{
  "name": "3x3 Granola",
  "address": "195A, Kaldemulla Road, Moratuwa",
  "telephone": "0770478689",
  "close_time": null,
  "description": "Great granola delivered by tuk!",
  "tip": "The gooey peanut butter goes really well with chopped bananas!",
  "review": "3x3 sells home-made Granola. Right now they have two standard flavors, Original and Peanut Butter. If you get your order in before Friday midnight you can expect a tuk tuk at your place bright and early on Sunday morning with some crunchy or gooey breakfast goodness in a little, hip looking plastic bag.\nI ordered one pack of each. 300g is the standard size though 3x3 also does custom sizes. The Peanut Butter costs Rs. 700 while Original will set you back Rs. 650\nThe peanut butter was my favorite. It had a great balance going between being bitter and sweet. Had a crunchiness (mostly due to a generous dose of almonds) which doubled-teamed beautifully with the gooeyness of the peanut butter, ending up with an amazing texture.\nThe Original is dryer, and needs a little more milk/yoghurt or whatever your poison is (try creamy alfonso mangoes if you can get em), to soften up. The Original definitely works much better with complements.\nIngredients are generous. Lots of discrete elements contribute to taste and mouthfeel, in addition to whatever you thought fit to put in.\nI don't really have a very creatively stocked fridge, so had to be happy with adding milk and fruit. All I had were plantains and papaya, but I found that both of them went really well with 3x3's granola. In case you're not into that kind of thing,\nis that 3x3 is working on a fruit-free version as well.\nIn terms of servings, I guess it would depend on how much you eat (obvs). But I found that i could squeeze out 3 pretty generous breakfasts quite easily out of one 300 gram pack.\n3x3 only delivers on Sunday. And you have to get your orders in before Friday night. You can order over phone, Facebook or Instagram. Check below for deets. They are really responsive and also quite creative with their content. Watch out for their promos on the gram, you might even be able to win some free stuff. Ah and delivery costs Rs. 100.\n3x3 will work pretty much great with any granola recipe  you throw at is. While I'm not exactly a granola conoisseur, even I can tell that this is world class stuff. So google, shop for extras and go nuts. Breakfast is the most important meal of the day.\n",
  "url": "https://www.yamu.lk/place/3x3-granola/review-216185"
}