{
  "name": "a & m Cupcakes",
  "address": "469C Galle Road, Colombo 3",
  "telephone": "0722442244",
  "close_time": null,
  "description": "A&M cupcakes is a charming little cupcake boutique located on the Galle Road, opposite Barefoot. Cupcakes are trendy, tasty little treats - good for eating and even better for instagramming.",
  "tip": "That Mocha Cupcake though! ",
  "review": "We decided to see how A&M were doing since it has been 4 years since we've last reviewed the place. While home bakers have claimed the Iron Throne in cupcakes, A&M is still up there and fairly reasonable.\nThey have a variety of flavors but all the interesting ones like the almond roast, mint choc-chip or lemontine were not available. They have quite a lot of regular flavors and 5 star flavors which are a bit expensive (Rs. 40 more). So I got 2 regular cupcakes, 1 mini cupcake and a jar all for Rs. 780, which was a big suprise cause I usually pay at least Rs. 1300 for that amount of cupcakes.\nI tried the Hazlenut Mini Cupcake (Rs. 90). It was so cute! Fitted right in my unreasonably small hand. It didn't taste as good as it looked though, I suppose it was the flavor I picked because the base was really smooth and tasty, but the frosting was really bland. It was like eating sand.\nThen we tried the Red Velvet Cupcake (Rs. 170), which was great! The base was delicious and so soft, it's like a party in your mouth. But the frosting had a little less cream cheese and a little more whipped cream than we'd like.\nThe Mocha Cupcake (Rs. 170) was a real winner! That creamy mocha frosting blending in with the chocolate velvet cake... oh man! Every bite was as good as the last. Since it wasn't too sweet, it spiked up the bitter mocha flavor, which I loved! Definitely try that one if you're a coffee lover.\nLastly, we tried the Oreo Cake in a Jar - Small (Rs. 350). A new addition to their menu, which they might as well have been better off without. It looks very inviting but one bite is enough to convince you otherwise. It was basically plain chocolate cake layered between a very poor mixture of oreos and cream icing.\nIt's a cute little place for your average cupcake shop with a really cool pink and white theme going on. They have a small seating area overlooking the main road, with high chairs and a very Instagrammy counter. The best part was the mirror wall near the cashier where the customers can write comments about the cupcakes on pink sticky notes and paste them before they leave. Can't complain about the service either.\nI'm a bit torn cause out of the four cupcakes I bought, two were delicious and two were not. I think if they could improve their frostings perhaps it might solve most of the problems we had with them. With a lot of home bakers and outlets like\npopping up every year, A&M needs to up their game a tad bit!\nA&M does affordable and yum cupcakes!\nA&M cupcakes is a charming little cupcake boutique located on the Galle Road, opposite Barefoot. Cupcakes are trendy, tasty little treats - good for eating and even better for instagramming.\n\nඒත් මෙයාලගෙ සේවාව නම් අවුල් වගේ. මම මුලින්ම ඉල්ලපු මිනි කප් කේක් 3 පෙට්ටියට දාපු සේවකයා ඊලඟ මිනි කප් කේක් ටික ඉල්ලද්දි කියනවා පෙට්ටිය ඉවරයි කියලා.\n\nA&M කියන්නේ ගාලු පාරේ පිහිටි සිත් ඇදගන්නාසුළු කුඩා කප් කේක් කඩයක්. එය පිහිටා තිබෙන්නේ  Barefoot ඉදිරිපිට.\n",
  "url": "https://www.yamu.lk/place/am-cupcakes/review-177097"
}