{
  "name": "Aloha Coffee Gallery Mirissa",
  "address": "Aloha Coffee Gallery, Sunanda Road, Mirissa",
  "telephone": "0768074123",
  "close_time": null,
  "description": "A great place for coffee and breakfast run out of a garage",
  "tip": "Try the Hippie Toast",
  "review": "Aloha Coffee Gallery is a small spot run out of a garage in Mirissa. They've got great food and coffee. The prices compare pretty decently to similar fare in other places.\nThey've got some pretty dope breakfast options, picked out of a nice and simple menu. Their smoothie bowls and\nsmoothie bowls are creative, and they've also got toast with various super/hipster foods like avocado and tofu. We tried a decent selection and came away happy.\nThe Peanut Butter Crunchy Bowl (Rs. 750) had a frozen peanut butter smoothie dolloped over coconut, oats, and bananas. Probably a damn good thing to eat if you're the healthy type who just got in from a morning of surfing. It's good for hungover, tired types also. They seem to make the smoothie the previous night and freeze it, adding the other ingredients as they serve it to you in the morning.\nThe Avocado Toast comes in two versions. The No.1 (Rs. 750) has crunchy sesame and pumpkin seeds with onion sprinkled on top of the avocado. The mango chutney it comes with is a nice touch, adding a bit of sweet tanginess. The No.2 has beetroot and feta. Ask for a poached egg on top if you feel like it.\nThe seemingly unintentionally self-effacingly named Hippie Toast (Rs. 600) has scrambled tofu in a saliva inducing coconut sauce. The sauce adds a nice creamy element to the mushrooms and spinach.\nTheir coffee is really good. And very reasonably priced. We had a Latte (Rs. 400) and Cappucino (Rs. 420) that really hit the spot after a late night.\nYou'd be hard pressed to get coffee this good at these prices in CMB.\nOf course they also serve king coconut with metal straws.\nAloha is a foreign owned establishment and the staff are generally backpackers working on holiday. They're pretty friendly and know what is what, though they mistook our order and brought us Avocado Toast No.1 instead of No.2. The place started some 2 years ago and is now the No.1 spot on Tripadvisor in Mirissa.\nThe space is nicely desiged with couches/mattresses, tables and chairs set under trees in the garden, as well as some indoor seating in the spacious interior.\nA good place for coffee and breakfast in Mirissa. Expect to spend just above Rs. 1000 per person for coffee and food.\n",
  "url": "https://www.yamu.lk/place/aloha-coffee-gallery-mirissa/review-218064"
}