{
  "name": "Ambrosia",
  "address": "27 1/1 Gregory's Road, Colombo 7",
  "telephone": "0777772052",
  "close_time": null,
  "description": "Ambrosia does baked goodies, but they're not a home baker. They're a company, but the stuff we had was made by a very skilled hand and given the special attention that only home bakers are known to give.",
  "tip": "Their savoury pastries are pretty good. Take cash with you.",
  "review": "Ambrosia happens to be well known only amongst a tight-knit community of loyal customers. It's located in a quiet neighbourhood at Gregory's Lane in Colombo 07.\nWhat boosted their fame is their large variety of cupcakes. From Oreo Cream to Red Velvet, you get to pick and choose what you like. We got a Ganache Cup (Rs. 120), a Strawberry Cupcake (Rs. 140), an Oreo Cream Cupcake (Rs. 180) and a Red Velvet Cupcake (Rs. 180).\nThey've got an interesting selection of pastries and we tried two of their short-eats just for fun.\nThe Mutton Roll (Rs. 150) shows promise and is a surefire contender amongst other\n. It was stuffed with chunks of mutton and a few bits of potato here and there. The shell was light and bready, so this is a good snack if you're looking for something light, yet filling.\nTheir Chicken Pie (Rs. 120) is a flaky, moreish bite with a lot of chicken filling. Unfortunately, the chicken was a bit bland with no real salt or spice so that left us a bit underwhelmed.\nWe also got their Passion Fruit Panna Cotta (Rs. 200) which we really liked. This one had a more yoghurt/curd taste to it, unlike your average sweet panna cotta. Along with the topping, it makes for a toothy dessert and is quite the palate cleanser after a midday snack.\nThe interior is plain with cream coloured walls, wooden furniture and dim lighting. There are a couple of tables outside but on a hot afternoon we didn't feel like enjoying the outdoor breeze or lack thereof.\nAs for their service, we have a poor impression, which was only bolstered by their numerous disappointed YAMU comments (scroll down) and\nuser reviews. The first thing I asked them as I entered was if they accepted cards. They responded with the affirmative and as we completed our order, we were told that the machine doesn't seem to be working.\n\nThis ticked me off a little and it got worse when we were told that there was an ATM 'just 5 metres from here madam.' We then had to walk all the way to the closest ATM. When we got back we were told that 'the machine is working again,' so we had to stop ourselves from tearing our hair out.\nI recommend stopping by at Ambrosia for a quick snack on the go, but nobody should really have to go through this much just to pay for a quick order.\nMost of Ambrosia's confections put us in a good mood. If I was in the area I'd try their Chocolate Ganache cupcake, but that's about it. Also, take cash with you.\nAmbrosia still serves up some good cupcakes and short eats, but we weren't impressed with their card facilities, nor their service.\nIt's not often that we make 'yay' inducing finds in Colombo so it's with much glee that we found Ambrosia. They do baked goodies, but they're not a home baker. They're a company, but the stuff we had was made by a very skilled hand and given the special attention that only home bakers are known to give.\n",
  "url": "https://www.yamu.lk/place/ambrosia/review-191360"
}