{
  "name": "Barracuda",
  "address": "41/2 Wasala Road, Dehiwala",
  "telephone": "770207733",
  "close_time": " Open until 11:00 PM",
  "description": "We had a great time here. It's a friendly spot on the beach, very near Colombo, with good Chinese food. Doesn't get much better.",
  "tip": "They only serve beer and wine, but you can BYOB. No corkage, yay! Note that they host EDM dance parties somedays, so perhaps call ahead on weekends.",
  "review": "Barracuda has grown into one of the best beach side hangouts in Colombo. They do a good take on Sri Lankan Chinese, and their hot butter cuttlefish is one of the best around.\nBarracuda, like it's neighbor\n, is known mostly for their Sri Lankanized Chinese, with an emphasis on the HBC. Both the menu and prices are very similar to The Station, with both Chinese and Thai dishes to choose from. Portions aren't huge, but we'd say a small portion at around Rs. 600 will suffice for three. Large portions are priced around Rs. 1000.\nWhile the menu at Barracuda is pretty extensive, they need to offer a full liquor menu in order to compete with The Station. One thing that all the diners seemed to agree was that the HBC is a must try and we can say that our verdict from the\nstill stays true.\nThe spicy fried rice with seafood (Rs. 898 for L) was pretty good, and it stayed true to it's \"spicy\" moniker with the added peppers and chillies adding the heat. There was decent amount of seafood mixed in as well, although we would have preferred regular prawns over the tiny ones.\nWe already kind of knew the hot butter cuttlefish (Rs. 980 for L) was going to be excellent, and it was. This one is as good as it gets with a light, flavoursome and crunchy batter on top of perfectly cooked cuttlefish . We sat there for a good 10 minutes trying to chose between this dish and the one from The Station, but we decided we'd wait for the next HBC taste-off. However, if you like your HBC a bit spicy, The Station might be a better option for you.\nFor a change from the Chinese, we decided to go with the chicken green curry (Rs. 600 for S), and it turned out to be pretty tasty. It was creamy and flavoursome, while maintaining a good spiciness with the green chillies and pepper pods. The chicken thigh itself was cooked well, with the creamy gravy binding well to further enhance the flavour.\nThe double fried pork belly (Rs. 600 for S) was decent, but pretty much all fat. We get that fat is to be expected when you order pork belly but some of the better places like\n, have a good ratio of meat to fat in the slices. This dish, while seasoned well, lacked the texture and the taste of the meat.\nColombo doesn't actually have many options when it comes to great places to chill by the beach, so Barracuda is a welcome spot. You're seated just a few meters from the ocean but it's still cool because most of the tables are shaded under beautiful mangroves. It also looks great at night under the lights. You can also sit out on the beach, but we recommend that after sunset.\nIn terms of service, Barracuda beats out The Station. The waiters are attentive, helpful and fast. The food was also ready in less than 15 minutes, at a time with a good amount of diners.\nBarracuda is one of the best beach side restaurants Colombo has to offer. The location is outstanding, the food is good and the service is fast.\nBarracuda is one of the best beach side restaurants Colombo has to offer. The location is outstanding, the food is good and the service is fast.\nWe had a great time here. It's a friendly spot on the beach, very near Colombo, with good Chinese food. Doesn't get much better.\n",
  "url": "https://www.yamu.lk/place/barracuda/review-39220"
}