{
  "name": "Batticaloa Muslim Hotel",
  "address": "Station Cross Road, Batticaloa",
  "telephone": "773597304",
  "close_time": " Open until 11:00 PM",
  "description": "A street-side eatery that does the best beef rottis in Batticaloa. Great for breakfast with plain tea.",
  "tip": "Go at 9AM if you want the rotti hot-hot.",
  "review": "Though it looks like any other streetside eatery, Batticaloa Muslim Hotel makes the best beef rotti around. Most of their clientele are the men who work around the area, including my friend who used to teach at the 'Oxford College' just next door. He introduced me to this place on my stay in Batticaloa, and it was the best breakfast I had there.\nOK. You might be thinking \"What's so special about a beef rotti?\". I'll tell you.\nIt's not just that it's super affordable at Rs 30, and you could easily hammer three to five of them in one sitting. It's that it's just made really well.\n\n\nIf you get it hot-hot, the rotti is soft and tears apart in your hands so beautifully.\nAnd then the beef - the roti is packed chock ful of it. They've got a lovely roast beef filling that's got all that east coast spice going on that you just don't find in Colombo.\nThis is your average\n, so you get the usual ambiance of grown men, confined spaces and a single waiter. The people are fairly pleasant though. Sure, they'll ogle at anyone who's not a local, and if you're female, they'll just be bewildered. They seem harmless though.\nJust look at this man's charming mustache. He couldn't hurt a fly if he tried.\nIf you're in Batticaloa and you want a cheap breakfast that's both super flavourful and filling, go here. You can also opt for string hoppers or parata for breakfast, with parippu or chicken/beef curry. They're open for lunch and dinner, too. Most items are under Rs 200. You can get a kottu for Rs 170. The shop has been open about 5 years now and it's run by a sombre man named Mubarak who's usually behind the counter.\n",
  "url": "https://www.yamu.lk/place/muslim-hotel/review-78609"
}