{
  "name": "Bavarian German Restaurant",
  "address": "No. 11 Galle Face Court 2, Colombo 3",
  "telephone": "0112421577",
  "close_time": " Open 12.00 PM - 3.00 PM and 6.00 PM - 12.00 AM",
  "description": "The Bavarian has been around for ages, and is still hugely popular. Change can be a good thing but sometimes when you're doing something right, you should stick to it, and that's exactly what the German Restaurant has done.",
  "tip": "If you're looking for a more budget friendly option, then be sure to ask for that lunch menu of theirs.",
  "review": "Bavarian has long been the holy grail of German food in Colombo and they’ve shown no signs of slowing down. While their prices have inflated over the years, the portions are still hearty, meaty and delicious, and the ambience holds on to that real German pub feel.\nGerman food in Colombo is quite scarce with just a handful of eateries offering Deutschland’s cuisine, which is odd since the Bavarian has had so much success over the past years. It’s easily one of the most popular restaurants in Colombo and it makes sense since it’s meat central. It is by no means cheap, with their prices prices slowly but surely climbing year by year with our most recent visit coming at around Rs. 3000 per head for mains and a couple of lagers. On the flip side, they never skimp on portions, serving up massive meaty platefuls that generally requires you to skip the previous meal to finish completely.\nThe pork knuckle at The Bavarian is stuff of legends, and we’ll be delving deeper into its deliciousness in our upcoming YAMU Loves feature, but this time around we tried out their Oven Roasted Pork Belly (Rs. 1430), which we’d say is right up there with some of the best pork dishes we’ve had in Colombo. It came with fried potatoes, sautéed red cabbage and an apple sauce. Just like most of their dishes the pork belly really shines through as the hero of the dish with a beautifully crispy crackling on top, followed by layer of flavoursome fat and tender meat at the bottom which gives it a perfect variance of textures. While the potatoes and red cabbage were fine, the sweetness from that apple sauce was the other element of the dish we really loved.\nThe Chicken à la Kiev (Rs. 1580), was actually an even larger portion than the pork belly with two large kievs served along with their homemade noodles and salad.  The salad seems to be there to make you feel better about yourself eating the rest of the dish but it was still pretty fresh nonetheless. The noodles were creamy but lacked a bit in terms of seasoning, and the portion was actually too much for us since the crumb fried kiev also has a carb element to it. On the other hand, the chicken kiev was well executed with a crunchy batter and well cooked chicken with a bit of contrast from the garlic herb butter in the center.\nBeing nearly stuffed to the brim at this point, we decided to split the Snicker Mousse (Rs. 680) which was a bit underwhelming. The mousse did have the correct accompaniments of peanuts and caramel, but we found the chocolate a bit too bitter and the caramel not quite sweet enough to balance it out. Not terrible, but not as high as the lofty standards their mains set.\nThe ambience at The German Restaurant has basically remained the same for the past four years staying true to their German Pub look, which they pull off quite well. The only issue is that when it’s at capacity, it can feel quite cramped since the bar is in the same space. We do, however, like the little booth tables they’ve set up along the wall  which gives it a really cozy feel.\nThe service at Bavarian is efficient, but we wouldn’t say it’s the friendliest. They’ve generally got their hands full so we can understand why they don’t have time for pleasantries, but the positive is that they’re always on the floor so you’ll rarely find yourself waving for a waiter.\nAs far as meaty masterpieces go, The Bavarian is still as good as it gets here in Colombo. They capture the look and feel of a German pub with an emphasis on all the right areas.\nThe Bavarian, holy grail of German food in Colombo, is still going strong and serving up meaty masterpieces.\nThe Bavarian has been around for ages, and is still hugely popular. Change can be a good thing but sometimes when you're doing something right, you should stick to it, and that's exactly what the German Restaurant has done.\nThe food at German Restaurant is big, flavorful, heavy and doesn't disappoint. We tried the steak stack (Rs. 1,350), a spinach stuffed beef (forget, about the same) and wiener schnitzel (Rs. 1,250). It was all very filling and very good.\n\nහොඳ කෑම වේලක් නිසා මේ ගාණ ඒ හැටි අවුලකුත් නැහැ. හැබැයි ඉඳලා හිටලා ගියොත් ඇරෙන්න ඉතින් හැමදාම ගිහින් කන්න නම් අමාරු වෙයි.\n",
  "url": "https://www.yamu.lk/place/bavarian-german-restaurant/review-103269"
}