{
  "name": "Beard Papa's (Urban Kitchen)",
  "address": "69, Hyde Park Corner, Colombo 2",
  "telephone": "0777729922",
  "close_time": null,
  "description": "Beard Papa's is an international franchise which specializes in cream puffs. The first outlet opened in Japan in 1999.",
  "tip": "Avoid the coffees.",
  "review": "Conjuring up an image of a fatherly figure, Beard Papa's is a name which doesn't give any hints as to what they're all about — which is cream puffs, with flavoured custard fillings. A Japanese international franchise, they've now opened shop in Colombo, and can be found at\nThere's nothing elaborate here, with a very focused offering. The cream puffs available here comes with chocolate, and vanilla fillings, and are dusted with a fine powder of each flavour. We've read that there are a variety of other flavours in other parts of the world, so we'd like to see this expand to offering a bit more than these two basics.\nNonetheless, we tried out both available flavours, and both sizes.\nPriced at Rs. 200 (minus tax), the regular ones comes overflowing with creamy custard, with the vanilla not really having a vanilla flavour but coming off more like a subtle white chocolate. The custard cream was well done, and the choux pastry was fresh, light and crispy. It's rather messy when you eat it, because the choux crumbles and there's a cream spillage, but that seems to be the case with most puff pastries, including our favourite from\nThe chocolate flavoured ones tasted akin to something made of Kandos chocolate powder, which is to say that it wasn't intensely chocolatey because of the creaminess.\nThey also offer a small selection of caffeinated drinks, so Malinthe got a double espresso (Rs. 350) and I went for a mocha (Rs. 400). The espresso wasn't bitter and was satisfactory as far as flavour goes, but the quantity wasn't enough to be a double. The mocha tasted more like hot chocolate without any hint of caffeine in it, and again had a Kandos chocolate powder quality to it.\nEverything's served in disposable plates and cups, btw.\nThese two were much better, with the ambience being of an un-crowded food court. Seating shares the same space as the wood-fired pizza outlet directly opposite Beard Papa's, and the place is pleasant and clean. Well maintained, basically.\nService is really nice, with the staff being accomodating, attentive, and friendly. It's also quite fast, and they don't dilly-dally. Add to that, they smile and are efficient, so double plus points from me.\nThe regular cream puffs are okay, but we don't think it's really worth the price. The mini ones comes upto Rs. 200, and is quite disappointing. Their drinks aren't too great, so it's better to stick with what they specialize in and hope that they offer more than just the basic flavours soon.\n",
  "url": "https://www.yamu.lk/place/beard-papas-urban-kitchen/review-72421"
}