{
  "name": "Black Cat Café",
  "address": "11, Wijerama Mawatha, Colombo 07.",
  "telephone": "0112675111",
  "close_time": null,
  "description": "The Black Cat Café serves up amazing sandwiches, coffee, and fresh fruit juices. They're also a B+B.",
  "tip": "Ask the staff for recommendations, they'll give you a rundown of what's special. Also, try their ginger beer.",
  "review": "Centuries ago, Aisha visited Black Cat and gave it five stars amidst much controversy and accusations of corruption. We went back recently to check out their new menu and if the place is still as cool as she claimed it was.\nWhile it’s great coffee and food certainly plays a role, how Black Cat really wins is through a thoughtfully curated ambiance and an amazingly laid back (but efficient) service approach that really makes you feel at home.\nThe new menu is divided into two. There's the breakfast menu which lasts until noon, and then another menu for the afternoon and evenings.\nWe tried two items from the breakfast menu and were a little underwhelmed by both. The Gone Troppo (Rs. 1200) had a selection of seasonal tropical fruit on Swiss muesli, complemented by buffalo curd, milk, and\ntreacle. We thought there could have been a few more fruits in it, also the buffalo curd seemed to be your standard off-the-shelf supermarket variety. Not what you'd expect for the price.\nThe Eggs Colombo (Rs. 1100) usually comes with sprats, but we tried it with smoked salmon because the kitchen was out of sprats on that day. It tasted pretty good, felt healthy and the extra toast was welcome. Although, the\ngreens weren't quite gelling with the whole dish for me.\nI only tried the Mezze Platter (Rs. 1200) from the afternoon menu. It was really good. The hummus was had a soft, slightly grainy texture. It comes with cut up veggies; carrots and cucumbers as well as a bit of Tabouleh with nicely seasoned, fresh and crunchy parsley. This dish also has a very good harissa hot sauce that really hits the spot. It's bloody good to taste some unabashedly spicy stuff at a time where menus across the country are getting progressively blander.\nDifferent kinds of cakes and desserts will pop up and Black Cat as and when they get made. Aunty Nimi’s Date Cake was the bomb. Not too sweet and served with vanilla ice cream on a tray that blended with the table, facilitating minimalist photography opportunities.\nThe classic homemade ginger beer (Rs. 400) was not as good as I remember. It was so sharp, the ginger almost burned my throat on the way down. It also had a slightly bitter aftertaste. Is this some sort of purist’s ginger beer that’s just a little too hardcore for my amateur taste buds or just an off-batch?\nThe Peach and Cinnamon Ice Tea (Rs. 400) had great mouthfeel but ultimately was a little too syrupy sweet. The coffee here is as good as anywhere else. The Cappuccino is both perfectly balanced doses of caffeine for sleepy mornings and afternoons alike.\nOn weekends Black Cat is a little too noisy on the inside. It’s echoey, sometimes the music can be loud-ish and raised voices of aunty-get-togethers reverberate through the room. Things vastly improve on weekdays though, I guess weekends aren’t for work. Also the wifi here is usually terrific, albeit less so on the outside. Power outlets are limited to certain corners, and there are none in the outside seating areas.\nThe furniture is cute but sometimes inconvenient. There are tables made out of doors, whose sharp edges and still-attached hinges can cut into you, and some made out of sewing machine stands that get in the way of your limbs. There is no need to sit at the hipster fittings if you don’t want to though, bag one of the many comfy armchairs/couches instead.\nThe service here can seem a little matter of fact in the beginning, but the initially gruff exterior masks a genuine friendliness. Staff tend to recognize you by sight of you’re a regular, and there is a stark absence of dirty looks when you stay for longer than is decent. There seems to be a focus on relationship building as an approach to service and that really makes a difference.\nThe outside seating area, shared with\n, is one of the best in Colombo, only matched by\n’s expansive garden set-up IMO. There are comfortable armchairs that remind you of your grandfather’s living room, and the limited space is designed efficiently enough to afford a surprising amount of secluded privacy.\nYou can BYOB or smoke and chill for hours on end, even after the cafe is closed.\nIt's still great. Full points for service, ambiance, and drinks. While the new menu has its moments, it's not as interesting as the old one and is sometimes a bit hit and miss.\nTheir menu is new but the  curated ambiance and an amazingly laid back (but efficient) service approach still remain the same.\nFabulous drinks, a great selection of books,  and a couple of kittens are the least of what awaits you here.\n\nඉස්සර නම් මෙහෙ පූසොත් හිටියලු. දැන් නම් එක එක හේතු නිසා ඒ කට්ටිය හොයාගන්න නැති බවයි ආරංචිය.\n",
  "url": "https://www.yamu.lk/place/black-cat-cafe/review-219729"
}