{
  "name": "Box Colony",
  "address": "308 A, Pannipitiya Road, Pelawatta, Battaramulla",
  "telephone": "0114328001",
  "close_time": null,
  "description": "A nice space in Battaramulla that has a big garden area as well as a quirky container box based building set up. While the service and ambiance is great, the food could use some improvement. ",
  "tip": "BYOB",
  "review": "Box Colony is a recently opened restaurant in Battaramulla. I wouldn't say its worth a trip all the way from the center of Colombo, traffic can be terribly anal, but if you're in the area, this can be a really nice place to chill for a while. The ambiance is great, lots of greenery, fresh air and garden seating; and the service is friendly and welcoming. The food however, could use some improvement.\nThe roast paan and chilli sauce dip comes as a standard for dine-in customers. The paan was a little on the rough side, but the dip was delish, it had a vague\nflavor to it, and that's something hard to resist.\nFor starters we ordered the Basil & Tomato Salsa on Toast (Rs. 460) and got a Lime, Lemongrass and Mint juice (Rs. 320). The bread was crispy and the salad was fresh, but didn't exactly wow the tastebuds.\nThe juice was refreshing, but slightly too much on the bitter side for my liking. So neither were execeptionally good, nor were they exceptionally bad. So I suppose we can agree on 'average'.\nThe Chicken Burger (at Rs. 800) came recommended from the kitchen so we went for that as a main, neither of us being too hungry that night. The meat patty was firm and had a good texture, but it wasn't very flavorful. So pretty average there also. The bread and salad was a less than average, and the barbecue sauce that came along with it was a little too sweet. The ingredients in the burger were rather dull tasting and ended up not voicing themselves, nor were they too mutually complementary.\nFor dessert we got the parfait. It was a huge portion and we couldn't finish it. It had a nice coconutty texture, and chocolate, lots and lots of chocolate. I am not much of a sweet tooth, so I found this rather too sweet. But still, if you like drowning your tastebuds in sugar this might be for you.\nIs rather easy to find, just pass the Cool Planet if you're approaching from Thalawathugoda, and it will be on your left just a 100m afterwards. Avoid rush hour at all costs if you're going there from Colombo. Road rage will drive you half-mad.\nBox Colony has a large garden area with a nice green lawn and lots of trees, one of the advantages of being located in a leafy suburb. It also has contaner boxes for buildings. Some areas are a little cumbersome, and if you BYOB then watch out for the iron steps leading upstairs, they are rather small and can get slippery in the rain.\nThe place calls itself a cafe, lounge AND a salad bar. I think these are identities that are way too disperate to fit into the same space without some measure of schizophrenia, and Box Colony falls prey to this condition a little bit also. The EDM pumping out of the speakers was out of place on the quiet weekday evening we were there, and the trendy filament bulbs hanging over the tables upstairs was a little too in our faces for our liking.\nThe upstairs section, being as it is within a metal box, has acoustics which will make you highly partial to your neighbors' conversations. Great if you're a private detective tailing a cheating husband, but not so good if you're just there for a quiet night out. I suspect the EDM was an attempt at fixing this problem, but it only ended up creating more noise pollution.\nExceptionally good, fast and friendly. They went out of their way to make us feel at home.\nCome here for the space and the garden area, also a good quiet place to BYOB and chill with friends. The food here doesn't exactly wow.\n\n\nA good place to go to if you find yourself in the area and need to relax.\n\nපැලවත්ත හරියෙන් යන වෙලාවක බඩගින්නක් ආවොත් බොක්ස් කොලනි කියන්නේ අනිවාර්යෙන් ම ගොඩ වෙන්න ඕනේ තැනක්.\n",
  "url": "https://www.yamu.lk/place/box-colony/review-207385"
}