{
  "name": "Bubblelement (Battaramulla) ",
  "address": "1108 Denzil Kobbekaduwa Mawatha ,Battaramulla ( Close to the Parliament ).",
  "telephone": "0778886615",
  "close_time": null,
  "description": "Bubblelement is now open for service all the way in Battaramulla!",
  "tip": "Get their paninis - you're in for a treat.",
  "review": "Bubblelement has been the premium bubble tea joint for a while now. They're a bit pricier than Mabroc and less watery than Bubble Me which makes them the go-to for anyone who has a little extra cash to spare. They've extended their reach all the way to Battaramulla which makes life easier for anyone in the neighouring areas to get their tea fix.\nWe got three full mason jars (sigh) of Iced Milk Tea, Hot Chai Caramel and the Apple and Passion Fruit Tea. Each of these comes priced at Rs. 390.\nThey've got these amazing paninis up for grabs. Each is toasted to a light, golden char with slices of roast paan as opposed to your average ciabatta which we found interesting and flavourful.\nThe Chicken Alfredo Panini (Rs. 475) was my favourite. Each square inch of that bread is covered in chunks of chicken and juicy button mushrooms in cream sauce. With its mild and mellow flavour I totally recommend this one if you aren't in the mood for spicier stuff.\nThe Mushroom & Cheese Panini (Rs. 450) was a little on the spicier side. Packed with bell peppers and what tasted like mozzarella cheese, this one's a good choice if you're vegetarian. I do wish there were more mushrooms though.\nWe also got ourselves a Pol Sambol & Beef Panini (Rs. 475). Instant favourite.  If there ever existed The Perfect Lankan Panini; this would be it. The beef was salty, soft, pink and dripping with gravy. The Pol Sambol was spicy, tangy just perfect.\nIt's a real winner and reminded me of roast kade paan paired with homemade beef curry. 10/10 stuff.\nThe interior screams tumblr. It's very minimal with a cool colour tone and a bunch of signs hung up.\n.\nThey've also got a seating area upstairs. There are fairy lights and I'll bet the place looks pretty at night.\nService was fine although the lady behind the counter seemed a little lost. No complaints though, they were super cordial and brought us our food when we were literally sitting on the other side of the counter.\n\nBubblelement is a little on the pricey side, but they're worth it. If you don't mind spending a little time away from the city, head out to Battaramulla and soak in the atmosphere and bubble tea.\n",
  "url": "https://www.yamu.lk/place/bubblelement-battaramulla/review-182178"
}