{
  "name": "Butter Boutique (Park Street Mews)",
  "address": "48C, Park Street, Colombo 02",
  "telephone": "0117040028",
  "close_time": " Open until 11:00 PM",
  "description": "Treat yourselves with decadent, delicious cakes and some of Colombo's best coffee, at Butter Boutique's newest branch at Park Street. ",
  "tip": "Tres Leches FTW and Cinnamon Rolls if you want something less sweet.",
  "review": "We love this place. Although the quality of their cakes can vary, they still come up strong in the coffee department, as well as in terms of the non-cake products. Drop in for some delicious treats, now in multiple locations.\nThey have all your the classic cakes and bakes: Red Velvet, Arabian Knights, Oreo along with cheesecakes, cinnamon rolls, and brownies. They also sell products like granola, almond milk, and Niccolo coffee from Melbourne.\nThe Nutella Cake (Rs. 580) had a spongy texture to it but it was a heavy kind of spongy. It wasn't as fluffy as it looked and fills you right up after two or three bites. It was way too sweet for us, therefore, we tasted more sugar than chocolate.\nI have been there many times and tried almost everything they have. One thing I have noticed is that their cakes seem to have gotten sweeter with time which was quite disappointing. Of course, the cakes are amazing and baked to perfection but that overpowering sweetness sometimes doesn't make it very appetizing.\nThe Cinnamon Roll (Rs. 550) is one of the best things you could have at Butter Boutique. This is legit. The fluffy dough and the crunchy and slightly burnt outer layer makes up for a succulent, decadent dessert that leaves you wanting more. The cinnamon aroma is strong and I have yet to try a place that does better cinnamon rolls. They also have a Nutella Cinnamon Roll for the chocolate lovers.\nThe Tres Leches (Rs. 550) is just as good as when we first tried it. I don't know how they do it, but there's just nothing like this anywhere else in Colombo. It was absolutely delicious and melts in your mouth. For all the noobs, tres leches is essentially a butter cake soaked in three kinds of milk; evaporated milk, condensed milk, and heavy cream. It was rich in flavor and the only sweetness you get is from the condensed milk so it is not overwhelmingly sugary.\nThey have some very interesting and excellent drinks. The best thing about it is that they're not afraid to try new things. They serve coffee, latte, and hot chocolate.\nWe tried their latest addition, the Turmeric Latte (Rs. 550) which was excellent. It is basically a normal latte with a turmeric concoction. It wowed us more than we expected. The turmeric does not overpower the latte, it simply elevates the flavor and makes the latte rich and stronger. We highly recommend this.\nThe Cafe Mocha (Rs. 550) was another great drink. It is not as good as Kopi Kade coffee, but definitely a close second. It was pure coffee with evenly added chocolate flavor. It was absolutely delicious and we finished it really fast. They also have an excellent Red Velvet Latte that you should go for.\nTheir service, while excellent most of the time, can get a little frustrating. We did find that a few of the wait staff that could have use a little more training.\nHowever, the familiar faces that we have seen since their outlet in Flower Road deliver some of the best customer service. They're generally very friendly and attentive to what a customer needs.\nThe new place is massive. It's two stories and very spacious. It has the same flowery decor and the classic boutique vibe as their other outlet.\nThe upstairs is even better with cushioned booths at the far end of the wall, the perfect place to spend hours getting your work done. The place doesn't get very crowded like it does at Rosmead Place so it is the ideal place to sit and enjoy a cuppa peacefully.\nEver since I discovered this place, there has not been a week when I haven't dropped in for at least a coffee. Vishvi says it's my \"second home\" but whatever. After the huge success of their outlet in Rosmead Place, they branched out and opened another one at Park Street Mews. It is also delicious, and a lot more spacious and we love them both.\nAfter the huge success of their outlet in Rosmead Place, they branched out and opened another one at Park Street Mews.\n\nකොළඹ ඉන්න කේක් පෙරේතයින් ට කියාපු ම තැනක් තමයි මේ බටර් බුටික්.\n",
  "url": "https://www.yamu.lk/place/butter-boutique-park-street-mews/review-217138"
}