{
  "name": "Butter Boutique",
  "address": "70 Rosmead Pl, Colombo 07",
  "telephone": "0112690028",
  "close_time": null,
  "description": "Butter Boutique has moved now! They're officially setting up shop at Rosmead Place so we went to check them out. ",
  "tip": "They've got a bunch of ice creams which aren't on display so ask and ye shall receive.",
  "review": "Butter Boutique makes rich, delicious cakes and some of Colombo's best coffee. Their new location on Rosmead Place is much bigger so more people can sit down and enjoy, but we still challenge you to finish their goodies without needing a takeaway box.\nButter Boutique's pink, fairy princess-y outlet at Flower Road was nice and all but seating areas were limited. The outlet was also a little too cramped so there was little to not movement space which was their only drawback really.\nThe new place is nice and big. Perhaps a bit too big.\nThey've really made full use of their new premises with a lot of flowery (not too girly) decor, a large counter to house their massive cakes and enough and more breathing space.\nHowever, I feel like maybe they've lost just a wee bit of that cosy ambience that was present in their last space. Perhaps I'm just not used to this place yet, so only time will tell.\n\nPeople seem to love the new makeover though as there were a lot of customers pouring in and staying longer. I suppose there's more time to chit chat now that everyone gets to sit down comfortably. They've also got raised stools and tables for those of you who'd prefer to sit by the wall.\nWe treated ourselves to three slices of cake and two drinks. Their prices have quietly hiked up a little bit, but it only makes a slight difference. They've got new confections like the Nutella Scrolls, Apple Cinnamon Scrolls, Lemon Blueberry Cake and so on.\nNeedless to say, we couldn't finish a single slice since their portions are so big. However, they want you to know that they'll be more than happy to pack your leftovers up for you, no matter how little so that nothing goes to waste.\nButter Boutique offers some interesting and excellent drinks; mostly coffee. The coffee is prepared with skill, well-roasted beans and a little cake-shop magic, maybe.\nThey've got Masala Chai (Rs. 550) on their menu now, and of course I jumped at the opportunity to try it out.\nThe tea is rich, delicious and quite strong. There's a very prominent cardamom flavour and I'm assuming they don't hold back on the cinnamon either. Stir well, because all the magic is at the bottom.\n\nTheir Iced Mocha (Rs. 650) is a community favourite now, mostly because people find it enjoyable and easy to drink because it's sweet and cold. It's extremely rich though, and tastes of pure coffee with the milk only just straining to be noticed.\nI recommend getting this one because its good for sipping at slowly so it'll last you the entire while you're there.\nTheir prices have hiked up just a bit, but that's only fair game given their new location. The cakes are as delicious as ever and now that there's more room to lounge around I see more chit-chat happening. Which is a good thing, I guess.\nButter Boutique makes rich, delicious cakes and some of Colombo's best coffee. Their new location on Rosmead Place is much bigger so you more people can sit down and enjoy.\nFor delicious lattes and tres leches.\nButter Boutique's new outlet is a great addition to Colombo's baking scene. I don't think anyone really saw it coming, but they've raised bar for coffee in town as well. Whether you're a fan of coffee or desserts, BB is more than worth a visit.\nButter Boutique has moved now! They're officially setting up shop at Rosmead Place so we went to check them out.\n\nබටර් බුටික් කියන්නේ කොළඹ හෝම් බේකර්ස්ලගේ බලකායේ තවත් එකක්. දැන් එයාල හැම බ්‍රහස්පතින්දාම එයාලගේ බේකරි නිෂ්පාදන ගුඩ් මාර්කට් එකේ විකුණනවා.\n",
  "url": "https://www.yamu.lk/place/butter-boutique/review-196691"
}