{
  "name": "Cafe Noir ",
  "address": "No. 302, Pannipitiya Road, Pallawatte, Battaramulla.",
  "telephone": "0113061500",
  "close_time": " Open until 12:00 AM",
  "description": "Café Noir is the definition of good vibes and great coffee. For real.",
  "tip": "Seafood pasta, hot chocolate and desserts! Yum-may!",
  "review": "Calling this place a \"café\" has got to be the biggest understatement because it's more of a fancy restaurant.\nIt's located on Pannipitiya road so it's really not hard to find. We were quite happy with the way they were on our first visit, but they've gotten even better since then.\nTheir menu has gotten a lot better since our last visit with lots of great options. It's probably the most extensive menu I have seen in a café. They have got your normal café goodies like All Day Breakfast and Pasta but they also have burgers, sandwiches, paninis and as if that weren't enough there's a separate Mains section which includes steak, risotto, lamb chops and seafood platters. All these categories have at least 3 vegetarian options, so yay me!\nKeeping it simple, we started off with a Veggie Burger (Rs. 580). Yes, it was just as pleasing as it looked. It came with a side of sweet potato fries and a coleslaw. The buns were grilled so it had the crunchiness you want instead of the soggy, squirmy texture you find in some burgers. The patty could be better in terms of texture and flavour because it was more like a cutlet than a juicy and spicy patty. I didn't really mind it because somehow everything worked well together.\nThe coleslaw was superb with fresh veggies tossed in a generous serving of mayo. The sweet potato fries too were great (more on that later).\nNext up, we ordered the Seafood Spicy Pasta (Rs. 920). It was excellent! The amount of prawns and cuttlefish was astounding for the price, and literally made my friend sweat.\nThere might've been about 10 well cooked jumbo prawns and an equal amount of perfectly marinated cuttlefish. The pasta itself was the perfect texture and stuck to the name of the dish; incredibly spicy!\nWe also got a portion of Sweet Potato Fries (Rs. 260). It wasn't as good as our favourite at\nbut it was a close second. The potatoes were spicy, salty and crunchy and it came with a homemade sauce dip which had a tinge of sweetness to balance out the flavours.\nThis Hot Chocolate (Rs. 540) was hands down the best I have had! I normally don't go for hot chocolate because it's either too sweet or too watery. However, for this one, I would drive down there without a second thought. It was a proper cup of hot chocolate. The texture and flavour were on point! The only sweetness you get is from the chocolate and the consistency is thick enough to leave a crease on your upper lip.\nThe Noir Dark Mocha Frappe (Rs. 580) was refreshing and a great drink to quench your thirst. It was a big glass of mocha goodness with just the right amount of bitter and sweetness.\nIt took us a while to settle on what we want because there were so many dessert options. We finally settled on a Carrot Cake (Rs. 440) and a Double Chocolate Brownie Cheesecake (Rs. 490).\nThe carrot cake was my favourite. It was fluffy, moist and rich in flavour. The piece was huge that we took some back to the office and everyone loved it too, so this is something we highly recommend you try.\nThe brownie cheesecake was, of course, really heavy but that didn't stop us. The cheesecake was creamy and gooey while the brownie was hard and chocolatey. You know what they say, opposites attract.\nThe staff was friendly, helpful and smiles all around. Ordering is super easy and the food arrived pretty fast. There's really nothing to complain about here (hence the 5-star rating).\nOne of the best things about the place is the ambience. It has three floors, each with a different theme, and there is so much seating space. The third floor was my favourite because it has a vintage vibe going on with carpet floors, comfy couches, round tables and marble wallpaper. It is so cosy and peaceful that you can easily spend three hours there.\nCafé Noir has unmistakably set the bar high in terms of excellent service, quality food and fabulous atmosphere. In addition to what they offer, we were told that they'll be adding more stuff to their menu (amazing!). The prices depend on what you order and in our experience, it's all been worth it.\nAn upscale café with great food, excellent service and great atmosphere.\nEspresso yourself.\n\nතරු පහේ හෝටල්වලවත් සමහර වෙලාවට දැකගන්න ලැබෙන්නේ නැති හොඳ සර්විස් එකක් මෙතැනින් අපට ලැබුණා.\n",
  "url": "https://www.yamu.lk/place/cafe-noir/review-186468"
}