{
  "name": "Cafe Sociale",
  "address": "No. 252A, Galle Road, Colombo 4.",
  "telephone": "0774445788",
  "close_time": null,
  "description": "A retro themed cafe serving filling dishes and average coffee.",
  "tip": "Try the Top Bun or any of the salad options.",
  "review": "Located on Galle Road, a few blocks away from Amirthaa, Cafe Sociale is a retro-themed coffee shop that has been buzzing for a few months. We dropped in for a late lunch.\nTheir menu is if nothing else, really fun to read because all the names are inspired by famous movies, like The Silence of the Lambs (Mutton Hot Pot), Meet the Parents (Creamy chicken), Chicken Run, The Cod Father, Catch Me if You Can etc. You get the idea.\nThe Top Bun (Rs. 850) was a vegetarian burger with a hefty paneer patty, chunky potato wedges, and a side salad. It's quite pricey for a burger but it was decent. The bun was average and could have used a few more minutes on the grill. The paneer, however, was excellent. It was perfectly cooked and seasoned well. They haven't skimped on the veggies, it was literally overflowing. The salad was a pleasant surprise. The veggies were fresh and crunchy. There was also pomegranate seeds and cashews, how cool is that? The wedges were nothing to rave about.\nBeing a huge Bourne fan, I can safely say The Prawn Identity (Rs. 1100) was definitely worthy of that name. It was surely the best out of the two. The couscous was absolutely delicious. It was sticky with the hint of a citric taste. The prawns were chewy and well cooked with a butter garlic drizzled on top. The sauce didn't really do much to elevate the flavors, it's something they can improve on. The salad was just as good as the last one.\nThe Charlie and the Chocolate Factory (Rs. 350) was their signature chocolate mousse. Unfortunately, it didn't live up to our expectations. While the texture was on point, it tasted very sweet which eventually overpowered the chocolatey taste.\nThe drinks menu was similarly fun to read with names like The Deathly Marshmallows, Dairy Poppins, Pineapple Express etc. Aside from that they also serve coffee and tea.\nThe Chocolita (Rs. 350) was essentially a chocolate shake with coca-cola. Yup, you read it right. If you're a coke fan, you might like this, otherwise, I would recommend you stay away. Basically, what they have done is used coke instead of milk. It was a very inventive drink but we don't see ourselves ordering it again.\nThe Cafe Latte (Rs. 380) was a big disappointment. It tasted very bland and the coffee was practically non-existent. Neither of us could finish it.\nTheir service was really great. There was only one person waiting on us and she was all friendly and smiles. Our food was served within a few minutes. They even asked us for any improvements on the food which is always nice to see.\nThe place has a retro-styled theme going on with colorful wall art and matching furniture. The artsy walls are very Instagram-worthy and trust me, they look great in a photo.\nThey also have wooden chairs and tables if you want to properly sit and have a meal. The place is very spacious and frankly very deserted during the day. You should drop by in the evening for their open mic nights and special events.\nConsidering all the cafes we have reviewed recently, they certainly seem to stand out in terms of inventiveness. The food is average but they could improve on their coffee.\nA retro-themed coffee shop serving decent mains but not the best coffee.\n\nකෝපිවලට කෙසේ වෙතත්, කෑමවලට හරි යන කැෆේ එකක් විදියට කැෆේ සෝෂල් එක හඳුන්වන්න පුළුවන්.\n",
  "url": "https://www.yamu.lk/place/cafe-sociale/review-218913"
}