{
  "name": "Cafè Alfresco",
  "address": "399, Bagatalle Road, Colombo",
  "telephone": "0112584980",
  "close_time": null,
  "description": "A café specialising in teas and quick bites. As the name suggests, this is mostly for outdoor dining, so it's not the best choice on a rainy day.",
  "tip": null,
  "review": "Placed right off Bagatalle Road and shrouded in greenery, Cafè Alfresco is a blink-and-you'll-miss-it establishment specialising in teas and quick bites. The outside is quaint and scenic, with seating for around twenty between five tables, with a few more couches and bar stools inside. The ample greenery gives out a jungle vibe, and provides some welcome shade from the relentless sun.\nThe egg and cheese burger (Rs. 530) was incredibly messy, and by the time it came out of the kitchen the bottom of the bun was soaked through. I managed to get some pictures just before the burger fell apart, after which I dejectedly scooped bits of cheesy omelette and bread into my gob. The taste of the burger itself was decent, the green chillies in the omelette gave it a nice kick although they could've held back a bit on the sauce. For the price, though, I'd have expected something of higher quality.\nThe waffles with ice cream (Rs. 350) - our second choice because they'd run out of strawberries and cream - was quite standard. The waffle itself was quite sweet, and could be eaten plain, but didn't get soggy quickly, and held together quite well even after the ice cream had melted a fair bit. This one's solid comfort food -  thick enough to fill your stomach, but also absorbent enough for your tears.\nThe service was fairly decent, although if you're on the less assertive side you'd have a hard time getting anywhere. The two men manning the café were quiet and prone to mumbling, and if we didn't initiate anything - from a basic greeting to ordering or seating ourselves - we'd probably be left standing at the door for a good while before they came up. Our food arrived fairly quickly, but when we asked whether we could sit outside (it had stopped drizzling), we had to move the food ourselves.\nThe risk with a place as small as Alfresco is that, if it's not dry outside, you can only seat a maximum of about 6 people inside. The interior has two tiny cafe tables, so fitting all your food and drink on one table is like a more difficult version of tetris. There's also more at risk - if you get over-enthused spilling some metaphorical tea to a friend, it is quite likely you will spill some literal tea as well. The walls are lined with shelves holding a variety of teas - if you haven't researched the place ahead of time, the decor screams 'WE DO TEA'.\nCafè Alfresco is a decent joint for tea and maybe some dessert, but a meal here for me would be a last resort. In most cases, the prices do not reflect the quality of the food, so it's a tad disheartening to pay so much for food that's average at best. This is primarily a place for a cup of tea, so give in to the subtle hints on every square inch of available wall space, and drink the tea.\n",
  "url": "https://www.yamu.lk/place/cafe-alfresco/review-187102"
}