{
  "name": "Chillato",
  "address": "No. 1110/1, Denzil Kobbekaduwa Mawatha, Battaramulla.",
  "telephone": "0715248037",
  "close_time": null,
  "description": "A soft serve ice cream place on Battaramulla.",
  "tip": "Try What's Popping!",
  "review": "Chillato is a soft serve ice cream place located in Battaramulla, near the Palan Thuna Junction. It's right before\n.\nHere's how it works. They serve a base of vanilla soft serve ice cream (small - Rs. 250, large - Rs. 350). You then add sauces and toppings to make a unique flavor. You can order preset combinations off the menu, or create your own.\nWe first tried What's Popping (Rs. 250) which comes with Rice Krispies, Popcorn and a sauce of your choice, to which we got the strawberry sauce. It was my favorite because everything worked so well together. They were quite generous with the toppings and were sweet and a little crispy which helped compensate the lack of flavor from the ice cream.\nNext, we tried the Choco Screamers (Rs. 250) which consisted of chocolate flakes, chocolate covered nuts (which tasted like Kandos chocolate balls) and chocolate sauce. This too was nothing to rave about. This didn't have nearly as many toppings as the first one did because, after a few bites, we were just eating the vanilla ice cream.\nTo mix things up, we tried the CocoNuts (Rs. 250). It was again vanilla ice cream with coconut crumbles, sprinkles and a sauce of your choice (we got caramel). Unfortunately, the coconut taste was nonexistent as there were few coconut crumbles added. The caramel sauce did help by giving a slightly different taste to the ice cream which we appreciated.\nFinally, we tried the Make Your Own Chillato (Rs. 250). For the two toppings, we got the Jelly Beans and the Chocolate Stones, topped with strawberry sauce. This was my least favorite cause the jelly beans were really hard to chew and they kept getting stuck in our teeth. The combo didn't work as well but that was our fault.\nThe place is owned by a lovely couple who were friendly and very helpful, especially when we couldn't make up our mind about the sauces.\nIt's a cozy little place with lots of parking space and an outdoor section. The interior has a brick and wood theme with benches and walled tables. The music was a little too loud but you can always ask them to turn it down. The seating outdoors is ideal in the evening or even on a mildly sunny day.\nThis is not the best place if you're looking for a huge variety of ice cream flavors but it's a really great spot to take your kids (the place is conveniently located next to Super Kids). Note that soft serve ice cream melts pretty fast and, aside from the toppings, it's just vanilla ice cream. The prices are reasonable so if you're ever in the area, you might as well check it out.\n",
  "url": "https://www.yamu.lk/place/chillato/review-212736"
}