{
  "name": "Chocoholics",
  "address": "506, Havelock Rd, Colombo 05",
  "telephone": "0114332261",
  "close_time": null,
  "description": "They put chocolate on everything.",
  "tip": "Get the Chocoholics stack! ",
  "review": "The name itself was enough to drag our lazy butts over on a chilled weekday. Chocoholics is dedicated to making everything a whole lot more chocolatey. While their dishes were great, we found ourselves a little conflicted with the prices. It is located on Havelock Road, a few blocks away on the opposite of the Sigma Institute.\nTheir menu is more widespread than we expected, with lots of options like pancakes, waffles, crepes, dipsticks, and churros. All chocolate covered.\nThe Mixed Fruit Pancake (Rs. 1200) was absolutely delicious. The pancakes were fluffy and golden on both sides and there were about 4-5 pancakes stacked together. Chocolate makes everything so much better so this was no exception. The warm melted chocolate along with the fresh fruits made up a stunning and succulent dish.\nThe Chocoholics Classic (Rs. 1100) was basically a strawberry filled waffle with a generous topping of chocolate sauce. While it was really delicious and mouthwateringly pleasing, we could not shake off the whopping 1000+ bucks.  The waffle had a decent texture to it with its own sweetness, and the sourness of the strawberries certainly helped balance out the flavors. It came with a side of melted chocolate and ice cream. We loved it.\nTheir beverages consisted of coffee, hot chocolate and lattes, which is pretty basic stuff.\nThe Hot Chocolate Viennois (Rs. 699) tasted fine, but unfortunately, it was cold. This is the first time that I actually received a hot chocolate which wasn't hot. There was quite a lot of marshmallows and whipped cream that I'm sure even the biggest sweet tooths would find to be too sweet.\nSince the hot chocolate didn't do it for us, we tried two other drinks which actually tipped the scales in their favor. The Coffee Cooler (Rs. 599) was really great, with a hint of coffee and a whole lot more chocolate milk. Out of the three, it was definitely my favorite. While I would have preferred more coffee, it was less sweet and more chocolatey.\nThe Strawberry Mojito (Rs. 499) was very refreshing, fizzy, very sweet and with that fresh hit of mint and lime.\nThey only have a handful of people, but their service is efficient and friendly. It did not take very long for our food to arrive, about 15 minutes.\nThe two-story building is painted in different shades of brown with matching wooden tables and comfy chairs. While their wall art is artsy and cute, it could use a variety. They have an open kitchen so you can easily observe how everything is made.\nThe food quality is above average, and so is the price. Our total bill came to about Rs. 4k. However, you can always share a dish between two people because that much chocolate is not good for anybody.\nThey put chocolate on everything.\n\nකොච්චර දුන්නත් බෑ නොකියා චොකලට් කන්න කැමති උදවියට කියාපු ම තැනක් විදියට මේ චොකොහොලික්ස් එක හඳුන්වන්න පුළුවන්.\n",
  "url": "https://www.yamu.lk/place/chocoholics/review-216776"
}