{
  "name": "Coffee Stop (Cinnamon Grand)",
  "address": "Cinnamon Grand, 77 Galle Road, Colombo 3",
  "telephone": "0112497382",
  "close_time": " Open until 02:00 AM",
  "description": "Coffee Stop at the Cinnamon Grand serves high quality short-eats, sandwiches, cakes and confectionary. It's open til 2 AM every day.",
  "tip": "Try the salmon and cream cheese bagel. ",
  "review": "The coffee shop conveniently located at Cinnamon Grand's lobby has good food and great service, combined with reasonable prices. Think of it as an upscale pastry shop, but with actually substantial food.\nThe manager and the staff are super friendly, though there was a bit of miscommunication with my orders not being placed right. The confusion was a result of a couple of different staffers taking my order, and only half getting through.\nServers went down just around then, and I was asked to take a seat — and that my order would follow. It did — the Beef Cornish (Rs. 122) was freshly baked and warm, and full of well-flavoured minced beef.  I did enjoy it, but it could probably do with a bit more filling.\nThey've also got a crepe station, so I got one of those with chocolate sauce. At Rs. 307 and a rather long wait, it's not really value for money: mostly because it's just one crepe (albeit a large one at that). It tasted fine as a pancake but I'm not sure I'd call it a proper crepe.\nI was a bit confused with my macchiato because it was pretty black and lacked cream, until I realised it was a double espresso instead: this was confirmed when the bill came. Little mix-up with the order there, but the coffee itself (despite not having cream) was quite good: aromatic, not burnt-bitter, and a good pick-me-up in the morning.\nCoffee Stop's mega plus point is their ridiculously friendly service. They'd forgotten to charge me for the take-away Cherry Pie I'd requested, and when I pointed it out they insisted that it was on the house and didn't matter as the mistake was on their end. Quite sweet, really.\nThe seating area is basically the hotel lobby. Furnishing is mostly bright fuchsia, and is very much a lounge to sit and have a nice catch-up with a group of friends. It's not the most convenient place to\nanything given the low tables, but it's pretty perfect for a coffee date. I've noticed little signs on the tables in the past, where it said that only customers who order above a certain amount (some 1500 rupees if I recall correctly) were entitled to use the space, but that seems to be gone now, which is great.\nOpen until midnight, Coffee Stop is one of the few places in Colombo to grab a late-night snack. They're consistently good, and rumour has it that they've also got some of the best mutton rolls in town (which they sadly didn't have when I dropped in!). It's a place you can feel comfortable and welcomed, and the prices (most of them under 500) aren't too bad either. Taxes and service charges are added to the bill, so keep an eye out for that.\nOpen until midnight, Coffee Stop's got good food and great service.\nCoffee Stop at the Cinnamon Grand serves high quality short-eats, sandwiches, cakes and confectionary. It's open til 2 AM every day.\n",
  "url": "https://www.yamu.lk/place/coffee-stop/review-170629"
}