{
  "name": "Cup Café (Mount Lavinia)",
  "address": "174, Galle Road, Mount Lavinia",
  "telephone": "0776073989",
  "close_time": null,
  "description": "The new Cup Café outlet in Mount Lavinia is a good place for coffee, GOT lovers and those looking for a secluded space to unwind.",
  "tip": "They've got the entire GoT series if you want to spend a few extra hours there.",
  "review": "The new Cup Café outlet in Mount Lavinia impressed us from the outside together with its interior setting the ideal café atmosphere, but did their food and drinks do the same?\nThe Vietnamese Iced Coffee (Rs.400) comes served with two layers of condensed milk and coffee.\n\nMake sure to really stir the layer of condensed milk to bring out the flavour.  However, the rich coffee flavour didn't come through as much on account of the drink being watered down by its heavy ice cube content.\nThe stirring would make for a cool\nthough, so either way you get something good out of it.\nThe Cappuccino(Rs.350) was what saved the day. It came with an ideal amount of slightly dense foam and a good water to coffee ratio.\nThey grind Hansa coffee beans (on-site) which provided a rich aromatic experience overall.\nThe Spicy Pineapple Chicken Waffle (Rs.600) is served with a helping of sloppy chicken, loaded with ketchup and laid on top of a slightly undercooked waffle.\n\nThe waffle was sweet which is a perk, but the pineapple took the spice away and made it taste even sweeter.\nWas the dish as spicy as we'd have liked it? Not really.\nJudging by how sweet the waffle was, we suggest you opt for the dessert waffles as opposed to their savoury counterpart.\nThe Death by Chocolate Cake (Rs.500) is a bit heavy so make sure you have room to put it all. The icing was a bit hard and the layers are not as smooth as one would expect.\nFlavour wise it was extremely sweet and did justice to chocolate, but overall it had me craving for a more moist cake base.\nGone are the days one has to worry about drinking a cup of coffee while awkwardly maintaining eye contact with a total stranger, thanks to the secluded 'booths' at Cup cafe.\nThe furniture is mostly polished wood with a few interesting statement pieces strewn about. There are a bunch of coffee-table books in case you want to do a bit of reading and they even have the entire GoT series if you're up for spending a few hours there.\nThey've got a guitar and everything, so if you're one of the more musically talented humans, you get to strum away.\nWith their prompt and friendly staff just a call away, you are bound to be in a stress-free zone while you are there.\nWith all the new cafés in town I'm not sure if Cup Cafe impressed me the most but I'll definitely drop by sometime to read another GOT book or grab a cup of cappuccino.\n",
  "url": "https://www.yamu.lk/place/cup-cafe-mount-lavinia/review-194512"
}