{
  "name": "Curve",
  "address": "1 Park Street, Colombo 2",
  "telephone": "112300133",
  "close_time": " Open until 12:00 AM",
  "description": "Curve, at Park Street Mews, is a tapas bar that's been around for a couple of years. While the purple-white theme is looking a bit old now, their tapas and drinks are still pretty good.\n",
  "tip": "Try the ice cream liqueur shots. ",
  "review": "Curve, at Park Street Mews, is a tapas bar that's been around for a couple of years. While the purple-white theme is looking a bit old now, their tapas and drinks are still pretty good.\nThe last time we reviewed Curve was a few months after they opened up, and back then it was quite happening. Nowadays things seem to have mellowed down, which isn't necessarily a bad thing. We dropped in during the afternoon which is possibly the least crowded time. Their menu has remained relatively unchanged, but their prices are still on the pricey side, especially when it comes to the drinks.\nCurve offers a pretty comprehensive range of cocktails to choose from, albeit at a slightly high price, ranging from Rs. 720 - Rs. 1250. We went caipirinha (Rs. 720) which is a bit of an uncommon cocktail here in Colombo but it's apparently Brazil's national cocktail. This is a pretty sweet cocktail though adequately strong because of that\nThey've recently introduced an executive lunch tapas platter which is actually a pretty decent deal Rs. 999. What you get is three different savoury options- vegetarian, open sandwich and a pasta, followed by a dessert. The good thing is that they give you a bunch of choices for each. In our case, we went with the curd marinated grilled chicken for the sandwich, crab with tomato cream for our pasta and the hash brown topped with sauteed mushrooms for the vegetarian pick. The open sandwich was a bit of a challenge to eat but besides that each element actually tasted quite nice, with a good contrast of flavours between them.\nWe also tried out their crab croquettes (Rs. 675) which is served with a curry mayo sauce. The last time we had this, we found it a bit bland but this time around the flavours were on point with a well seasoned creamy crab meat filling and crispy fried shell. The curry mayo sauce, however, was just too mild and didn't really add that bit heat that we were looking for. We would also have liked to have seen a bit more than just four croquettes for nearly 700 bucks.\nOur dessert- the nougat parfait with berry sauce was a part of the executive lunch platter and while the portion was quite small, it tasted great. The parfait itself was creamy and sweet with the pieces of nougat adding that nice crunch at the end.\nA couple of years ago Curve's purple and white colour theme was pretty hip, but not it's looking a bit dated and washed out, almost looking a night club with an identity crisis. They've got a small performance area where they host musicians on most nights of the week, so this is still a good a place to unwind after a long day of work. One thing they do need if they plan to stay open during the day, is a much stronger AC.\nI've been to Park Street Mews a few times and I haven't really had many complaints when it comes to their service, but on this occasion the service was far too slow so we ended staying for at least half an hour longer than we should have. From what we gathered they were preping for an event later that night so everything from bringing the menu to taking the order were nearly 15 minutes apart.\nIf you want to try something a bit different, Curve's executive lunch tapas platter at Rs. 999 is a pretty good deal. They generally have some sort of gig on week nights so check their\n, before dropping in.\nCurve, at Park Street Mews, is a tapas bar that's been around for couple of years. While the purple-white theme is looking a bit old now, their tapas and drinks are still pretty good.\nCurve is a welcome addition to Colombo nightlife. They do decent tapas, good cocktails, and extraordinary ice cream shots, all in a beautiful and social location.\n\nකර්ව් කියන්නේ පාර්ක් ස්ට්‍රීට් මිව්ස් එකට එහා පැත්තේ තියෙන ටපැස් බාර් එකට. ඒකෙ මිල අඩු නෑ. ඒත් කොක්ටේල් සහ ටපැස් හොඳයි. මේ දවස්වල ඒක ටිකක් ජනප්‍රියයි.\n",
  "url": "https://www.yamu.lk/place/curve/review-50320"
}