{
  "name": "Divine (Colpetty)",
  "address": "32, Queen's Road, Colombo 03",
  "telephone": "0112583598",
  "close_time": null,
  "description": "A Sri Lankan bakery chain.",
  "tip": null,
  "review": "Divine has been around for some years now. While they haven't expanded to every corner of Colombo like your average\n, they do have quite a few branches. I popped in to their most known branch positioned down Queen's road for a few Lankan bakery classics. So, is it really divine?\nWe tried out a variety of what was on display ranging from their Assorted Savoury Pack to their no-bake Strawberry Cheesecake.\nComplete with 3 mini Fish Patties, 3 mini Chicken Pizzas, 3 Sausage Pastries and 3 mini Fish Buns, their Assorted Savoury Pack is really reasonably priced at Rs 300 with each item coming up to just Rs 25 each. Tastewise, it was quite satisfactory.\nThe mini Fish Buns and Fish Patties had adequate fillings - spicy with lots of fish. What I liked best about the patties was that the texture hadn't lost crunch as is the case in most places. The mini Sausage Pastry was nothing extraordinary - it was your normal, basic sausage pastry. The mini Chicken Pizza was doughy, but for Rs 25, it was topped with a generous amount of thinly cubed chicken and of course, the mozarella.\nI also got a Fish Cutlet (Rs 50), a Fish Bun (Rs 40), a Chilli Prawn Pie (Rs 150), a Tandoori Chicken Pie (Rs 100) and a Sausage Boat (Rs 100).\nThe Fish Cutlet, slightly pricier than usual places, was loaded with fish and was well spiced..\nThe Sausage Boat was somewhat like a pizza without the measly bit of mozarella bakeries tend to splatter on top. This wasn't a winner. Tasted mediocre. Wouldn't bust 100 bucks on that again.\nDivine broke the unspoken rule and had more fish than mashed up potato in their Fish Bun! Also for 40 bucks, it was filling.\nSri Lankan restaurants and bakeries love adding the word \"Tandoori\" before anything that comes with chicken for a fancy touch and Divine decided to join the Fake Tandoori Club. There was nothing Tandoori about the chicken filling! But without the Tandoori in mind, this pie wasn't bad.\nJust like the Tandoori Chicken Pie, the Chilli Prawn Pie, too, wasn't anything great.\nMain question - Where exactly were the prawns?\nHowever, it's notable mentioning that Divine did a good job on the crust for both pies. It was neither packed with margarine nor was it dry.\nTo wash down all of that gluten, I tried their Chocolate Mud Cupcake (Rs 160) and Strawberry Cheesecake Cup (Rs 130).\nThis was a really dense cupcake topped with a rich chocolate ganache-y topping. Worth the 160 bucks spent.\nDivine's Strawberry Cheesecake Cup is what you should be going for if you're really craving cheesecake but finished all of what you received on payday. It doesn't taste rich with that creamcheese-y goodness, but their take on no-bake cheesecake isn't too bad for Rs 130, but the strawberry topping was the real champ. Tangy and sweet, it's worth buying just for the topping. Okay, not really.\nHowever, it is rather disappointing to see Divine give in to shameful misrepresentations by lining the cup with crushed biscuit. That's right - there's no full biscuit layer. Also, being sandwiched by the cheesecake filling doesn't really help retain that biscuit crunch.\nIt's a bakery, not a spot for fine dining. So, the interior is mediocre with just glass-top tables and normal chairs with steel backs.\nService here is not bad. The staff will readily help you out and serve you with smiles. No complaints, but no fancy treatment either because it's just a normal bakery and not your grandmom's palace.\nObsessed with the color pink, Divine stands as a reliable bakery for Fish Buns and other bakes. They are not uber expensive like\nbut nor are they as divine as their name would suggest.\nAll in all, it's your standard Colombo bakery.\n",
  "url": "https://www.yamu.lk/place/divine-colpetty/review-139743"
}