{
  "name": "Dolce Vita",
  "address": "27, Poruthota Road, Ettukala, Negombo",
  "telephone": "0312274968",
  "close_time": null,
  "description": "Dolce Vita is a rustic and snug little Italian restaurant / café which serves everything from breakfast menus to snazzy drinks, pizzas and gelato.",
  "tip": "Go for pizzas or pastas.",
  "review": "I first thought Negombo was called Little Rome because of the amount of Italian restaurants in town. The nickname apparently comes from the considerable number of Roman Catholic churches you can find in the city, ancient remnants from the Portuguese era still heavily frequented by the large Catholic population of the area.\nMore into food than religious heritage, I preferred to stick to my first thought and to visit Dolce Vita, this homely beachside restaurant away from the buzz of Poruthota Road.\nA red Vespa would have given a more authentic look to the entrance but I don't think the yellow scooter was part of the scenery anyway.\nWe purposely ignored the sandwiches, crepes, burgers, etc, to focus on Italian staples: pizzas and pasta. And gelato (only because they're homemade).\nThe sea breeze and relaxing sound of the waves crashing on the beach nearby probably influenced our first pick: the Seafood Tagliatelle (Rs. 900). The al dente pasta came with lots of fresh prawns and cuttlefish in a deliciously oily, garlicky and spicy sauce. This simple dish was brilliantly executed. A lot of flavours were going on: the seafood, the garlic, the chili, the herbs, the olive oil. And the cooking of the pastas was spot on! Kudos for that! The only miss was the cuttlefish that was a bit chewy.\nDolce Vita makes Neapolitan-style pizzas, easily identifiable with their rather thick bready crusts. The dough was perfectly cooked: crusty on the inside and soft in the inside. Yum! It lacked bit of salt but the saltiness of the tomato sauce and other ingredients compensated.\nThe Quattro Stagioni (Rs. 1,000) immediately delighted us with the way the main ingredients (black olives, ham and artichokes) were aesthetically arranged on the pizza. Taste-wise we were also pleased. From the tomato sauce to the crust, cheese, olives or ham, all components were of high quality.\nThe Salami Pizza (Rs. 1,100), simple and efficient, was equally good. The subtlety spiced salami made us happy.\nFinally, we couldn't resist the gelato call, especially after reading on the menu that they're homemade. Choice was limited to 6 flavours on that day, which made our life way easier. We tried half of the offer: Chocolate, Vanilla and Coconut (Rs. 250 a scoop). And the winner was coconut! Taste and texture were both on point. It was creamy and the coconut flavour was subtle and not overpowering. The 2 others unfortunately tasted rather synthetic and we found some ice crystals in the vanilla ice cream, which is not a nice find.\nRestaurant names don't always make sense but in this case, Dolce Vita (sweet life) perfectly suits the place. It's hard to describe why but it feels good to be there. Time seems to slow down as soon as you enter. Is it because of the retro style that makes Dolce Vita look like an old cafe from a secluded village in Europe? Is it the proximity with the beach? Or is it the cheesy Italian music in the background? Probably not this last guess. Anyway, Dolce Vita is a chilled spot with good vibes. You won't want to leave.\nThe service is nice and efficient, really nothing to complaint about.\nDolce Vita is a very homely and affordable place to hang out with friends, good Italian food and a great view of the Negombo Beach. We strongly recommend when passing through Negombo if like us you're more into Italian food than Roman Catholic churches.\nUnpretentious Italian restaurant on Negombo Beach serving honest pizzas, pastas, gelato and more.\nThe food is good value for money, and it comes in generous portions. More importantly, they don't disappoint.\n",
  "url": "https://www.yamu.lk/place/dolce-vita/review-204103"
}