{
  "name": "Don's Deli",
  "address": "53, Haig Road (Marine Drive), Colombo 3",
  "telephone": "112055606",
  "close_time": " Open 8.00 AM to 8.00 PM",
  "description": "Don's Deli is a little bakery on Marine Drive that doubles as a favourite spot for lamprais, and they also serve seafood at Fat Crab upstairs. ",
  "tip": "It's on Marine Drive, three streets south of Majestic City.",
  "review": "Don's Deli aka Don Stanley's is an establishment that's been around for a very long time and they're known for their catering business, mostly through their pavilion restaurant\n. We dropped by the deli on Marine Drive and sampled their shorteats.\nDon's Deli is a small, comfy, barely furnished space. The deli opens at 8AM but if you plan on having a meal, you can either ask for their famed lamprais, or head upstairs to The Fat Crab which opens at noon. The place is A/Ced with a nice glass view of the passing Marine Drive traffic and the ocean. Service is what it is, in a small mainstream bakery where you get your order over the counter.\nDon's Deli serves a cheesecake that has come highly recommended from its start-up days. We tried it, and it's rather expensive at 500 bucks, but it's tasty - soft moussey cheesecake, sweet and slathered in real strawberry sloshed around with jam and sauce. By ordinary bakery standards, the cheesecake is good, despite the hefty price.\nWe also tried some other stuff - the brownie, the maalu paan, the eclairs, the mushroom & chicken pie. This stuff is more bakery priced at Rs. 80-125. The brownie is actually not bad (there aren't a load of easy stops that do takeaway brownie), it's very thick and chocolatey, although a little hard from being stored a while. These guys make a good maalu paan, it isn't amazeballs like the toppers of\n, but it's quite decent served warm, with plenty of fish and potato.\nDon's Deli does decent pastries, sandwiches and desserts, if you're in the neighborhood and want a quick bite. We'd say it's worth more the visit for their lamprais, and maybe some late night crab curry upstairs.\nDon's Deli is a little bakery on Marine Drive that doubles as a favourite spot for lamprais, and they also serve seafood at Fat Crab upstairs.\nThe original Don's was an institution. The new establishment on Marine Drive, however, seems to be still finding its legs. Don's Deli has a great location and a range of stuff you can order in advance (crab, pasta). What they have on immediate offer, however, is rather limited, for now.\n\n''රයිස් ඇන්ඩ් කරි නම් නෑ. ලම්ප්රයිස් තමයි තියෙන්නෙ''\n\nමුල් ඩොන්ස් ආයතනය ඉතා ප්‍රසිද්ධ එකක්. මැරීන් ඩ්‍රයිව්හි අලුතින් පිහිටුවන ලද ඩොන්ස් ඩිලිඑක තවම නැගිටිමින් ඉන්නවා. ඩොන්ස් ඩිලි පිහිටා තිබෙන්නේ අනගි තැනක. එහි ඔබ කැමති කකුළුවන්, පැස්ටා වැනි දේ කලින් ඇණවුම්කර ලබාගන්න පුළුවන්. ඒ මොහොතේ මිළට ගන්න තිබෙන දේ දැනටනම් අඩුයි.\n",
  "url": "https://www.yamu.lk/place/dons-deli/review-43687"
}