{
  "name": "Dots Bay House",
  "address": "Hiriketiya Beach, Dikwella 81200",
  "telephone": "0777935593",
  "close_time": " Open until 11:00 PM",
  "description": "A cafe/hotel/performance/community space on Hirikeytiya beach, Dots Bay House wears its multiple identities with casual confidence.",
  "tip": "Pre-check if you can make it there when there's a performance or market by local artists and artisans, nothing like some good home-grown on this jungly beach",
  "review": "Hiriketiya Beach feels like its just emerging into the mainstream after several years in the post-war travel underground. It's really small, I mean you can walk across it in ten minutes, and is still peppered with only a few businesses. The place largely attracts surfers and backpackers, and a few people from Sri Lanka who seem to dig its rather undiscovered feel.\nOne of those businesses is Dots Bay House, occupying land claimed out of the marshes that surround Hiriketiya. It functions as a hostel, restaurant, art and community space.\nIt is very open plan in design and I like how the space merges with the lagoon and the surrounding environment. On quiet evenings there is a steady roar of crickets and other insects that blends into background music.\nInstagrammers rejoice, the food is presented in dishes that complement the furniture, the pastel shades, the minimalist shapes and industrial structures of the design. Tables are either solid wood or made out of metal barrels. Cement benches line the edges of the space, looking out over the marshes.\nDots Bay House often plays host to performances, we'd watched The One Who Loves You So by Arun Welandawe-Prematilleke the previous night, and The Soul and Larry T were billed for NYE. This Saturday there was a local artisans' market in full swing.\nThe vibe is chill, and good. The prices fit well into the upmarket backpacker bracket. The clientele is mostly white, but unlike Mirissa, there is no brownophobia here. I didn't stay there so I can't say much about the hotel experience, but I did hang out here for a while and tried the food, so let me tell you about that.\nWe sipped cocktails out of handmade metal straws made by\n. The straws were a bit too thin for the job, and bits of fruit kept blocking them up, it turned out later the staff had served us with the wrong straws, we saw others drinking out of ones with a bigger circumference.\nThe Passionfruit Mojito (Rs. 750) (right) was good. The Bacardi had a slight bite, but the mint complemented the acidic taste of the passion fruit really well, even though it was a little bitter towards the end. Papaya in a cocktail isn't normal, but the Shrubs Up (Rs. 750) was pretty baller. The chili in the vodka and mint was what did it, making it taste like an accharu in a glass. Try the watermelon version if they have it, I hear its just as good, if not better.\nThe coffee (Americano - Rs. 350) was presented ready made for an instagram picture with whatever hifalutin book you're not actually reading but carry around to impress people (in coffee shops and online) with. It also tasted good, in case that's important. I liked the single Hawaiian cookie placed on the tray.\nWe liked The Prawns (Rs. 800), but it would have been way too little as a complete meal for a hungry person, assuming you want to eat a complete meal of only prawns. They were crispy and the lemon and correander mayo was the perfect seasoning.\nThe Sausage (Rs. 800) (top left) was also really good, the creamy mash potato contributed a softness to the chicken bratwurst, which was fresh and meaty. The onion gravy was a great partner to the tangy taste of the meat.\nThe vegetarian options weren't the best. The Penne (Rs. 750) (top right)  pasta had parsley, zucchini and green pepper but in unsatisfactory quantities. The veggies were also a little too soggy while the pasta was a little too dry. It tasted bland and the cream cheese's sourness wasn’t countered by anything else. The herbs in it had some promise, but some more light spicing wouldn't have gone amiss. The Nachos (Rs. 650) came with banana chips. A little burnt and too dry. The melted mozzarella didn’t do enough to soften it. The sour cream did, but unfortunately there wasn’t much of it in the dish.\nNote that the menu we tried was an intermediate one because the kitchen at Dots House was being renovated. The new kitchen should be up and ready by the new year, with a brand new menu to boot. So lettuce know what you think of the food when you go.\nWas a hit. The Chocolate Brownie (Rs. 450) was soft and yielding with a middle that had a good solid density to it. The semi-whipped cream was airy but stll retained substance. It wasn't too sweet and the multiple textures created a melt-in-the-mouth kinda situation. The chocolate sauce was light.\nIf you have instructions to stay away from sweet things, looking at this brownie being consumed will definitely test your self-control.\nDots Bay House is staffed by locals. They seemed to be having fun at work, always something that translates well into good service.\nA relaxed place with great service, Dots is great to have as a base while you surf or chill on the Hiriketiya beach.  The drinks are spiffing, but the food is only about sixty-forty good. We support its support for local economics, art and crafts.\n",
  "url": "https://www.yamu.lk/place/dots-bay-house/review-208741"
}