{
  "name": "Eastern Wok",
  "address": "38, Walukarama Road, Colombo 03",
  "telephone": "0112576276",
  "close_time": " Open until 11:00 PM",
  "description": "Eastern Wok is a multi-cuisine restaurant that serves Chinese, Indian and Arabian food.",
  "tip": "Prepare yourself for the really, really large rice portions.",
  "review": "If your stomach is being indecisive and cannot decide what it needs, you might want to give Eastern Wok a go as they serve Chinese, Indian and Arabian food, although Chinese seems to be the more favored cuisine by the looks of their menu.\nIn under 10 minutes, food was served. +1 for the quick lunch! (However, it's not always this fast as I have patronized Eastern Wok before. So, I am assuming they are pretty quick during lunch hours because of the orders  they receive for executive lunches.)\nWe opted for Chinese, saving our taste buds the muddle of a fusion of cuisines. We ordered a portion of Devilled Chicken (Rs 795), a portion of Wok Special Mixed Fried Rice (Rs 720) and a portion of the good, old, Sri Lankan Chinese classic, Deep Fried Cuttlefish in Hot Butter Sauce (Rs 885).\nThe Devilled Chicken was the standard spicy yet sweet chicken settled in with thick, glossy gravy.\nThe dish didn't take me to Devilled Chicken Heaven, but it was pretty good. The flavours could have come through more strongly and someone needs to stop the chef from throwing in too many tomatoes, but otherwise it wasn't disappointing.\nThe portion of cuttlefish was fairly large, but tastewise, I'd say 6.5/10 because it was a little too sweet and the batter was a little too lumpy. Not the best out there, but not the worst either.\nThe Wok Special Mixed Fried Rice, on the other hand, ladies and gentlemen, boys and girls, cats and dogs, was the true winner. The portion was magnificient, enough to feed 4-5 people, or 10 earthlings on a diet. Very well spiced with generous amounts of shrimp and fried chicken tossed in, this was worth every cent.\n\nThe interior has a Middle Eastern touch and there is plenty of comfortable seating, including upstairs seating.\nIn terms of service, the staff seem to be adequately trained. They weren't overly friendly and knew what they were doing. In fact, the rice was ordered upon their recommendation. On the whole, the service wasn't too amiable, but that's not a bad thing because being extra genial can be a little pesky.\nIn conclusion, the food is not the best in the city and there definitely is a lot of room for improvement in terms of really bringing out the piquancy of the cuisines, but their portion sizes mean the bucks are not gone to waste.\nNot a disappointing experience and will definitely go back for the yummy rice!\n",
  "url": "https://www.yamu.lk/place/eastern-wok/review-115010"
}