{
  "name": "Empire Cafe",
  "address": "21 Temple Street Kandy Sri Lanka",
  "telephone": "812239870",
  "close_time": null,
  "description": "Empire Cafe is a little restaurant-cum-cafe housed inside the Olde Empire Hotel, a 200 year old building, right next to the Dalada Maligawa in Kandy. It's a popular tourist hangout, is surprisingly affordable, and has the best chocolate cake we've had in ages.",
  "tip": "The chocolate cake is excellent. Give the homemade ice cream a go too. ",
  "review": "The café is housed in the colonial, Olde Empire Hotel...that has been around since the 1890’s. During its time the Olde Empire building has been used as a coffee factory (Kopi Kade)...frequented by lawyers and legal workers...In January 2014 Manor House Concepts took over the lower floor...and renovated it into the now vibrant Empire Café, one of the best restaurants in Kandy.\nThis is an excerpt from their website about the café's history. As it shows, the building has been around for about 200 years and the café itself is a blend of the colonial and modern. I'm down for that!\nThe restaurant/café is right next to the\nin Kandy. It is a popular tourist spot with affordable, delicious food.\nTheir menu mostly consisted of pasta, wraps, burgers and salad - quick and easy. The café is located in an area where most people just want to pop in for a quick bite before continuing their tour, so they cater to that.\nWe ordered a Kingdom Burger (Rs. 680) off their Empire Classic section which came with a side of chunky fries and ketchup. The potato patty was big and juicy, accompanied by\nof rocket lettuce leaves, eggplant, tomato, gherkin and a mustard tomato sauce. It was flavourful and filling, definitely one of their popular dishes. The fries were crispy, salty and just yum!\nWe also got The Lankan Wrap (Rs. 615) which had a homemade parippu vadai, paneer, spicy caramelised onions and mint filling with a side of chunky fries and ketchup. The combo worked surprisingly well. The tortilla wrap was thick and crunchy while the vadai and paneer spiced it up. There wasn't a lot of caramelised onions, but they had a generous amount of paneer so no complaints there.\nWe've said it before and we'll say it again, their desserts are heavenly! We got the Homemade Strawberry & Cinnamon ice cream and at Rs. 390, this is so worth it. It was absolutely delicious, and the texture was creamy with bits of strawberries to chew on. When you first taste it, you're immediately taken aback by the strong taste of cinnamon, but it recedes quickly and you find yourself going back for another bite, then another.\nHere's the thing. For their specials that day, there was a Pink Tea with Hibiscus and Jasmine (Rs. 370). I ordered a pot because I have never tried Pink Tea. So either I'm colour blind or that is\npink tea. However, it did taste alright, and I definitely detected hibiscus and jasmine, but if you're gonna tell me I'm getting pink tea, I need pink tea.\nWe also got a Cappucino (Rs. 385) and it didn't taste as good as it looked. They told us there was something wrong with the machine which is probably true cause it tasted very bland and watery.\nThe interior design of the place is beautiful with a pink and teal theme, big white cane chairs, Sri Lankan and Indian vintage posters and cute wall art. The place still has remnants of the elegant hotel it used to be, with its old-fashioned reception, narrow corridors and balcony.\nThe waitress who aided to our needs was very friendly and bubbly, giving us our time and space to order. The rest of the staff was friendly and hospitable too.\nTheir mains have improved a lot since we last visited. You get the feeling of being inside an old Kandyan café chomping on delicious food while staring out the window. The place is timeless. If you're ever in Kandy, drop by for a visit.\nIt is a popular tourist spot with affordable, delicious food.\nEmpire Cafe is a little restaurant-cum-cafe housed inside the Olde Empire Hotel, a 200 year old building, right next to the Dalada Maligawa in Kandy. It's a popular tourist hangout, is surprisingly affordable, and has the best chocolate cake we've had in ages.\n",
  "url": "https://www.yamu.lk/place/empire-cafe/review-182728"
}