{
  "name": "Fazly's Halal Refreshment",
  "address": "1, Vellons Passage, Colombo 2",
  "telephone": "0112304504",
  "close_time": " Open 5.00PM to 1.00AM",
  "description": "Fazly's Halal Refreshment is one of Colombo's most popular streetside haunts, known for their delicious, mayo dripping, affordable fare. ",
  "tip": "Get either the Charley or Cordon Bleu burger. \r\nTake-away recommended. ",
  "review": "It's a little funny how Burger's King has a little sign by their shop that says 'No affiliated branches.' From a little bun-kade to a full on diner, they've come a long way and are now the go-to fast food shop for people from all walks of life.\nWhether you're a broke teenager, a hangry businessman or a writer with 0 salli to spend (me), this is your spot.\nSo they're famous for being the King of Street burgers and while I never really understood what the hype was I decided to go check them out anyways. Word on the street is that they've got big fat meaty patties, although I heard that the patties have now reduced in size.\nFirst of all, the buns are pretty generic, commercially made buns but that's expected of them since they're a street stall for fast food. They don't hold back on the sauce and mayo although I wish they would. Apparently my cousin is a regular customer and he recommended a few items that were customer favourites.\nThe Fish Fillet Burger (Rs, 380) comes stuffed with crisp fish fillets. The fillets are fresh, wonderfully soft, batter fried and a little on the bland side but that didn’t stop me from enjoying the taste of fish without it being overly seasoned. If you're someone who enjoys more seasoning though this probably wouldn't do it for you.\nWe also tried a Chicken Cordon Bleu Burger (Rs, 380), which was worth every penny spent solely for the meat. In terms of the patty, it puts the burgers at the other joints to shame because it doesn’t come with any old patty.\nIt’s served with a big, juicy chicken breast that’s crisp and fried on the outside and soft and chewy on the inside. I was expecting it to be charred but imagine my surprise when I actually heard a fresh crunch as I bit into it. Heavenly.\nI honestly can’t decide if this was my favourite, or if it was the beef burger (see below). The Big Roast Chicken Burger (Rs, 340) was served with big, fat slices of chicken ham and I couldn’t get enough. The slices were succulent and bursting with chickeny goodness. So much happiness.\n\nOkay the Big Roast Beef Burger (Rs, 330) has to be the best out of the lot. Just like the Roast Chicken Burger, it came with beautiful roast beef slices (beef ham???) which packed a great meaty flavour to it. If you're a beef hog like me then you should definitely go for this one.\nAll burgers come with a serving of fries, but the fries weren't exactly what my soul was craving for. In fact they were quite dry and from what I can tell they've been stored for at least a day and then refried. Why u do dis.\nHowever, we DID get the Rosti Rounds (Rs. 220).\nI'm just going to go ahead and say it. These are hands down the BEST hash browns in the city by far. They're thick, they're packed with flavour, salted, peppered, and spiced just right and even thought they're just a wee bit oily they're absolute perfection. 5/5 for these.\nSince it’s a dodgy diner that dishes up street food, you can’t really expect to walk in and have a 7 star experience. I even had to take pictures discreetly as I was being given the stink-eye by about 50 different people. Being more of a dodgy-pub girl myself, I didn’t mind the garish, contrasting paint on the walls (lime green and neon orange) the bright fluorescent lights, or the tacky generic chairs and the unmistakeably grimy overall appearance. So bad I actually liked it.\nNot that the ambience really matters since Burgers King is a crowd favourite for their post drinks take-away excellence. Accordingly, the waiter was swift with our orders and believe it or not it literally only took 10-12 minutes for them to bring out four different burgers and the side dish.\nGrab your friends, pool your pocket money together and head down to Burger’s King. Make some noise, laugh as loud as you want to and stuff your faces until you’re bursting at the seams.\nAll in all, it was a fun experience for me and I’d definitely go back.\nFrom a little bun-kade to a full on diner, Burger's King has come a long way and are now the go-to fast food shoppe for people from all walks of life.\nBurger's King is one of Colombo's most popular streetside haunts, known for their delicious, mayo dripping, affordable fare.\nThe name - either a gentle pun or copycat mistake - says it all. This thriving eatery sells pretty much just burgers - about fifteen varieties.\n\nපොකට් එකට නොවැදී බඩ පුරවගන්න කියාපු තැන මේක. අනික රෑ එක වෙනකම් ඇරලනේ. ඔය නයිට් අවුට් වෙලාවට වුණත් යන්න පුළුවන්.\n\nBurger's King කියන ‍මෙහි නම ඇතැම්විට අනුකරණාත්මක අත්වැරැද්දක් හෝ හාස්‍යොත්පාදක එකක් වන්න පුළුවන්. වේගයෙන් දියුණුවන මේ ස්ථානයේ වර්ග 15ක පමණ බර්ගර් අලෙවියට තිබෙනවා.\n",
  "url": "https://www.yamu.lk/place/burgers-king/review-121472"
}