{
  "name": "FLOW (Hilton Colombo Residences) ",
  "address": "200, Union Place, Colombo 2",
  "telephone": "0115344644",
  "close_time": " Open 6.30AM to 10.00AM, 12.00PM to 3.30PM, 7.00PM to 11.00PM",
  "description": "FLOW is a restaurant at the Hilton Residences that serves up  a variety of international and local cuisines. ",
  "tip": "Call and make a reservation. ",
  "review": "The buffet at FLOW has been a popular go-to for the white-collared masses for a while now. They have an a la carte menu with a few interesting dishes but their buffets are what they're known for.  The ingredients are extremely fresh and they offer a massive spread.\nIt is highly recommended that you make a reservation before you go. They'd reserved a single table for me in a perfectly quiet corner away from the noise and people.\nThe interior is posh, with dim yellow lighting directly overhead. It casts a massive shadow over your food and makes taking pictures a chore. If you're here to Instagram, bring a portable light source with you or reconsider your life choices. The furniture is basic, with most of the attention being focused on the serving stations.\nTheir main attractions are their in-house chefs, who make sure the food is always topped up. It's presented in pans over low heat so it's always hot-hot and fresh.\nThey offer a multitude of cuisines such as Western, Indian, Asian, and local. There's also a ton of different types of salads, hors d'oeuvres and so on. Their sushi options are incredibly limited with three types of rolls; a cucumber roll, tuna roll and California roll which you can see in the picture above.\nWhen I asked, the hostess told me that they specialise in Western cuisine. They had herb encrusted fish fillets, chicken cacciatore, grilled polenta and a manner of grilled vegetables. Problem is, these had little to absolutely no seasoning coming through despite the food looking bright and inviting. I'm okay with bland food but most of it tasted like water.\nTrying my best to sample as much as I could from the large spread, I came to the conclusion that what they specialise in is the Indian food. The naan was light, with soft, pillowy corners. The dhal was fantastic. It's probably the best dhal I've had at any restaurant.\nIf you find yourself drawing a blank amidst the counters, opt for the beef or chicken satay. Both were equally filling and the meat was juicy and pretty much perfect.\nAs with all buffets, their noodle station is a winner. With a choice of either Tom Yum or Chicken Soup, you get to pick and choose what you like and the chef will put it all together for you. The Tom Yum soup is excellent and you'll be forced to spend more time than you have so you can sit down and enjoy each and every spoonful.\n\n\nDessert is alright, with a plethora of different cakes and puddings. There's also a waffle/ice-cream kotthu counter so you can indulge in either if you feel like it.\nThe chefs are super-eager to help out if you need it. The waitstaff are alert, they're always topping up glasses of water and they regularly check up on their patrons.\nOne thing I'll have to remark on is the fact that the waiter who was tending to my table got a tad too friendly. I'm all for friendly conversation and I was rather enjoying his overall pleasant conversation, but at one point he asked me a few personal questions; 'Where do you live?' 'Where's your hometown?' etc. I don't entertain such questions so I ignored him and eventually he stopped.\nThe entire buffet costs Rs. 3000 (inclusive of taxes) and while we're not sure we'd spend that much on lunch again, it's still a good buffet if you feel like a splurge or if you've got business people/clients to entertain.\nFLOW at the Jaic Hilton does a full buffet perfect for business lunches.\nFLOW is a restaurant at the Hilton Residences' that serves up  a variety of international and local cuisines.\n",
  "url": "https://www.yamu.lk/place/flow-hilton-colombo-residencies/review-177096"
}