{
  "name": "Frosty Roll",
  "address": "338 T B Jayah Mawatha, Colombo 10.",
  "telephone": "0773702582",
  "close_time": null,
  "description": "A new rolled ice-cream place inside the Pearl of Asia Mall.",
  "tip": "Get your ice-cream to go in a takeaway cup!",
  "review": "Frosty (like the snowman) Roll (like my stomach after eating here) is a new rolled ice-cream place located inside the brand new Pearl of Asia Mall next to Excel World. They've got a pretty extensive variety of flavours and combinations, so it's probably best to go with a group of friends, each get a different flavour and try them all. Unless you have an issue with spit swapping, in which case you're missing out big time.\nFirst up we had the Choco Blast (Rs. 450), a chocolate ice-cream with chocolate bits, topped with chocolate wafers, an oreo, whipped cream and chocolate cornflakes. This tasted a lot more like sugar than like chocolate - I like my chocolate to be more cocoa than sugar, and this did not deliver. The toppings were great though, and the cornflakes offered up a crunch that the chocolate bits didn't.\nThe Strawberry Blast (Rs. 450) is a strawberry ice-cream made with frozen strawberries and strawberry syrup, and topped with whipped cream, strawberry wafers, and a strawberry. This one was my favourite, the strawberry flavour really came through and the ice-cream was creamy and rich. It was also by far the prettiest, and looked like the inspiration behind\nVanilla Peach (Rs. 420) has a vanilla base with little bits of canned peach in it and infused with peach syrup. It's topped with whipped cream, a slice of a canned peach and a cherry. Turns out peach and vanilla are a pretty good combination, although the vanilla was a bit overpowering. I'd have preferred a more peachy flavour, but this - like the Choco Blast - was more sugar than anything else. It's still a nice, refreshing change from the standard ice-cream flavours though, so give this a try if you want to try something new, but not too wild.\nThe station is manned by four people, but they only have two bases for preparing the ice-cream, so the process is quite slow. You can, however, watch them preparing your ice-cream through a little glass divider, so if you're easily amused like I am you should be okay. It's a big difference to the standard chuck-a-scoop-in-a-cone ice-cream experience, but it's worth the wait if you want to try something new and have some time to kill.\nThe place is quite small, and seats around 12 people maximum. The design sensibility as a whole is very Pinterest (flower pots, posters with cute but slightly annoying slogans, chalkboards), but still sunny and bright. The tables are decorated with mini vases and flower pots full of artificial flowers, and they've also got some magazines lying around, presumably to entertain you while you wait 10 minutes for ice cream. The place looks quite relaxing but it's also quite small.\nFrosty Roll is a cute little place that's great if you want to try something new and are super patient. The toppings were the highlight, but the ice-cream itself is very, very saccharine so if, like me, you have the taste buds of a 50-something uncle, you might leave feeling a little dizzy. It is, however, a great place to take kids, provided said kids don't belong to you and you can get rid of them before the sugar rush kicks in.\nA new rolled ice-cream place to fulfil - and potentially reverse - your sugar cravings.\n\nඔන්න එහෙනම් රස ම රස රෝල්ඩ් අයිස්ක්‍රීම් කන්න පුළුවන් තවත් සුපිරි තැනක් ගැන තමයි මේ විස්තරේ කිව්වේ.\n",
  "url": "https://www.yamu.lk/place/frosty-roll/review-188121"
}