{
  "name": "Gihans Family Restaurant",
  "address": "68, S De S. Jayasinghe Road, Kohuwala Dehiwala, Colombo",
  "telephone": "0112814194",
  "close_time": " Open until 11:30 PM",
  "description": "A great place for a quick lunch or dinner. ",
  "tip": "Try the chicken biriyani and the mango juice! Yumm-my!",
  "review": "Situated a few metres away from the Kohuwala junction, Gihan's is a great lunch spot with big portions of food and cheap booze. We dropped by last weekend to check it out and the food did not disappoint. The bar is upstairs and considerably good. You may also recognize their branch at the expressway service station.\nRight off the bat, I have to mention that this is not a vegetarian-friendly place. Except for some sides, all the special rices and noodles were non-veg. The service was a bit slow. And for three hungry pandas, we were not happy. However, once the food came, that disappointment went out the window.\nOur drinks came first. We had no choice but to get the only two that were available - Mango and Wood Apple Juice.\nThe Mango Juice (Rs. 200) was a pleasant surprise. I would definitely go back for this one. It was just the right amount of thickness and sweetness, a delightful taste with less cordial and more freshly squeezed mango unlike in some places.\nThe Wood Apple one (Rs. 200) was not for me. It tasted way too sweet and not fresh.\nNext up we got Gihan's Special Mixed Rice (Rs. 950) which came with plenty of chicken, prawns, cuttlefish and eggs. It tasted a little dry but still delicious with chicken and the seafood complimenting each other. The rice itself was cooked well and left a great aftertaste. The portion was huge - easily enough for 3 people, or more for that matter.\nWe also got the Lamprais (Rs. 400). The portion was relatively big. It came with a large roast chicken, cooked quite well and tasted crunchy on the outside, tender on the inside. It is a bit pricier than your average lamprais but totally worth it. The curries were all really tasty and thoroughly balanced out in terms of the portions. The brinjal especially was really good. However, we didn't find the ash plantain sambal that usually comes with the lamprais. That being said, you hardly miss it cause everything else is just so darn good.\nSince we were really hungry, we also got a side of Hot Butter Mushroom (Rs. 400) for the vegetarian me. It wasn't as good as the one at\n- nothing is - but it was on the tastier side. It was a bit too oily which showed on the side of the bowl but still tasted great, very crispy and crunchy.\nNeedless to say, we were so full after all of that but we still asked for dessert. Sadly, they only had ice cream so we decided against it.\nThe place was a house turned into a restaurant with pink walls and white wooden doors. They had quite a few rooms filled with comfortable wooden tables and chairs, and the place is nice and clean enough.\nThe service however, did not come up to our expectations. The waiter did not recommend anything when we asked for the specials and simply replied that we have to order what we want. Either he was too lazy to tell us or he genuinely didn't know, we couldn't tell. The food took quite a long time to arrive so might not be the best place if you're dropping in for a quick lunch.\nWe liked it. The food was really good and filling. If you're in the area, drop in for some lunch or take away a pack of lamprais that is worth your money.\nGihan's is a great spot with big portions of food and cheap booze.\n\nකෙසේ වෙතත් ඩෙවිල් එකේ මට්න් කෑලි ටික නම් පංකාදු පහයි. මොනව හරි දාලා නියම ගාණට පදම් කරල. අනික කෑලිවල සයිස් එකත් සාමාන්‍යයෙන් ලොකුයිනෙ.\n",
  "url": "https://www.yamu.lk/place/gihans-family-restaurant/review-177506"
}