{
  "name": "Grande Gourmet at Nirj's",
  "address": "39A, Horton Place, Colombo 7",
  "telephone": "0775420485",
  "close_time": " Open 7 PM–11 PM",
  "description": "Try-hard decadence that's not worth your money. Faux fine dining.",
  "tip": "Give this place a chance once they've sorted out their liquor licence and rolled out their set menus. ",
  "review": "Grande Gourmet at Nirj's is a brand-new entry into Colombo's fine dining scene that promises more than it plates up. The owner, Nirj, Niranjan Deva Aditiya, is a patron of the Nth Degree, an exclusive dining club in London.\nHe hopes to bring down guest chefs from Michelin-star restaurants to spice up their menu. Our Prime Minister dined here, opening the restaurant a few weeks ago, so that's some hype to live up to. Let's start with the promise of fine dining. French fine dining, to be precise.\nThere is no liquor on this menu. That means no wine. Grande Gourmet has not yet been able to secure a liquor licence. While ordering\nalso bear in mind that this is their first menu. For starters, you can try seared scallops (Rs.1,500), salmon and spinach (Rs. 1,400), raw fish on avocado and apple (Rs. 1,300), and an exotic garden salad (Rs. 1,150). They've got the names and descriptions written in both French and English, if you fancy mispronouncing your order to the waiter.\nBy way of soup, the menu features two options: a\nand a\n, both priced at Rs. 900. I was hoping to try a\n, but they don't have one on the menu at the moment.\nMoving on. The mains. You can choose from seared duck breast (Rs. 2,200), steer fillet (Rs. 2,900), baked stuffed leg of chicken (Rs. 1,800) and herb-crusted rack of lamb (Rs. 2,900). There's also quite an array of seafood available, including lobster.\nThey've got a special dessert of Bacardi blackberry crepes with ice cream (Rs. 1,290) and an assortment of cheese (Rs.1,950), plus sorbets, ice creams and apple tarts at Rs. 900.\nFor starters, we shared the scallops, or\nA mouthful to pronounce, they were undercooked.\nThe two sides were unevenly seared. This dish was badly executed. The inside of the scallops was juicy but also tasted raw and fleshy in parts. The plating looked like green and orange goop in a ying-yang, and some tiny little blackheads in the guise of caviar. Ugh.\nAfter our starters were taken away, the waiter brought little shot glasses with one single fried fish inside each. It was unmistakably a\n, a word I'm not used to using in the singular. It came with compliments from the chef, but it didn't fit in with the rest of the courses and felt quite out of place for a French fine dining experience. It works as a good combination for gentrified Sri Lankan fast food: crunchy, tart and acidic.\nOn our second course, we shared the\n(Rs. 900), because the combination sounded... interesting? A \"sea of mixed mushroom veloute around an island of avocado guacamole with fig chutney\" arrived. The bowl was served with just the guacamole and fig jam huddled together. Then, the waiter poured the creamy mushroom soup over it. I enjoyed the effort put into some table-side action. The fig chutney's sweetness was the only bright note in this dish. The avocado guacamole got lost in the creamy soup, and was soon overpowered by the flavour of the mushrooms.\n\nSoup consumed, we were each served a wild berry sorbet as a palate cleanser. It didn't cleanse my palate. The sorbet's intense tart and sweet flavour hit hard, and left me with an aftertaste that I had to undo by swilling some water. It would make for a great dessert, though, and is available as an option.\nFor the third course, we had the lamb and Nirj's signature salmon (Rs. 2,700). The lamb and the salmon arrived simultaneously. Without checking with me,\nthey had decided that I would enjoy my lamb done medium-well, which seemed to be the safest route, but it was unevenly cooked. The gravy was too salty, the mash was\n, and the presentation was sloppy. What was peculiar about this course was that we were served our mains on greyish-blue plates, unlike all the other courses that were served on white plates. Maybe they were going for contrast? I felt that the ambience of the room was already overdoing the contrast game, so it was a bit over the top given all that.\nThe signature salmon skin was crisp, but bitter in parts. The flesh was overcooked but somehow managed to look pink and flaky. My date liked the flakiness, but I didn't. The fancy cheese sauce (Roquefort) was fancy, but I didn't get enough of it because she nicely went at it.  This dish was well-seasoned, according to her. I agreed. Both plates had pretty much the same look going on, we noted, from the grayish-blue plates to the accompanying veggies. We both avoided the tomato with breadcrumbs. I tried a nibble and it just didn't work for me. The crumbs fell off and weren't crisp or crunchy enough to really provide an interesting experience of contrast with the textures at play here.\nDessert. We split a warm apple tart (Rs. 900). It had apple slices sitting on a crisp, flaky pastry, with a little dollop of okay ice cream and a strawberry. The ice cream tasted quite milky and the whole thing tasted like breakfast cereal. So, yeah.\nWhat the actual French. Colour clash. Green ceiling. Red carpet. Blue plates. Yellow tablecloth. Metal tables. Plastic chairs painted gold. Faux velvety cushion. Oh, and where I was seated, you could still see the pencil marks that the decor team had left behind.\nThe colour of the walls and the choice of lighting really don't let the food show its true colours, and that's a bit worrying given that you might not see just how well your meat or seafood is cooked. And there are apples on the table. Every table for two comes with a green apple and a red apple that just sit there awkwardly in front of the salt and pepper dishes. They're real. We checked. Awks.\nWe didn't feel like the service matched what we paid for, and that left us feeling quite disconnected from the experience.\nOur bill for two came to Rs. 10,000 with tax, so, that's about Rs. 5,000 per head, while splitting the starter, the soup and the dessert. Don't waste your time and money. I'm sorry, but this just felt like a bourgeois, try-hard decadent diner with exorbitant prices. If you want real fine dining, go to a five-star hotel. If you'd like to try Nirj's, wait until they get their liquor licence and sort out their set menus.\n",
  "url": "https://www.yamu.lk/place/grande-gourmet/review-57664"
}