{
  "name": "Indo Ceylon Cafe",
  "address": "Galle Road, Colombo 3",
  "telephone": "0112574611",
  "close_time": null,
  "description": "Their coconut chutney lifts to high heavens an otherwise mediocre array of South Indian staples.",
  "tip": "Best for early dinner, right after work.",
  "review": "These days, you don't find a lot of\nthat serve up authentic food. Most of them give in to modified recipes that skip out on the\n(or black gram) and the fermentation process that are both essential to the tangy flavour you expect. Kollupitiya's answer to\nfood is a disappointment in this regard, for an otherwise busy location that would be convenient if you work around here. Alas, the food just wasn't fresh when we visited.\nThe trick to get the best food out of a\n(which only works for takeaway) is to tell them that the food is for the\n. As we were dining in, this option wasn't available to us, and, so we had to make do with the usual fare. Soon after we sat down, we were greeted with a platter of\n, masala (\n)\nand\n. Our plates were smattered with a bright orange coconut chutney speckled with chilli flakes, which made the\ngo down easier. I'm a huge fan of\n(Rs. 45), but not as much of\nIndo Ceylon's version of the former left me quite disappointed.\nFirst, this is hardly an\napart from its appearance. Our hunch is that in place of expensive black gram, they've got their own mix going on made of rice and maybe even wheat flour. This is one of those\nthat you're going to want to squeeze between two sheets of paper to release all the oil out of it. If you're willing to overlook the grease, though, smother this starch with some coconut chutney and you'll forget all about tradition. With the right balance of sour, sweet and chilli, this condiment from heaven will put your\nto shame. If you have it on its own, you'll first taste the lime, then the sweet coconut, and finally be left with the heat of the chilli. Just... beautiful.\nSecond, the\n(Rs. 50) is quite large and packs quite a lot of potato in it. The filling isn't too flavourful, which is a letdown, but once again, it's more enjoyable with the coconut chutney. And third, the masala\n(Rs. 45) was just plain stale. I turned mine into\nby crumbling it down and finished it off.\nWe then tried the ghee masala dosa (Rs. 175) with much anticipation as\nnoted their dosas to be light and fluffy. True, the dosa is light and fluffy, but there was not much of the scent or taste of ghee involved. Given that this is a high-volume\n, they don't seem to let their dosa mixture ferment for too long, so you don't get those tangy notes that make for a\ndosa. The masala was so off-putting. It tasted dark and muddied, with mostly the taste of mustard seeds and stale curry mix. We wished we had gone for a simple, plain dosa instead, and had no option but to leave without finishing our food.\nThe other saving grace was the Island Coffee that is served here. I had the milk coffee (Rs. 65), which was just sweet enough to not overpower the taste of coffee, and reminded me of the filter\nin Chennai, which was unexpected and quite comforting.\nIndo Ceylon Cafe has the typical ambience of a\n, with bright white lights and stainless steel plates. It's quite a contrast to the other eateries around this part of Kollupitiya. Service is quick but not very considerate. The waiters don't think to even gesture before they pour\nall over your plate. Our dosa was just dropped right onto the plate and on top of the coconut chutney, so we didn't appreciate that.\nDinner at Indo Ceylon Cafe was mostly a disappointment, apart from the coconut chutney.  Don't go out of your way to dine here.\nGiven that this is a high-volume saivar kadé, they don't seem to pay close attention to quality. Alas, the devil is in the details.\nDosa King has got super fluffy dosa and dynamite coconut chutney. It's right around the Kollupitiya junction.\n\nකොල්ලුපිටිය පැත්තෙන් යද්දී සයිවර් පාරක් දාන්න හිතුනොත් ඉන්දු සිලෝන් එක පැත්තට ගිහින් බලන්නකෝ.\n",
  "url": "https://www.yamu.lk/place/dosa-king-indo-ceylon-cafe/review-58753"
}