{
  "name": "Jack Tree",
  "address": "200, Park Road, Colombo 5",
  "telephone": "0117620620",
  "close_time": " Open 11.00AM to 11.00PM",
  "description": "Jack Tree's food is pretty tasty, if you eat here you're probably going to eat till it hurts a little to walk. It is however, pricey. Is it authentic Thai? We didn't think so, you get food here that the Sri Lankan palate is quite used to.",
  "tip": "Drink all the ambarella juice! ",
  "review": "Situated down Park Road, Jack Tree does Thai and Chinese cuisine. They're run by the same group that runs\n, which in turn whips up some pretty decent North Indian food. Jack Tree's got a pretty great vibe going on with a shaded and dimly lit interior upstairs, with some decent music playing. Their food, while okay, isn't mind blowing. However, their fresh fruit juices are pretty dope.\nWe opted to open with their Sweet Corn Chicken Soup (Rs. 425). While it came to the table steaming hot and laden with chunks of chicken, the soup itself was a tad denser than usual, and a bit too corn-starchy. Other than the almost porridgy thickness, the soup was alright in terms of flavour, with generous amounts of both sweet corn and chicken swimming in solidified egg whites.\nNext, we went for a large Chicken Pad Thai (Rs. 1395) along with a Sizzling Beef Platter (Rs. 925).\nThe Pad Thai was also generous in portion, but was rather underwhelming where taste was concerned.\nIt was surprisingly sweet and my friend, who practically lived off on pad thai while he was in Thailand, said that it lacked the tang of lemongrass and the actual taste of pad thai which he got there. On the bright side though, it's an enourmous portion so you can easily share it among four people (or three, if all of you are ravenous).\nThe beef was unexpectedly disappointing because it was like a regular dry beef curry, albeit a very chewy one. We brought some back to office, and some of the others found it quite hard to eat because of how tough and gristly it was.\nFor drinks, we tried their grape juice (Rs. 450) which was beautifully executed. Many places get juices wrong, either pouring too much water or sugar into it and thereby losing the essence of what makes a good fruit juice, but this was spot on.\nIt was liquified grape, nice and chilled, wonderfully\nsaccharine sweet. Pretty perfect for a hot day!\nTheir Peach Iced Tea (Rs. 350) on the other hand, had a chockful of undissolved sugary syrup at the bottom.\nIt came filled with slices of lime as well, which was pretty refreshing, but the essence of the peach flavoured tea was lost among the syrup and citrusy overtones.\nFor dessert, we were told a couple of their items were unavailable after we placed the order, so we eventually settled for banana fritters with ice cream (Rs. 425).\nDespite its rather unappealing appearance, it was quite good, with the fritters being hot-hot and crunchy on the outside, soft and mushy on the inside. It contrasted pleasantly with the dollop of vanilla ice cream which accompanied it.\nService is friendly and efficient, with the waitstaff always being around. Nothing much to say about them really, because there wasn't anything particularly noteworthy.\nWe loved the ambience of the dining area upstairs, because of how muted and calm the whole set up was. The interior was two toned, with green and beige being the colour scheme, and Jack Tree carries it off unexpectedly well. The area didn't feel crowded either, so that's a win.\nLovely ambience, nice staff, but meh food which in the end isn't actually worth the cash you fork out for it. We're ok with splurging when the food's great, but we expect a lot more when prices are hiked up — especially when a beef dish is nearly a thousand bucks and is below average.\n\n\nJack Tree's new prices don't quite match up to the quality of their food.\nJack Tree's food is pretty tasty, if you eat here you're probably going to eat till it hurts a little to walk. It is however, pricey. Is it authentic Thai? We didn't think so, you get food here that the Sri Lankan palate is quite used to.\n",
  "url": "https://www.yamu.lk/place/jack-tree/review-80384"
}