{
  "name": "Jolly's Ice Cream (Dehiwala)",
  "address": "147, Galle Road, Arpico Super Center, Dehiwala",
  "telephone": "0777534973",
  "close_time": " Open until 11:00 PM",
  "description": "Jolly's Ice Cream has opened their latest outlet in the suburbs of Dehiwala. ",
  "tip": "Pretty much every flavour they serve is great. So try them all! ",
  "review": "Jolly's Ice Cream serves up some really nice ice cream with a super authentic Sri Lankan touch. Originated in Nittambuwa, they’ve opened their second branch in Colombo in the suburbs of Dehiwala, near Arpico Super Center.\nPriced at Rs. 180 a scoop, Jolly’s Ice Cream offers a wide range of flavours. You can either get them on a waffle cone or in a plastic cup. We tried five flavours: Swiss Chocolate, Blueberry, Kiri Kopi, Bubblegum and Cinnamon.\nWe also tried the Raspberry flavour (Rs. 200), a limited edition ice cream that Jolly’s has introduced specially for this Christmas season. It took us by surprise because we never expected it to have such a legit flavour. The bits of raspberry embedded in the pink coloured creamy, milky texture were a nice touch. While enhancing the flavour, it added a bit of tartness and gave a fruity kick.\nAccording to the manager, they infuse the ice cream with natural raspberries. This deliciousness hasn’t taken permanent residence on the Jolly’s menu yet, but they hope it will if the demand increases.\nThe guy manning the counter was super fast and very friendly. He'd let you try the different flavours before you place the order, which is very thoughtful. As for the environment, there’s a seating area at the entrance of the Arpico Super Center. Plus, there’s the takeaway option too.\nSame as our last visit to the\n, we had a really nice experience here at Dehiwala Jolly’s outlet. We highly recommend their ice cream, especially because of their unique set of Ceylon influenced flavours they offer at a fair price tag.\nJolly's Ice Cream serves up some really nice ice cream with a super authentic Sri Lankan touch.\n\nකවුන්ටරේ පිටිපස්සේ ඉන්න මල්ලි කඩියා වගේ වැඩ. කියන පරක්කුවට අයිස්ක්‍රීම් ටික ලෑස්ති කරලා දෙනවා.\n",
  "url": "https://www.yamu.lk/place/jollys-ice-cream-dehiwala/review-205339"
}