{
  "name": "Kami Maki",
  "address": "26, De Vos Ave, Colombo 4",
  "telephone": "112590626",
  "close_time": " Open 11 AM–12 Midnight",
  "description": "Kami Maki is a Japanese fusion restaurant in Bamabalapitiya. While it's not the most authentic Japanese in town, they do offer some interesting fusion dishes.",
  "tip": "The rice burgers and rolls are your best bet.",
  "review": "Kami Maki recently moved and, somewhat hilariously, somebody immediately opened a copycat shop in the same location.  Uncool, because Kami Maki built up their own fan base over years. If you want that unique take on Japanese cuisine, you now need to head De Vos Avenue in Bambalapitiya, near the YAMU Office.\nThe main thing that's changed from our last reviews is the location. Whereas the old Kami Maki was on a prominent but sun-blasted spot at Jawatte and Thimbirigasyaya, the new one is on a little by-lane off Duplication Road, just before Vajira Road. Check the map attached to this review.\nThe main plus point here is that there's some semblance of parking and the new outpost is not as tiny and sunny as the older one.\nThe inside is positively dark, and blissfully cool.\nWhile Thimbirgasyaya is the happening spot, this new location is close to the YAMU Office, so we can't complain.\nKami Maki has always been a bit about managing expectations. This isn't pure Japanese — it really is Sri Lankan fusion. Their classic dishes are non-canonical rice burgers and their innovative rolls. None of these have the restraint or minimalism of traditional Japanese cuisine. They use Japanese flavors and ingredients as a base, but what they create is something quite different. It's closer in spirit to Hawaiian or California Japanese than anything else.\nTake, for example, the Crispy Salmon Roll (Rs. 720) pictured here. This is a salmon roll but with tempura fried something and cucumber inside, served with a good amount of rice on the outside and a tomato mayo sauce. It could be a bit much, but the dish actually works really well. You get a rare experience for Colombo — an actual flavor crescendo. The rice hits first, mixed with the sweet tomato mayo, then you get a crunchy hit of tempura and cucumber. Then you go back to soft and deeply umami (savory) with the salmon inside.\nThis dish has an interesting mix of flavors (sweet, umami) and textures (soft, crunchy) and overall works as a tasty bit of fusion.\nThe other dish I tried (everything just based on the server's recommendation) was the chicken katsu rice (Rs. 720). This is basically rice, vegetable curry and fried chicken. The chicken was tender and fried well, the veg was cooked perfectly and the rice was, well, rice. An interesting dish in that the curry tasted almost Indian. Overall it was very warm and hearty, like a stew. It could have used some acidity or something fresh to cut it for my taste, but I'll eat salad (or lunu dehi) with anything. This reminded me a bit too much of school lunch, but it's not a bad meal for a salaryman.\nThe day I went (shortly after they moved), they were understaffed and the service was a bit slow, but they apologized for that and carried on. The server did know the menu well and could recommend some good options and the owner seems to always be around if you have a major problem. My only complaint would be that the bill took about 10 minutes to arrive.\nIf you set your expectations for fusion, you can have an interesting meal at Kami Maki. Their rice burgers and rolls count as legit innovations. They're doing a creative marriage of Japanese and Sri Lankan cuisine, which, while it can be hit-or-miss, has inspired loyalty even after their move.\nIf you set your expectations for fusion, you can have an interesting meal at Kami Maki. Their rice burgers and rolls count as legit innovations. They're doing a creative marriage of Japanese and Sri Lankan cuisine, which, while it can be hit-or-miss, has inspired loyalty even after their move.\nKami Maki is a Japanese fusion restaurants in Thimbirigasyaya. While it's not the best Japanese in town, they do offer some interesting fusion dishes.\n‘Fusion’ is the keyword at the latest Japanese restaurant in Colombo. With a carefully thought out menu, creative combinations, and unfussy food, this is a place that delivers what’s promised.\nKami Maki is a Japanese fusion restaurant in Bamabalapitiya. While it's not the most authentic Japanese in town, they do offer some interesting fusion dishes.\n\nකාමි මාකි කියන්නේ ජාවත්ත සහ තිඹිරිගස්යාය මුල්ලේ තියෙන අළුත් ජපන් අවන්හලක්. මෙතන කෑමවල මූලික වෙනස්කම් ටිකක් කෙරෙන්න ඕනේ. ඒත් ඒක සිත් ඇදගන්නා සුළු සහ ඥානවන්ත සංකල්පයක්. අපි හිතනවා දැන් අපි තොරතුරු හොයන ගමනක් එහි යායුතු බවත් ලැබෙන ප්‍රතිචාර අනුව එයාලා අඩුපාඩු නිවැරදි කරගනී කියලත් හිතෙනවා.\n",
  "url": "https://www.yamu.lk/place/kami-maki/review-56261"
}