{
  "name": "Karapincha",
  "address": "141 Galle Road, Dehiwela, Sri Lanka",
  "telephone": "0772744788",
  "close_time": " Open until 11:00 PM",
  "description": "A great spot for authentic Sri Lankan cuisine.",
  "tip": "Get the cashew curry. You won't be disappointed. ",
  "review": "Karapincha is on Galle Road, adjoining the Concord Grand Hotel. It has a huge green sign on top, so you won't miss it.\nThe menu is pretty interesting, with a wide range of authentic Sri Lankan cuisine to choose from, and relatively reasonable prices.\nWe got a portion of\n(Tempered Yellow Rice - Rs. 200),\n(Tempered Cashew cooked in Coconut Milk - Rs. 429) and the Chef's special\n(Chicken Black Curry with Fried Rice - Rs. 523) and a\n(Egg Salad - Rs. 132).\nThe rice portions were cooked perfectly with strong spices like karapincha (of course), cinnamon and cloves to bring out that perfect rice aroma. I can't tell you enough how much I love a good cashew curry and this was oh so delicious! The gravy was so creamy and the cashews were soft and easy to bite into.\nThe chicken was nothing special but slightly on the pricier side for a small portion but the gravy was seasoned well and full of flavour. It was just the right amount of spiciness we were looking for. The egg salad was a great addition with fresh veggies and boiled eggs.\nFor dessert, we got a Cream Caramel (Rs. 200). While the presentation was a bit unpleasant, the texture was everything you would want in a caramel pudding; soft and creamy with the typical sweet and milky flavour.\nWe tried a Watermelon Juice (Rs. 209) and a Hot Ginger Tea (Rs. 110) which were both superb. The watermelon thankfully had very little sugar in addition to its natural sweetness. The tea was surprisingly good and had a slight ginger flavour. It was a proper homemade tea that you could have without sugar and would still taste good.\nService was quick. Our food arrived within 10-15 minutes. The staff was friendly and courteous which is always refreshing to see.\nThey have done a decent job in terms of design but it could be improved. Nevertheless, there was ample space for large or small groups amidst wooden tables and chairs with nicely colour coordinated cutlery and tableware.\nIt was a quality experience. The food was delicious and tasted homemade with very little additives. Our total bill came to around Rs. 2400 including service charges and taxes which was very reasonable considering the flavour, texture and the portion sizes.\nWe highly recommend you try this place. It's\nas well cause they prepare your food pretty fast.\nDelicious and authentic Sri Lankan food.\n\nඅපේ ඔරිජිනල් රසට බතක් කන්න ඕනේ නම්, ඔන්න තවත් තැනක්.\n",
  "url": "https://www.yamu.lk/place/karapincha/review-185009"
}