{
  "name": "Latitude (Buffet, Taj)",
  "address": "Taj Samudra, Galle Face Center Road, Colombo 3",
  "telephone": "112446622",
  "close_time": " Open 12.00 PM - 3.00 PM & 6.00 PM - 10.00 PM",
  "description": "Latitude at Taj Samudra offers one of the more expensive lunch buffets in Colombo. While they don’t particularly specialise in a particular area, they offer a satisfying spread overall.",
  "tip": null,
  "review": "Latitude at Taj Samudra offers one of the more expensive lunch buffets in Colombo. While they don’t particularly specialise in a particular area, they offer a satisfying spread overall.\nAt Rs. 2450 nett, the lunch buffet at Latitude is one of the pricier options in town. It falls in a median point in terms of spread somewhere between the likes of\nand\nat the upper end of the spectrum. They do, however, offer a good variety of preparations. One area they were lacking was in the carbs with a choice of just steamed rice and noodles.\nWe were impressed by the salad spread, which we’d say falls just a bit short of Mt. Lavinia Hotel. One area that they did have most others beat was the pre-prepared salads which were excellent.\nFor cured meats they had smoked beef, rolled chicken and pork salami. We tried each and they were all fine, but nothing to write home about. Going back to those salads, we loved the beef and asparagus salad, which was fresh, tasty and worked well with the thousand island dressing.\nLooking at the mains, while the choice of carbs were disappointing, the meats and seafood offered a nice contrast of preparations and cuisines.\nOur favourite among the meats was the roasted pork loin with peach sauce which was cooked to perfection. The fat was also rendered beautifully so that each slice just melts in your mouth.\nThe Chinese chilli crab while cooked well, lacked a balance of flavours,  and could have done with a bit more sweetness to counteract the chilli. One thing we did appreciate was that it was presented in a way that you could scoop up the crab meat with a spoon, so no messy hands.\nThe oddly named coconut fried chicken was pretty much a batter fried chicken lollipop with chilli onion sambol. The batter itself is quite spicy but the chicken was very tender, so the textures work well.\nThey had a sizeable dessert spread, but once again we felt like there could have been a bit more to choose from seeing how they do charge more than others.\nThe positive is that most of the desserts were quite good. Our favourites were the dried fruit florentine, with it’s nice crunch complemented by the flavour of the fruits, and secondly the layered blueberry panna cotta which wasn’t overly sweet and had good mix of textures.\nIn general, the Interior of Taj looks great with the high ceilings, large pillars and marble floors. Latitude, however, is a bit dull in comparison, and could use a bit of a facelift, especially in terms of their furniture which just looks boring and uninspired.\nThe service was one area we couldn’t really fault. The waiters were friendly,  very attentive and carried themselves professionally.\nThe buffet at Latitude does many things right with some tasty salads and meat dishes, but we feel like they need to offer a bit more for their price point.\nLatitude at Taj Samudra offers one of the more expensive lunch buffets in Colombo. While they don’t particularly specialise in a particular area, they offer a satisfying spread overall.\nThe dinner buffet at Taj Samudra is pretty good - great presentation and we loved the desserts, though the seafood wasn't so impressive.\n",
  "url": "https://www.yamu.lk/place/latitude-buffet-taj/review-45249"
}