{
  "name": "Lifestyle Gym Snack Bar ",
  "address": "45, Sir Marcus Fernando Mawatha, Colombo 07",
  "telephone": "0114723300",
  "close_time": " Open 7.00AM to 10.00PM",
  "description": "The snack bar at the Lifestyle Gym offers some very healthy drinks and wraps - also, yummy cookies. ",
  "tip": "I don't care if you're on a diet - you have to try the cashew cookies. ",
  "review": "\nalso has a snack bar that serves some healthy wraps and drinks - we thought we'd pay a visit and check it out. The food is good and super affordable, and ironically, we loved this fitness center's cookies the best.\nThe snack bar here isn't much for ambience - it's mostly inviting to people on a break from their workout at the gym. It's still a clean space, enough for about five people, with bar stools, high table tops and a fish tank for funsies.\nThe\nis inside the Sri Lanka Tennis Association, which also has got\non its premises. When you walk through the gates, the gym is right ahead down the corridor in front of you.\nThe menu here is nice and extensive: bagels (kurakkan bagels too), cereals, salads, a range of chicken wraps, a few fish and veg, and a long list of juices. We could only try a fraction of all these choices, but some interesting things we noted were the Kadala Salad and the combo-juices, which is a whole bunch of veggies or fruits blended together (\nalso does this).\nService is basically one or two people at the kitchen counter, and one at the cashier's. We got our dishes in a few minutes, and at the time of our visit, there was a friendly lady at the counter who was happy to inform us about our options.\nWhat we tried was the recommended CJ Special. For Rs. 400, this was actually extremely tasty: lightly cooked cubes of chicken tossed with caramelized onions, fresh lettuce, cucumbers, tomatoes and a bit of cheese, wrapped in light pita bread. The cheese makes it a dubious candidate for a healthy snack, but it wasn't greasy and heavy, and made a relatively healthy snack compared to pita wraps elsewhere. They also have Tandoori and BBQ chicken wraps here, which aren't generally healthy options but it seems they're made here with relatively healthy moderation.\nWe love that there's a range of freshly blended juices to pick from here. We asked for the Veg Buster, for Rs. 280, which is a blend of beetroot, apple, cucumber and celery. The beetroot flavour is quite strong, so it's slightly bitter, but it was thick and refreshing - we were told they don't add water or sugar to the juices, it's pure flavour.\nOur other wrap was more in keeping with healthy standards - the Vegetta Wrap, for just Rs. 240. It's basically gotukola, cucumber, carrot and celery in a very light sauce, wrapped in roti. We think this usually would have made a very fresh veg snack, but unfortunately ours was a little bit too salty.\n\n\n\n\n\n",
  "url": "https://www.yamu.lk/place/lifestyle-gym-health-bar/review-41283"
}