{
  "name": "London House of Coffee",
  "address": "2B, Gregory's Road, Colombo 07",
  "telephone": "0112693072",
  "close_time": " Open until 11:00 PM",
  "description": "London House of Coffee is a new coffee shop located on Gregory's Road serving Ceylon Coffee - roasted in-house.",
  "tip": "If you're going after dark, try to get the sofa on the balcony. ",
  "review": "Set in Gregory's Road, the London House of Coffee has warm, hospitable service, great atmosphere, and pretty good coffee and drinks. They also have remarkably nice washrooms, and have maintained these standards from when they first opened up over an year ago.\nThe service here is stellar. From the moment you enter to when you're ready to leave, the waitstaff are attentive, friendly and helpful. They also volunteer with recommendations, which is great for when you're indecisive and can't pick between a coconut and mango smoothie.\nOn recommendation, we went for the Coconut and Avacado Smoothie (Rs. 550) and then after more debate, picked out a bunch of other drinks and desserts, along with a Toasted Tuna Sandwich (Rs. 550).\nThe sandwich was well done, pleasantly fresh and crispy, with the tuna not overpowered by the other elements. It's actually quite filling, and can be shared among two people if you're also going for that smoothie; which honestly, is a meal in itself.\nLHoC has expanded their menu, and they now have a range of organic smoothies. We liked the sound of them — non-pretentious and uncomplicated, the range consisted of easily available local produce. Our Coconut and Avacado Smoothie was better than expected: it was supremely thick, and had layers of flavour which blended beautifully with each other. Okay, it was just the flavour of both the fruits, but the execution was spot on. The buttermilk hits you first, and then comes a creamy coconut aftertaste.\nWe tried a few more drinks and were really impressed. The Hot Chocolate (Rs. 575) comes in a tall glass and is nice and warm. It could be a tad creamier, but the chocolate itself tastes quite good. It's hard to find a cuppa that doesn't disappoint, so we're happy with this find.\nHaving tried their coffees in the past, we wondered if they still made cups just as good — and they do. Coming at Rs. 475, the macchiato is slightly creamier than it ought to be (there's an actual layer of froth over the top, as opposed to just a dollop), but the coffee in itself is flavoursome and not bitter in a bad way. It was well prepared.\nFood is where they fall slightly short. The Blueberry Cheesecake (Rs. 450) was unbelievably smooth and creamy, BUT also exuded a pretty strong egg smell that was quite off-putting. The biscuit base was a bit soggy too, but if you had a really weak sense of smell (and maybe taste) you wouldn't get the eggyness of it.\nYou get quite a large slice of Apple Pie for Rs. 450. I liked this one, though the pie crust was more cakeythan flaky. There were raisins mixed in with the apple, and the pie itself was nicely aromatic with cinnamon and stewed apple.\nWe also ordered an English scone, but they forgot to bring it and we forgot all about it until we checked the bill for this review.\nThis has remained constant. The coffee shop is housed in a beautiful old building which has remained mostly unchanged. The dark wood panelling, white walls, large washrooms are all preserved nicely. The couches are spread out across different ends of the floor so there's a sense of privacy. You also get a lovely balcony area if you prefer fresh air to the airconditioned insides.\nThe prices are a bit on the expensive end, but you're guaranteed good service, drinks, and ambience. If you like coffee, organic juices, and interiors with character as opposed to the generic coffee shop atmosphere, you ought to check this place out.\nSet in Gregory's Road, the London House of Coffee has warm, hospitable service, great atmosphere, and pretty good coffee and drinks.\nLondon House of Coffee is a new coffee shop located on Gregory's Road serving Ceylon Coffee - roasted in-house.\n\nකොෆි හවුස්වලින් ඉතාමත් ඉහළ තත්ත්වයක් තියෙන තැනක් කියල ලන්ඩන් හවුස් ඔෆ් කොෆි හඳුන්වන්න පුළුවන්. කෑම බීම හොඳ වගේම, ඊටත් වඩා තැන හොඳයි.\n",
  "url": "https://www.yamu.lk/place/london-house-of-coffee/review-144653"
}