{
  "name": "Mathura Restaurant",
  "address": "16, Melbourne Avenue, Colombo 04",
  "telephone": "1122505036",
  "close_time": " Open 11:00 AM to 3 PM, 6 PM to 10:30 PM",
  "description": "Mathura is a decent Indian vegetarian restaurant that has been around Colombo for years, but now at a new location.",
  "tip": "Try the veg biriyani!",
  "review": "Mathura doesn’t really require a fancy description – it has been around for the longest of times, known for the veg friendly Indian that they serve. (If you have never heard of Mathura, you have probably lived under a rock – no hate though.  *insert hug*\nAnd now, they are at a new location! No longer do they operate from behind the bus stop in Havelock town.\nAlthough the famous Mathura served some soooooper Indian (veg), the quality deflated over the years. So, I was rather curious to see what the new Mathura had in store for me. It took approximately 10 minutes for the food to be served, which wasn’t too long.\nMy North Indian thali (Rs. 530) was huge. Plated on the massive silver tray in true thali style were rasam, dhal, vegetable kadai, two potato curries, vegetable biriyani, a tiny pot of rice, a naan/chapathi (because it looked like naan, but tasted like chapathi), curd and kesari bhath.\nThe rasam, I believed, could have had a stronger dose of seasoning as it didn’t come off as spicy as rasam usually is. The curries were basic, but tasted good and were well spiced. While there was nothing I could really complain of with the contents of the thali, the veg biriyani was the real winner.\nFor someone who is forever in love with biriyani and thinks it’s abominable to exclude meat from the glorious dish, the veg biriyani was beyond impressive! So well flavoured that I didn’t whine about not having a small piece of chicken to go with it.\nWhat you don't see in the pic is a little cup of paneer that came along with the thali. The paneer was creamy and yum, and the kesari bhath, (which is a sweet dish [first from left]) was done justice with the taste of ghee combining well with the level of sweetness.\nOn the whole, I really did like my veg thali, despite not having any meat.\nThe paper masala dosa (Rs 380) was, unbelievably, not greasy! Coming across non-greasy, non-oily South Indian is a rare delight. Enveloped in a crispy, long dosa, the masala-fied potatoes hit the right spot with the spices. While my friend felt it wasn't spicy enough, I personally thought it matched the quality of dosas that you'd find in any little shop in the south of India. But I would have preferred more generous portions of the sambar and chutneys.\nFor dessert, I got myself a portion of Gulab Jamun (Rs 200) that was delivered hot in a bowl of sugar syrup. It was a little too dark in color and looked overfried. Biting into it, expecting it to feel like a brick, I realized they were right when they said, \"Don't judge a book by its cover,\" because these were really soft on the inside, while also giving me a high risk of diabetes. Too, too sweet.\n\nWe were served by a helpful waiter who was also a little forgetful.\nHelpful enough to give me polite instructions on how to eat my thali and forgetful enough to tell me one of the three veggie dishes off the thali was paneer, when in fact, it was not.\nDespaired by not finding any paneer despite poking my fingers in the most gross manner possible (PANEER IS IMPORTANT. DON'T JUDGE.), I merely enquired about which of the curries was paneer. Without a reply, he returned with a small cup filled with paneer and brought along the chef, who very kindly explained paneer wasn't on the menu for the day. Too much confusion to deal with, but they are still new on the block. Hence, shall be excused.\nIn terms of interior, I would say Mathura has done a splendid job. Spacious and generous seating (including upstairs) coupled with the faint sounds of Hindi music give the restaurant a whole new vibe.\n\nI wasn't disappointed. The food was of good quality and service was friendly. Although in terms of price it's more than your average\n, it's not too bad - more affordable than catching a flight to Chennai for some dosas.\nIt would, however, be nice to see Mathura extend their dessert choices with more than just one Indian dish on the list.\nGo for the Dosa, stay for the Thali.\nOne of Colombo's oldest South Indian restaurants, Mathura serves reliable pure-veg fare in a middle-class environment. You can, however, get better quality if you're willing to eat in more working class settings or pay a bit more elsewhere.\nMathura is one of the best vegetarian restaurants in Sri Lanka. The tomato soup is excellent, as is the paneer and naan. It's located just off Havelock Road, near the Royal Institute.\n\nMathura is a decent Indian vegetarian restaurant that has been around Colombo for years, but now at a new location.\n\nMathura is a decent Indian vegetarian restaurant that has been around Colombo for years, but now at a new location.\n",
  "url": "https://www.yamu.lk/place/mathura/review-114347"
}