{
  "name": "McDonald's Delivery (McDelivery)",
  "address": "Delivery",
  "telephone": "0115555555",
  "close_time": " Open 7.00 AM - 11.00 PM",
  "description": "We order from McDonald's far more than we probably should, but that's because their delivery is efficient, reliable and quite fast!\r\n\r\n",
  "tip": null,
  "review": "We were wondering just how long it would take McDonald's to get on the delivery band wagon, and today they finally did. The criteria for delivery is simple - a minimum order amount of Rs. 600 and being in Colombo in the suburbs (or near a McDonald's outlet). This could be subject to change in the future depending on how this picks up. We have a nagging feeling McDelivery will be hugely popular.\n\nWe got a double cheeseburger meal (Rs. 620) and a chicken McSpicy (Rs. 400). Both arrived intact with no spillage. They also send two sachets of chilli and garlic sauce. The fries that came with the meal were slightly soggy but we were somewhat expecting that.\n\nIn our case the delivery was fast, as in less than 20 minutes, but we're pretty close to their Colpetty outlet. If we were to make a suggestion, we'd say the best bet would be to order just the burgers since the fries can get soggy and the drinks can lose their fizz over long deliveries.\nThe phone call for the order did take a fair bit of time, but that's mostly because they wanted information to enter in their customer database. So I'd expect the order time to be far less when calling them next time around. They deliver from\nwhich is also pretty awesome. As far as we know they deliver to Colombo and suburbs, but it's very likely they'll deliver to other areas with McDonald's outlets.\n\nThey charge a flat Rs.100 for delivery which is also reasonable. Who knows, maybe that'll also be removed after sometime to compete with the others.\nIf you ever find yourself craving McDonalds, you can now get it delivered. Besides the somewhat long phone call, they seem pretty efficient.\n",
  "url": "https://www.yamu.lk/place/mcdonalds-delivery/review-36783"
}