{
  "name": "Mirissa Eye Beach Restaurant",
  "address": "Matara Road, Udupila, Mirissa",
  "telephone": "0112254601",
  "close_time": " Open 8.00AM to 10.00PM",
  "description": "This is one of the better beach-side Mirissa restaurants if you want seafood. They also do a super banana & chocolate milkshake. ",
  "tip": "Worth the visit for a refreshing banana & chocolate milkshake. ",
  "review": "Mirissa Eye is one of the better beach-side restaurants on the shores of Mirissa. This is also a guest house. They've got very tasty seafood, and they make a super banana and chocolate milkshake.\nIt works well as a beach-side bar (Lion beer at Rs. 300 and other liquor at Rs. 500ish), with a TV switched on to the sports channel and flags hanging from the ceilings. There's also a token picture of Bob Marley on the wall and rasta music playing in the evenings.\nIt's pretty typical as far as ambience and service is concerned. Most of their furniture is on the beach while there are two tables indoors, and like a lot of establishments in Mirissa, the place is very foreigner-inclined. We heard the waiters tell a group of locals that they only let foreigners stay at their guest house.\nOur crab (with fries and salad) was delicious. The fries were nice and crisp, and the crab meat was soft, sweet and plentiful - we really wish there had been more than just two parts though, since the dish was for a pricey Rs. 1000. Still, the crab made us very happy, so no regrets.\nWe also got a seafood macaroni, which we weren't expecting much out of, since Western dishes down South are notorious for being a little bland. But this dish was very well flavoured, and came in a huge portion for Rs. 750, with melt-ey strips of cheese, loads of fish chunks, cuttlefish and mini prawns.\nAlso, let it be known, Mirissa Eye has the best banana and chocolate milkshake ever. Not that we've actually had a banana and chocolate milkshake before. But for Rs. 250, it's ingenious, and both flavours came out strong, making a very interesting mix.\nMirissa Eye seems like a run of the mill sort of beach-side hangout. But their seafood is legit - if you feel like a little meal after coming back from a swim, this is a good choice among the others on the same shore. We'd give them a 3.5 out of 5.\n",
  "url": "https://www.yamu.lk/place/mirissa-eye-beach-restaurant/review-40235"
}