{
  "name": "Miss Whisk ",
  "address": "Colombo 7",
  "telephone": "0770797657",
  "close_time": " Open 9.00AM to 7.00PM ",
  "description": "Miss Whisk is another Colombo home baker,  and she does interesting themed cupcakes and some delicious strawberry tarts. ",
  "tip": "Call 2 days in advance for fondant cupcakes. ",
  "review": "Miss Whisk is another creative home baker. We heard about her\nthemed cupcakes and called her up right away to get them. She makes a range of cupcakes, cakes and tarts, and as with most new bakers the menu evolves, so stay tuned on her Facebook page for updates. We're fans of her strawberry tarts.\nYou can't really go wrong with strawberries and cream - very similar to the stuff we have at Jagro. These strawberry tartlets smell and taste great, at Rs. 600 for six, with plenty of cream and strawberries. Excellent finger food for a party.\nThe minion cupcakes looked amazing - perfect craftsmanship, so if you're looking for a good looking fondant cake, Miss Whisk is a reliable bet. These chocolate cupcakes cost Rs. 960 for six, which means Rs. 160 for a cupcake, which is somewhat on par with a lot of Colombo's cupcake makers, especially considering the fondant work (ordinary cupcakes are for around Rs. 100). The cupcakes themselves were alright, although not the best - small, light, fluffy snacks topped with a hard layer of sugary fondant.\nThere's a wide range of classic cupcakes on the menu (coffee, Oreo, red velvet etc), and\nis an entertaining space to stay tuned to (\nis another fun home baker on instagram). Prices seem to be around Rs. 100 per cupcake and the minimum order is six, so this is affordable by our local cupcake standards. Miss Whisk is based in Colombo 7, so they also deliver if you're nearby.\nMiss Whisk is a good call for affordable party orders, especially for kids' parties if you'd like wacky fondant on your cake. We haven't tried all her cupcakes, but the chocolate ones we tried tasted alright. The strawberry tarts are a win - I'd personally order them again.\n",
  "url": "https://www.yamu.lk/place/miss-whisk/review-44344"
}