{
  "name": "Mithuro Cafe",
  "address": "9, R. A De Mel Mawatha, Colombo 04",
  "telephone": "0779915863",
  "close_time": null,
  "description": "Mithuro Cafe does good rice and curry for cheap, and we especially love their 'chicken pieces' rotti. ",
  "tip": "Try Lotus leaf buffet. ",
  "review": "There aren't too many places to eat on Duplication Road (around where our office is at least). Thankfully, Mithuro Cafe exists and does a pretty good rice and curry. What we love about the place though is its understated, yet beautiful outdoor area. They've also got short eats, kottu in the evening, and fresh fruit juice for super cheap.\nThis is one of those places where they serve your food for you, so you can tell them if you want extra mallum or a bulls eye added to your meal, which is nice. I opted for red rice and fish (Rs 120), while Aisha got white rice with chicken (Rs 140).\nThe curries were well seasoned, not too salty and as spicy as you'd expect.\nOn the day we went, they offered jack fruit seed curry which was nice and milky without being too sweet, as well as kathuru murunga mallum, parippu and an effective rice puller in the form of dambala, fried chili and papadam.\nTucked away from the main restaurant, as you walk further down Duplication Road, you'll find that Mithuro Cafe also has its own juice bar. All the juices are priced at Rs 100 except for the papaya which is cheaper at Rs 80. I tried pineapple while Aisha tried mango.\nBoth were unimpressive, and it comes down to the quality of the produce. The pineapple was watery and just not tart enough to really give it that kick. The mango juice was a pale yellow and that didn't seem promising at all. It tasted really bland and Aisha didn't want to finish it.\nSadness.\nWhile the indoor area is just like any other roadside eatery, the outdoor space is really chilled out.\nIt's got some beautiful trees with pretty fronds and creepers going on, and just enough shade to save you from the heat.\nFor such an affordable place, this is their main plus point, for me, at least.\nService is pretty prompt and courteous. There's an old man who'll come outside and check that you've got drinking water and take away your plates when you're done eating. No complaints.\nGo here if you work around the area or happen to be passing through. The food isn't extraordinary but for the price it meets expectations. Avoid the juice, though, and maybe hit up the Roots on Marine Drive instead.\nWhat we love about the place is its understated yet beautiful outdoor area, and their rice and curry is good.\nMithuro Cafe does good rice and curry for cheap, and we especially love their 'chicken pieces' rotti.\n\nලී බංකුව උඩින් වාඩි වුන චිනයි මායි චින්තකයි ලී මේසෙට බර වෙලා කතා කර කර හිටියෙ මෙච්චර රස කෑම තියෙන කඩයක් මෙච්චර ලඟ තිබිලත් අපිට හමුවෙන්න මෙච්චර කල් ගියේ ඇයි කියල.\n",
  "url": "https://www.yamu.lk/place/mithuro/review-85326"
}