{
  "name": "Momo's by Ruvi",
  "address": "43/1D, Majestic Avenue, Bambalapitiya",
  "telephone": "0765204867",
  "close_time": null,
  "description": "Authentic and affordable food, complete with a chef who knows his dishes.",
  "tip": "Get a platter to have a good overview of the offer.",
  "review": "Momo's by Ruvi started its adventure with great fanfare less than a year ago and quickly became Colombo institution for dumplings. For those who missed the buzz, Momo's by Ruvi is a tiny quaint restaurant hidden in a narrow lane opposite Majestic City that exclusively sells momos, these dumplings originated from Tibet.\nWe visited them during their opening week in April this year and were sold. We thought it was about time to check if they were still living up to their reputation.\nFirst, you'll have to settle on the cooking style, as momos can either be steamed, shallow fried or wok fried. Second, you'll have to think about the filling: veggies, chicken, beef or prawn.\nOr, if you're hesitant or, like us, want to try everything, go for a platter. The Meaty Fiesta (Rs. 1,250) enables you to choose 2 meats that will be cooked in all 3 ways, while the Platter (from Rs. 800 to Rs. 1,200 depending on the meat) features a single type of meat prepared following the 3 possible methods. Note that a platter should fill you up.\nNow that's the somehow confusing ordering part is done, let's enjoy the goodies!\nOn our last visit, we've tried most of the momos on the menu and they were all equally delicious! The flimsy dough held generous and juicy fillings, mixes of veggies, meat if any and herbs. They were all really delicate and so flavoursome. Spot on!\nFillings are the same regardless of the cooking style. The steamed momos are the plain and most delicate ones, the wok fried cooking brings some texture and interesting crunch to the delicacy, while the shallow fried version, coated in a delicious spicy sauce, is the richest option.\nIt would be really hard to rank them. But for the sake of it and for you Yamu readers, we'll do it. And the winner is... Shallow Fried Chicken Momos, very closely followed by the Steamed Prawn Momos, and all the other options.\nThere honestly wasn't a single thing we didn't like on our plates. The homemade chili & soy and sambol sauces were also very nice and pleasantly accentuated the flavours of the dumplings.\nWe also gave a go to the only non-momo-ey item on the menu, the Stir Fried Bok Choy (Rs. 230), served in soy sauce and sprinkled with crunchy garlic and chili flakes. And we didn't regret it. It made a fresh and spicy add-on to our meal.\nMomo's by Ruvi is no fancy place and they don't try to look or act like one either, and we really like this attitude. They're here to make momos and they do it well. Full stop.\nThe restaurant can accommodate about 15 to 20 diners max at a time in one cramped room. It's not very private as you can imagine and we wouldn't recommend it to discuss confidential stuff or to declare your love to your crush. Unless you're very confident about your date or/and don't care about other people participating to it.\nWhile we aren't big fans of the quaint decoration, we acknowledge and appreciate the effort to make the place feel warm and cosy. Plus, it's very neat and clean.\nWhile ordering was a bit of a confusing process (but maybe more on our side I have to admit), the rest flowed smoothly and the first platter arrived pretty quickly. The person assuring the service on that day was welcoming and discreet.\nWe're glad to confirm that Momo's by Ruvi is living up to the hype. Dumpling lovers, you're in for a treat! And for a fair price. Dumpling haters, go on your way, this place isn't for you!\nA cosy little place overflowing with momos and quirky decoration.\nAuthentic and affordable food, complete with a chef who knows his dishes.\n",
  "url": "https://www.yamu.lk/place/momos-by-ruvi/review-207367"
}