{
  "name": "Mount Lavinia Hotel Buffet ",
  "address": "No 100, Hotel Road, Mount Lavinia, Sri Lanka.",
  "telephone": "0112711711",
  "close_time": " Open 12.00 PM - 3.00 PM and 7.00 PM - 11.00 PM",
  "description": "The Governor's Restaurant at Mt.Lavinia Hotel offers one of the better buffets in the city. We found that mostly everything tasted good, with an exceptional salad bar and arguably the best selection of desserts around.",
  "tip": null,
  "review": "The Governor's Restaurant at Mt. Lavinia Hotel offers one of the better buffets in the city. We found that mostly everything tasted good, with an exceptional salad bar and arguably the best selection of desserts around.\nDuring our previous visit to the Governor's we tried out their\nThe first thing we went for was the salad area which gives plenty of choices so you can go ahead and come up your very own frankensalad. They've got everything from boiled veges, to stir-fried options as well as a good selection of cold meats. What's great is that they've also got an equally impressive selection of sauces to complement the salad options.\nIn our case we made a garden salad with some lettuce, cabage, carrots, spinach and bean sprouts\nBesides the Asian dishes they also had an action station set up where you could have a pasta prepared to your liking by selecting the type of pasta, cheese, sauces and spices. We went ahead and got a penne pasta in white sauce with a bit of added chili and spices. All in all it came out pretty well and ticked the right boxes in terms of flavour.\nThe chicken lababdar was nothing short of excellent, cooked just right so that the meat was still tender but not under cooked. The thick sauce also had a great balance of spices and seasoning.\nThe buffet itself is mostly self-service but the waiters were always around to tend any of our needs. This is a five star hotel so the service is very professional and courteous so no complaints on that front.\nIf you're planning on dropping in at The Governor's Restaurant we'd definitely suggest the buffet over the\nThe Governor's Restaurant at Mt.Lavinia Hotel offers one of the better buffets in the city. We found that mostly everything tasted good, with an exceptional salad bar and arguably the best selection of desserts around.\nThe Governor's Restaurant at Mt.Lavinia Hotel offers one of the better buffets in the city. We found that mostly everything tasted good, with an exceptional salad bar and arguably the best selection of desserts around.\n",
  "url": "https://www.yamu.lk/place/mount-lavinia-hotel-buffet/review-45108"
}