{
  "name": "New Gadaby Rest Inn (Kaththankudy)",
  "address": "250, 252, Main Street, Kaththankudy",
  "telephone": "652245611",
  "close_time": " Open 5.30 AM - 12 PM",
  "description": "Home of the best beef samosa. Gadaby is perfect for your short eat fix on the East Coast.",
  "tip": "Wait for a fresh batch of samosas. Trust me, it's worth it.",
  "review": "Kaththankudy, apart from being entirely populated by Muslims, is also home to arguably the best beef samosa. Gadaby is just one place where you can find a pretty good version of the treat. Throughout the East Coast, from Nintavur to Kaththankudy, beef samosas are packed with flavour, full of beef, and have little of that onion and potato fluff that plague samosas in Colombo. If you find yourself travelling through the East Coast, this spot is great for a tea stop. We grabbed a whole lot of samosa and even tried out a coconut cookie and a chocolate cake.\n\n\nThe perfect samosa ought to be not too thick on the crust, and should tear away easily and give way to the plentiful filling inside. If the outside is too chewy and thick, then it's not going have that crisp crunch that you expect, and it's going to get in the way of the juiciness of the meat inside.\nGadaby does really well in all these regards, and, at Rs 25, their beef samosas are well worth it. If you weren't counting, you'd easily hammer 10 of these in one sitting. It's got a great savoury, spicy kick to it and just enough onion to give it a contrast in texture. Other places might go overboard with just minced beef, which has its own merits, but this mix hits the spot of what I consider East Coast flavour.\nWe tried some of the other short eats that caught our eye. What looked like it might have been a cream bun, given its wrapping, turned out to actually be butter cake with a thin filling of icing in between.\nButter cake is always best fresh out of the oven, but this one was cute in its presentation and that kind of offset the fact that it was dry. At Rs 30, it didn't feel like a rip off, though.\nThis coconut cookie (Rs 30) was the bomb! It had an amazing texture, being just crunchy and chewy enough to pass off as more of a cookie than a biscuit. It was quite sweet, but that's the status quo around Kaththankudy and Batticaloa. You definitely taste the coconut and it's a way better texture than those Hawaiian biscuits. Definite win.\nGadaby's chocolate cake is quite meh. It doesn't really taste like chocolate. Cocoa powder reigns supreme in these parts, and doesn't make for an authentic chocolatey taste. At Rs 30, you might as well have another coconut cookie.\nPlain tea costs just Rs 15 at Gadaby, and is similarly priced at most places around here. It's super sweet, and you can ask for ginger. They'll give you a baffled look if you ask for no sugar and serve you a sweet one anyway.\nThe staff at Gadaby are generally too busy for their own good, so you really need to grab their attention, tell them what you want and then remind them to get it. Service is definitely not their strong suit. They don't have much patience for curiousity. Ambiance wise, the place feels like you're regular\nkade. They've got a big screen TV at the back where you can watch the match.\nWhether it's a fried rice or a beef samosa that you're looking for, Gadaby's is generally a good choice for food in Kaththankudy. The food is cheap, the place is clean and that's about as much as you can ask for around these parts, unless you're looking for the enigmatic '\nwhich sadly isn't sold anywhere anymore.\n",
  "url": "https://www.yamu.lk/place/gadaby-restaurant-kaththankudy/review-82279"
}