{
  "name": "Nordic House (Hikkaduwa)",
  "address": "339 Galle Road, Hikkaduwa",
  "telephone": "776871243",
  "close_time": null,
  "description": "Really tasty burgers, but not cheap.",
  "tip": "Read the story of how the burger is made on the wall.",
  "review": "Nordic House does some really tasty burgers in Hikkaduwa. They ain't cheap, but you're getting top quality. We were supposed to review more places but we actually ended up going here twice.\nNordic House's main product is burgers. As they illustrate on the wall, they get sirloin beef, mix it with a cheese for added fattiness then grill it and add bacon, blue cheese, onion rings, etc.\nIt's served with tomato, lettuce and cucumber\nthe patty and with Helmann's mayonnaise and tomato sauce.\nThe burgers are expensive - Rs. 750 to 1,000 - but they are delicious and worth it. You can make it a meal for Rs. 400 more, which includes some fresh cut french fries and a Dilmah iced tea. For the blue cheese burger we tried that brought the total up to Rs. 1,350, but no complaints.\nIt's a really tasty burger and they've put a lot of thought into making it that way. The blue cheese variant was my favorite (I tried a few). The blue cheese is melted into the patty and it's juicy and delicious.\nAlso tried the Kansas Ranch (Rs. 1,000 just the burger, 1,400 for the meal). This comes with bacon, grilled onions and onion rings on the burger itself. This is a meal within a burger and was also delicious.\nThe iced tea also ain't bad (Rs. 250 on its own) and comes in black currant, lemon and mixed berry flavors. They also have sandwiches for Rs. 450-700.\nNordic House is a two story place on the Galle Road near Chaaya Tranz. It's walkable from most parts of the strip.\nThe interior is simple and decorated with some cool old posters. There's an AC lounge upstairs but the AC is only on when it's busy. Most of the time the downstairs is cool enough. You order at the cashier, it's not really table service, though it can be if they're not busy.\nThey also have Wi-Fi so you can while a way a bit of time also.\nThe service proposition is pretty simple here, you order at the cashier, they bring you a tasty burger in like 10 minutes, you pay at the cashiers and leave. They people working here are quite nice and most of the work seems to go into the preparation of the burgers themselves. We'd say it's a pleasant experience overall.\nThis place is nom. Expensive, but really tasty burgers.\n",
  "url": "https://www.yamu.lk/place/nordic-house-hikkaduwa/review-45550"
}