{
  "name": "Olive Garden Restaurant",
  "address": "28, Thurstan Road, Colombo 3",
  "telephone": "0112573046",
  "close_time": " Open 10.00AM to 11.00PM",
  "description": "Olive Garden is another one of Colombo's many Chinese restaurants. The food is good and affordable, and they've got private rooms if you want to take a big crowd with you. ",
  "tip": null,
  "review": "Olive Garden Restaurant is another one of\n. It's quite new but we dropped by and the food is good, and affordable, and they've also got private rooms much like\ndoes, in case you want to take a crowd with you.\nThey've got your typical range of Chinese food in Small and Large, although as is usually the case, dishes like lobster and crab are only available in a quantity of 500g minimum. We got the spicy peppered prawns with some seafood rice and chicken dumplings.\nThe prawns were very good (Rs. 890) - big, crunchy, a little salty, well flavoured and served with a generous toss of lettuce, onions and red chillies - a dish enough for two. This went great with the seafood rice which was light and not too oily and mixed with plenty of shrimp and cuttlefish.\nThe dumplings which you can get in any number, Rs. 30 each, are served with a side of watery chilli paste, but were a little underwhelming. They were small and filled with more vegetable than minced chicken.\nThis is random but the orange juice we got here was one of the best we've had in ages, with a nice strong flavour. For Rs. 300 it comes in a very tall milkshake-ey glass.\nThe interior in stereotypical affordable-Chinese-place fashion, features celebratory gold and white table decor where the chairs look like flowergirls at a wedding. It's clean and pleasant with sunlight streaming through the French windows at the back.\nThere are also a few private rooms upstairs if you feel like a private work or family party. Service was good when we were there, which it tends to be at newly opened restaurants - the Chinese manager herself stopped by to check on our dishes, and the waiters were friendly.\nOlive Garden is one of the good ones among Colombo's affordable and simple Chinese restaurants. It's in that genre of Chinese places that tries to cater a little to Sri Lankan tastebuds too without losing authenticity (Min Han is another one of these, though far better). It's only their first week in business, but so far so good.\n",
  "url": "https://www.yamu.lk/place/olive-garden-restaurant/review-46252"
}