{
  "name": "One Seven One",
  "address": "171, Old Kottawa Road, Nawinna\r\nMaharagama",
  "telephone": "0711965892",
  "close_time": null,
  "description": "One Seven One is a well known restaurant in Maharagama for quality pastries,  and rooftop dining. ",
  "tip": null,
  "review": "The menu at One Seven One is quite limited. Sure it seems like they serve a range of items like soups, salads, rice-centred specialties, burgers and mains, but it’s only chicken and seafood.\nThey serve a couple of mutton dishes, but no beef or pork. So your choices here are somewhat narrow.\nWe started off with a Chicken and Mushroom Soup (Rs.250). It was creamy and came with bits of chicken and mushroom which we thoroughly enjoyed. It was served with a side of garlic croutons, but the courtons tasted rather odd.\nFor our main course, we ordered a Seafood Fried Rice (Rs.450 for a small portion), a plate of Hot Butter Cuttlefish (Rs.550), and a Chicken in Bangkok (Rs.500).\nThe Fried Rice was alright. The rice was cooked well, and wasn’t too oily.\nIt’s basically Basmati rice tossed in carrot, spring onions and pieces of fish and prawns. But sadly, it tasted like it had been seasoned with a Maggi soup cube or some kind of flavour enhancer.\nThe HBC at One Seven One is one of the cheapest HBCs we’ve come across. It was crunchy, piping hot and adequately spiced.\nAt Rs. 550, this was a generous portion of cuttlefish as it wasn’t just filled with leeks or spring onions.\nNow, the Chicken in Bangkok. We chose this from their mains, which means it should be able to fill one hungry belly, right?\nWell, at least that’s what we thought. Once we saw this plate, we were really glad that we ordered the Fried Rice, because this is no main by any means.\n\nThere was a big piece of roast chicken, covered with a yellow sauce and presented with half a cup of sticky yellow rice.\nThe chicken was tender , tasted like curry and mixed with the slight sourness of the sauce gave it a really nice kick. But I repeat, this isn’t enough to cure your hunger.\nOur dessert was a piece of Caramel Pudding (Rs.150), which was the highlight of our meal. The top was a perfect shade of brown, and its super-creamy consistency made it our instant favourite. It was worth every single rupee we spent on it.\nWe wanted to try the juices, but unfortunately none of them were available. So we opted for a Chocolate Milkshake (Rs.250) and a Cappuccino (Rs.200).\nThe Chocolate Milkshake lacked the balance of milkiness, sweetness and chocolatiness. Seriously, how hard is it to blend some chocolate with vanilla ice cream?\nFirst I thought there was a mix-up on my order, but then I found out this, infact is the Cappuccino they serve. I'm no coffee connoisseur, but this looks more like a layered latte than a cappuccino.\nTastewise it was like a normal\nand wasn't too bad after adding two spoons of sugar into it.\n\nBut Rs.200 for a cappuccino that looks like a layered latte and tastes like a regular\n? Nah, I'll pass.\nOne Seven One has three floors, including a rooftop dining area. Their bakery is located downstairs and the first and second floors are allocated for fine dining.\n\nWe liked the ambience here. It's quite comfy and has a pleasant vibe with plenty of space. The rooftop area gets booked all the time for bridal showers, birthday parties and surprise proposals.\nThe food and drinks took around 15 - 20 minutes to arrive, but we didn't mind since they were freshly prepared.\nThere were couple of downfalls in their customer service, though.\n\nWe were the only customers at the first floor, but still we had to bug the waiter for couple of times to get some drinking water and chili paste. Our bill was all muddled up as well. Even though we ordered only one caramel pudding, they accidently charged us for two.\nBut instead of cancelling it, out we paid and enjoyed that creamy goodness for the second time.\nOne Seven One doesn't serve the best food in town, but it's definitely one of the most affordable places around. Our bill came to a total of Rs.2100, and this includes service charge and taxes too.\n\nSo if you're around Maharagama and looking for a meal within a budget but in a fancy environment, this is just the place to be.\nOne Seven One doesn't serve the best food in town, but it's definetly one of the most affordable places around.\n\nගණන් පැත්තෙන් බැලුව ම නම් වන් සෙවන් වන් එකේ කෑම වේලක් කන එක පට්ට ම ලාබයි.\n",
  "url": "https://www.yamu.lk/place/one-seven-one/review-193818"
}