{
  "name": "Peach Valley",
  "address": "27, Flower Road, Colombo 07",
  "telephone": "0112672888",
  "close_time": " Open 11.00 AM - 2.30 PM & 7.00PM - 11.00 PM",
  "description": "Peach Valley is an old favourite when it comes to Sri Lankanized Chinese in Colombo. While the food itself hasn't changed much the recent renovations have done a great deal to help the look and feel of the place.",
  "tip": "Go with a group of around 5-6 people to get the best cost per head.",
  "review": "Peach Valley is an old favourite when it comes to Sri Lankanized Chinese in Colombo. While the food itself hasn't changed much, the recent renovations have done a great deal to help the look and feel of the place.\nAs a general trend the older Chinese eateries haven't been performing all that well in recent times, especially with all the new places that have opened up. That being said, Peach Valley is one of the few veterans that still seems to be going strong. The food at PV isn't brilliant, but it does have it's moments and we actually like the place. They offer a good selection of dishes, at affordable rates with some pretty massive portions.\nThe seafood braised fried rice (Rs. 680), in simpler terms is a wet seafood rice. I'm yet to come across a really praiseworthy wet rice dish here in Sri Lanka but this was one of the better ones. First off, their small portion is actually quite a bit larger than most large portions, which in our case was enough for around four. The rice itself was cooked well, not overly watery with a good amount of prawns, calamari and fish. The seasoning on the rice was fine but seafood was a bit a bland.\nThe lemon chicken (Rs. 760) was an interesting preparation with batter fried chicken strips in a thick lemon cordial based sauce. This is the type of dish you will either enjoy or hate. The reason being because its incredibly sweet. Personally, I wasn't the biggest fan but the others seemed to have enjoyed it.\nThe prawns in garlic sauce (Rs. 780) was the generic pan-fried prawns in a soy and garlic sauce. This wasn't terrible but we've had this exact same preparation at a bunch of other places so we'd recommend trying something else.\nThe roast pork with brown sauce (Rs. 890) was a bit pricier than the other dishes since its one of their specials, but totally worth every rupee. This dish had everything you'd look for in a good Sri Lankanized dish with plenty of tender pork, well rendered fat, an almost glaze like brown sauce and just a good balance of seasoning and spices overall.\nQuite honestly, the Peach Valley of old looked pretty awful. Realizing this, PV did some renovations around December last year and now the place looks far more pleasant. While the set up is mostly the same, the place looks cleaner, more colourful and just plain classier.\nThe service is fast and the waiters while not the most knowledgeable, were very friendly, well mannered and attentive. The Chinese management also seems to be more involved after the recent renovations, but the communication between the local staff and the Chinese isn't too great. English isn't the mother tongue of either party but that seems to be the common language of choice, so you'll find both parties lost in translation quite often.\nPeach Valley is one of the better Sri Lankan Chinese spots in Colombo and with the recent renovations the restaurant looks pretty good too. Their food is decent but the specials seem to be their strong suit.\nPeach Valley is an old favourite when it comes to Sri Lankanized Chinese in Colombo. While the food itself hasn't changed much the recent renovations have done a great deal to help the look and feel of the place.\nPeach Valley is an old favourite when it comes to Sri Lankanized Chinese in Colombo. While the food itself hasn't changed much the recent renovations have done a great deal to help the look and feel of the place.\n",
  "url": "https://www.yamu.lk/place/peach-valley/review-46128"
}