{
  "name": "Peri Peri Kukula",
  "address": "50A, Jawatte Road, Colombo 05",
  "telephone": "0770788051",
  "close_time": null,
  "description": "As the name suggests, Peri Peri Kukula specialises in spicy flame-grilled chicken along with some tasty sides.",
  "tip": "Bear in mind that the Peri Peri sauce is made to suit Sri Lankan palate. Choose wisely!",
  "review": "Nearly half-a-year after Laura's\nat Peri Peri Kukula, we went back to see how the place was doing. TLDR: the place is doing quite well. The service is great, the crowd keeps coming in, and the chicken and sauce are juicy and good, though you'll note a few areas for improvement suggested in our second look.\nWe love the simplicity of the menu, just choose the size of your chicken and how spicy you want your sauce and you are good to go. There are upto 6 sides and a few outliers like the Chicken and Pulled Jack Burgers. The chicken is from Prima, the meat is flame grilled as you wait, and the sauce is made from locally sourced ingredients.\nThe peri peri sauce we tried was pretty hot, that is to say 'hot'. The restaurant has careful hotness categories. At the lowest level there is just 'Garlic', for white people and babies; 'Medium Hot'; 'Hot'; and 'Very Hot' for overcompensating, discerning Sri Lankans with deep-seated sexual insecurities.\nThough the chicken is not cheap, the family platter (Rs. 3000) is enough for three reasonably hungry people. The chicken is juicy on the inside, kinda crispy on the outside (no I wasn't inspired by the KFC signage across the road). The charred bits were my favourite though, I like digging through the texture.\nI did think that maybe the meat could have been more powerfully marinated, some of the softer bits on the inside tasted rather bland. Especially in the breast areas, the meat was drier and stringier and completely lacking in flavor. You’re reduced to mopping up the sauce with the chicken, but maybe that's the point.\nWe got sides of Corn and Garlic Bread with our platter. ​ The Garlic Bread could improve, the bread is too thick, it's texture too irregular and it didn't seem as garlicky as it should be. The corn though, was amazing.\nWe also ordered some ​Hummus with Peri Peri Sauce (Rs. 400). It seemed a little old, was brought out frozen, and tasted like it had too much chick pea in it. Also , it could have used more lemon. We still ate it because we were hungry. We asked for pita bread refills, and they took some time to arrive. The bread wasn't done properly and was only irregularly crispy.\nSo what do you know, Peri Peri has their own selection of bottled juice (Rs. 250). The Narang was pretty on point. Not too sweet not too sour. The Passion Fruit Juice was great, but lacked a but of uh, passion. They source the fruit from Pettah, add sugar and don't add any preservatives.\nPeri Peri is a small place, but manages to avoid feeling cramped. Its definitely cosy for groups; families, friends, couples....\nIt's nice to be asked if we're going to be eating with our hands or cutlery. In general the service was excellent\nA great place for grilled chicken, their sides are pretty good too, if you know what to stick to.\nA great place for grilled chicken with some spicy chilli sauce.\nFor all those desperately waiting for Nando's to come back to Sri Lanka.\n",
  "url": "https://www.yamu.lk/place/peri-peri-kukula/review-217542"
}