{
  "name": "Pot Biriyani",
  "address": "29, Kadawatha Road, Off Anderson Road, Kalubowila",
  "telephone": "777330938",
  "close_time": null,
  "description": "If you're having people over and don't want to cook or just having a family meal, we highly recommend Pot Biriyani for takeaway or delivery. It's run by a friendly family and they make tasty, well presented and generous biriyani, among other things.",
  "tip": "Dig for extra chicken at the bottom of the biriyani pot. It's there.",
  "review": "Aside from having a fiercely loyal fan base and being something of a cult favourite amongst suburban Dehiwala, Pot Biriyani serves up some really good biriyani.\nOut of all the biriyanis we've had, these guys are\n.\nAll things\n.\nThey've got string hopper biriyani as well. You get to pick between chicken, mutton, beef or seafood. They also have cupcakes and other stuff up for grabs so make sure you go through their menu. Aside from individual orders, they also cater to events so call them up and inquire if you're interested.\n\nKeep in mind that a small pot of biriyani (enough for 4-6) costs Rs. 2,200 while the larger portion (enough for 8-10) cost us Rs. 3,200.\nYou'll have to call them up on to place an order about two days ahead. The lady will take your details down or- depending on how clear your line is- you might have to send them a text with all your details. Delivery is available as well.\nThey'll deliver your biriyani right on time, if not a few twenty minutes or so earlier. You'll have to pay for the tuk fare as delivery charge. They operate from deep inside the Dehiwela suburbs, so to get here they charged us about Rs. 300. The food is brought neatly packaged and the accompaniments are organised into separate containers.\nThe biriyani is a typical Hyderabadi dum biriyani and is served in a large clay pot. We thought the packaging was super cool but here at the HQ, there's a few of us trying to figure out how to put the large pot to good use.\nAside from the excess amount of chicken in the pot, we also got two parcels of fried tandoori-spiced chicken.\nThere were four large chunks of chicken, well fried with a fiery orange coating and adequate seasoning. The chicken was soft and tender to the bite. Initially, we were a bit taken aback with the rather hefty amount of meat, but it didn't go to waste in the end.\nThere were three large containers, each containing the standard green peas, onion\nand maldive fish sambol. I'm not a huge fan of any of these items, but:\nSince our last review, they haven't dropped in terms of quality or quantity. Their biriyani has to be one of the best in the city and they're the perfect choice if you're hosting a large group.\nPot Biriyani is a home-caterer who specialises in some excellent Hyderabadi biriyani.\nIf you're having people over and don't want to cook or just having a family meal, we highly recommend Pot Biriyani for takeaway or delivery. It's run by a friendly family and they make tasty, well presented and generous biriyani, among other things.\n\nපොට් බිරියානි කියන්නේ කදිම බිරියානි ලබාදෙන ගෙදර උයන කෑම තියෙන තැනකට. ඒවා එන්නේ මැටි බඳුන්වල. (ඔබට ඒ මැටි බඳුන් තියාගන්න පුළුවන්.) අට දෙනෙකුට හරියන පංගුවකට රුපියල් 3,000යි. හතර දෙනෙකුට රුපියල් 2,000යි.\n",
  "url": "https://www.yamu.lk/place/pot-biriyani/review-189271"
}