{
  "name": "Prego",
  "address": "2E, Poruthota Road, Negombo",
  "telephone": "0312225655",
  "close_time": " Open 10 AM–11 PM",
  "description": "Prego is an Italian restaurant in Negombo. Although the prices are high, the food is quite authentic and the ambience is chilled out. ",
  "tip": "The pizzas are large enough for three people, so order one if you're looking for a value meal.",
  "review": "An Italian joint down Poruthota Road in Negombo, Prego offers a variety of pizzas, pastas, rice, and meats. It's a pretty nice place with very friendly staff and a chilled-out ambience. They also have a range of drinks, both alcoholic and non-alcoholic.\nThe staff are really attentive and friendly. They ushered us to our seats, put our dying-out camera batteries to charge with a smile on their faces (didn't make me feel like I was bothering them), and patiently waited until we made up our indecisive minds about what to order. The food took a little while to arrive — about half an hour to 45 minutes — but the items were served hot and fresh. The food tasted good, so the wait was worthwhile.\nAlthough their food is tasty, it's also pricey, with barely anything to be found for less than a thousand bucks. I ordered a petti di pollo (grilled chicken breast smothered in mushroom sauce with a few slices of grilled bell pepper) for Rs. 1,500, and my friend ordered the salmone (smoked salmon) pizza (Rs. 1,600). We also got a watermelon juice and an orange juice, each at Rs. 300.\nThe watermelon juice tasted fresh. I'm usually not a huge fan of it, because it tends to be watered down. The flavour of the orange juice was strong and tangy. It wasn't doused with sugar, so I really appreciated that. Also, it was served chilled — very refreshing on a sunny,\nday.\nI thought the chicken was overpriced, given that it was just the meat. That being said, we really liked how the mushroom sauce complemented the well-prepared chicken.\nWe were also offered a little vial of olive oil, which we didn't use 'cause the dish had plenty. The chicken was soft with the outside crisped to a light gold, and although it seemed like quite a small serving, it was a filling dish.\nThe salmon pizza had thick, pink slices of smoked salmon scattered across the dough, which was layered with mozarella and what seemed to be dollops of oregano paste. The flavour of the fish was quite strong and while I found it overpowering, my friend said it was fine. I loved how you unexpectedly bit into the spice and flavour of the oregano — it added a pleasant dash of non-fishy flavour to a very fishy pizza.\nThe restaurant is spacious and well laid out. Tables with chairs are on the right and others with benches are on the left. There's a wooden statue right in the middle, and cutlery hanging on the ceiling above the counter. The place is dimly and relies mostly on natural lighting. There's also an al fresco area outside.\nIt is neat and chilled out. We liked it.\nPrego is an expensive place, albeit good for a special occassion. The food is filling, the pizzas are worth the price, and the staff are friendly and full of smiles. It's quiet during weekday lunch hours, so it's a place to seek out if you want some peace.\nPrego (which means 'you are welcome' in Italian) dishes out pricey but flavoursome Italian cuisine that doesn't disappoint.\nPrego is an Italian restaurant in Negombo. The food seems quite authentic, the prices high, and the creme brulee is amaze.\n",
  "url": "https://www.yamu.lk/place/prego/review-59913"
}