{
  "name": "Rio Ice Cream (Wellawatte) ",
  "address": "Marine Drive, Wellawatte, Colombo 6",
  "telephone": "0212227224",
  "close_time": " Open 10:00 AM to 10:00 PM daily",
  "description": "Rio Ice Cream, a Jaffna franchise that's about forty years old (according to Raja at its Wellawatte branch), is idyllic and affordable for ice cream lovers - they're creative with flavours and mix it up for fun with jelly and smarties, because why not? ",
  "tip": "Try the Rio Special. It's special.",
  "review": "If you want to get some ice cream while soaking in the beautiful sunset, Rio is the place to be.\nJaffna's legendary, Rio, has been perched along Marine Drive for about four years now. While the taste remains the same (saccharine and surprisingly likeable), the prices have been hiked up a tad bit.\nINFLATION? ECONOMIC CRISIS? PRICE MECHANISM? YAHAPALANAYA?\n\nWith a wide variety of ice cream flavours and milkshakes on their menu board, we opted for a Blueberry Sundae (Rs 230), a Mega Special (Rs 180), and a Badam Shake (Rs 300).\nThis didn't taste like blueberries, but then again there are only 1 out of 2744275430 (please adjust for hyperbole) Sri Lankans who have actually tasted real blueberries. (Ones on cheesecakes do NOT count.)\nYou don't really realize the ice cream does not have a strong blueberry taste until you go, \"hmm, this tastes very blueberry-ish, but, hmmm, I haven't really had real blueberries... HOLY MOTHER OF ICE CREAMS THIS IS TRICKING MY BRAIN BECAUSE IT'S SWEET VANILLA WITH A SLIGHT BLUEBERRY FLAVOR AND LOTS OF LIGHT VIOLET COLOURING... but this is pretty darn good,\" and you end up downing it like beer.\nIf you're Muslim, like Barbican because #HalalLife.\nIf you like telling people what to do, don't get the Rio Mega Special. You won't have a say in the flavour of ice creams in the sundae. Either way, this sundae is loaded with jelly, smarties (which I am assuming are Ritzbury Pebbles), and nuts. Not too many nuts, but enough nuts. You will also come across some fruit here and there. So it's kinda healthy, I guess.\nA little too sweet for my liking because it comes at you all at once. With overpowering sweetness, Rio's Mega Special is only for the Mega Strong.\nBadam Shake (Badam = Almonds in Hindi) was a little disappointing. I expected a thick milkshake, but what I got was one with a watery consistency. I refuse to call this a Badam shake. It was a lot like badam milk, but not as tasty as how badam milk usually is. Very diluted in taste and a little too expensive for something that I wouldn't go back to buying.\n\nThis place is packed to the brim in the evenings. You would be surprised at the number of people who want to eat ice cream on a Tuesday at 4 PM.\nThe crowd is what really highlights the place. Rio is constantly buzzing, with people celebrating birthdays to soon-to-become aunties taking little kids to eat some ice cream, to old uncles who just want some sweetness in their system.\nService is a little slow given the continuous crowds. If you are dying and you really want ice cream, ditch Rio because they will take about 10 minutes.\nOn the whole, you won't receive a smile most of the time with your ice cream. But do you really need that smile?\n\nThe ice cream is very, very sweet, but if you are not weak and your body can deal with it, go ahead and try Rio.\nTake. The. Challenge.\nEat. That. Saccharine.\nIf you hate crowds, avoid Rio.\nIf you are broke, you go to Rio.\nIf you just want a very Jaffna feel, Rio it is!\nThe spot for reasonably priced ice creams and shakes, and buzzing crowds.\nRio Ice Cream, a Jaffna franchise that's about forty years old (according to Raja at its Wellawatte branch), is idyllic and affordable for ice cream lovers - they're creative with flavours and mix it up for fun with jelly and smarties, because why not?\n\nඉර බැහැගෙන යන හැන්දෑවක, මුහුදේ ලස්සනත් බලන ගමන් අයිස්ක්‍රීමක් තොලගාන්න කියාපු තැන තමයි මේ රියෝ එක. මේකට යන්න දවස් ගණන් හිතහිත තැවිතැවී ඉන්න ඕනේ නැහැ. මොකද මේක පොකට් එක නැත්තටම නැතිවෙන්න හිඳුණු දවසක වුණත්, බයක් සැකක් නැතුව ගිහින් හිතේ හැටියට අයිස්ක්‍රීමක් රස විඳින්න පුළුවන් තැනක්නේ. අනික ගෙවන ගාණේ හැටියට උපරිම වටිනාකමක් මේ අයිස්ක්‍රීම්වලින් ලැබෙනවා.\n\nවෙනදා යාපනයේදී පමණක් රසවිඳින්නට ලැබුණු රියෝ අයිස්ක්‍රීම් දැන් වැල්ලවත්තේ මැරයින් ඩ්‍රයිව් වෙතට ඇවිත්. රතු පැහැති සංඥාවකින් යුතු මේ ට්‍රක් රථය බොහෝ වෙලාවට නවත්තල තියෙන්නෙ හේමර් ඇවෙනියු අසලමයි.\n\nயாழ்ப்பாணத்தில் பல ஐஸ்கிறீம் கடைகள் இருக்கின்றன. அவற்றுள் மக்கள் படையெடுக்கும் இடமொன்றுதான் நல்லூர் கோவிலுக்கு அருகில் அமைந்துள்ள ரியோஐஸ்கிறீம். கொஞ்சநாளாக இதன் கிளையொன்று நீர்கொழும்பு கடற்கரை வீதியில்இருந்தது.\n",
  "url": "https://www.yamu.lk/place/rios-ice-cream-truck/review-117798"
}