{
  "name": "Rolex Hotel",
  "address": "360, Galle Road, Wellawatte, Colombo 6",
  "telephone": "0112360462",
  "close_time": " Open 10.00AM to 10.00PM",
  "description": "Rolex Hotel is a Jaffna bath kade in Wellawatte which also seems to have a branch in Jaffna.",
  "tip": "The mutton is decent. Don't expect too much from the biriyani.",
  "review": "Hotel Rolex, now Rolex Hotel, doesn't actually make branded watches. They do however do rice and curry and other buth kade specialties in a little spot in Wellawatte, with the promise of Jaffna fare. The dishes aren't as legit as the stuff at say\nor\n, but as far as the rice and curries go, it's still tasty.\nThis kade is mostly known for its biriyanis and kottus. The mutton biriyani came recommended so we tried that. For Rs. 350, this isn't much of a biriyani - it's more like a very tasty, yellow rice packet. It comes with parippu, brinjal, egg, onion pickle...\nAnd a separate generous heaping of mutton. The mutton was tender and quite tasty but there wasn't that spicy, distinct punch you get in your typical Jaffna preparation.\nWe also asked for a dish of devilled prawns for Rs. 250 for funsies - plenty of juicy ones covered in a very thick, spicy sweet pickle sauce. All this made an overall tasty lunch - Rs. 600 for yellow rice and two generous servings of curries. Not bad, but if you're seriously looking for biriyani and you come here and have to face this plate of yellow rice instead, you're going to be disappointed.\nin 1982, while the Colombo branch picked up in '95. It's one of the cleaner kades, and much more female-friendly than most. It's packed during lunch hours and kottu evenings.\nService is typically very efficient - you pay at the counter and the bill goes to the boy behind the glass display, who wraps it up for you. The waiters and manager are quite friendly and attentive, particularly if you can manage a bit of Tamil.\nRolex Hotel is a good place to stop by if you want a tasty rice and curry, and maybe string hoppers and the lot. The biriyani tends to disappoint though, considering it's biriyani-priced too. The Jaffna punch here isn't that strong, but the curries are still more generous and flavoursome than at your average kade.\nHotel Rolex is a Jaffna bath kade in Wellawatte which also seems to have a branch in Jaffna.\nHotel Rolex is a Tamil/Jaffna bath kade in Wellawatte which also seems to have a branch in Jaffna.\n\nහොටෙල් රොලෙක්ස් කියන්නේ වැල්ලවත්තේ තිබෙන යාපනය දෙමළ බත් කඩයක්. එහි ශාඛාවක් යාපනයේත් තිබෙනවාලු.\n",
  "url": "https://www.yamu.lk/place/hotel-rolex/review-48793"
}