{
  "name": "Roots Gelato (Crescat Boulevard)",
  "address": "No 89, Galle Rd, Colombo 3.",
  "telephone": "0775558334",
  "close_time": null,
  "description": "Root's version of artisanal Italian ice cream. They do a pretty good job.",
  "tip": "Their Dark Chocolate sorbet is a must-try. Also, the Limone Biscotti gelato if you're a lemon puff fan.",
  "review": "Roots has upped their game since we last reviewed their gelato place at\n. They now have an outlet at the Crescat Food Court as well, so we decided to pay them a visit.\nThey have introduced a bunch of new flavors since our last time like Limone Biscotti, Pani Kaju and also Chocolate Biscuit Pudding (yes, you read it right). The prices differ according to the type of flavor.\nThe normal gelato starts at Rs. 280 per scoop, sorbets Rs. 250 and premium flavors Rs. 350.\nThe Limone Biscotti (Rs. 350) was our favorite. If you're a Lemon Puff fan, you will definitely love this. The sweet and tangy Lemon Puff flavor was rich with a creamy texture. They even had biscuit bits inside as well.\nThey certainly have improved on the Pistachio (Rs. 280). It's nothing like the one at the\nbut it came pretty close. Although I saw a few nuts on display, there weren't any pistachios in our serving, which was disappointing. Other than that, it was tasty and the flavors weren't overpowering as last time.\nWe also tried the classic Chocolate Gelato (Rs. 280) which tasted like a cheaper version of the Haagen Dazs Belgian Chocolate Ice Cream. It was decadent, creamy and very chocolatey.\nFor those of you who don't know, the main difference between gelato and sorbet is that sorbet is dairy-free so it's made with sweetened juice or water.\nThe Dark Chocolate sorbet (Rs. 250) was so good! This is my personal favorite. The rich dark chocolate flavor was extremely strong with a creamy texture. It is well worth the price.\nTheir service is pretty basic, but it was efficient. The portions were quite big so it was no surprise that people were giving us judgy looks when we had more than 2 on our table.\nThe ambience is the same old Crescat Food Court, which is a little better than MC. There's enough space for you to sit and enjoy your ice cream, amongst the never-ending chatter.\nRoots has finally entered the gelato game with quality flavors including some localized ones. The prices are now reasonable and worth it. We highly recommend the Dark Chocolate sorbet and the Limone Biscotti.\n",
  "url": "https://www.yamu.lk/place/roots-gelato-crescat-boulevard/review-213812"
}