{
  "name": "Royal Bakery",
  "address": "202, Galle Road, Colombo 6",
  "telephone": "0112588476",
  "close_time": " Open 5.00AM to 9.00PM",
  "description": "Royal Bakery is an old timer from Colombo's original bakery scene, going way back to 1906. The shorteats and cakes are still pretty good, and they've expanded to serving rice and kottu too. ",
  "tip": "Visit early in the mornings to get the shorteats fresh.  Also heads up, these guys do specialty cakes. ",
  "review": "Royal Bakery is an oldie from Colombo's original baking scene, going back to 1906, and their shorteats and cakes are still good. We haven't had lunch or dinner here, but they now also do a range of rices and kottu.\nThe selection here is pretty huge and everything generally looks fresh and good. Besides your usual shorteats and sweet snacks, you can also get sandwiches, breads, biscuits and nice big cookies here, and everything is for less than Rs. 100. Upstairs you get nasi goreng, fried rice, kottu for dinner, and so on, all for around Rs. 200. So as a one-stop-for-all, this place works.\nWe tried the chicken sandwich - simple thick bread and chunky flavoursome curried chicken, very tasty and cheap, also a Chinese roll and the batter fried capsicum. All good. As with most local bakeries though, you're better off buying your savouries early morning, lest the stuff goes bad.\nI usually avoid cupcakes at bakeries and leave\nto it. If it's in a glass display case, high chance it's just going to be a little stale and puffy and the icing's going to be hard to bite into. But the ones at Royal Bakery looked tempting enough - no regrets - this is actually an excellent takeaway cupcake for 70 bucks. It's big, soft, with chocolate chip cookies in the cake and a huge heaping of creamy chocolate chip icing that reminded me a little of Nutella's hazelnut flavour. The eclairs are also not bad at all, better than at most Colombo bakeries.\nRoyal Bakery is immensely popular because of its wide selection. It's a much less glamorous, not-quite-there-yet version of\n. It's usually crowded and right now is under renovation, so there's a mess of steel rods out front too. The inside seems clean but a little haphazard given the crowds harassing the old man at the cashier stand.\nThere's a little plastic seating space upstairs if you're in the mood to sit down and have a rice packet, alongside some unlikely Old England paintings on the walls.\nRoyal Bakery is one of the better ones among Colombo's limited options for over-the-counter baked goods. If you're looking for a mid day snack or easy breakfast, especially if it involves cupcakes, it's worth a shot.\n",
  "url": "https://www.yamu.lk/place/royal-bakery/review-47965"
}