{
  "name": "Ru's Kitchen",
  "address": "Sri Somarathane Mawatha, Bellanwila",
  "telephone": "0773505999",
  "close_time": null,
  "description": "A home baker who specializes in amazing brownies. She also makes savory goodies.",
  "tip": null,
  "review": "It was Rishani's birthday and she brought us a box full of the most delicious brownies we've ever had. Imaad told me we had brownie cake, and brownie cake it was.\nMere words cannot describe how good it was. Our connoisseur Malinthe, who's very hard to please, went for thirds, fourths, and fifths.\nVery thick and generous pieces, the brownies were not overly sweet and struck a perfect balance in terms of texture, chocolatey flavour, and nice, very light and thin crust. The base was decadent and moist, and we loved the dark chocolate flavour that just oozed out. At Rs. 110 a brownie, we thought it was well worth it.\nWe'd ideally order in and review a minimum of three items unless we're talking about a specific meal, but this was so good that we decided to do a post on it.\nShoutout to\nfor one of the best brownies YAMU's had!\nAmazing brownies.\n\nRu's Kitchen එකේ හැදෙන චොක්ලට් බ්‍රව්නීස්වල හොඳ තද චොක්ලට් රසක් තියෙන බව නම් කියන්නම ඕනේ. ඕනෑවට වඩා පැණි රහක් එන්නේ නැති නිසා, පැණි රසට එච්චර කැමති නැති කෙනෙක්ට වුණත් කිසිම අවුලක් නැතුව මේ චොක්ලට් බ්‍රව්නීස් රස විඳින්න පුළුවන්.\n",
  "url": "https://www.yamu.lk/place/rus-kitchen/review-108587"
}