{
  "name": "Sahan Agro Strawberry Corner",
  "address": "Jambugasmulla Mawatha, Nugegoda",
  "telephone": "0778844050",
  "close_time": null,
  "description": "The Sahan Agro organic shop at Economic Center has a dessert parlour down Jambugasmulla Mawatha, Nugegoda. They dishes out a range of strawberry based snacks, drinks  and other natural products like bee honey.  ",
  "tip": "Try the waffles.",
  "review": "Located at Jambugasmulla Mawatha, Nugegoda, Sahan Agro Strawberry Corner is a branch of\n. It's one of the handful of places in Colombo to get fresh organic fruits, and apart from that, here they serve a range of strawberry centered food items, drinks, jam, chutney and other natural products like bees honey, and jaggery.\nTheir menu is quite extensive with a ton of juices, milkshakes, smoothies, bubble tea, and a couple of food options; waffles, and ice cream.\nWe tried the Waffles with Nutella and Strawberry (Rs. 450), and it totally delivered. Crispy on the outside, soft and fluffy on the inside, it’s a well-executed dish as opposed to the rubbery ones available in some popular cafes in Colombo. It was coated with a generous layer of nutella, and had plenty of strawberry slices to go around. The waffle itself wasn’t too sweet, which helped to balance out the sweet, sour and fruity flavours perfectly.\nAs for drinks, we got a Milo Bubble Tea (Rs.299) and Fresh Strawberry Milkshake (Rs. 349). The milkshake was thick, freshly blended, sweet, milky, and very strawberry-ice cream-ish, but we couldn’t quite get the taste of fresh strawberries in it.\nThe bubble tea was pretty average. It was overly sweet, and not milo-ey enough. The milk to milo ratio was unbalanced, and overall it tasted very bland.\nThis place is quite small, enough to accomodate 8-10 people at a time. The interior is all white and pink, which is kinda cute. The guy manning the counter is very friendly and super attentive.\nSahan Agro Strawberry Corner is a good place to grab a quick drink, or something to munch on, if you're in the area. I certainly see myself going back there for the waffles.\nSahan Agro Strawberry Corner is a good place to grab a quick drink, or something to munch on.\n\nමෙච්චර කාලයක් ස්ට්‍රෝබෙරි බේස් කරගත්ත කෑම තිබුණේ සිම්ප්ලි ස්ට්‍රොබෙරීස් එකේ විතරයිනේ. ඉතින් ඒ තරම් ජාති නැතත්, ස්ට්‍රෝබෙරිවලට ආස කරන ඕනේ ම කෙනෙක්ට යන්න පුළුවන් තැනක් තමයි මේ සහන් ඇග්‍රෝ ස්ට්‍රෝබෙරි කෝනර් එක.\n",
  "url": "https://www.yamu.lk/place/sahan-agro-strawberry-corner/review-221393"
}