{
  "name": "Smokey's (The Brownie Bar)",
  "address": "1B, College ave, Mount Lavinia.",
  "telephone": "0777105113",
  "close_time": " Open 9.00AM to 9.00PM",
  "description": "Smokey's is a home baker that specializes in delicious brownies at easy prices - and they happen to be completely vegan too. ",
  "tip": "Call a day ahead to place your order. ",
  "review": "Smokey's is a brand new home baker who makes amazing brownies. We didn't know it till we had finished eating them, but these brownies are also vegan. If you're not a vegan you're probably thinking 'oh no, vegan and brownies should not be in the same sentence', but trust me, this stuff is the shizz.\nWhile we're on the topic,\nis another known vegan home baker, and\nand\nare some of our other favourite brownie makers.\nFirst off it has to be said that these brownies are huge - the '6 pack' of chocolate brownies that we got, was more like a 12 pack, and all of it cost Rs. 570. We got an assortment of toppings - chocolate, peanut butter and peanutella (chocolate and peanuts). As a fan of peanut butter, this stuff smelled amazing when the box was opened and completely got my vote right away.\nServed warm, the brownies were very soft and chocolatey without being too gooey (\ndoes very gooey brownies if you're into that), and they are wonderfully generous with portion and topping (especially the peanut butter). Can't really say anything bad about the brownies, they taste great without being overly rich as chocolatey desserts sometimes tend to be, so you feel like going back for more.\nThey also have a strawberry and coconut cream brownie on their evolving home baker menu, which sounds very interesting, and as with everything, is home-made from scratch and vegan. You can stay tuned on\nfor updates.\nLike we've said, the prices here are superb by Colombo's baking standards. The brownies are available in 6-pack and 12-pack boxes, and while you'll have to watch the Facebook page for the prices of specific flavours, the chocolate ones come at Rs. 570 for six gigantic squares. Completely worth it. Place your order a day or two in advance, and the usual pick-up point is in Nugegoda, though you can alternatively call them up and ask to pick it up from Dehiwala.\nSmokey's makes very good brownies, and they happen to be vegan as well (vegans can rejoice over this since there are very few vegan food options in the city). We'd definitely try their stuff out again for funsies.\n",
  "url": "https://www.yamu.lk/place/smokey/review-44029"
}