{
  "name": "Spice Coast",
  "address": "39A/1 Marine Drive, Bambalapitiya, Colombo 4",
  "telephone": "0112593969",
  "close_time": " Open 11AM to 11PM every day",
  "description": "Spice Coast has good Indian food on Marine Drive. We personally think this is an ideal place for Indian takeaway/delivery and not a bad place to dine in.",
  "tip": "They do big biriyani savans (Rs. 2,950 for chicken",
  "review": "Spice Coast is one of the most popular Indian food joints down Marine Drive. They've got some good Indian dishes for a decent price tag.\nSpice Coast’s main focus is Indian food, but they’ve got some Chinese food options on their menu as well. In our last review we tried the Chinese menu, so we decided to go for the Indian menu this time.\nAn Indian meal without a Biriyani is incomplete, which is why we opted for a Chicken Biriyani (Rs.450). Spice Coast used to do a good biriyani, but this time it didn’t live up to our expectations. The rice was cooked well, wasn’t crazy-oily, but the seasoning was just not right. We couldn’t quite locate the significant masala fragrance or the taste in this. It was alright with some raita and gravy, but didn’t make up the fact that it lacked the mandatory spice elements. The chicken served with this was tender and moist but again, not properly spiced.\nNext up, we tried Butter Naan (Rs.130) and Cheese Naan (Rs.190), accompanied with the classic North Indian dish - Chana Masala (Rs.390).\nWe loved the butter naan at Spice Coast. Crispy on the edges with an intensely buttery texture, this is quite the steal for that price tag. Cheese Naan on the other hand was a disappointment, as it was the same butter naan embedded with some grated cheese in the middle. It's not worth the extra bucks.\nWe were pleasantly surprised with the Chana Masala. Unlike the biriyani, it had all the spices in the right balance. There were plenty of chickpeas in the curry, cooked to its perfection and the gravy itself was spicy and tangy. At Rs.390, this is a generous portion of chana masala that can be easily shared between three people.\nAs for drinks, we got a Sweet Lassi (Rs.290). With its thick texture and the strong curd taste, this is indeed a refreshing treat for this insanely hot weather.\nSpice Coast gets packed during the lunch hours, but still they managed to bring our food within around 10 minutes. The staff is attentive and efficient as well. As for ambience, they’ve got an ok-ish dining setup, but still could be improved with some maintenance.\nSpice Coast is a good place to grab some Indian food if you're in the area. Be sure to try the chana masala, these guys does a good one.\nSpice Coast is a good place to grab some Indian food if you’re around Marine Drive.\nSpice Coast has good Indian food on Marine Drive. They also unexpectedly serve some yummy cuttlefish.\nSpice Coast has good Indian food on Marine Drive. We personally think this is an ideal place for Indian takeaway/delivery and not a bad place to dine in.\n\nමැරීන් ඩ්‍රයිව් එක අවට ඉන්න වෙලාවක ඉන්දියන් කෑම වේලක රස බලන්න හිතුණොත්, ස්පයිස් කෝස්ට් කියන්නේ ඒකට ගැලපෙන තැනක්.\n\nSpice Coast has good Indian food on Marine Drive. We personally think this is an ideal place for Indian takeaway/delivery and not a bad place to dine in.\n",
  "url": "https://www.yamu.lk/place/spice-coast/review-208176"
}