{
  "name": "Steam Boat (Mount Lavinia)",
  "address": "43, 8A, Beach Road, Mt. Lavinia",
  "telephone": "0112807380",
  "close_time": " Open 11.00AM to 3.00PM, 6.00PM to 11.00 PM",
  "description": "Steam Boat provides a lovely spot for sunset and wave watching. With an elevated cement and canopy dining area as well as shaded chairs and tables on the sand, venue wise they've got it spot on. Food, however, not so much. ",
  "tip": null,
  "review": "Steam Boat has been around for quite a while and is still a popular choice among lovers of Sri Lankanized Chinese food. We tried out their delivery for this review - Steam Boat's food hasn't changed in so long, the food is still kind of meh, and still cheap. So if you're really hungry with a craving for cuttlefish and don't want to leave the house, Steam Boat still does their thang.\nThe only real win about Steam Boat is that it's affordable. We got a large mixed rice (two boxes), large cuttlefish, small garlic beans and small peppered beef. This is easily enough for four people, and it cost about Rs. 2000.\nThe mixed rice came in a huge portion enough for four (Rs. 570), it wasn't too oily, though had more egg than any meat in it.The cuttlefish which was supposed to be a 'large' portion, was the same size as the other small dishes, and though kind of spicy, seasoned and good for random cuttlefish cravings, frankly wasn't worth Rs. 650.\nThe beans and beef came in very goopy soups - beef was soft and tasted fine, the beans unfortunately tasted sweet for some reason. And again like the cuttlefish, it'll do, if you're just after some midnight-munchies fast food, especially with a group. If you have higher standards than that though, we're not nuts about Steam Boat.\nSteam Boat has its own delivery service - just make your pick from\nand give them a call. When we called them back and wondered out loud about our ridiculously small 'large' portion of cuttlefish, they were pretty indifferent. At least delivery was fine - no spillage, it took about an hour.\nSteam Boat is what it is - cheap Sri Lankanized Chinese food. Their rice portions are pretty large, and their cuttlefish though far from the best is fine if you're craving and don't want to spend. Also, our last review\nat their restaurant gives them points for their by-the-beach ambience.\nSteam Boat has got a regular customer base for cheap Sri Lankanized Chinese food. The food's okay if you're craving cuttlefish, but otherwise a bit goopy.\nSteam Boat provides a lovely spot for sunset and wave watching. With an elevated cement and canopy dining area as well as shaded chairs and tables on the sand, venue wise they've got it spot on. Food, however, not so much.\n\nඉස්සරහ කෙලින්ම පේන මුහුද, විනාඩි දෙක තුනකට මාව හුදකලා කරද්දි යාළුවා සේවක මිත්‍රයෙක්ට කථා කරල මෙනුවකුත් ගෙන්න ගෙන. ''මොනවද බන් කන්නෙ'?' මගෙන් අහනවා.\n",
  "url": "https://www.yamu.lk/place/steam-boat-mount-lavinia/review-39070"
}