{
  "name": "Streat360",
  "address": "66/3, Ward Place, Colombo 7",
  "telephone": "117360360",
  "close_time": " Open until 11:00 PM",
  "description": "Streat360 is an interesting little restaurant featuring 'street food' from different countries. The interior is quite chic and rustic, but it's kinda overpriced.",
  "tip": "Best to visit in the evenings - grab a milk toffee sundae and laze around in the garden. ",
  "review": "Streat360 is a beautiful and rustic resto down Ward Place with a mixture of Sri Lankan, Mexican, Western and Vietnamese dishes. Their concept is street food from around the world. Rather expensively dished up street food, if I may add.\nThe waitstaff are friendly and helpful and they know their menu, which is great. We saw some Chicharones (Rs. 530) as a 'lite bite' and thought it would be fun to try out because it's well, chicken. It's technically chicken skin, but for some weird reason I didn't expect it to be\nthat (and it was) so woopsy; my bad. This was crackly, crispy, intensely oily chicken skin.\nThis might be an acquired taste, but it really didn't go down well. No one back at worked liked it either, and we were icked out by it.\nOur mains were an incredibly expensive Mutton Biryani (Rs. 1500) and a Piri Piri Chicken (Rs.1400).\nThe biryani was actually quite lovely, with flavoursome and fatty bits of mutton in it and fragrant long rice. It was pretty nice, but definitely priced on the higher end of the spectrum.\nThe chicken was well done and quite plentiful in quantity, but taste-wise was just alright. It was spicy and packed a bit of heat, and was accompanied by a side of wedges and a pretty great salad. The salad > chicken. Which is really weird.\nDespite our rather disappointing experience with the food, we really really enjoyed our drinks.\nBehold our Passion Fruit Virgin Mojito (Rs. 400) and Lemongrass and Mint (Rs. 300). The drinks were spot on with the Passion Fruit having perfect acidity and sweetness, and the lemongrass a predominant and interesting flavour. The latter was garnished with a stalk of lemongrass as well, so that added a lot more authenticity to it. FYI, they don't have a liquor licence, so they're generally chill with you bringing in your own bottle of wine etc.\nLong solid benches and desks akin to ones on the streets as well as your regular old tables and chairs provides furnishing.\nThere are a few cool paintings around, the decor is minimalistic and beautiful, and the whole place is really well lit thanks to a couple of walls being mostly glass. It's a very lovely spot, inclusive of an outdoor seating area.\nStreat360 is a cool place to hang out because of the funky decor, but personally, the food is hella overpriced for the quality and quantity. The drinks are really good though, so that's something worth checking out.\nStreat360 is a beautiful and rustic resto down Ward Place with a mixture of Sri Lankan, Mexican, Western and Vietnamese dishes.\nStreat360 is an interesting little restaurant featuring 'street food' from different countries. The interior is quite fancy but the prices aren't half bad.\nStreat360, a cosy new restaurant that’s just popped up down Ward Place. It's got interesting decor and it's a fun place to hang out. The food is alright, sometimes enough to pique your interest, but not gratifying for the really-hungry.\n",
  "url": "https://www.yamu.lk/place/streat360/review-119578"
}