{
  "name": "Subway",
  "address": "347, R. A. De Mel Mawatha, Colombo 03",
  "telephone": "0115115115",
  "close_time": " Open 7 AM - 11 PM (Monday - Wednesday), \n7 AM - 12 PM (Thursday - Sunday)",
  "description": "Swift service and healthy veggie options make Subway a worthy new franchise in Colombo.",
  "tip": null,
  "review": "Nearly 3 years since coming to Sri Lanka, Subway is one of the only fast food places that's consistently been healthy, reliable, and well, fast. It's also quite tasty to boot, so there's practically nothing to complain about.\nOrdering is three steps long and quite simple: pick your type of bread, meat preference, and salads. Oh, and cheese and dressings, if you like. Prices are in the Rs. 420 - 700 range, with the Sub of the Day being the best deal at Rs. 420.\nWe got the Roast Beef on Wednesday for Rs. 420, and a Subway Club for Rs. 590.\nThe Club comes with roast beef, turkey, and smoked chicken, so it's great if you want a bit of everything! Service is smooth and friendly, and the staff are patient throughout even when indecisive customers take ages to place an order and choose their greens. Props to remaining cool through the day (and month!) because I know I wouldn't be able to deal with it like they do.\nThey recommended Parmesan and Oregano for it, which I agreed with to no regrets. From there on, they lay out the meat, you select your cheese (cheddar or mozzarella?) and then you pick the salads and sauces. I'd advise not piling on a ton of stuff because it's just one big mess when there's too much going on, but each to their own. I love spice and heat though, so I went for jalapenos and pickled gherkins, along with some olives to balance it out. The combo was great.\nChandana's Roast Beef was topped with honey mustard and a ton of greens, sandwiched between a 9 grain Honey Oat bread. Given his choices of vegs and toppings, had a slightly sweet tang.\nThe food was fresh and well worth its price though, especially when compared to other sandwich or burger places scattered around the country, and in terms of quality and produce as well.\nWe also got a Red Chilli Chicken Salad (Rs. 690). While the portion is large and it's basically a make-your-own salad, it's nothing spectacular given that it's literally the toppings neatly packed into a large plate. Points for presentation, though.\nWith great 90s and early 2000's music and clean, neat dining spaces, Subway's surprisingly well preserved. There's also an upstairs section with a few couches and unimaginative decor which can be improved upon (there are still-life enlarged photographs of vegetables), but other than that is a good private area for a group outing if you're keen on customisable and fresh sandwiches.\nProps to the Subway team for maintaining the high standards they started off with. We'd definitely recommend these guys (especially their Sub of the Day deal) for nutritious fast food (yes, that sounds like an oxymoron but it's not!) that gives you great value for money, especially if you're hungry, short of time, and can't decide where to eat.\nThis is consistently good. We love it.\nWe're glad Subway is in Colombo. Subway is an efficient and consistent franchise, especially if you want to eat healthier and put more veggies in there, or if you want to experiment with the sauces. We think it's good value for money, considering a 6 inch here is only about 200 bucks more than a regular burger at McDonalds, and, in our opinion, both better tasting and better for you.\n\nඅනිත් ෆාස්ට් ෆුඩ්  කඩවලට වඩා අඩු ගාණට, රසට සහ ටිකක් සෞඛ්‍යසම්පන්න විදියට කන්න පුළුවන් තැනක්.  සබ් ඔෆ් ද ඩේ එක පට්ට ලාබයි.\n\nඇත්තෙන්ම සබ්වේ එකේ කටට සැරට කන්න කෑම නැති වුණාට බඩ පැලෙන්න කන්න පුළුවන් නියම සබ්මැරීන් සෙට් එකක් නම් තියෙනවා.\n",
  "url": "https://www.yamu.lk/place/subway/review-164915"
}