{
  "name": "Sudarshan Veg",
  "address": "No 8, Frankfurt Place, Colombo 04",
  "telephone": "0114801901",
  "close_time": " Open until 11:00 PM",
  "description": "A 100%  veg restaurant serving North and South Indian food.",
  "tip": null,
  "review": "Giving competition to up-scale vegetarian restaurants and your basic\nis Sudarshan Veg, a restaurant that is tucked away in a road in Bambalapitiya. I had serious doubts about the quality of food here because:\nSo, I began my investigation.\nThe first item for the investigation was Pani Puri, one we got off their Indian Chaats selection. We received a portion of 6 puris for Rs 185.\nWhile the puris were slightly disfigured, they were packed to the brim with spiced potatoes, chopped onions and coriander. With the combo of the spicy mint flavoured water and watered down sweet tamarind chutney, the end result was similar to what you would find at a pani puri stall in India, except it felt more hygienic.\nWhat arrived next was the North Indian Thali (Rs 600) followed by a\nBiriyani (Rs 565).\nThe Thali had a generous amount of white rice and roti along with a mushroom soup, spiced potatoes, paneer curry, dhal, mixed veg curry, a dessert, a glass of buttermilk, and two flattened veg kebabs.\nThe accompanying curries were really well spiced and bound perfectly with the rice and soft roti. The mushroom soup, which I confused for\ntasted super creamy and buttery. I loved everything about the Thali from the silky paneer to the refreshing, spiced buttermilk and the dessert, kesari\nwas well prepared without killing you with the sugar and ghee.\nTruly, a Thali worth the price.\nVegetarian biriyani is usually a disgrace to the biryanis overall, but this particular biriyani put all the chicken biriyanis sold in Colombo to shame. With so much of masala infused into every long grain of basmati, I didn't miss the taste of  chicken at all. Neither dry nor insipid, this was of the best of biriyanis I have had!\nOn a sweeter note, we also tried their\ne\nand\n. Both were priced at Rs 285 each, but the\nwas complimentary for some reason, which was really nice.\nTopped with almond flakes, this\nhad a thick consistency and tasted richly of almonds (\n). Sweet and creamy, this was one of the ideal ways to end my Indian meal - really helped ease out all of that masala from my oesophagus.\nA rice pudding of sorts,\nis a dish I have avoided all my life. But this was the best\nI have had in the past 20 years of my existence as a Biriyani loving mortal. Served chilled, it worked well with the humidity, and tasted divine with the milky goodness coming through.\nWould I recommend this dessert to anyone? Hell, yes.\nThe service is what you would anticipate at any restaurant.\nAttentive staff coupled with smiles made our experience one without complaints.\nIn terms of the ambience, this restaurant hasn't spent its bucks hiring an expensive interior designer.\nIt's brightly lit and there's plenty of seating, including upstairs and outdoors.\nWhile the interior doesn't stick to any Indian theme to highlight the cuisine served, it looks like any normal family-friendly restaurant you would find in India.\nJudging by the restaurant's mediocre exterior, I walked in expecting a very dull experience.\nBut surprise! It was one of the best Indian veg restaurants I have patronized in Sri Lanka! The mainstream veg restaurants will have some serious competition, if Sudarshan Veg won't compromise on its quality.\nHowever, slightly disappointing is the fact that they don't serve some of the classic items mentioned on their menu such as\nand\nHowever, on the whole, will go again. For the biriyani.\nAnd phirni.\n",
  "url": "https://www.yamu.lk/place/sudarshan-veg/review-134981"
}