{
  "name": "Sweet Wishes by Vish",
  "address": "No. 5 Moor's Road, Colombo 6",
  "telephone": "0773780760",
  "close_time": null,
  "description": "Sweet Wishes by Vish is a veteran among Colombo homebakers. Her bakes have survived the test of time and her new stuff and savouries taste delicious.",
  "tip": "The Facebook page has their menu if you're looking to order.",
  "review": "Sweet Wishes by Vish is a relative veteran among Colombo home bakers. Her bakes are tested and true her new line of sweets and savouries taste delicious.\nVish has been in the local baking scene for a while now, and has amassed quite a following. She still operates mostly on a pick-up basis, but as of last month she opened up a dedicated bake shop (Saturdays only). This isn't like an actual restaurant, rather it's a small area where you can grab a quick bite or get something in the morning without prior orders.\nThe menu each week changes but you can expect a mix of savories, grills and sweets. Her prices are also quite reasonable with pretty much everything priced between Rs. 70 and Rs. 200, with the pricier bakes being the ones that have something special going on.\nI think everyone is well acquainted with Vish's sweets by now, but little did we know her savories are just as good, if not better! The gourmet burger grillo (Rs. 275), is one of the her grills that were on offer, and it was exceptional. She makes it on order so you get it fresh and warm. It basically square wrap with fillings similar to a burger with lettuce, cucumber, cheese, homemade tomato sauce and crumb-fried chicken. It all just works very well together and with texture of the lettuce, the wrap absorbing the slightly sweet tomato sauce and the well cooked, crunchy chicken.\nThe chillie chicken pie (Rs. 80) was also tasty and well worth the price. This one is simply a light puff pastry with a spicy chicken filling and cheese. It's adequately spicy, well seasoned and well balanced, which makes for a great pie.\nOur favourite among sweets was the neopolitan mini cake (Rs. 160), which is basically a layered chocolate, red velvet and butter cake with cutter cream icing. This one looks great, and the taste of each separate layer coming through quite nicely. The butter cream icing also complemented the cake well with just the right sweetness and a smooth texture.\nSweet Wishes also has a bunch of different shots (Rs. 70). We tried the red velvet with cream cheese, cheesecake and chocolate mousse. We were happy with each of them but the red velvet was our favourite, with the rich chocolate mousse also making a compelling case. If you're fan of equal parts frosting/topping to cake, these shots will make you happy.\nThe choco chunk brownie (Rs. 150) was the only one of the lot that we weren't crazy about. That being said, this is still good, but not mind blowing. We would have preferred it a bit more moist with milk chocolate chips as opposed to dark chocolate, but that will differ depending on personal preference. The ones pictured above are the almond flake variant.\nAll in all it's easy to see why so many have patronized Sweet Wishes over the years. Her sweets are consistently great and her savouries are just as impressive.\nSweet Wishes by Vish is a veteran among Colombo homebakers. Her bakes have survived the test of time and her new stuff and savouries taste delicious.\nSo we ordered macarons again.\n",
  "url": "https://www.yamu.lk/place/sweet-wishes-by-vish/review-44028"
}