{
  "name": "Tartaruga Restaurant  (Unawatuna)",
  "address": "Yaddehimulla Road, Unawatuna Beach,\r\nSri Lanka",
  "telephone": "0094914927116",
  "close_time": null,
  "description": "Overlooking the sapphire blue waters of Unawatuna, Tartaruga delivers good food with an equally good view.",
  "tip": "Request for a scoop of vanilla ice cream with the banana fritters.",
  "review": "After 60 seconds of serious pondering in Unawatuna, Tartaruga was the spot chosen for lunch. And the swift decision wasn't regretted.\nThe drive to Unawatuna can really work one's appetite up and Tartaruga restaurant's extensive menu was clearly not helping us decide. So, with the help of the friendly dude who was serving us, we opted for seafood rice, devilled prawns, calamari with hot garlic sauce and devilled kangkung.\nThe seafood rice was spot on! Unlike the dry seafood rice that one would find in most places, this didn't really require any side dishes to complement it, but we ordered them anyway. The rice had a tonne of carrots (Vitamin A. Yay!), and two portions (priced at Rs 690 each) were enough to be shared among four hungry mortals.\nWith an underlying subtle taste of garlic, the Calamari (Rs 970) was beyond your ordinary good. It was really good. Neither too spicy nor too bland, this curry hit the right spot with its flavour and level of spice. Most places tend to go overboard with their chillie, but Tartaruga had it under control.\nBut what they didn't have under control was the number of chopped capsicum and onion in their devilled prawns.\nMore capsicum and onions than prawns = not cool.\nThe \"devilled\" flavor didn't really come off as strong, but was satisfactory. However, if I were given another chance, I wouldn't bust Rs 890 on their devilled prawns unless I was dying and the prawns were the only option.\nThe Devilled Kangkung (Rs 390), on the other hand, was tasty, retaining their crunch and garlic flavour. The only disappointment was the size of the portion which was disastrously small. A small portion scattered on a large plate wasn't the most visually appealing thing to see.\nFor dessert, banana fritters awaited me with a scoop of vanilla ice  cream (upon my request). These were, hands down, the best banana fritters I have ever had. The batter was not lumpy. Fried to crisp perfection, the warm bananas teamed with the honey and ice cream were a gastronomical delight. Worth every single cent of my 400 bucks!\nIt took us a while to be attended to, but the food didn't take that long to arrive. If my stomach weren't rumbling, I'd have happily waited for a longer time while soaking in the beautiful view of the sun, sea and sand.\nWe were served by a cordial man named Ajit who was well versed with the items on the menu and made the right recommendations for the lunch options. The food took exactly 30 minutes, as Ajit said it would. With friendly and well-trained staff, the service is up to standard.\nIf not for the average prawns and small portioned kangkung, lunching at Tartaruga was a pleasant experience! Would definitely go again. For the banana fritters.\n",
  "url": "https://www.yamu.lk/place/tartaruga-restaurant/review-112700"
}