{
  "name": "Tatlers Tea",
  "address": "27 1A/1B Visakha Road, Bambalapitiya, Colombo 4",
  "telephone": "0112552158",
  "close_time": null,
  "description": "Tatlers Tea is the usual YAMU tea break spot. It really isn't anything to write home about, but if you visit you just might bump into us!",
  "tip": "Specify how much sugar you want!",
  "review": "Tea is the elixir of life for most Sri Lankans, and believe it or not, even the most seasoned YAMU member at office needs an occasional caffeine boost for midday exhaustion. Tatler’s Tea is the regular tea break hangout for some of the YAMU team. It’s a small shop that is a marriage between a thae kade and a café. If you pay a visit just around lunchtime, you might just run into us grabbing a cupper. It’s got okay, cheap tea, and very basic, unappetizing short eats.\nThis isn't a review per se, but more of a ‘A Day In The Life Of A Yamurai' post.\nTatler’s Tea is just around the corner of the YAMU Office. Dinesh and myself usually head there and for Rs.45 grab the usual; one milk tea with sugar, and one without. There’s usually a TV with some politician blaring some speech on the news whenever we go. It’s a little run down, though not dirty. There’s a neater seating area on the side of the café with a bit more light and space.\nThe lady at the counter is the one who runs the place. She’s pleasant and knows our usual despite Dinesh and me being just two of many office folks who get our caffeine boost there. It’s an okay stop if you work nearby and are looking to get some tea.\nAccording to YAMU Office definitions teatime is “the inconclusive time Dinesh and Sandesh feel like sneaking a break.” I joke of course. (Here’s to hoping Indi doesn’t see this.)\nMy Milk Tea with sugar is okay. It isn’t exactly the best, but it does have a nice, unique flavour- occasionally. Some days it’s there, most days it’s not. Occasionally the nice lady will accidentally put more sugar than normal so it does tend to be too sweet at times. Tatlers’s also do their\n. You can buy yourself a box and try to get that unique taste I occasionally find. Dinesh tried their green tea and found it okay too.\nTatlers has also got a decent selection of juices which come from local produce (I forgot this in the initial draft of the review and headed downstairs a second time). It's quite popular - Bhagya and Helmali, upon finding about my second visit had me take down the very specific order of \"Two mangoes, one bottle, no salt\" and \"One Naarang, no ice, no seeds.\".\nMy order on the other hand was a clear \"Mango Juice, Shaken, not stirred.\"\nThat's right. I have a license to drink.\nThe mango juice was pretty thick and tasted good, though it came on the slightly un-iced side of things. \nJanith quite liked his Avocado, and Dinesh enjoyed his unsweetened Papaw juice. \nAll in all Tatlers is quite decent with three mangoes, one avocado, papaw, and naarang clocking in at Rs.460. \nThis surely beats the likes of\nTheir short eats aren’t the best. The butter cake was dry and heavy, whereas the Chinese roll was more of a Chinese flat; it wasn’t crispy, had little filling and was all in all disappointing. Hunger may be the best sauce, but I really can’t imagine anybody trying these out. If you’re absolutely famished I suppose they’ll curb the roaring pit in your stomach.  To make a long story short- I’ve been to Tatler’s plenty of times and only tried the food once, for the sake of this review. (The things I do for you guys).\nTatlers is a “K.” We like it because of its convenience, cheap prices and okay tea. However for \nsomeone whose office isn’t anywhere close by it really isn’t worth going out of the way unless \nyou’re looking to run into us. =)\nP.S. Anyone looking to grab a free copy of the\ncan pick it up here.\nTaters Tea is the usual Yamu Tea Break spot. It really isn't anything to write home about, but if you visit you just might bump into us!\n\nහවස් ජාමෙටකට ඇවිත් නිදහසේ ඉඳගෙන රසම රස තේ උගුරක් හරි පළතුරු යුෂ එකක් හරි තොල ගාන්න නම් Tatler's තේ කඩේ කියාපු තැනක් තමයි.\n",
  "url": "https://www.yamu.lk/place/tatlers-tea/review-49377"
}