{
  "name": "Tea Blog",
  "address": "758A, Dr. Danister de Silva Mawatha, Colombo 09",
  "telephone": "0115753024",
  "close_time": null,
  "description": "The newest bubble tea joint in Colombo. They also do cakes, burgers, waffles and sandwiches.",
  "tip": "Try the Raspberry bubble tea. ",
  "review": "Located down Baseline Road, Tea Blog is the latest bubble tea spot in town. Apart from bubble tea, they serve up a range of sandwiches, burgers, baguettes, waffles, and sandwiches.\nThey have three types of bubble tea; Fruity tea, Milk tea, and Tea Blog Specials. We tried one of each.\nThe Lovers Paradise (Rs. 400) in their signature range didn't impress us. Originally, it was supposed to come with rose petal black tea, basil seeds and popping boba. But as there was a shortage of popping boba, they were kind enough to replace it with some preserved strawberries.\nThe bits of thinly sliced strawberries floating around were a nice touch, but we could barely get the tea taste in this. It literally felt like drinking a very sugary\nleaving your mouth all sticky. Needless to say, we didn't finish this.\nTheir Nutella Waffle (Rs. 600) looked quite messy but we liked it. The waffle itself had a fluffy texture, crunchy edges and wasn't crazy-sweet, which worked well with the toppings.\nTopped off with three small scoops of chocolate ice cream, and drizzled with Nutella, it was a very filling snack. Although, we wish it had fresh strawberries, instead of preserved ones.\nWe also tried their Chilli Cheese Sandwich (Rs. 350), which was quite alright. The bell pepper and mozzarella flavors emerged nicely through the perfectly toasted slices of bread.\nThe interior is decorated with cushioned benches, comfortable chairs, and warm lighting, which has given it the glimpse of contemporary elegance. It can easily accommodate 15-20 people at a time.\nTea Blog is managed by some of the nicest people you’ll ever meet. They’re very friendly, and attentive but unfortunately, they took around good 40 minutes to deliver our food and drinks to the table. It's highly unacceptable considering there were only four more customers apart from us.\nTea Blog has been around for 8 months now and as we could see, it has become a popular spot among the working crowd around this area. Whilst they've got some good food and drinks, they definitely should work on improving their service.\nA bubble tea spot with some good snacks.\n\nදෙමටගොඩ පැත්තෙන් ආව වෙලාවක බබල් ටී එකක් බීලා, පොඩි ස්නැක් එකක් වගේ කන්න ටී බ්ලොග් එක හොඳ තැනක්.\n",
  "url": "https://www.yamu.lk/place/tea-blog/review-221580"
}