{
  "name": "The Promenade at ODEL",
  "address": "5 Alexandra Place Colombo 7",
  "telephone": "0112682712",
  "close_time": null,
  "description": "Colombo's biggest department store's upscale food court area",
  "tip": null,
  "review": "ODEL has been undergoing some refurbishing in the last couple of months. While its interior is pretty much untouched and is still the same, it looks great on the outside.\nOverall, it's a massive upgrade and quite aesthetically pleasing. There's a spacious courtyard, with foodstalls bordering it and plenty of greenery. The furnishing is tastefully done — wickerwork with glass-topped tables — and there seems to be more seating facilities. A few of the stalls are still closed, but should be open soon since the signage and hoardings were all up.\nYou have about nine outlets to choose from:\nMabroc wasn't open as yet when we dropped in, and there were a few bare carts at the entrance. I'm not entirely sure if that's ornamental, or if they'll be vendoring food soon. The place is very well kept, and the staff clears out the tables quite fast. One thing I found a bit awkward was that they clear out your table while you're still seated and haven't completely finished.\nWe checked out Regent and Seafood Shack. The prices are a bit on the high end — just as expensive as if you're getting food at a proper restaurant.\nRegent's food layout looked great: clay pots, rice and curry, completely Sri Lankan cuisine including lotus roots which you'd be hard-pressed to find easily in Colombo. Despite being aesthetically pleasing, the food was sadly underwhelming. A generous portion beautifuly presented (and inclusive of a really nice\n, a regular rice and curry portion is Rs. 500.\nFrom Seafood Shack, we picked the Dory Fish and Chips. The fries were chunky, crispy, and tossed in chilli. A really well made dish, the fish wasn't disappointing either; it was coated in a crisp light batter, and the fish in itself was light and succulent. My one complaint would be that for Rs. 800, you get only 3 strips of fish and the portion is rather small in that sense.\nWe got a Narang and Starfruit juice (Rs. 330) and an Avocado Blast (Rs. 480) from Roots to wash the food down. The drinks were good actually, much better than most of Roots' other outlets. The Avocado Blast came mixed with bananas, dates, and coconut but the avacado and banana flavours dominant.\nThe Naarang and Starfruit was slightly (rightfully) acidic and very refreshing. The flavours melded well together and it's a great way to beat the heat. A plus point is that none of Roots' juices are overpowered by sugar.\nThis is definitely one of the better foodcourts to hang around in, especially if you're looking for something outdoors and pretty to sit in while you're grabbing a quick bite.\nODEL has been undergoing some changes over the last few months: they've got a brand new foodcourt.\nThe best food court in Colombo\n\nහුඟ කාලෙකට කොළඹ ෆුඩ් කෝර්ට්වලින් හොඳම එක වුන ODEL එකේ ෆුඩ් කෝර්ට් එක ඔක්කොම කඩල දාල අලුතෙන්ම ෆුඩ් කෝර්ට් එක හදන්න අරගෙන තිබුණා.\n",
  "url": "https://www.yamu.lk/place/odel-food-court/review-146039"
}