{
  "name": "The Brown Bean Coffee (British Council)",
  "address": "49 Alfred House Gardens, Colombo 03",
  "telephone": "0716221626",
  "close_time": null,
  "description": "One of the icons of The Good Market since its very beginning, The Brown Bean Coffee has grown since then and has now 2 permanent outlets at the British Council and at Dialog Head Office. ",
  "tip": "Grab a table outside outdoor people",
  "review": "No more need to patiently wait for the Good Market on Saturday to get your caffeine fix from The Brown Bean Coffee (TBBC). You can now find them at the British Council or at Dialog Head Office to get you going through the week, when you need them most.\nWe dropped into the British Council to check out their permanent stall. Don't be intimidated by the security guys at the entrance, the café is open to the public as well.\nThe coffees are up to standard. No surprise, it's exactly what you'd get at the Saturday Good Market, served out in porcelain or glass.\nWe got ourselves a Cappuccino (Rs. 250). Brown Bean really nails the ratio of milk/coffee. The drink impeccably combined the bold coffee taste and the sweetness and creaminess from the milk. The only drawback for me was the texture, which wasn't velvety enough to my taste. But I'm being picky here.\nWe couldn't miss out on our all time favourite, the Iced Coffee (Rs. 280). Both flavour and texture were spot on. Creamy but still refreshing, rich in flavour and deliciously cold, it was perfect, as usual.\nFinally, we also tried their Americano (Rs. 250) to really get to taste the organic Peruvian coffee beans they use. Peruvian coffee is known to be smooth and delicate, mild yet aromatic, with low acidity and bitterness. And these characteristics applied to the drink. To make it short, it was very easy and pleasant to drink.\nWe were excited to see that we could pair our brew with some snacks: pastries, sandwiches, wraps, salads, soups and the likes.\nAs for the coffee, prices are reasonable. Quality and taste don't quite compete with the coffee though. But don't get me wrong, it's not bad, and they offer few interesting options.\nWe started with a good ol' Seeni Sambal Bun (Rs. 60). It was a good one that ticked all the boxes: bread was fresh and the generous filling sweet and spicy. You can't really ask for more from a seeni sambal bun.\nThe Mexican Chicken Wrap With Cheese (Rs. 350) featured on the menu caught our attention. It consists of veggies and chicken cooked in a spicy sauce and wrapped in a tortilla wrap. The tortilla was fresh and soft and the stuffing tasty and spicy. But we are still looking for the cheese and the Mexican touch here.\nWe also got an Avocado and Orange Salad (Rs. 550), an original mix of orange, avocado, lettuce, black olives dressed with a spicy sauce. As simple as it may look, it's actually packed with different textures and flavours. It's all together creamy, juicy, crunchy, sour, sweet, delicately salty and spicy. We were really happy with this choice.\nThe piece of Garlic Bread was sold separately at Rs. 30. Grilled on order, it was really good, not the average frozen type. Bread was nice and crunchy and the garlicky and oily sauce on it was super flavoursome.\nWe ended the meal on a sweet note with the Chocolate Brownie (Rs. 150) and the Chocolate Chips Muffin (Rs. 60). While the Chocolate Brownie was very appetizing with its typical flaky crust and nuts, it was actually a big disappointment. It was bland and overly sweet. We couldn't really distinguish the chocolate taste to it, which is a bit frustrating for a chocolate brownie. The muffin on the other hand was good. It was moist and delicately sweet. A good match with the Americano.\nWe've found the service to be a bit messy and disorganised. You order at the counter and staff brings drinks and food at your table.\nWhile the coffees arrived quickly, it took us more than 40 minutes to get our food. Except from the wrap and the salad, everything else was ready to be served. They also forgot to bring some of our orders. We don't recommend for a quick lunch on the go.\nThe staff is very pleasant and smiley though.\nThe space looks and feels more like a tiny and bright food court than a cosy and trendy café.\nThey have few tables and benches outside overlooking the British Council garden, which are more pleasant if, like me, you like to get your daily dose of fresh air.\nIt's so comforting to know that you can always count on The Brown Bean Coffee for high quality coffee at very decent price. And now everyday. And with some interesting snacks if you're hungry and not in a hurry.\n",
  "url": "https://www.yamu.lk/place/the-brown-bean-coffee-british-council/review-201689"
}