{
  "name": "The Original Rocket Burger",
  "address": "Pedlars Street, Galle Fort, Galle",
  "telephone": "0778545395",
  "close_time": " Open 9.00AM to 10.00PM",
  "description": "Rocket Burger is the Galle Fort's only burger specialist.  The patties are well ground and they're usually very generous with stuffing -  you're going to spend Rs. 900 minimum for a burger here though. ",
  "tip": "Don't do take-away - these heavily stuffed burgers are best when they're eaten fresh and hot. ",
  "review": "So you're walking around under the harsh Galle sun. You're looking around and all you see is a bunch of artisanal eateries with fancy names and Calorie Counter. Be on the lookout though because there's a sweet little burger joint tucked away somewhere in the maze that is Pedlar's Street.\nWe were pretty hungry so we decided to go all out and after a few minutes of ho-humming and raising eyebrows at the aptly named burgers, we finally settled for the Shipwreck (Rs. 900), the Tiki Tiki (Rs. 600) and the Texas Cowboy (Rs. 650) respectively.\nThe Shipwreck comes with a gigantic hunk of fish which makes you wonder what on earth the fish ate to bulk up like that. The fish fillet wasn't strongly flavoured, just your average slab of grilled mahi mahi with oodles of mayo-like lemon tinged sauce. It's massive, that's for sure, but the flavours were incredibly underwhelming. We're not sure this is worth Rs. 900 despite the size.\nThe Texas Cowboy comes stuffed with a whole lot of pulled chicken. Excellently prepared and flavoured really well the chicken is dripping with a sufficient quantity of sauce. Hiding underneath the patties is a dollop of coleslaw for that added crunch and pickled onions which tie the whole thing together. The final outcome is a really confusing bang of flavour which leaves you wondering if it's a sweet, sour or salty taste.\nThe Tiki Tiki is a vegetarian delight with a patty made of mostly potatoes and a mash of other vegetables. The herbivore who indulged in it says that it was a bit of a difficult task to actually eat said burger thanks to the patty falling apart all over his hands so I recommend you use cutlery. That being said, the burger comes with a hefty amount of greens so if you're taking the green walk then this is a good choice.\nThey've got their own brand of iced tea called Blue flamingo which sells for about Rs. 150 a pop. The good thing is these come in fairly large bottles so if you're looking for a thirst quencher then DEFINITELY get this. We loved it and it was by far one of the best iced teas we've had.\nThe lemon doesn't overpower the tea which is a definite plus and it's gloriously refreshing especially if you've gone for a trek around the streets.\nThe eatery is relatively tiny with a slight\n-esque feel to it with yellow and deep grey accents. There's a bunch of quirky little benches you can sit on and gabble on about that cute surfer\nyou saw and whatnot.\nIt gets pretty hot during the day but unless you're Leonardo DiCaprio there's nothing you can do. There's a seating area upstairs as well and although it's deceptively small I'd say it can comfortably hold about 15 people.\nThe chap you see in the picture above does the burger assembly and also provides some good service. Ask him for his opinion and he'll make a good recommendation. He is less blurry in real life.\nIf you're in Galle and craving a legit burger, then do head on to Rocket Burger as it's a bit of a cult favourite. Keep in mind that nothing in Galle is cheap even though it's teeming with the hippies and free-thinkers so you'll have to deal with the irony. Happy eating!\nTORB serves up a mean albeit overpriced burger. The restaurant is tiny, quaint and is a great spot to chill and put a chat with your comrades.\nRocket Burger is the Galle Fort's only burger specialist. The burgers aren't as mind blowing as they used to be, but they're still good, albeit it's all Rs. 900 minimum here.\nThis Cuban run burger shop in Galle Fort is amazing. Some of the best burgers on the island.\n",
  "url": "https://www.yamu.lk/place/the-original-rocket-burger-galle/review-155886"
}