{
  "name": "The Ocean (The Kingsbury)",
  "address": "48, Janadhipathi Mawatha, Colombo 1",
  "telephone": "0112421221",
  "close_time": " Open 11.30AM to 2.30PM, 6.30PM to 12.00AM",
  "description": "The Ocean is the Kingsbury's seafood restaurant. The food is fresh off the ice onto the pan - it's good, and they also do a decent, affordable sashimi. ",
  "tip": "Grab a table near the fresh seafood so you don't have to walk up to place your order. ",
  "review": "The Ocean is the Kingsbury's seafood restaurant - the food is fresh off the ice, and it's good. They actually seem to be in competition with\nat the Cinnamon Grand, since they have the same basic theme: pick fresh seafood off the counter, and make your choice of sauce and preparation.\nThe salmon sashimi was actually quite good. It comes in 13 pieces with the wasabi and soy sauce, and costs Rs. 990, which is good by general sashimi standards. The fish was wonderfully fresh and high quality. The Ocean might not be the best place in Colombo for Japanese food (\n,\n), but the stuff is definitely good.\nOur side of garlic rice was well flavoured, a little oily, and surprisingly for two people the bowl cost only Rs. 200. The garoupa we got was beautifully presented, and all around smelled and tasted superb - lightly grilled, with a crisp outer coat, fresh and slathered in a bit of sauce. Our prawns didn't come tempura fried like we ordered but were skinned, soft and in a thick white sauce - still tasted good however.\nAlthough the manager seemed rather stoic and preoccupied when we walked in, service was generally good, with a friendly chef, a very attentive waiter, and these cleanly prepared dishes taking just about 20 minutes to reach our table.\nThe Kingsbury is a fancy place to dine, so like the Lagoon this is one of the classier seafood restaurants in the city for a formal or business meal. The only complaint we'd have is that customers have to walk to the end of the room to make their order of mains, so take a seat near the chef's station maybe. You can watch him prepare your food through the glass wall.\nThe Kingsbury took a big hit once the ongoing Port City project just swallowed up its view of the ocean. So there really isn't a view anymore, unless you like piles of rocks.\nThe Ocean is a very good option if you're looking for good seafood. The food is fresh and very well prepared. We were surprised that our wallets weren't demolished at the end of the fiasco - for sashimi, rice, prawns and garoupa, for two, it cost Rs. 3,600, which we think is great for the quality of food and the upscale ambience.\n",
  "url": "https://www.yamu.lk/place/the-ocean-the-kingsbury/review-44379"
}