{
  "name": "The Havelock Place Bungalow",
  "address": "6-8, Havelock Place, Colombo 05",
  "telephone": "0112585191",
  "close_time": " Open 7 AM to 10 AM (breakfast), 12 Noon to 3 PM (lunch),  3 PM to 6.30 PM (snacks), 7 PM to 10 PM (dinner)",
  "description": "Havelock Place Bungalow has got a charming little restaurant with a Barefoot-esque alfresco and good food. The prices aren't too bad, and their home-made ice cream is great. ",
  "tip": "Go there for the ice cream, it's great. ",
  "review": "HPB is a charming, secluded little boutique hotel in the heart of Havelock Town. It holds an equally charming little al fresco restaurant, ensconced in foliage, and removed from the bustle of the city. It's actually one of my favourite spots in town, and even made it on to our\n.\nWe're glad to see the recent subtle improvements in service and attention to detail. The restaurant's played host to a couple of lovely\nbrunches and events, which has also helped raise its visibility (we're happy they're getting popular, but not happy our secret date spot is exposed).\nTheir food has improved marginally but noticeably- there's a bit more attention to plating now, and the chalkboard menu is more interesting, but the fixed menu is totally the same. I also love that they've switched up the usual resto bread basket, and chose to open with pita bread and a tiny dip of hummus. If you're having a drink, I'd strongly recommend their wine list as it's fairly reasonable (you can get a regular Cava for about Rs. 2600, for example).\nWe've had a\nin the past, so we decided to jump straight into mains this time around. We ordered both from the chalkboard specials, which is generally the best decision.\nThe Pan Roast Chicken with Semolina Mash and Ratatouille (Rs. 1250) was a fairly hefty portion, which could have been plated slightly better. It was a well balanced meal, with a little bit more oil than I would have liked (from both the chicken skin and the vegetables). The spicing was a lot more layered than I initially thought, and the semolina mash had a lovely, almost Indian flavour to it with plenty of sautéed curry leaves strewn in. Barring the oil, it was cooked to perfection.\nWe also tried the Fillet of Mullet with Passion Fruit & Ginger Sauce (Rs. 1300), the flavours of which were delicious. The spices at play offset each other well, although the passion fruit sauce could have done with a bit more spice for the Lankan palate. The bed of rice and beans were a little boring and dry, but healthy enough. I would have prefered my fish marginally less cooked as it detracted from the mullet's naturally soft flesh that falls away under a stern fork prod. Overall, this dish was almost perfect in taste but not texture.\nTheir dessert is generally brilliant. We've tried loads of their inventive ice cream flavours,\n, all of which have been absolutely delicious. This time, we deviated a bit and tried the Slow Baked Lemon Tart. It was perfection enough to please Sansa, and the layer of brûlée on top just added to the great texture variation going on. The citrus was strong and compelling too.\nThe service is significantly more enthusiastic and quick than it used to be. Our orders were taken and brought out within just about 15 minutes, and there was always a waiter within waving distance. It's still cosy and quiet though, so there was no bustling or hovering.\nThe ambience was always the main draw of HPB. It's really small, with just about 6 tables and seating areas, dim lighting at night, and a lovely al fresco feel. You can wander around the property if you like, which you'll notice is a lot better maintained now. The bathroom never ceases to fascinate me, as it's almost completely open to the pond and walkway, but still somehow covered. A bit unnerving, but kind of cool in terms of design.\nThe Bungalow is still a haven in the city, a little leafy oasis of solitude and romance. The food's gotten better, as has the service, but we'd love to see a whole new menu rolled out in the near future. A little more attention to culinary detail for regular meals would be great, and we look forward to more experiences and events being hosted there.\nOne of Colombo's most charming little spots for drinks or dining.\nHavelock Place Bungalow has got a charming little restaurant with nice alfresco dining. The prices aren't too bad, and their home-made ice cream is great.\nThis was our main reason for visiting The Havelock Place Bungalow - the homemade arrack ice cream (Rs. 350). And it didn't disappoint. It was a good ice cream, great even; tasty and well-textured and served with a slim, crunchy biscuit.\n\nමේ තමයි අපි මෙතැනට ආ ඇත්ත හේතුව. ගෙදර හැදූ අරක්කු අයිස්ක්‍රීම් (Rs. 350) රසයි. පෙනුමයි. එය පිරිනැමුණේ තුනී විස්කෝතුවක් සමග. මෙහි අයිස්ක්‍රීම් මෙනුපත විශේෂයි. හනිකෝම්බ්, හකුරු, ඉඟුරු, අත්තික්කා හා පැණි ආදිය එහි තිබෙනවා. අරක්කු අයිස්ක්‍රීම් එක තරමටම ඒවාත් රස ඇති. අපි පසු අවස්ථාවක යනවා බලන්න.\n",
  "url": "https://www.yamu.lk/place/the-havelock-placebungalow/review-103501"
}