{
  "name": "the KAFÉ (Hotel Nippon)",
  "address": "123,  Kumaran Ratnam Rd, Colombo 2",
  "telephone": "112431887",
  "close_time": null,
  "description": "Hotel Nippon reopens and brings back their famed mutton rolls and other delicacies at the KAFÉ",
  "tip": null,
  "review": "\nThe Nippon Hotel, in its new guise, has been open for a few months now and is seemingly doing well. The place has a vaguely vintage aura about it, if only because associations forced through things like a large poster for The Grand Budapest Hotel hanging in its lobby.\nThe KAFE, spelled in all caps so you’ll need to yell the name when pronouncing it, purportedly sells food from Kerala, but aside from a few special items, mostly sweet, what you get is your standard Perera and Sons oriented sweet and savory fare, along with lamprais and rice and curry, which apparently sells out fast, as early as 2 p.m.!\nKAFE is located facing the street, there is parking behind the Nippon Hotel. The Ambiance Wide windows face the street, and the seating is organized in a diner style, or in the style of train if you like. It kind of feels like sitting in a train, with seats facing each other, and the landscape passing you by on the outside. It’s also nice and quiet inside, with a cosy feel, and all the dust, smoke and chaos of the street is filtered away so that all you can see is the pattern of life passing you by. I really liked the ambiance. There is also a set of couch in the back if you are with a larger group.\nWe mostly tried the short-eats. The rolls are their specialty. They come in mutton, fish and beef (Rs. 140 each). Strangely, no chicken while we were there. Be warned that all of these rolls are going to be very oily. The kind of oily that soaks through the brown paper bag they give it to you to take it away in. The fish and supposedly famous mutton rolls were average. The fish was a little too on the peppery, salty side, and the mutton had good texture but no flavor. The beef roll though, was boss. I really felt the taste of the subtly cooked meat. All the rolls were generously stuffed with filling. The were other options for short-eats, like chicken buns and pastries, but none of them looked particularly apetizing on a hot weekday afternoon.\nFor drinks we ordered the Passion Fruit Juice (Rs. 250), the Iced coffee (Rs. 200) and the strawberry milkshake (Rs.250). The passion fruit was all natural, and came with a sour natural flavor also, this batch of fruit was a little too on the sour side. The iced coffee was good, with spices like cardamom and cinnamon adding a light tang to it. The strawberry milkshake though was too artificial for our liking. Too syrupy.\nOn to the sweet stuff. We tried the éclair (Rs 100) which wasn’t too sweet and didn’t come stuffed with icing. The dough also was a little on the softer side. We liked it, but we also aren’t what you would call éclair connoisseurs. The coconut toffee (Rs.40) was too hard, tasted a little artificial again, and lacked that crumbly texture that good homemade coconut toffee comes with. The milk toffee (Rs 30) also was rather average.\nWe rounded this off by trying one of the items from Kerala, called Khaja. This only comes in packets that cost Rs 150, for which you get a few. It had a kokis like texture with a pani murukku like flavor. So brittle and crunchy, but also sweet (though not sickly sweet). We liked it, but also thought it was a little bit tough. But since we’ve never had this before, we can’t compare.\nQuick, friendly and efficient. They don’t seem to mind customers sitting here for long hours.\nNippon Café is a nice cosy little spot in Slave Island that is friendly and welcoming. The food isn’t spectacular, but it’s alright for the prices.\nGets you away from the bustle with a cosy and quiet interior, but the ambiance might just be the only thing for which KAFE stands out\nFully refurbished and not dodge anymore,  Nippon  now features KAFE, which (no surprises) is a cafe. With very reasonably priced and filling food.\n\nනිපොන් හෝටලේ මට්න් රෝල්ස් කිව්වම පරම්පරා ගානක මිනිස්සු ඒ රස දන්නවා. ඒ වගේම නිපොන් හෝටලේ නැවත පැමිණීම ගැන අපිට සතුටු වෙන්න පුළුවන්.\n",
  "url": "https://www.yamu.lk/place/the-kafe-at-hotel-nippon/review-208232"
}