{
  "name": "The Sooriya Village ",
  "address": "49, Skelton Road, Colombo 05",
  "telephone": "0112552666",
  "close_time": " Open until 11:00 PM",
  "description": "A hamlet designed to bring together the two most loved things - music and food.",
  "tip": "Try the pavlova.",
  "review": "Sooriya Village is a space for music, arts, and food. It's a leafy little retreat near Havelock City, with hospitable service, nice food, and a recording studio, practice room, library, and a store stocked with musical merch.\nMuch like a laid back village, Sooriya's space is calm, soothing, and chilled, with artsy little touches in the form of yaksha dancers and iron-wrought sculptures placed around, and brightly dyed recycled paper serving as tablemats. Look out for newspaper articles, old adverts or photos from the historic\ndays. The Village isn't just a restaurant, they also have lots of rooms that serve as soundproofed sound, yoga, or dance studios that you can rent out. They also have live music or little events most evenings. The staff are smiley and welcoming, quick on their feet and quick with service.\nWe got two iced teas (Peach and Lemon flavoured) for Rs. 250 each, which arrived almost within five minutes of placing the order. With slices of lemon floating in the tall glass, the Iced Lemon Tea was acidic and refreshing enough, but the Iced Peach was more of a syrupy disappointment as it was overpoweringly sweet.\nFood is where you're really denting your wallet though, so go expecting to spend approximately about Rs. 2000 on the main courses alone. You do get sandwiches for about Rs. 1000 though, and soups for a bit less.\nDespite being a hefty Rs. 1750 for a rice dish, the Portuguese Style Seafood Rice was unexpectedly amazing: superbly rich and creamy and soaked in broth. There were a few large prawns mixed in among the risotto, which was topped off with bacon (which I abstained from, just fyi).\nMy Roast Lamb (Rs. 2000) was two large slabs of succulent and well-prepared lamb, accompanied by some creamy mash, roast baby potatoes, and dense and flavoursome gravy. It's very filling, and could definitely be shared with someone, unless you've got a voracious appetite.\nWe love the quirky space, lovely service, and good food. Prices are definitely something to take into consideration because\ntwo mains and drinks cost us over Rs. 4000. If you don't mind that though, go ahead, it's a great place with a great vibe.\nA lovely space in Colombo 5 for music, arts, and food.\nNot your average village. *strums guitar*\n",
  "url": "https://www.yamu.lk/place/the-sooriya-village/review-168948"
}