{
  "name": "The RoadHouse",
  "address": "Hotel Road\r\nMount Lavinia, Sri Lanka",
  "telephone": "0774668420",
  "close_time": null,
  "description": "A food truck serving quality kottus using locally sourced ingredients and Lankan inspired flavours.",
  "tip": "There is a patch of grass next to the road, so if you fancy a cheap late night picnic, get a mat and throw a picnic on the road using their kottus! ",
  "review": "From\nto kottu on wheels, the Sri Lankan start up community is pushing all the right buttons. The Roadhouse is nestled (or parked rather) near the bustling Hotel Road in Mount Lavinia and it serves some of the best kottu dishes I’ve had.\nSince they specialize in only a few items, they really can’t go wrong. While you’re waiting for your kottu, you might as well explore the creatively designed truck with various food puns.\nThis killer Nai Miris Chicken Kottu (Rs.430) really kicks in with its spicy punch from the first bite. As you swallow it that pain (or ecstatic feeling for some) starts at the back of your throat and ends up like a spark in your head.\nThe gravy that comes along with this tastes a bit like the gravy given with the biriyani at KFC, which is a non-spicy counterpart and it balances out the flavours of the dish.\nOverall, the kottu was also of a good texture and if my body could handle more, I would’ve had more than one kottu!\nA dish that does justice to kottu everywhere is the Chili Beef Kottu (Rs.450) which is one full of succulent cubes of beef that oozes out with a peppery flavour and churns well with the soft roti of the kottu.\nIt may not seem like a lot to eat but it’ll have you feeling stuffed in no time! When you go back for seconds and thirds even though you are sweating and panting because it's so hot, that's when you know the dish was worth the sweat and your money!\nPunctuality is a joke in Sri Lanka and the Roadhouse didn’t surprise us when they too opened late at 6.30pm as opposed to 6pm like they’re supposed to.\nThe staff was friendly and took me through their limited menu which is necessary because their dishes may seem like they are closely linked whereas in reality all these flavourful dishes are very different to each other.\nDefinitely. The location may be a bit of hassle to reach for some of us, but like new moms forgetting labour pains when they see their kid, you too will forget the tedious ride when you see that the kottu is so damn good.\n",
  "url": "https://www.yamu.lk/place/the-roadhouse/review-196065"
}