{
  "name": "The Cricket Club Cafe",
  "address": "12, Flower Road, Colombo 03",
  "telephone": "0112501384",
  "close_time": " Open until 11:00 PM",
  "description": "The old classic at a brand new spot.",
  "tip": null,
  "review": "1996 was a great year for Lankan cricket. Not only was it the ultimate year of glory for the motherland, the pinnacle of many an uncle's existence, but it was also the year we got our first cricket- themed restaurant. The Cricket Club Cafe was one of Colombo's old-school establishments, a cosy colonial house on Queen's Road that held court for decades (although it's felt like a century).\nMasters of alliteration, the Aussie owners just moved shop to a funky, bright building on Flower Road. We swung by for a lunch and a beer, and generally enjoyed our experience.\nFeaturing multi-tiered brushed cement and brightly painted warped wood, the new building is pretty large. There's an open-air courtyard bar area which we liked, and plenty of a/c rooms throughout the area when the afternoon heat is too hot to brave.\nThe inner areas have maintained a lot of the original concept and charm, with antique cricketing memorabilia, like original uniforms used (some are signed!), bats, balls, and more. They've also maintained their old barrel keg tables, and plenty of TVs showing the match of the day.\nDespite all the sports bar trappings, I thought it was a pretty place to sit, chill, and enjoy a meal. They're apparently also putting in a floor-to-ceiling wine rack to draw in the classy cats.\n\nThe food menu is identical to the old one, no real changes here. It's still a bit extensive and the names can leave you stumped, so we opted for the classic CCC fare. We ordered the Fish & Chips (Rs 895), and the Corned Chili Beef Nachos (Rs 1195). Given the execution of both, we can see why they're keepers.\nThe nachos were clearly meant to be a sharing plate (which is awkward since sharing isn't Bhagya's strong suit), because the portion was massive. No chance of running out here. Slathered with a superb amount of cheese. guacamole, and plenty of well-spiced beef, the quality here was undeniable. We'd reccomend it for a match-watching snack with friends rather than a main course though, because it's massive and probably not very healthy to devour all by yourself.\nThe Fish & Chips came out quick and crispy, just as it should be. The batter was surprisingly light (the bowler wasn't too heavy either), and almost audibly crispy. The coleslaw side was fresh and zesty, while the potatoes (I substituted fries for mash) were creamy and not lumpy. Overall, good execution, good quality. But again, I couldn't quite finish my portion.\nWe washed down our hefty meal with an Arrack Cocktail, and a cold Tiger lager (Rs 625).\nAt Rs. 895++, we thought the cocktail was a bit pricey. True, there was a generous pour of liquor in there, but the flavours at play didn't quite bowl this maiden over. All the signature cocktails were simple, tasty concoctions around the same price. But this is homegrown arrack after all, so prices could decrease.\nWe can't say anything too exciting about mass produced lager, but Tiger's branding appears to be all around the place, so that's clearly the go-to brew here. It was a hot day, the beer was cold, we were happy.\nTo wrap up the meal, we got a Pavlova topped with passionfruit and mango for a cheap Rs. 345. The meringue was light and crunchy, and the fresh fruit offset it deliciously. A perfect hot afternoon sweet treat.\nWith the total at Rs. 4972, and plenty of leftover food for another full meal, we didn't feel shortchanged.\n\nThe waitstaff is pretty much exactly the same as the old premises, since the owners retained their entire team. They appear to be a bit more enthusiastic in the new settings, but getting their attention can still take some time during busy periods. It's a silly point to press, but I appreciated that they were nice enough to serve me mash instead of fries without a fuss.\n\nThe new spot, and its location in the middle of Colombo are a match made in heaven. It's equally appealing for tourists and locals, the food is great (and reasonable), and the drinks are strong. You may not be that into cricket, but this is a club worth getting into.\nThe decades-old Colombo classic, now in a new and refreshing new location on Flower Road.\nFounded in 1996 by two cricket-crazed Australians, this long-serving cornerstone of the Colombo cafe scene is still batting o\n\nවටපිටාව වගේම මෙනු එකත් තනිකරම ක්‍රිකට්: සංගක්කාරගේ සී ෆුඩ්, මහේලගේ මැට්රිෂියානා, ගවස්කාර්ගේ ග්‍රීක් සැලඩ්, නොටවුට් නිෂ්වාස් වගේ කෑම ජාතිවලින් තමයි මෙනු එක පිරිලා තියෙන්නෙ.\n",
  "url": "https://www.yamu.lk/place/the-cricket-club/review-120775"
}