{
  "name": "The Kitchen Galle Fort",
  "address": "No. 104, Pedlar Street 80000 Galle",
  "telephone": "0773873344",
  "close_time": null,
  "description": "The Kitchen serves tasty European fusion food in a refreshingly breezy outdoor setting at the Galle Fort.",
  "tip": "Try the Beef Burger",
  "review": "​The Kitchen in Galle Fort is all about keeping it real, at upmarket prices.\nOn the surface, it doesn’t have a massive amount of contrivance in terms of personality and character, and it has a great location, good ambiance, great seating and great food. So it's got all the important things going for it.\nThe menu is mainly comprised of European fusion food. It's got a couple of Chinese oriented stuff in there (like the Tom Yum soup) and standard fast food variants like the Burger and Club Sandwich.\nWe picked three starters and decided to splurge on a burger. The Tuna Tartar (Rs. 880) featured soft and mellow tuna which blended perfectly with the avocado cream and butter, complemented nicely by the crunchy texture of the baguette slices.\nThe Ceviche (Rs. 780) featured raw white fish fillet marinated in citrus, its texture was soft and generated a slight, but pleasant, rubbery/stringy sensation. The orange peel and spring onions added flavor and crunch. The Green Gazpacho (Rs. 480), cold vegetable soup, was refreshing. Chilled with a crushy texture.\nThe Beef Burger (Rs. 1780), definitely on the pricier end of normal, featured a homemade bun which was crispy and slightly salty, toasted on the inside with cheese. This brilliant concontion housed crunchy onions, runny egg and stringy cheese along with a meaty beef patty that combined in bites that veritably melted in the maw. If you're prepared to pay for it, you'll get one of the best burgers you can in the country right now.\nOh yes and it also came with nicely baked and seasoned chips.\nThe only thing that seriously let us down were the drinks, both the Recharger (Rs. 550) and the Ice Tea (Rs. 400) were bland and lacked flavor, and the former in particular was a little too watery for our liking.\nWe tried the watalappam cake (Rs. 580), which wasn't too impressive. The chef had been aiming for a version that was not quite local (dulling the sweetness, but also in the process dulling much of the distinctive flavor of watalappan). The cheesecake biscuit bottom in particular, killed the watalappam taste and confused your tastebuds. The watalappam was really struggling to be heard, and only managed to scream out its presence when eaten sans the biscuit.\nEating on the street is not something you get to do too much in SL and The Kitchen is an excellent place for it, being as it is inside the Galle Fort, where there is no dust or smoke constantly attacking your pores. Instead there is cool sea breeze and sun. A little too much sun if you walk in during lunch and are unlucky enough to not get a table in the shade.\nThe interior is nothing much, but I don't think they were aiming for anything more. It does open up into a beautiful Dutch courtyard in the back though, but that is out of bounds as it is owned and run by a different establishment.\nQuick and friendly. Nothng much else to add here. The Hungarian chef ​\nseems always up for a chat and talk about the food if you can catch him walking around.\nCertainly on the pricier side of the spectrum, but if you're willing to pay, The Kitchen is a brilliant spot for an excellent meal that also allows you enjoy the ambiance of the Galle Fort.\n",
  "url": "https://www.yamu.lk/place/the-kitchen-galle-fort/review-209046"
}