{
  "name": "The Cabinet (Hotel Nippon)",
  "address": "123, Kumaran Ratnam Rd, Colombo 02",
  "telephone": "0112332603",
  "close_time": " Open until 12:00 AM",
  "description": "The bar and lounge of historic Hotel Nippon",
  "tip": "The Cocktails here are amazing. Cheap too. ",
  "review": "Started as a mansion during the colonial era, Nippon is one of the oldest landmarks of Colombo’s history. Today it's a hotel with a restaurant (\n), cafe (\n) and a pub (The Cabinet). They're well-known for their legendary mutton rolls, delicious chicken lamprais and reasonably priced cocktails and bites, among other things.\nThe Cabinet is on tap from 10 am in the morning. The alcohol is considerably cheap, and they've got a bunch of fruit juices and cocktails for you to choose from.\nThe Nippon Green Apple (Rs. 499.69) from their signature cocktail range was pretty simple - Vodka and apple juice with a tinge of spiciness that comes from the chili rimmed glass. In terms of presentation, it certainly has room for improvement, but the flavours worked well together.\nWe also tried a Margarita (Rs. 635.44), which was our favourite out of the two. Involving the usual margarita mix, generous amount of Tequila and garnished with a lime twist, it had all the elements of a good margarita in the right balance.\nThe Pepper Pork (Rs. 522.75) was excellent! It was piping hot, and had an incredible flavour. The meat was cooked to perfection with a firm rind, and one of two fat bits that melt in your mouth. Seasoned with black pepper, crunchy green chilies and onions, this is a very generous portion of pork.\nThe Prawn Balls (Rs. 530.44) we tried at The Cabinet is probably one of the best ones out there. It's basically five big spheres of mashed prawn, golden batter fried and tasted amazing, especially with the chili sauce that came with it. They were light, puffy and not crazy-oily, and we devoured it within minutes.\nThe service was pretty decent. The staff was polite, attentive and helpful. Our food and drinks arrived within 15 minutes.\nIn terms of the ambiance, it has a strong retro-themed vibe going on, with wooden furniture and vintage posters hanging on the wall.\nAll in all, we really enjoyed our experience at The Cabinet. They've got some good cocktails, delicious bites and their prices are comparatively lower than the other pubs and bars around. Our total bill came to Rs.2870 including service charges and taxes, which is pretty cool considering that it is, in fact, a bar attached to a popular hotel in Colombo.\nThe Cabinet is the bar and lounge of historic Hotel Nippon.\n\nඅවුරුදු එකසිය ගාණක් ගිහිල්ලත්  තාමත් වයසට නොගිය නිපොන් හෝටලේ බාර් එක.\n",
  "url": "https://www.yamu.lk/place/the-cabinet-at-hotel-nippon-first-look/review-222691"
}