{
  "name": "The Bungalow - Galle Fort",
  "address": "No. 5, Church Cross Street, Galle Fort, Galle",
  "telephone": "0914944941",
  "close_time": null,
  "description": "With its colonial elegance, comfortable accommodation, well trained staff, and the excellent food, The Bungalow - Galle Fort is a place that unites every bit of happiness that you're looking for in Galle. ",
  "tip": null,
  "review": "They've got 6 rooms spread out through two floors; 4 King rooms and 2 Queen rooms. The Queen rooms are slightly smaller than the other one. At about 14k - 19k per night, they provide cozy and comfortable rooms with modern, spotless bathrooms, A/C, Wi-Fi, twin beds, and usually a garden view.\nNone of the rooms have TV or Cable facilities, but there's a nice lounge upstairs with a very comfy sofa if you're in a mood to read a book, watch a DVD, or Netflix and chill.\nFrom starters to desserts, the food menu at The Bungalow is quite extensive and covers a range of cuisines that suits anyone. As for drinks, they’ve got both alcoholic and non-alcoholic ones, including mocktails, cocktails, soft drinks, milkshakes, juices, and coffee.\nWe started off with the Mushroom soup (Rs. 600), which was simply amazing. Hearty, garlicky, oniony, and most important of all, lots and lots of mushrooms. We could taste that in every spoonful. They use three types of mushrooms to make this delicacy; local, shiitake and button mushrooms. The texture of this soup was thick, slightly grainy and to kick it up a notch, they’ve added freshly crushed pepper to it.\nWe also tried the Crispy Wontons (Rs. 750), which is one of the biggest-sellers in their appetizer section. Puffy, light and not crazy-oily, it became an instant favorite of ours. They were stuffed with oven roasted chicken, shiitake mushrooms, and spring onions. Paired with some soy sauce and peanut butter on the side, this is an ideal starter to awake your taste buds before the main course.\nThe Sri Lankan Prawn Curry (Rs. 1400) was such a delight. The prawns were chewy, adequately spiced and well cooked. While the gravy wasn't overwhelmingly creamy, it had the proper balance of milkiness and spiciness, which satiates both Sri Lankan and Western palates.\nIt came with a side of sticky rice, veggies cooked in coconut milk, mango chutney, and some good old\n.\nPacked with herbs and flavor, the Lamb Kofta (Rs. 2100) at The Bungalow is a must try. It had three minced Australian lamb skewers that were properly blended with Middle Eastern spices, soaked in tomato onion chutney, and grilled to perfection. The meat itself was soft, moist and easy to bite into.\nThe Buttered rice on the side was sticky and had the ideal amount of seasoning with some caramelized onions, and\n. It smelled and tasted so good; I would have just eaten that on its own.\nThe Lentil Soup, however, didn't impress us. It was a tad watery for my taste, and the veggies were very mushy and overcooked.\nAs for the dessert, we ordered up a Pavlova (Rs. 600). It's basically a massive meringue, covered in whipped cream and homemade blueberry glaze that thoroughly amazed us from its very first bite. There's a nice mellow surprise inside the shell of this giant meringue, which made us feel like eating a sugar-coated cloud, no regrets.\nThe whipped cream was good as the one we had at\n; with perfect consistency and not too sweet. Their blueberry glaze was on point. It was made from fresh blueberries, that burst with flavor through every bite while balancing out the sweet and soul elements perfectly.\nFrothy, light and not burnt, the Latte (Rs. 500) had a good blend of coffee and caramel. The caramel flavor was strong but didn't overpower the coffee taste. Even the milk to coffee ratio was really good. It's a good pick-me up on a gloomy weather.\nWalking through the doors of this place was like traveling back in time. Built during the Dutch colonial period, and extensively fortified throughout the British empire, it carries the remarks of both Dutch and British interior designs.\nThe walls of the right wing are made with corals representing the Dutch architectural patterns, while the left one has brick walls that symbolize the British interior designs. They've got a simple, but nice courtyard at the back, which adds a homey vibe to it.\nThe waitstaff at The Bungalow is well trained. They were more than happy to assist us to choose the best food that went with our appetite. With genuine friendliness and smiles all around, they made us feel very welcome. Our waiter was polite, attentive and hovered at a discrete distance and slid right over whenever we needed something.\nThe Bungalow - Galle Fort is an ideal place for a couples getaway, or to spend a  relaxing day or two while backpacking through down south, and even to grab a delicious meal whenever you're in Galle. The alluring seashore of Galle is literally a 5-minute walk from here, and there're a bunch of other historical monuments, shops, and restaurants around, that awaits for the explorer in you.\nAll in all, we had a very pleasant experience at this gorgeous colonial boutique hotel. It is so peaceful out there, and you simply cannot get enough of its comfiness and delicious food.\nSo, if you're keen on having a relaxing escape at the paradisaical down south, away from all the chatter and noise, while enjoying a homelike stay in an exquisite, historic bungalow, this is just the place to be.\nBuilt on the ruins of an elegant family house, The Bungalow - Galle Fort is an exquisite colonial structure dating back to the 1700s.\n\nගෙදර වගේ රිලැක්ස් වෙන්න නියම තැනක්!\n",
  "url": "https://www.yamu.lk/place/the-bungalow-galle-fort/review-220764"
}