{
  "name": "The Dodol House ",
  "address": "317/1, Gemunu Mawatha, Kiribathgoda",
  "telephone": "0771175521",
  "close_time": " Open 9.00AM to 9.00PM",
  "description": "Dodol is a difficult dessert to find easily in Colombo shops - so we were ecstatic to find one that not only makes some but delivers dodol to your home. ",
  "tip": "Call 24 hours in advance. ",
  "review": "The Dodol House is one of two places that we know of that delivers kalu dodol to your doorstep. We wouldn't say theirs is the most classic rendition of the much beloved sweetmeat, but it's definitely tasty with a brilliantly gooey texture.\nIt's not something you hear everyday, but we've been on a bit of a dodol binge lately. We discovered Dodol House around a year ago and we instantly fell in love with their stuff. Earlier this year we discovered\n, which also does a pretty legit job. Pricewise you're looking at a very small difference between the two, with Dodol House charging\n, which includes delivery.\nDH's dodol is very rich with a crustlike outer layer and a glistening, gooey center. In a general sense, the darker the kalu dodol, the better it is (since that usually means it has high quality jaggery), and this is right up there in terms of color. The sweetness of the kithul jaggery is also very distinct with the richness and creaminess coming from the coconut milk.\nThe texture of a kalu dodol is just as important as its flavour and that's the biggest difference between our dodol contenders. Dodol House's stuff has gooey texture, somewhat like a thick muscat. Coupled with the crust, this makes for a beautiful contrast of textures. If you're not into the gooeyness (why wouldn't you be?), you can go for Mune's dodol which is also great with seemingly more coconut milk in it, and a more solid composition.\nWe did, however, notice the fact that the piece we got this time around had less cashews in it, which was slightly disappointing.\nThe Dodol House is still rocking their brilliant Comic-Sans-on-Paint cover photo on\n, which is where you can place your order, either by sending them a message or calling them up on\nThe Dodol House delivers yummy kalu dodol with high quality ingredients right to your doorstep. Need we say more?\nDodol is a Sri Lankan dessert favourite and good dodol is hard to find - we found a place that makes some and also delivers it to your door.\n\nදැන් කළු දොදොල් කන්න කවුරුහරි කතරගම ගිහින් එනකල් ඉන්න ඕන නෑ. කොළඹ දොදොල් හවුස් එකෙන් දැන් රසම රස දොදොල් ගෙදරට ම ගෙනත් දෙනවා.\n",
  "url": "https://www.yamu.lk/place/the-dodol-house/review-96123"
}