{
  "name": "The Sandwich Factory (Colombo 3)",
  "address": "10, Palm Grove, Colombo 3",
  "telephone": "0114333363",
  "close_time": null,
  "description": "Sandwich Factory does a filling take  on western diner favorites.",
  "tip": "Make sure to play one of your favourite 80s classics or any other old song on their digital-jukebox shaped machine for that added diner experience.",
  "review": "Previously located at Wijerama Mawatha, The Sandwich Factory has now moved house to Palm Grove Avenue. They opened up nearly a month ago, if I remember correctly, but they're yet to set themselves up properly. Despite the name, however, TSF doesn't deal purely with sandwiches. They also offer a range of burgers, wraps, fries and drinks.\nIn its earlier location, TSF was popular for its diner-like appearance despite the overpriced sandwiches. While the diner-like appearance is yet to manifest itself in the new outpost—there are a few seats, but they're mostly white—the prices have remained largely unchanged. The staff seem new, but they're very friendly and eager to help out. After taking our order of one serving of chilli cheese fries (Rs. 390), a Philly cheese steak (Rs. 670), a roc shake (Rs. 360), and a Western BBQ burger (Rs. 710), we settled in to wait for our food. The food took just over 20 minutes to arrive. That was quite a wait for diner food, and when it did arrive, we weren't blown away. But wait, let's take this one by one.\nThis is the Roc shake. We're not entirely sure what this drink is made of, except that the main component seems to be chocolate ice cream. It had a few chunks of chocolate, and that tasted good. But the drink was mostly bland, having neither the chocolatey richness nor the sweetness of ice cream.\nNext came the chilli cheese fries — a generous portion of well-salted fries, sprinkled with an equally generous portion of chopped tomatoes, minced meat (you can pick either chicken or beef), and a slice or two of melty cheese.\nWe liked this because of all the flavour in it, although at times (and this is just me nitpicking), the fries got a bit soggy from the tomato juice. It was still quite nice overall though, and we really liked how the minced meat added spice to the whole thing.\nGiven how well the fries were prepared, the Philly cheese steak was a bit of a downer because of how super bland it was. This was definitely lacking salt and oomph. The bread was soft and tasted fresh, but the sub was essentially tasteless and could have used a whole lot more seasoning. On the bright side, the meat was soft, well-cooked, and abundant (but would have tasted loads better with a dash of salt).\nFor nearly 700 bucks, one would expect a larger submarine, or one that is at least well-flavoured. This one was just\nand fell short of expectations.\nThe Western BBQ beef burger was larger and looked way better than the sub. It was quite substantial and presented nicely. In terms of flavour, it wasn't outstanding but definitely fared better than the Philly.\nThe patty and the bun itself were soft and flavoursome. The onion rings, not so much. The burger was filled with a ton of pickles, and I loved that because it spiced up the whole thing and added a very welcome tang. It also came with a side of the same crisp and well-salted fries, minus the toppings. This was quite a good dish, but I'm still not sure if it was worth 700-plus bucks.\nDespite being up and running for some time, TSF still hasn't found its footing. They still seem to be in the middle of decorating and setting up. They've got a nice place—it's spacious and in a pretty good location—but it feels incomplete and in transition. The manager spoke to us and apologized for the state of the place though, and promised that they'd have the interior sorted within the next two or three weeks. I'd suggest you drop in then.\nTSF is a bit pricey. It's not exactly unaffordable, but it's definitely not value for money. Their staff are nice and friendly though, and they seem to have done away with the whole self-service thing, coming up to the table to take your order instead. On top of the already steep prices, they also have service charges and taxes, so you kind of need to watch your wallet.\nIn its new location, The Sandwich Factory continues to serve pricey sandwiches, subs and burgers that aren't exactly value for money.\n\nකලින් කිව්වා වගේම, පිටරටවල්වල දැකගන්න තියෙන ඩයිනර් සංස්කෘතියට නෑකම් කියන අවන්හලක් විදියට සැන්විච් ෆැක්ටරිය හඳුන්වන්න පුළුවන්. කෑම, බීම වර්ගවලින් විතරක් නෙවෙයි, ගෘහ අලංකරණය පැත්තෙන් ගත්තත් ඒ අත්දැකීම පාරිභෝගිකයාට ලැබෙන්න ඔවුන් ඉඩකඩ සලස්වලා තියෙනවා.\n",
  "url": "https://www.yamu.lk/place/the-sandwich-factory-2/review-56557"
}