{
  "name": "Theva Cuisine",
  "address": "Theva Residency Road, Sri Lanka",
  "telephone": "0817388296",
  "close_time": " Open 12PM - 3PM & 7PM - 10PM",
  "description": "Theva Cuisine is of Kandy's few good restaurants. With great breads, excellent dessert and friendly service, it's definitely worth a visit.",
  "tip": "Get a table by reservation only. ",
  "review": "Nestled in the hills of Hantana with a panoramic view of the city, Theva Cuisine is one of the few good restaurants Kandy has to offer. They’ve improved their execution in many aspects with some of the best breads we’ve had and excellent desserts to boot. While their mains have room for refinement, it was a minor caveat in an otherwise complete dining experience.\nDuring our initial visit to Theva Residency back in 2014, Theva Cuisine was still rough around the edges. This time around, however, the management seems to have listened to the feedback and changed things for the better. Their prices are still on the higher end, so expect to pay round Rs. 2500 per head. We tried a bunch of stuff during our stay, so we’ll focus on a few of the most significant dishes.\nBefore we get to the food, I have to give a shoutout to Theva Cuisine’s signature cocktail, Athura (Rs. 850). We ordered it out of curiosity since it said “Award Winning” on the menu, and they weren’t lying. This is one of the best arrack cocktails I’ve had. It’s a peculiar mix of arrack, passion fruit, coconut milk and cardamoms but it works brilliantly. I’m not even a fan of coconut milk, but this creamy concoction was both delicious and adequately boozy with a slight acidity and undertone from the passionfruit.\nOne of our favourite aspects of Theva Cuisine was their breads. They came to the table at just the right temperature, golden brown with a light glaze on the crust and a light and airy center. Their croissants were also some of the best we’ve had with just the slightest sweetness, which complemented their homemade jams (pineapple, marmalade and strawberry).\nTheva Residency, being a boutique hotel, doesn’t have buffets but still manages to offer an impressive variety of dishes across the menu. Our pick of their breakfast selection was the breakfast burrito which came packed with a mix of egg, sausages and bacon. It’s hard to go wrong with bacon and egg and this is no exception. This was a pretty hefty portion, so you could probably skip lunch if you have this for a late breaky.\nWe were also impressed by their starters, particularly their tempura prawns and even the grilled eggplant with feta cheese.\nWe tried quite a few mains, which included their baked fish, stuffed chicken and pork fillet and beef strips. Our favourite of the bunch was the baked fish which was presented sort of like a roulade, cooked and seasoned well. We liked the fact that they threw a local spin on it, served along with a kiri hodi and Olu rice.\nThe meat dishes did well in terms of flavour and seasoning, but we found them to be slightly overcooked. We also feel that they could have an option for locals so that we could opt for a bit of added heat and spice.\nDessert is another area where Theva Cuisine shines. Our favourites were the jaggery panna cotta and the passion fruit cheesecake. We liked the fact that the sweetness came entirely from the jaggery with the cream acting as the base with the berry coulis adding a bit of acidity to cut through the richness.\nThe latter had super tart topping, which was balanced out by the richness of the cream cheese with the passion fruit flavour really coming through well.\nThe look of Theva Cuisine remains mostly unchanged which is perfectly fine by us since it looked great to start with. They’ve got both outdoor and indoor seating, but we definitely recommending sitting on the deck at night overlooking the city lights. Either way you’ll find yourself routinely looking up from your meal to take in the amazing view.\nThe service at Theva Cuisine was stellar. They always had at least two waiters on the floor, so attentiveness was not an issue at all. They’re also very friendly and knowledgeable enough to make some good dish suggestions.\nTheva Cuisine has come a long way in short period of time. Their mains still have a bit of room for improvement, but every other aspect of our experience was on point. So if you don’t mind driving a bit out of Kandy town, Theva Cuisine is definitely worth a visit.\nTheva Cuisine is of Kandy's few good restaurants. With great breads, excellent dessert and friendly service, it's definitely worth a visit.\nWe recently wrote about Theva Residency, a tasteful boutique hotel with windows that look out on Kandy's hills. Their restaurant serves an upscale menu, the food is good (but spiced for tourist palates), and the view is the best part about it.\n",
  "url": "https://www.yamu.lk/place/theva-residency-restaurant/review-94138"
}