{
  "name": "Urban Green",
  "address": "10, Unity Place, Colombo 03",
  "telephone": "0114326105",
  "close_time": null,
  "description": "Nice, cosy café with nice, recycled furniture and a shaded terrace. ",
  "tip": null,
  "review": "Tucked away in a peaceful and verdant parallel street to Duplication Road, only few minutes walk away from Liberty Plaza and Kollupitiya buzz, Urban Green looks very inviting with its wooden upcycled furniture and large shaded terrace. The restaurant/café caters for each and every need of the day and at very reasonable prices, which is pretty rare and much appreciated in this rather exclusive neighbourhood.\nWe dropped by at around 3pm on a lazy Sunday afternoon and were glad to hear that the lunch menu was still available at that time.\nParched after an urban stroll around Kollupitiya under a blazing sun and in great need of a caffeine kick after an eventful weekend, we happily spotted the iced coffee section in the menu and immediately ordered an Iced Cafe Latte (Rs. 420) and an Iced Americano (Rs. 380).\nThe coffee they're using is a mild, light or medium roasted one. The brews are accordingly mild and easy to drink, which isn't unpleasant at all, unless you're feeling really down and need a powerful kick to wake up.\nThe iced latte was milky and mellow with a velvety and rich texture, as I like. The americano was very refreshing and invigorating but lacked a bit of depth.\nUrban Green has widened its selection of food since our last visit and, in addition to short eats, sandwiches and cakes, now serves burgers, rice & curry, fried rice, salads and pastas for lunch and more elaborated mains as well as kottus for dinner.\nThey cook rice & curries for lunch during the week for Rs. 250. They also organise Jaffna nights on Wednesdays and BBQ or Kebab nights on Fridays, which sound pretty cool and affordable.\nThe Fish Bun (Rs. 70), with curry leaves on top, looked very promising in the display case and didn't disappoint. The bread was fresh and soft and the generous filling very fishy (in a good way) and spicy.\nWith a copious Greek Salad (Rs. 400), it made a light and healthy meal or starter for bigger eaters. The salad mainly consisted of iceberg lettuce, cucumber, (a lot of) bell peppers, onions, tomatoes, olives and parmigiano. Not sure the Greeks would approve this twist. We would also have preferred the expected feta cheese, instead but it was still a decent salad that satisfied our need of freshness.\nThe Chicken Fried Rice (Rs. 400) was ordered by a friend of mine, an expert in the subject after years of fried rice tasting throughout the world. And was approved by him. It was nicely eggy and peppery and the considerable amount of fresh veggies added an interesting crunch to the moist rice. The only and quite big drawback was the chicken. It was undercooked in its center and the whole texture was very rubbery. Therefore, we safely left it on the side. It was not a good day to die from salmonella.\nThe Spicy Juicy Chicken Burger (Rs. 450) was more juicy than spicy. The chicken inside was grilled and properly cooked this time. The burger was loaded with bell peppers, which made the dish taste more like a Mexican fajita than an actual burger. The burger came with a small portion of potato wedges, that were well executed and spiced.\nAnd finally, the French Fries (Rs. 250) were thin, nicely crispy and spiced. They disappeared from the plate in no time.\nAll in all, the food was pretty good but not mind blowing.\nUrban Green did a great job in furnishing and decorating the place.\nInside is very cosy and trendy with wooden walls, shelves, tables and Tolix looking chairs. The French window naturally lights up the counter and middle of the room and there's also a darker corner with a comfy looking couch to crash on and read the available newspapers and magazines.\nThe shaded and green terrace is spacious and has the same modern pallet wood upcycling theme going on.\nOn this Sunday afternoon, they were playing ABBA Best Of in the background, which didn't really suit the contemporary look of the place but manage to put us in a festive mood.\nAttentive and efficient. Food and drinks came quickly and the staff was regularly checking on our side to make sure our meal was running smoothly.\nUrban Green dishes out some decent Western and Sri Lankan dishes and coffees at a fair price and in a cosy and laid back atmosphere.\nCafé that shuts out the hustling of Colombo while being in Colombo.\nColombo's latest cafe that shuts out the hustling of Colombo while being in Colombo.\n\nඅර්බන් ග්‍රීන් කියන්නේ කොළඹ තියෙන කැෆේ සංස්කෘතියට මීට අවුරුද්දකට හමාරකට වගේ කලින් එකතු වුණු තවත් තැනක්. පර්ස් එකට ලොකු ගාණක් තට්ටු නොවෙන විදියට, හොඳ කෑම වේලක් ගන්න පුළුවන් විදියේ තැනක් විදියට අපේ කීපදෙනෙක් ම මේකට රෙකමදාරුවක් දීලා තිබුණා.\n",
  "url": "https://www.yamu.lk/place/urban-green/review-207813"
}