{
  "name": "VOC Cafe (Dutch Burgher Union) ",
  "address": "114 Reid Avenue  Colombo 4",
  "telephone": "0112584511",
  "close_time": " Open 11 AM to 11 PM everyday ",
  "description": "The VOC is a one of the best places in the city to get lamprais, and we've heard their burgers are pretty good too. ",
  "tip": "Head there early before 1 PM",
  "review": "The DBU is a calm, balmy place removed from the stress and traffic of everyday Colombo. The staff are so chilled, they took 40 minutes to execute our take-away order a couple of weeks ago. That was once-upon-a-recent-time though, so we dropped in for lunch recently and sampled some nice iced-coffee and yellow rice.\nIf it's a sweltering hot day, there's an airconditioned indoor seating area. For nice, breezy days, you get terraced outdoor areas, which are so removed from the hustle and bustle of Colombo that it's hard to believe you're smackdab in the middle of the city. The main building is a gorgeous old structure, high ceilings, wood panelling and all.\nTheir food isn't half bad either, with their Yellow Rice (Rs. 525) being my favourite — it's fragrant, beautifully presented, and has a few complementing curries going on.\nThey've got a cutlet (pretty sure it's a cutlet and not a frikkadel) and a killer pol-sambol and\n. The rice is topped off with a bit of mango chutney if you'd like a tang of acidic sweetness, and it's as good as a home-made meal you'll ever get. This set is a winner, and we love it.\nSadly, the standards of their Lamprais (Rs. 545) seem to have gone down, starting right with its appearance. Size has diminished slightly, but that's not as much of a let down as the quality itself. The rice has a slightly hardened undercooked quality to it, and the meat in the mixed meat option were pretty lacklustre and lacking definitive flavour. It's still an alright, standard lamprais, but at Rs. 545 you're not going to feel like you got your money's worth.\nNext up was the beef burger, reasonably priced at 350 bucks. Getting this was a chore, though. Indi had tried ordering it the day before, but they forgot about it. Likewise, we placed this as a take-away order and realized it wasn't ready when we were ready to leave about an hour later. The aunties behind the counter held a hurried meeting, and then told us that the burger wasn't there....\non the bright side, they'd only mixed the order up and made something else instead. So could we please wait a few minutes until they re-made our order?\nWe walked out with the food 20 minutes later. As Kinita said, they're rather an anti-burger union where this is concerned.\nMeanwhile, Indi had this to say about it:\n\nTheir iced-coffee and mango juice (Rs. 125 and Rs. 250 respectively) were alright, with the iced-coffee having that classic Milkmaid taste to it. The juice was well done, not too sweet, with lots of thick swirly mango going on.\nTheir service deserves a shoutout because it's like a trial of endurance, patience, and strength, really. You could say it's quaint, if you've literally nothing else to do and don't mind repeating your order five times and smiling sweetly while you're at it. It's quite literally like the\nPlacing our burger order was like thus:\nKinita: I'd also like a beef burger please, for take away.\nStaff:  A what?\nK: Beef burger.\nS: Eating here or take away?\nK: Erm, take away please.\nS: A burger?\nK: ... yes.\nS: What burger?\nK: Beef! A beef burger for take-away!\n\naaaand they\ngot it wrong.\nGood burgers and yellow rice, but the standard of their lamprais has gone down which is sad because it used to be one of our favourites. The service may drive you up the wall, but should be okay for an aunty party where everyone would ask and be okay with a hundred questions anyway.\nA lovely colonial building in the heart of Colombo, serving up good Dutch Burgher fare.\nVOC at the Dutch Burgher Union is one of the best places in the city for a delicious packet of lamprais, and we've heard their burgers are good too.\nWe love the DBU. A beautiful clubhouse, an excellent bar and though there are consistency issues on its day their lamprais is the best in the city.\r\nSo when we heard that our favorite ethnicity based drinking/sporting union had opened a restaurant open to all (ie non members) on its premises we were excited.\n\nඉතින් මම අද ඔයාලට කියන්න යන්නෙ ඕලන්ද රාජ්‍ය කාලෙන් පස්සෙ ඒ කියන්නෙ 1906 දි විතර ඕලන්ද ජාතික (බර්ගර්) එකමුතුවෙ කට්ටිය හදපු ගොඩනැගිල්ලක තියෙන ඕලන්ද කෑම වර්ග ගොඩක් රස බලන්න පුළුවන් ලාංකික අවන්හලක් ගැන.\n\nලන්දේසි බර්ගර් සමාජය අපි කැමති තැනක්. එය ලස්සන සමාජශාලාවක් තිබෙනවා. හැමදාම එකවගේ නොවුණත්, ඔවුන්ගේ ලෑම්ප්රයිස් තමයි නගරයේ හොඳම ඒවා.  ඉතින් මේ ජනවාර්ගික සමාජශාලාවේ සාමාජිකයන්ට පමණක් නොවෙයි කාටත් විවෘත අවන්හලක් ආරම්භ කර ඇතිබව ඇසූවිට අපි ගොඩක් සතුටුවුණා.\n",
  "url": "https://www.yamu.lk/place/voc-cafe-at-the-dbu/review-100776"
}