{
  "name": "Waves",
  "address": "58/6 Fairline Road, Dehiwela",
  "telephone": "0112716108",
  "close_time": " Open until 11:00 PM",
  "description": "Waves is so good I’d rather it be a secluded seafood jewel tucked at the bottom of Fairline road. The portion are generous and the fares are reasonable.",
  "tip": "I’d avoid lunchtime though-\nAnd spilling chicken on the floor-\nEvermore.\n",
  "review": "Is Waves the Shangri-La of Seafood and Chinese food places in Sri Lanka? Not quite, but it’s a strong contender nevertheless. My quest to seek this hidden jewel was, if at all, the only annoying part, save the crows. With a fleet of mostly great dishes, pretty friendly staff, and a great location Waves sweeps away most of its competition in a single swift torrent.\nWaves is tucked near the Dehiwela end of the Mount Lavinia-Dehiwela beach (roughly at the bottom of Fairline Road, which is quite the journey). It’s excellent; you get the open-air beach experience in an environment that is quiet, and cleaner than the overly active Mount-Lavinian side of the beach. It’s just passed the train tracks and towards your right. Because of the distance from the main road I would recommend going with a guest because the road and area nearby gets very empty.\nMy first reaction when I trekked it near the train tracks was – “please don’t let this be waves.” The entrance gives no indication that the white, wooden entrance is in fact, Waves. The building looks a little run down, and being a place for (I assume) primarily dinner it was empty when I arrived.\nThe staff were friendly, although lacking the sort of professionalism you’d see at Loon Tao. They did take about half an hour for my dish, which I guess is understandable given that I saw the guy who took my order in the kitchen cooking it. (?)  They might need more afternoon staff, I can’t really blame the cook.\nOnce upon a review dreary\nhead to four-star stardom\n",
  "url": "https://www.yamu.lk/place/waves/review-49279"
}