{
  "name": "Asylum",
  "address": "30, Arcade Independence Square, Colombo 07",
  "telephone": "0114061761",
  "close_time": " Open 11.00 am - 11.00 pm",
  "description": "Three years after opening Asylum has upped its food and service game",
  "tip": null,
  "review": "It's been more than three years since Asylum opened, and at the time we rated it as rather mediocre. Since then we've heard great things about the food, and so went in to see if the fare had improved.\nTL;DR: the food has vastly improved.\nThe Mediterranean Chicken Salad (Rs. 800) came first.\nThe chicken was interestingly prepared, in two big pieces instead of being cut up into little ones. it was definitely juicier as a result, which we really liked. The salad leaves were fresh and sun-dried tomatoes are always a nice touch.\nNext up, the Barramundi (Rs. 1900) was dee-vine. The jalapeño sauce gave it a subtle, tangy dose of spice. The tahini and chick peas added texture to the soft fish. The color scheme in the presentation made me want to go nuts on my Instagram feed with it, but I resisted.\nI looved the Chimichuri Lamb Ribs (Rs. 3100), but yes it was also a tad on the fatty side. I love fatty lamb though, maybe you don't. It came with risotto, which was good too. Not too creamy. Clever move, holding back on the grease, this is all too often not the case. The vegetables were not too soft, not too hard. Perfect texture.\nThe Coconut Lime Cheesecake (Rs. 900) was, and perhaps you're sensing a theme here, really good. The mango sauce perfectly complemented the bite of the lime, and the coconut rode in as aftertaste. The only disappointing thing was the strawberry. This dish didn’t need more sour, some sweet berries would have been much better.\nThe ambience doesn’t excite you, but it has a subdued charm, really private and secluded. And the AC is on maxxa chill, making it cold inside on a hot Colombo day. We almost found ourselves wishing for sweaters.\nNot bad but could be better. We weren't offered any water, and our plates were taken away before we could completely finish licking the barramundi off them. I mean who does that?\nWe tried a perfectly chilled Prosecco (Rs. 1050), which was honestly the best Prosecco I've ever had. The color reminded me of the sunset that time I was driving my Alfa Romeo Spider in the North of Italy. Besides that we didn't try any of the drinks. But\nlast time, and from what we can gather they are still quite good.\nAsylum has seriously upped its food game, though some service quirks still need to be fixed. Definitely look to spend around 7k for two people, more if you're having drinks.\nWe went back after three years to find out if Asylum has upped its food game. It has.\nAsylum is the new the bar/restaurant at the Arcade Independence Square. They've got good drinks, great ambience and decent food, but their service is still not quite up to scratch, so go with time to spare.\n",
  "url": "https://www.yamu.lk/place/asylum/review-211384"
}