{
  "name": "Banana Leaf",
  "address": "720 Galle Road, Colombo 3",
  "telephone": "0755500001",
  "close_time": " Open 11 AM to 3.30 PM, 6 PM to 9.30 PM ",
  "description": "They do chicken biryani pretty darn good and now have crab and lamb on the menu.",
  "tip": "Try the canonical 'chicken biriyani' - not really a biriyani, but still excellent. All food is served on a banana leaf. ",
  "review": "New Banana Leaf is a restaurant that specializes in a localized Chinese Biriyani that's pretty solid. The moment you enter the place, you get the smell of their tandoori chicken that just won't let you be. We resisted the temptation and tried their new offerings of crab and lamb for dinner.\nYou can order biriyani, be it chicken, lamb, mutton or crab, or just get your biryani rice on its own. We went that route, and it only cost Rs 120 for a single portion of biriyani rice and it was plenty. For curries, we ordered crab (Rs 350), mutton (Rs 450) and lamb (Rs 500). They also gave us an onion sambol and masi sambol at Rs 80 each. The biriyani rice itself was good, though they use a small samba grain as opposed to basmati. The rice is super soft and light, which is great.\nFirst off, the lamb was pretty good. We got just two pieces for Rs 500, but they were quite flavourful and cooked till they were soft. The curry came with caramelized onions that lent a lovely sweetness to the dish.\nThe mutton wasn't spectacular. The gravy was your typical salty, heavy on pepper affair. It didn't really help the fatty taste of the mutton come through, and the mutton itself was still a bit tough. We got two big chunks, though, so you get more meat than with the lamb.\nFor Rs 350, we got a whole crab in a wonderful crab curry. It was a proper Sri Lankan crab curry, not too spicy but plenty flavourful. It's not a big crab, by any means, about the same size as what you'd get at Yarl. Worth it.\nWe're not big on the garish green colour that surrounds you in this place. Service is pretty prompt. They get you a cold, wet towel as you take your seat, and set out your banana leaf before the food gets to the table.\nIf you're in Colpetty and want an affordable biriyani, New Banana Leaf is a good option. They close at 9.30PM  though, so they're not a great dinner option unless you're getting take out. Check them out for lunch sometime.\nGood biriyani with crab and lamb options. They close early at night, so best stop by for lunch.\nThe New Banana Leaf isn't all that \"new\" anymore, but their chicken biryani is still pretty darn good. It's got some local influence to it, but most of it works quite well.\nBanana Leaf is back. Those golden grains ensconced in thick, emerald palms, the hefty hunks of masala-smothered chicken, the crispy deep-fried boiled egg...this was one of my - and perhaps even Colombo's - favourite Sunday lunchtime repasts.\n\nපංකාදු පහයි!. මට්න් නම් අන්න මට්න් ඈ… ඒ කරියට එයාලා කියන්නෙ පෙපර් මට්න් කියල. මම හිතන්නෙ ඒ නිසාම වෙන්න ඕන හොඳ සැර ගතියකුත් තියෙනව. පාන්, පරාටා  කන්න කියාපු.\n\nඒ වුනාට මෙතන එහෙම නෑ. බිරියානි බත් එක වෙනම බිත්තරේ වෙනම සලාද, ග්‍රීන් පීස් ව්‍යංජනය, උම්බලකඩ සම්බෝල වෙනම. රයිස් ඇන්ඩ් කරි එකත් එහෙමයි. බත් වෙනම එළවළු වෙනම හරිම පිළිවෙලයි. හිතේ හැටියට බෙදාගෙන කන්න පුළුවන්. අනික ව්‍යංජන ජාති බෙදා හදා ගන්නත් පුළුවන්.\n\nබනානා ලීෆ් ආපසු ඇවිල්ලා. මෙහි මසාලා ක්‍රමයට පිසින ලද චිකන් කුට්ටි, ගැඹුරු තෙලේ බදින ලද තැම්බූ බිත්තර ආදිය සමග බුරියානි ඉස්සර මගේ ප්‍රියතම ආහාරයක්. මගේ විතරක් නෙවෙයි, බොහෝ කොළඹ වැසියන්ගේ ප්‍රියතම ඉරිදා දිවා භෝජනය තමයි, එය.\n",
  "url": "https://www.yamu.lk/place/new-banana-leaf/review-96949"
}