{
  "name": "Beehive by RnR",
  "address": "Racecourse Complex, Philip Gunewardena Mawatha, Colombo 07",
  "telephone": "0778360033",
  "close_time": null,
  "description": "Beehive by RnR is a restaurant anchored at the Racecourse complex with one of the most unique interiors.",
  "tip": "You can take your booze without corkage, boozehounds!",
  "review": "Beehive by RnR is one of the few restaurants that takes its name really seriously - probably more seriously than everything else that needs more serious attention. As it is, they have no licence, so will rather insistently remind you to bring your own booze.\n\nThe menu is pretty much similar to what you would expect at most cafes and pub-style restaurants. You get a range of pastas, burgers and some classics like Fish and Chips.\nWe opted for two classics - a portion of Fish and Chips (Rs 600++) and Hot Butter Cuttlefish with Chips (Rs 700++).\nI was expecting 2 huge fillets of batter fried fish, but received a few medium-sized pieces of batter fried fish instead. No complaints about the amount of fish, though. The taste, however, didn't blow me away. It was alright. It lacked salt and seasoning. It was something I would eat if I were dying, but wouldn't bother ordering again.\nThe Hot Butter Cuttlefish didn't look like the picture I had drawn in my mind. I expected to see little lotuses of golden fried cuttlefish, but saw strings of very lazily fried cuttlefish among stir-fried leeks. It seemed as if the chef remembered about the saltlessness in the Fish and Chips when making my cuttlefish, so decided to double the dose in this. The cuttlefish was pretty darn salty. This dish, like the Fish and Chips, was just okay as it was super salty without much spice.\nThe french fries that were served with both dishes, on the other hand, were very well fried. Most restaurants tend to either overfry these heavenly strips of potato or underfry them, but these had the right amount of crunch and right amount of potato. They were also seasoned with salt and chilli powder. So, +1 on that. If you want to know who does the best French fries,\n.\n\nDisclaimer: this may sound like a rant.\nService felt like though the staff didn't really care about the patrons.\nThe ambience, in contrast to the we-don't-care-about-who-comes service, was on the other end of the spectrum. Beehive by RnR is one of those few restaurants that lives up to its literal meaning.\nThe stairway is ornamented with jars filled with a golden glaze to look like honey and the downstair seating has partitions made of honeycomb structures. These two were the highlight of the restaurant. To see a place take their name so literally is amazing!\nWhile the upstair seating isn't beehive-y, it's got a good view of the racecourse and there's a rack that has got a variety of indoor games - great if you are planning on drunk-quarelling with your friends over monopoly. There's a pool table too. So, Beehive is also a gamehive.\nIn conclusion, the food was mediocre, the service was bad, but the restaurant's physical attributes were appealing, if not a bit strange.\nIt's definitely one of those places to head to when you have a bottle of whiskey lying around but none of your friends' mothers would entertain your hooligan-y and tipsy bunch of friends.\n",
  "url": "https://www.yamu.lk/place/beehive-by-rnr/review-124225"
}