{
  "name": "Cafe Chill",
  "address": "Wellawaya Road, Ella",
  "telephone": "771804020",
  "close_time": " Open Mon - Sun, 10 AM to 10 PM",
  "description": "This is truly a chill spot with beanbags, good food, decent WiFi and really smart and friendly staff.",
  "tip": "This place gets super crowded at night. Go early.",
  "review": "Cafe Chill, as the name implies, is pretty chill. It's situated in cool, beautiful and increasingly hip Ella, right on the main strip. The food is quite good but it's the vibe of the place and the staff that makes the difference.\nFrom the main road Chill Cafe actually doesn't look like much, but walk in and there's a big dining area surrounded by green. If you go up the stairs there's an even more deeply chilled area with bean bags, overlooking the street. There were people relaxing there and we didn't want to take photos. It's a nice comfortable and quirky place to dine, or have a drink.\nChill Cafe is famous for their lamprais and rice and curry, which we recommend. On this trip, however, we tried western fare. I had the beef burger, which was well cooked and generous with the toppings.\nWe also tried the chicken schnitzel which was also pretty good. Food in Ella in general is nice and Chill Cafe is no exception. Apologies for not have the prices this time. Our bill for two people with beer was about 2,500. Speaking of, this is also a nice place to grab a drink.\nNote that the pizza here is quite popular, if you're in the mood.\nMore than anything it's the service that sets this place apart. I haven't been to Ella in years but our waiter (Vidal) remembered me and knew some people in common. He was just a really cool guy and as a waiter quite professional. When he noticed that the beer he brought was a bit flat he just replaced it outright, and he was able to guide us through the menu quite competently.\nElla has become part of the Hikkaduwa/Unawatuna/Arugam Bay circuit and you get a quite experienced calibre of service professional sort of rotating through, depending on season.\nElla is a magical place and the town has evolved some excellent dining and hanging out options. Chill Cafe is one of them, the food and drink are good and the service is excellent. Highly recommended.\nCafe Chill, as the name implies, is pretty chill. It's situated in cool, beautiful and increasingly hip Ella, right on the main strip. The food is quite good but it's the vibe of the place and the staff that makes the difference.\n\nඇල්ල කියන්නෙ හරිම කූල් පැත්තක්. මම කියන්නෙ මෙහේ තියෙන සීතල දේශගුණේ ගැන ම නෙවෙයි.\n",
  "url": "https://www.yamu.lk/place/cafe-chill/review-49158"
}