{
  "name": "Café by Boo",
  "address": "No 23, Sri Soratha Mawatha, Gangodawila, Nugegoda.",
  "telephone": "0115667700",
  "close_time": null,
  "description": "A little gem hidden between street joints, serving cheesy kottu and delicious pasta for affordable prices. ",
  "tip": "Cheesy Chicken Kottu FTW! They don't take cards so, bring out the cash.",
  "review": "Thanks to a suggestion by one of my friends at University of Jayawardenapura, we dropped in for an early dinner at Café by Boo. It's a gem on Sri Soratha Mawatha among your normal street joints, serving one of the best cheese kottus I have had in a while.\nWe started off with their most popular dish, the Cheese Chicken Kottu (Rs.500). Easily enough for two people, the Kottu was filled with cheesy goodness, a generous portion of crispy chicken slices, a side of fried\n(yes you read it right) and coleslaw. It tastes just as good as it looks, maybe even more. The Kottu was incredibly creamy and moist so it was probably boiled with milk at one point. The\nwas a great addition, spiking up the flavours and giving the dish a tinge of sweetness. The chicken was tender and cooked well with a crispy coating. So good!\nThe Veggie Cheese Macaroni (Rs. 380) was perfect for vegetarians. The pasta was cooked perfectly but the texture was a bit off because the milk had not soaked through and you could still see it on the sides. Still, it was delicious.\nWe also tried the Garlic Rice with Hot Butter Cuttlefish (Rs. 480). Sadly, the rice was way undercooked so we couldn't finish it, and the cuttlefish too was a bit hard to chew on. It was perfectly marinated though and it would have tasted amazing if the two elements were cooked well.\nService was quick and efficient. They don't take cards so make sure you have enough cash for a second round too because believe me, you're going to need it. The food arrived warm and the presentation was superb. My Instagram was happy.\nThe place is quite small but I loved the wooden tables and benches. As we ate, we realised that a lot of people come here for takeaway which is probably the best idea because they can never guarantee enough seating. The place is fully air-conditioned so don't worry about it getting stuffy.\nThis is definitely going on my list. It's a great place for Uni students and it's worth the trip even if you live far away. They also have wraps, shawarma, submarines, burgers and by judging from what we had, I doubt they would disappoint.\nProbably the best cheese kottu in Nugegoda!\n\nලොකු ගාණක් අතේ නැතත්, රස කෑම වේලකින් හිතේ හැටියට බඩ පුරවගන්න ගැලපෙන තැනක් විදියට මේ Cafe by Boo එක හඳුන්වන්න පුළුවන්.\n",
  "url": "https://www.yamu.lk/place/cafe-by-boo/review-184390"
}