{
  "name": "Chana's",
  "address": "50, W.A. Silva Mawatha, Colombo 06",
  "telephone": "0113288788",
  "close_time": " Open 11.00 am - 11.00 pm",
  "description": "Chana's has been gaining popularity for sometime now and it's easy to see why. They do a pretty good take on North Indian cuisine and their biriyani is one of the best in town.",
  "tip": "Their Puris and Tandoori dishes are available after 5pm. They've got prawn and fish biriyani are not on the menu so you'll hav.e to ask the cashier about it",
  "review": "Chana's is a little restaurant in Wellawatte that seves up some of Colombo's best biriyani. They focus on North Indian cuisine, and do a decent job at it. The place is pretty small, so it's not the greatest dine-in experience. If you're looking for delivery or take-away, then they are a better bet. We dropped in for lunch.\nIf you go at lunch time, you can't get the naan, which is a bummer, but all the rice based dishes are available. We tried the Tandoori Chicken Biriyani (Rs 580). It was pretty good, but the rice was quite dry. Also, the chicken was just a tad undercooked, with the meat at the bone was still a little raw. This might have just been a bad day, as it's otherwise one of the best biriyanis in town.\n\nYou can get Chapati (Rs 45) for lunch, which is good news for those of you who don't like to load up on the starchy carbs of the rice-based options.\nWe tried the chapati with Paneer Butter Masala (Rs 480) and it was delish. It had just the right amount of tanginess to it, and a lovely, creamy spicy gravy. The paneer was just soft enough and there was plenty for two.\nThe Mutton Roganjosh (Rs 730) was pretty good. It's basically cooked in fat. The dish is typically meant to be made with lamb, but mutton works too. What I didn't care for were the boney pieces of meat that are a pain to eat. The curry is super spicy and fatty, which would go well with some naan.\nChana's is such a tiny place that it's not a dine-in experience by any stretch of the imagination. Inside they can accommodate only around 10 people comfortably.\nThey do set up tables outside when necessary, which can accommodate another 7. Service is fairly prompt.\nChana's is still a fairly reliable spot for an affordable North Indian meal. They do delivery and take-away. Our biriyani was a little disappointing this time around, but that's because we expect a lot from them. Their curries are still on point, though. They are best visited after 6PM if you want to be able to order from their whole menu.\nChana's is still a fairly reliable spot for an affordable North Indian meal.\nChana's has been gaining popularity for sometime now and it's easy to see why. They do a pretty good take on North Indian cuisine and their biriyani is one of the best in town.\n\nආයේ කතා දෙකක් නෑ ඉතින්, මෙතුවක් කාලෙකට කඩේකින් කාලා තියෙන හොඳ ම බිරියානි එක තමයි මේ!\n",
  "url": "https://www.yamu.lk/place/chanas/review-107749"
}