{
  "name": "Chola Authentic Indian Restaurant",
  "address": "37, Lily Avenue, Colombo 6.",
  "telephone": "0114363118",
  "close_time": null,
  "description": "Chola is a new Indian Restaurant serving some of the best Indian we have tried.",
  "tip": "Best combo; Paneer Butter Masala and Butter Kulcha! ",
  "review": "Chola, on Lily Avenue, serves some delicious, authentic Indian cuisine. Once you pass Rio Ice Cream on Marine Drive, take the next turn on your left.\nThey serve North Indian, South Indian, Chettinad, Mughalai, and Chaat Dishes. The menu is very informative; they have pictured what each dish looks like next to the name. You might find the prices a bit expensive, but the portions are enough for two people so there's really not much of a difference.\nWe started off with some Butter Kulcha (Rs. 250). We were sold from the very first bite. It was superb! It was perfectly cooked and seasoned. It was crunchy out on the outside and soft in the middle with a mild buttery taste. The sesame seeds were an additional treat. Each portion comes with two kulchas, and one is more than enough for a person if you combine it with a curry.\nThe Cheese Chili Naan (Rs. 325) was decent, with a good amount of chopped chili pepper and it wasn't doughy which we liked.\nWe also got a Paneer Butter Masala (Rs. 800) to go with the naan. By far, one of the best we have tried. The gravy was thick with distinct spices and seasoning, along with a hint of sweetness which made everything much better. The paneer was well cooked and more than enough to share among two to three people. Of course, it is on the pricier side, but the portions are quite large and the quality of the food is undeniable. We highly recommend you try this.\nThe Chicken Tikka Biriyani (Rs. 850) was delicious with that strong masala taste. The basmati rice was well cooked and seasoned with all the right flavors. There was a lot of chicken bits underneath the rice. This again was very filling and enough for two people, although it might look small.\nThey have fruit juices, milkshakes, tea and filter coffee.\nThe Watermelon Juice (Rs. 250) was refreshing and naturally sweet. It had a thick texture and a strong watermelon taste. It was a great drink to sip on while you wait for your food.\nThe food took a long time to arrive which was the only thing we have to complain about, especially considering we were the only two people there. The staff, on the other hand, is accommodating and very friendly.\nThe place seems like a bungalow flipped into a restaurant. The atmosphere is calm with appropriate mood music going on. It's very spacious and can hold roughly about 50 people at a time. There are seatings outside, as well as another room a little smaller to the one pictured above.\nWe like Chola a lot. You might find the prices expensive but most of these dishes can be shared among two people. Not to mention the quality and quantity of the food. We got to know that there are Indian chefs preparing the food, which explained the authenticity. Don't forget to try the paneer butter masala.\nA new Indian restaurant serving delicious paneer butter masala and kulchas.\nLocated in a beautiful old bungalow in Wellawatte, great ambience and service does little to compensate for over priced, rather mediocre food.\n\nචෝල එකේ කෑම හැදෙන්නේ ඉන්දියානු ජාතික චෙෆ්ලා අතින්. ඒ නිසා මේවයේ ඔතෙන්ටික් ගතිය ගැන කිසිම සැකයක් තියාගන්න ඕනේ වෙන්නේ නැහැ.\n",
  "url": "https://www.yamu.lk/place/chola-authentic-indian-restaurant/review-213654"
}