{
  "name": "Coco Veranda (Crescat Boulevard)",
  "address": "G-09, Crescat Boulevard, Galle Road, Colombo 03",
  "telephone": "0112445235",
  "close_time": " Open 9AM–9PM",
  "description": "Coco V at Crescat offers the same stuff as the Coco V at Ward Place, but the ambience isn't as chilled out as the other. Their signatures are coffees and cakes.",
  "tip": "Their Chocolate Mint Blend is commendable. Expensive, but good.",
  "review": "The Coco Veranda at Crescat offers the same stuff as its mother-branch at Ward Place, but in a less chillaxed, more congested setting. Their outdoor area is spacious enough though, so you can sit out if you're claustophobic.\nFood at Coco is generally consistent albeit overpriced. We went for waffles with caramelised bananas (Rs. 540), a slice of passionfruit cheesecake (Rs. 470), a slice of carrot cake (Rs. 320), and a slice of Death by Chocolate (Rs. 440). To top it off, we also ordered a cuppa of Americano (Rs. 430) and a Chocolate Mint Shake (Rs. 650).\nThe waffles with caramalised bananas were waffles with sliced bananas with a drizzle of caramel syrup. This isn't exactly what the definition of 'caramalised'\n, and that's slightly disappointing. The waffles were okay, I suppose. The banana topping was of a generous quantity, but the caramel syrup didn't honestly add much flavour, being rather watery in both consistency and taste (or the lack of thereof).\nEch. It should probably be re-named.\nWe tried the carrot cake, passion fruit cheesecake, and DBC (Death by Chocolate) next. The carrot cake (pic's right  up there ^ ) had a rather dense texture, but was moist and soft, despite its weight. I liked the passion fruit cheesecake of the whole lot because of the tangy, tart flavour of the passion fruit topping and how it contrasted with the cream cheese. It's biscuit base wasn't all that great though, also being a bit too dense for my liking.\nOooh, and the passion fruit cheesecake (pictured above) had a bit of a crunch in it as well, from the pips, I think. This can be weird, but it's not unpleasant, and I liked it. It added to the whole passion fruit experience.\nThe DBC is a general favourite but it sadly disappointed this time because (whilst the chocolate sauce/ topping on it was great as always) the cake in itself was dry. This is about the second or third time I've come across dry DBC at this outlet, so it seems to be a recurring occurence. Pity about that, because it's a fabulous cake otherwise.\nMoving onto the drinks next.\nWe didn't have anything to pick on in these, because they were pretty good. The Americano was bitter and strong, and could possibly jerk you awake on a sleepy morning. The chocolate mint drink has been better (I've had a better one at their Ward Place branch) but it was still refreshing nonetheless. It was quite creamy and filling, with the mint adding a refreshing kick to what would seem like an average chocolate milkshake. At nearly seven hundred bucks, I don't think it quite justifies the price though.\nThe service here is alright. Staff are friendly and accomodate requests (like halving our orders and packing the rest up) without any fuss, so that's nice. They seem a bit slow and new-to-the-job though, so perhaps that could be improved.\nInside, the space is minimal. Six people would easily be a crowd, but they've utilized whatever space they have quite well. There are also these green-cushioned bar-stools lining one end of the wall. The paint (a deep pink) reminds one of Madame Umbridge and her obsession with everything pink and frilly. The outdoor seating area has more space, but also has a clinical and sterile look to it.\nThe drinks are pretty decent. Don't try the waffles. Also, they have this multi-layered chocolate and coffee concoction (also nearly seven hundred bucks) called the Seventh Heaven which could knock you out if you want a food coma and sugar rush.\n",
  "url": "https://www.yamu.lk/place/coco-veranda-crescat/review-58689"
}