{
  "name": "CP's Grill",
  "address": "211D, Stanley Thilakarathne Mawatha, Nugegoda",
  "telephone": "0115883882",
  "close_time": null,
  "description": "CP's Grill at Nugegoda does some delicious grilled and non-grilled dishes for a decent price tag. We loved their Cheese Kottu.",
  "tip": "Chicken Cheese Kottu here is the bomb!",
  "review": "While exploring the busy streets of Nugegoda, we stumbled upon this charming street restaurant, CP's Grill. Located right behind the Niromi building at Stanley Thilakaratne Mawatha, it's a popular spot among the tuition kids, shoppers and working crowd.\nCP’s Grill is mainly focused on grilled food, but other than that, they also dishes out a range of non-grilled items such as pasta, kottu, pizza, biriyani, etc.\nWe started off with a plate of BBQ Wings (Rs. 300). Firm on the outside, juicy on the inside, this is a superb dish that well-serves its name. Despite being drenched with sweet barbeque sauce, the wings had this slight crispiness that we liked. The meat was tender and fell off the bone. This came with a side of coleslaw, made from fresh veggies mixed with some good old mayo.\nAs for our mains, we ordered a Chicken Cheese Kottu (Rs. 450) and a Roasted Pork Pizza (Rs. 550) from their tortilla pizza range.\nThe chicken cheese kottu is the biggest seller here and the first bite made us realize why. It had an incredibly creamy texture as it was smothered with cheese and chunks of roasted chicken tossed in a generous serving of\n. The chicken was roasted to its perfection and had this rich reddish coloured touch to its outside. So good!\nThe roasted pork pizza was about the size of a medium pizza at\n, but had a really thin crust. The crust itself was tad over-cooked, but we didn’t mind as it had plenty of chewy roasted pork dispersed evenly throughout the pizza. Topped off with bell pepper and onions, this pizza had a nice spicy kick to it. We’d prefer more cheese on this though.\nIt wasn’t good as the pizzas you could get at popular\nor\n(obviously), but still worth the price.\nWe were excited to try the Peach Iced Tea on their menu, but as it wasn’t available, we opted for a Lime Juice (Rs. 200). It wasn’t refreshing as we thought it'd be, but had a proper balance between the sweet and sour elements.\nThis is not your average street joint. The neat wooden chairs on the tiled floor, the decorated walls and the bright yellowish background add a nice vibe to the place. It's spacious enough to accomodate around 15 customers at a time.\nThey get pretty packed during peak hours, so the arrival of food could take some time. Ours took around 20 minutes, but believe me; it's so worth the wait.\nCP's Grill is a hidden gem of a street restaurant. They've got great food and almost every item on their menu is less than Rs. 700, which makes it the perfect place to grab a bite when you're on a budget. I'd certainly drop by again for some of that delicious chicken cheese kottu.\nCP's Grill in Nugegoda does some delicious grilled and non-grilled dishes for a decent price tag.\n\nසීපී’ස් ග්‍රිල් එකේ මෙනුවේ තියෙන හුඟක් කෑම රු.700ට අඩුයි. ඒ නිසා අඩු බජට් එකක ඉන්න වෙලාවක යන්න පුළුවන් නියම ම තැනක් තමයි මේ.\n",
  "url": "https://www.yamu.lk/place/cps-grill/review-206363"
}