{
  "name": "Currymuch",
  "address": "57/2 Braybrooke Place, Colombo 2",
  "telephone": "0115975975",
  "close_time": null,
  "description": "If you're working around Slave Island or Fort, Curry Much does a decent buth packet with better packaging.",
  "tip": "They also serve breakfast. Not open for dinner.",
  "review": "Currymuch on Braybrooke Street is a very cosy place to sit and eat your daily dose of\n. The prices haven't changed and the quality of the food has not wavered.\nThe location is right down Braybrooke Street before turning to Muttiah Road. It gets very crowded during the lunch rush with all the office crowd bustling in, so unless you're planning on getting take out we suggest you go a bit early.\nIt turns out we went a little too early (around 11 AM), because they were still preparing the food so most of the lunch options weren't available at that moment. They usually have fried rice, rice and curry and garlic rice. You get your own choice of curries.\nThe Red Rice with Egg (Rs. 230) was a big portion of rice with devilled soya, dhal curry,\ncurry,\nand a brinjal curry. The soya and\nespecially were delicious and spicy. The soya was a bit overcooked but I prefer it that way. The rest of the curries could have been spicier.\nWe also tried the Garlic Rice with Prawns (Rs. 270) which was a much better choice. The prawn curry was such a delight. The gravy was very milky and spicy and I would have just eaten it on its own. The prawns were cooked perfectly and the texture was soft enough that it's easy to bite into. The fried bitter gourd was my favourite. I love a good bitterness to spike the flavours of a rice and curry. The garlic rice was more of a fried white rice and didn't really have the strong garlic flavour you would expect.\nWe also got two Narang Juices (Rs. 100 each) and they were quite flavorful with enough tang and sweetness.\nTheir service is efficient as it can possibly be considering the number of customers they get. There were about 4 people handling the food and service and they're all very friendly and accommodating.\nThe place has gotten a lot better with the new interior. The funny quotes along with the wooden tables and stools are a great addition to something that was once just a normal street joint.\nAlthough the food has not dramatically changed in terms of quality, the ambience has. It has actually brightened up the place so that anyone who wants to sit and eat can do so now. If you're working around the area, Currymuch does a decent lunch for a reasonable price.\nNew and improved Currymuch serving a decent rice pack with a killer prawn curry.\nIf you're working around Slave Island or Fort, Curry Much does a decent buth packet with better packaging.\nCurrymuch isn't really your average kade. Bright, clean and manned by excellent, friendly staff, CM offers the healthier, feel-good alternative to the average buth packet. Serving a rotation of rice-based lunches (different meals on different days, only one of which is available per day), you can pop into to the little store on Staple St to procure a box of rice for just Rs. 200\n\nහැමදාම එකම තැනින් කාලා එපා වෙලා නම්, පොඩ්ඩක් කරි මච් එකට ඔළුව දාලා එන්නකෝ.\n\nකරිමච් සාමාන්‍ය බත් කඩයක් නොවෙයි. එය බත් කඩේකට වඩා පොෂ් කඩයක්. දීප්තිමත්, පිරිසිදු ස්ථානයක් වන එහි මිත්‍රශීලී සේවක පිරිසකුත් ඉන්නවා. කෑමත් සෞඛ්‍යාරක්ෂිතයි. එහි සතියේ දින හතේ මාරුවෙන් මාරුවට බත් වර්ග පිරිනැමෙනවා. එක් දිනෙක එක් බත් වර්ගයක් පමණයි. බත් පෙට්ටියක් රු. 200ක් පමණයි.\n",
  "url": "https://www.yamu.lk/place/currymuch/review-190033"
}