{
  "name": "Dinemore (Moors Sports Club)",
  "address": "50A, Braybrook Place, Colombo-2",
  "telephone": "0112302888",
  "close_time": null,
  "description": "The go-to place for submarines since 1996. ",
  "tip": "Do go there after 6pm, they have a different menu during dinner.",
  "review": "Going way back to 1996, as a kid, ever since I could recall, we would head over to Dinemore with my entire family to sink into some beef submarines. As it turns out, the Moor’s Sports Club branch and the Wellawatte Branch has a different menu from the other branches.\nWe kickstarted our meal with Chicken Wings and BBQ sauce (Rs.260) as our appetizer. They were delicious. The chicken was crispy and tender inside, the sauce had a nice note of sweetness that tasted like honey and had a distinct smoky whiff to it.\nThe Fish and Chips came in next. This was one of the best dishes I've had in a while. The fish was on point, came with a wonderful coleslaw, a fresh batch of crisp french fries and slices of tomato and salad. For a price of Rs.480 it was great value for money.\nWe ordered the Chicken Lasagna, but instead we were served a beef lasagna that looked a little microwaved and was dry. But as soon as we informed the waiters they were happy to change the order and apologise for the glitch. The Chicken Lasagna (Rs.480) was a complete disappointment. It was dry, once again like its beef alternative and had absolutely no flavour, the white sauce on top was stiff as cardboard and the carrots inside tasted a little funny.\nThe Beef Chops with Paratha (Rs.530) was another beautiful dish. Beautiful as in, the flavours in the gravy really complimented the chops. Generously doused with a perfect measuring of spices, the chops were soaked in flavour and was extremely tender. A long slender chilli and a few rings of onion were the accompaniments placed with the meat.\nLastly came in the Pizza, this time around we chose the Dinemore Special (Rs 480) for four slices. There was a decent topping with an assortment of fish, chicken sausages, olives and cheese. The cheese deserves a definite mention here, as there was a generous amount of it layered on the pizza.\nThe place was clean, spacious and had a large amount of seating, the waiters were all polite and efficient. They had an outdoors as well as an indoors so you could choose where you wanted to be seated.\nThis place had good food. Although the lasagna was a disappointment, the fish and chips made up for it as well as the Beef Chops. The pricing was decent and the food was good. Apart from submarines, looks like Dinemore scores points for some of their other dishes too.\nA good place for your basic grab and go meal. Now with an improved,  after 6 menu that comes with great fish and chips and a good 'steak and gravy'\n\nකොච්චර රෙස්ටෝරන්ට් පටන්ගත්තත්, තවමත් සමහර අය සබ්වල රස බලන්න යන්නේ ඩයින්මෝර් එකට. මොකද ගාණත් ෂේප්. බඩත් පිරෙනවනෙ.\n",
  "url": "https://www.yamu.lk/place/dinemore-moors/review-115143"
}