{
  "name": "Gelato Italiano by Roots",
  "address": "4/1A Majestic City, Station Road, Colombo 04",
  "telephone": "0112506292",
  "close_time": null,
  "description": "Gelato is a new ice cream boutique at MC, managed by Roots.",
  "tip": "Try their Passion Fruit gelato!",
  "review": "Gelato Italiano is Roots's attempt at serving up the sweet Italian confection we've all come to know and love. This new venture isn't as\nas their juices, unfortunately.\nThey've got a menu advertising a plethora of different flavours as well as a selection of sorbets. Unfortunately, they only had about six different flavours of gelato on display when we went in.\n\nThis may be due to the fact that they're just starting out, so this gives them an excuse. However, it'd be better if they took the menu down until they're fully stocked so as to not shatter any high hopes.\nI initially asked for waffle cups but my statements went ignored and we got waffle cones instead. This is okay, but when you've got to review four ice creams and there's no room to sit in the overcrowded sweat-fest that is the food court, a drippy cone isn't such a good idea. Let alone four.\nThe waffle cones are priced at Rs. 300 which is an okay price except for the fact that you're served a minuscule amount of ice cream in a slim cone. Is this fair? Only the flavours will tell.\nThe lady behind the counter kept giving me the stink eye, but I'd do the same if some random hooligan started snapping pictures while I'm on the clock. Our orders were taken swiftly with no complication. We weren't given tissues though, so we had to reach over the counter and obtain a few for ourselves which probably irked her even more but what to do.\nThe ambience is the same old MC food court that's been around since the dawn of time. The general hullabaloo of the screaming children and adults alike will forever be etched into those grimy, dimly lit walls. We stood outside by the stairs and ate which was much more enjoyable thanks to the lack of people and noise.\nYou're actually better off paying around Rs. 480 for a double scoop at\nor forking over Rs. 250 for a superb Pistachio Kulfi at\n. But if you're at MC and want to beat the heat, try Roots's Passion Fruit Gelato.\n",
  "url": "https://www.yamu.lk/place/gelato-by-roots/review-185190"
}