{
  "name": "Giovanni's",
  "address": "No. 145, Thimbirigasyaya Road, Colombo 5.",
  "telephone": "0770335366",
  "close_time": " Open 6 PM–11 PM",
  "description": "Giovanni's is a little Italian pizza place run by a chef who uses his own recipes, and serves fresh from a clay oven. ",
  "tip": "If you're going late at night, call first since he doesn't have a specific closing time (if he's done selling 50 pizzas by 9, he closes shop!). Also, parking is a little tough. Just park on the side of the pavement and hope you don't annoy drivers on the road. ",
  "review": "Since they first opened their doors one year ago, Giovanni’s has been our go-to spot for wood-fired pizzas. This time around, despite Dimuthu’s absence on the day we visited, they still dished out the quality pies we've come to expect from them.\nIn the course of the last 12 months, the folks at YAMU have made numerous stops at Giovanni’s. I happened to be one of the only people in the office to not have tried their pizzas, so I was excited to see if all the hype was for real.\nOn our previous visits, it had been Dimuthu manning the clay oven, so we were a bit surprised to find a different gent working the dough this time around. From what I’ve heard, Dimuthu trusts very few people with making pizzas, so I was definitely curious to see how well the chef deemed worthy of the task would fare.\nGiovanni's keeps things relatively simple with a 20-item menu that revolves around classic italian preparations. You'll find the entire menu written out on a blackboard at the entrance. Prices range from the mid-to-high end, but the pizzas are large and more than sufficient for one hungry person. They also top their pizzas more generously than any other pizzeria in Colombo (even compared with the likes of\nand\n), so the value for money is unbeatable.\nSince the option was available, we went for two half-and-half pizzas. The first of these had bacon and pollo cacciatore (Rs. 1,400 and Rs. 1,500 respectively for full pizzas). While the latter is essentially chicken doused in a tomato sauce with added herbs, the bacon pizza is quite simply that — unadulterated bacony goodness with warm, stringy mozzarella. There wasn’t much else going on in the bacon half, which really helped emphasize the fatty flavour of the meat.\nOne thing we really appreciate about Giovanni’s is the fact that they absolutely pile on the toppings. One slice of the pollo cacciatore had the equivalent of half the topping you’d get at a mainstream pizza chain. The chicken, while well-cooked, was also moist. The flavour of the tomato came through well, further complemented by the basil leaves added on top.\n\nThe other pizza consisted of one salami half and the other half, all-meat (Rs. 1,700 for a full pizza of either). With a fermented tang that comes through in the flavour of the pizza, salami may not be for everyone. The pizza nails the brief in terms of flavour, but it may taste funny to those who aren’t too familiar with the distinct flavour of salami.\nThe all-meat was also legit, with plenty of bacon, chicken and beef, topped off with sliced capsicum and basil leaves. This also had a spicy kick to it, with a bit of dried chilli added into the mix. Despite the abundance of ingredients, they still managed to maintain that balance of flavours, so the savouriness and spice is evened out by the creaminess of the mozzarella.\nDespite its obvious popularity, Giovanni’s remains quite a small space. The ground floor is where the magic happens, while the compact dining area with just a few tables occupies the first floor. It’s actually quite charming—and perfect for a date—despite the simple wooden furniture, chequered table cloth and balconies that overlook the street. They’ve got seating for around 15 upstairs, but don’t be surprised if you see them set up tables on the side walk to accommodate the hungry hordes.\nClay oven pizzas require very little cooking time, so you can expect the service to be quite fast. That being said, it is still quite a small operation, so the service time does get slower as the place packs up. The guys at Giovanni’s are casual, friendly and knowledgeable. As for the new chef, we’d say he fared pretty darn well.\nWe’re happy to see that Giovanni’s hasn't let the demand affect the quality of their pizzas. It’s one of the few places in town that has been consistently knocking it out of the park, so we’re excited to see what Dimuthu & Co. come up with next.\nSince they first opened their doors a year ago, Giovanni’s has been our go-to spot for wood-fired pizzas. This time around, even in Dimuthu’s absence on the day, they still dished out the quality that we've come to expect.\nGiovanni's is a little Italian pizza place run by a chef who uses his own recipes, and serves fresh from a clay oven.\n\nවැඩේ කියන්නෙ එච්චර රස වෙලත් බියර් බෝතල් 3 ඉවර වෙද්දි වෙජි පීසා භාගයක් ඉතුරුයි කියන්නකො.  එක අතකින් වෙරි මරගාතෙ කියවනව. අනිත් අතින් ඉස්මුරුත්තාවට එන්න ඔන්න මෙන්න.  කොහෙට කියල කන්නද අප්පේ… මේ පීසා.\n\nජොවානිස් කියන්නෙ සාම්ප‍්‍රදායික ඉතාලි ක‍්‍රමේට ගොඩක් කිට්ටුවෙන් යන විදියට පීසා හදන තැනක් කියලයි ප‍්‍රසිද්ධ. මයිකල්ආන්ජලෝ, රොකෝස් වගේ පීසා කඩ පටන්ගන්නත් මුල් වුණු දිමුතු තමයි මේ කඬේ කරගෙන යන්නේ.\n",
  "url": "https://www.yamu.lk/place/giovannis/review-57693"
}