{
  "name": "Grand Beijing",
  "address": "62/A, Dharmapala Mawatha, Colombo 03",
  "telephone": "0719966669",
  "close_time": " Open 11.00AM to 11.00PM",
  "description": "Grand Beijing is another Chinese place around the Kollpity junction that serves up good, authentic dishes at affordable prices. ",
  "tip": "Go for the prawn balls. ",
  "review": "Grand Beijing Chinese Restaurant is one of the good ones if you're looking for authentic Chinese food in Colombo, but a bit more affordable than places like\n. The place is run by Chinese management and cooks, even their hotline is answered with a 'Nin hao' - but there are Sri Lankan waiters around to keep you from getting lost in translation.\nAs a starter we got these prawn balls which we didn't expect much out of (Rs. 668). Basically big spheres of mashed prawn, batter fried, and they tasted pretty awesome, especially with the lettuce and chilli sauce that came with it.\nWe also got a plate of vegetarian dumplings, stuffed with fresh leeks and spicy onion. As someone who doesn't usually drool over veggies, I have to say this is a very tasty dish and a total win if you've got a vegetarian in your group. Also not too pricey with more than 12 in ours, enough for two, at Rs. 968.\nOur seafood fried rice barely had seafood in it (microscopic prawns and a stingy amount of cuttlefish), but the rice was still tasty, not too oily, and came in an awesomely large portion enough for 3, at Rs. 528. We loved our plate of stir fried beef tenderloin with plenty of green chillies (so much that we saved some for later too) - soft beef bathed in chillies and sauce, a treat for people who love spicy food (this was enough for 2 again, at Rs. 618).\nThe restaurant is nice - just a big open, clean space, wooden furniture and a few chandeliers. Service is basic, with just waiters taking your order and the dishes arriving in about 10-15 minutes. You might see some of the Chinese managers and cooks around but they don't seem very chatty.\nGrand Beijing is a good choice if you're looking for some authentic, appetizing Chinese food, in a pleasant environment, without spending a whole lot (Rs. 1000 for one person). Take a group with you since the 'small' plates of dumplings and rice especially are actually big and the cost can be split.\n",
  "url": "https://www.yamu.lk/place/grand-beijing/review-38755"
}