{
  "name": "Harpo's Pizza (Nugegoda)",
  "address": "178/A Stanley Tillakaratne Mw, Nugegoda",
  "telephone": "114323023",
  "close_time": null,
  "description": "Harpo's has a new stand-alone pizza parlor in Nugegoda. Almost by default it's one of the nicer places in that town now, and it makes for faster delivery to the suburbs - from Kotte to Battaramulla.",
  "tip": "Try their fresh (homemade) pastas.",
  "review": "Harpo's has a new stand-alone pizza parlor in Nugegoda. Almost by default it's one of the nicer places in that town now, and it makes for faster delivery to the suburbs - from Kotte to Battaramulla.\nFood wise they have the same classic Italian pizzas plus some interesting pastas, all backed by a really professional service. It's a welcome addition to the neighborhood.\nIt's also a nice place to dine-in. It's a small but well appointed place, like a cafe. There's colorful chairs and it's well lit. Almost by default it's one of the nicest places in Nugegoda.\nThat was enough food, honestly, but we wanted to try a pasta as well. They have a range of fresh pastas which look delicious, but they were all sold out. Those include pastas stuffed with crab and lobster, lamb, and prawn and mushroom pastas - all under Rs. 1,000. Another time.\nWhat we tried was a bit of a reach - the Housewife's Pasta (Rs. 600). I have actually made some version of this - tossing dhal and pasta together when that's all I had in the fridge. This version was actually quite good. It included the base dhal and pasta but also added fried vegetables and an egg. A surprising mix, but tasty. They also more Italian pastas like a carbonara and bolognese.\nOverall we'd say the food was quite satisfying.\nHarpo's joints are known for their professional and responsive service and this outlet is no exception. We were served by a manager, we think, who knew the menu and could tell us what wasn't available and make useful suggestions. It seems like they've put experienced people from the main outlet to get this going and they know what they're doing.\nThe Nugegoda Harpo's brings quality pizza and pasta to the suburbs. In addition to making delivery faster (and cheaper), this pizza parlor is also a nice place to dine-in. It's got the same high quality Italian food the original Harpo's is known for with some interesting twists.\n\nහාපෝ’ස් එකේ පීසා හැදෙන්නේ දර පෝරණුවේ. කවුන්ටරේ පිටිපස්සේ තියෙන දර පෝරණුවේ ගිනි දැල්ල අපට වාඩිවෙලා ඉන්න තැනටත් පෙනුණා.\n",
  "url": "https://www.yamu.lk/place/harpos-2/review-44823"
}