{
  "name": "Hotel De Pilawoos (Kollupitiya)",
  "address": "417 Galle Road, Colombo 3",
  "telephone": "777417417",
  "close_time": " Open 24 hours",
  "description": "Hotel de Pilawoos, one of the many Hotel de Pilawoos, is probably the best Hotel de Pilwaoos in town.",
  "tip": "Cheese kottu or cheese roti and iced milo. That's all it is.\r\nOh, try the chocolate rotti.",
  "review": "Road side joints like Pilawoos have all the flair of  Flea Bottom (GOT fans unite!). There's a mess on your table from the previous diner that hasn't been cleaned up; there's an endless rush of bodies swarming towards the cashier, and even two cops enjoying a few\n(I assume, since there weren't any doughnuts to be seen). There's also piles of crushed paper on a muddy-tiled floor — Pilawoos is street food central.\nPilawoos (the most popular one) does good food, albeit lacking cleanliness. But it's street food, so we're not complaining.\nHotel De Pilawoos is one of the most popular 24 hour eateries named Pilawoos. Believe it or not, this is a big category; there are at least 10 Pilawoos in Colombo. The brand has become diluted and YAMU writers have gotten indigestion trying to figure out the best one. The original was supposedly in Maradana and is long gone. This is the Bambalapitiya Pilawoos and it's OK, definitely central. It's gentrifying fast.\n\nහොටෙල් ඩි පිලාවුස් කියන්නේ පැය 24ම ඇර තිබෙන ඉතා ජනප්‍රිය බොජුන්හලක්. මෙය ලොකු ජාලයක්. පිලාවුස් කෑමහල් 10ක් පමණ කොළඹ තිබෙනවා.\n",
  "url": "https://www.yamu.lk/place/hotel-de-pilawoos/review-51491"
}