{
  "name": "Icebair Restaurant",
  "address": "95 Lewis Place, Negombo",
  "telephone": "0312238097",
  "close_time": null,
  "description": "Located right on Negombo Beach, Icebair is a pleasant restaurant to while away the time with some decent food or drinks.",
  "tip": "Chocoholics, refrain yourselves from ordering the chocolate cake.",
  "review": "Like the\n, its smaller version in Negombo town, the Icebair restaurant is a cool place to chill out at, right on Negombo Beach. Even if it isn't the most inviting beach of the island for a swim, it's still nice to have a meal or drink by the sea when you happen to be in the area.\nInitially built as a retirement home, the Swiss owner soon realised that the house was too big for him (rich people have their problems too you know) and converted it into a guesthouse called Icebear and a restaurant logically (or not) named Icebair.\nThe Swiss influence is clearly perceptible in the menu, which includes muesli, rösti and coffee made the way neighbouring countries Germany and Italy do it.\nIntrigued by the German coffee listed on the menu, we ordered a Pot of German Filtered Coffee (Rs. 390). Germans are more famous for their beers or schnapps and we now understand why. While it wasn't terrible, it certainly won't let us a lifelong memory. It was bland and a bit sediment-y. It tasted pretty much like a French pressed coffee.\nTrue to its reputation and fame, the Italian Espresso (Rs. 390) satisfied us. Strong and aromatic, it was an honest espresso.\nWe were more impressed by the presentation of the brews. They were served in an authentic Bialetti espresso maker and in a Moroccan looking teapot. I don't know what the pot was made of but it was bloody heavy! Pouring the German coffee happened to be an excellent morning exercise for our biceps.\nWe went for a very Swiss and healthy breakfast: Rösti (Rs. 1,100) and Chocolate Cake (Rs. 460).\nFor those amongst you you aren't familiar with Swiss gastronomy, the rösti is this potato fritter which often comes with an egg on top. This one also contained bacon and cheese. Deliciously golden and crispy on the outside while still soft and moist inside, the rösti was really tasty and well executed. It was a bit on the oily side but overall it was very nice and made a hearty breaky option.\nOn the other hand, the chocolate cake was a bad choice. The sauce was the only element that tasted like chocolate but wasn't good enough to save the stodgy and dry piece of cake. Keep away from this one.\nStaff is courteous and reserved. So discreet, it can be hard to find them at times. Service was not the most efficient. But being on one of this lazy day, we didn't mind and the wait actually enabled us to roam around the garden and to greet the turtles and my homonymous hen.\nThe restaurant is located in a lush garden full of quirky decoration and fronting the beach. It's an ideal place to while away the hours in good company or, if not, with a good book.\nWe also appreciated the extra effort put into food and drink presentation as well as the quality tableware. It contributed to make our stop here feel pretty unique and exclusive.\nIcebair Restaurant is a great spot for a lazy weekend breakfast or some relaxed afternoon/evening drinks. Too bad the food and drinks don't quite live up to the ambience.\n",
  "url": "https://www.yamu.lk/place/icebear-restaurant/review-205836"
}