{
  "name": "Indian Chaat Corner",
  "address": "No. 03, 32nd Lane, Wellawatta",
  "telephone": "0724100282",
  "close_time": " Open 10AM to 9PM daily",
  "description": "Indian Chaat Corner is a tiny barely-noticeable restaurant that specializes in Indian street food. The chaat is still pretty good, and they've got a nicer interior now.",
  "tip": "Opening and closing times are erratic,  though they're generally open do call before going.",
  "review": "The Indian Chaat Corner has been one of our favourite spots for affordable, spicy, and different-from-the-usual food. While chaat is a common street food in India, it's rather hard to find here.\nThe chaat house is an actual house, run by a family. There's a boy, and his parents, and I think it's the mother who prepares the food. They used to be based in Bambalapitiya, but they've moved to Wellawatta now and the hall of their house is what's converted into the seating area.\nSo it's rather obviously homely, with tables and chairs spaced throughout. You need to knock and call about a bit for them to come / hear you though, because there's no one in front (this could easily be fixed if they install a bell, which they haven't).\nRegardless, the food is still great.\nEverything's priced between Rs. 200 to 400, and it's all pretty generous portions.\nWe love their Samosa Chaat (Rs. 200), which is chunky and doughy bits of vegetable samosa doused in green chutney and tamarind chutney, along with curd. It's quite filling, and very heavy because the samosa dough in this is thick.\nOur Dahi Puri (Rs. 200) was stuffed to the brim and was intensely flavourful. It's a mouthful (literally), but you're supposed to pop it in whole and then munch it down. Alternating between the heat of spice from the masala and the coolness from the curd, this was a good burst of conflicting textures and taste.\nDinesh ordered some Bhel Puri (Rs. 200) as well, and despite it looking a royal mess it was splendid. A plate piled with rice crispies (puffed rice?), bit of\nand a lot of tangy sauce, this is once again a treat. As with the other chaats, this also had a lot of sev (\nlike dried noodles stuff) poured all over it.\nStrangely, the Lassi (Rs. 250) was more expensive than the food, but fully worth it. By far the thickest and creamiest lassi we've had to date, this was naturally sweet and made entirely of good curd.\nSince YAMU bellies are actually bottomless, we had a portion of Chicken Biryani (Rs. 400) as well. We could have had more, it was that good. A change from our regular biryanis, this also featured their curried chickpeas, along with the green chutney and chopped up chunks of chicken.\nIt's a quaint, simple location. The family does a great job with the food, and we recommend it. The prices are very reasonable too!\nOur only gripe would be with the service, because we'd have loved some water and for someone to check up on us once in a while when we needed to amend or expand on orders, but we were left alone for nearly the whole while until we literally had to call them out.\nOther than the lack of professionalism (but also bear in mind they're just a family doing what they can), we'd fully recommend this place.\n\nThe Indian Chaat Corner's been one of our favourite spots for affordable, spicy, and different-from-the-usuals food.\nIndian Chaat Corner is a tiny barely-noticeable restaurant that specializes in Indian street food. The chaat is still pretty good, and they've got a nicer interior now.\nWhile Sri Lanka has successfully tried its hand at many a cuisine, chaats are somehow not our forte. For the homesick Indian, there are few places to which you can dart for a bit of home cooked cheer in the form of a bhel puri.\n\nඉන්දියන් චාට් කෝර්නර් එක කියන්නේ යමු එකේ අය සෑහෙන්න ආසාවෙන් කන්න ගිය තැනක්\n\nIndian Chaat Corner is a tiny barely-noticeable restaurant that specializes in Indian street food. The chaat is still pretty good, and they've got a nicer interior now.\n\nලංකාවේ සූපවේදියෝවිවිධ විදේශීය භෝජන වර්ග සාර්ථකව පිසිනමුත් චාට් නම් සාර්ථකවෙලා නැහැ. චාට් කියන්නේ ඉන්දියාවේ වීදි අද්දර කෑම කරත්ත විසින් පිරිනමනු ලබන ජනප්‍රිය වීදි ආහාරයක් වන සැර හා ලුණු රසමුසු  ප්‍රණීත කැවිල්ලක්. ගෙදර ගැන සිතමින් ලතවන ඉන්දියානුවන් වෙනුවෙන් ගෙදර හැදූ බෙල් පුරි පිරිනමන තැන්නම් කීපයක් තිබෙනවා.\n",
  "url": "https://www.yamu.lk/place/indian-chaat-corner/review-112774"
}