{
  "name": "Java Lounge (Fort)",
  "address": "No.7, Hospital Street, Colombo 01.",
  "telephone": "0112333051",
  "close_time": null,
  "description": "The Java Lounge has spawned yet another coffeeshop at Colombo 01. They still serve the same items from their menu and nothing much has changed except for the great new location.",
  "tip": null,
  "review": "The Java Lounge has spawned yet another branch at the Fort down Hospital Street. We decided to investigate.\nSince I was craving for some spaghetti, I ordered the Spaghetti Alla Carbonara - spaghetti with beef bacon\n, egg, parmesan cheese mixed in a cream sauce at Rs. 850 and it was unexpectedly atrocious.\nThere was way too much pasta for one person which is generally a good thing, but it was more intimidating than appealing. The spaghetti itself was far too greasy, and I could literally taste the grease/butter/whatever element they'd decided to incorporate into the pasta. That being said the beef bacon was sparse and literally tasted like basic sausage with no authenticity whatsoever. Worse still, there was just no flavour going on, not even salt.\n\nFor my drinks I got a mug of good old Cappuccino (Rs. 390 for a short mug) and as much as I was expecting it to be served in an adorable coffee-shop style mug it was served in a basic white mug with the Java Lounge logo printed on it. There was no hipster coffee art either. But my disappointment was washed down by some up-to-standard coffee. It wasn't too milky, the coffee was just right and I liked how it was just warm enough so as to not scald your tongue. Worth the price, if you want a quick cuppa.\nNext up we got the Java Chip Frap (Rs. 630) which is chocolate chips blended with chocolate and coffee and you get every rupee worth of chocolate in this Tall cup.  We shared it among two of us and it's a real chocoholic's drink.\nLastly we got the Oreo Cheesecake (Rs. 490) which to be honest was the best thing at their establishment. It was beautifully soft and fluffy, the cheesecake tasted of oreo cream, and the oreo bits really came through. Satisfactory!\n\nThe place is fantastic. I loved how neo-colonial it was. It's beautiful and in the evenings it has a rustic ambience to it.\nThe interior is average coffee shop decor, with couches and dim lights but the best part was they have solitary work stations for the solo workaholics. Thumbs up!\nAs for the location, beware of walking down Hospital Street during the day, as the masons yell preposterous things at you (\"NICE AH!\") and you'll be hounded by shady gents trying to lure you into seedy money-exchanges. We had one dude who literally followed us up to the Main Road.\nThe service at the Java Lounge was stellar. Our orders didn't take too long, the barista came to check on our food and when I forgot my pasta (got it for take-away) she brought it to us before we left. It's nice to have a friendly experience at a cosy coffeeshop.\n\nDespite the great service and good coffee, I HAD to go hard on the pasta since it's very hard to go wrong with such a simple dish. I have high hopes for them, their drinks are really good and perhaps a few weeks from now they'll present better dishes.\nOverall a great spot for chilling out, and not incredibly hurtful to the wallet either.\nThere's another branch of the Java Lounge down Hospital Street.\n\nජාවා ලෞන්ජ් කියන්නේ ලෝකල් ෆ්‍රැන්චයිස් එකක්.\n",
  "url": "https://www.yamu.lk/place/java-lounge-fort/review-133572"
}