{
  "name": "Jolly's Ice Cream ",
  "address": "402/2, Kaduwela Road, Battaramulla, Koswatta 61158",
  "telephone": "0777534973",
  "close_time": null,
  "description": "They serve some super authentic Sri Lankan ice cream.",
  "tip": null,
  "review": "Jolly's Ice Cream is originally from Nittambuwa, but they opened up a small new branch in Battaramulla near the Hi-Life building.\nWe tried five flavors, Strawberry, Blueberry, Cream Milk, Coffee, and Chocolate. The first two we got in waffle cones and the latter in a cup.\nThe Strawberry (Rs. 80) was your average strawberry ice cream, albeit a bit milkier, and with fresh strawberries on top, which we really liked. The Blueberry (Rs. 100), was perfectly flavoured, and wasn't too sweet. The waffle cones were brilliant, we could have probably eaten them on their own.\nThe Chocolate (Rs. 70), was very rich and decadent. We loved it, but we loved the Coffee (Rs. 80) more. If you're a fan of typical Sri Lankan\nyou would love this too because that's exactly what it tasted like. It was brilliant. Cream Milk (Rs. 60) tasted nostalgic. It took us some time to realise what it tasted like and then it hit us. Those Rs.5 flavored ice packets they sell outside your school. This was just a creamier, icier version of that!\nThe staff was very friendly. They let us try out ice creams before ordering, and we asked if they had more flavours, but they said that they'd only been open for a month so need some time to settle in. As for ambience, there's an outside seating area complete with umbrellas and a nice view.\nWe definitely enjoyed ice cream here and we highly recommend it, especially at this reasonable price point. We're excited to see what else they have to offer after they're fully functional.\nJolly's Ice Cream is originally from Nittambuwa, but they opened up a small new branch in Battaramulla near the Hi-Life building.\n\nඅපේ ලෝකල් රහට හරියන අයිස්ක්‍රීම් ඕනේ නම් මේක තමයි පොට් එක.\n",
  "url": "https://www.yamu.lk/place/jollys-ice-cream/review-161142"
}