{
  "name": "Kaema Sutra",
  "address": "Shangri-La Hotel, 1 Galle Face, Colombo 2",
  "telephone": "0117888288",
  "close_time": null,
  "description": "The new Kaema Sutra, moved from its previous premises in Arcade Independence to the plush Shangri La, still serves decent-ish food at high prices  ",
  "tip": "Try their signature dessert 'What the Hopper'. It had us licking the plate.",
  "review": "At the new Kaema Sutra at the Shangri La hotel, valet parking and people treating you like a VIP comes with the package. But was the food worth the money?\nKaema Sutra's new premises incorporates a whole wall covered in devil masks, grinning, feral faces stare you down as you enjoy an expensive night out with friends, family or business associates. As frightening as this may sound, the effect is actually a nice one.\nThe interior is also thoughtfully and plushly decorated in soft brown shades, and very comfortable, down to the swiveling chairs at the bar that somehow combine the efficiency of a barstool with the comfort of an armchair. Even the big screens behind the bar, tuned into a permanently frozen football match, a superhero action flick and an old cricket match respectively while we were there, somehow seemed to blend in well with the overall accent of the place.\nThere is also outside seating, though this removes you from the aforementioned ambience. But the great views and fresh breeze more than make up for it.\nThe menu is simple and doesn't give you a mindboggling array of choices that will leave you scratching your head.\nKaema Sutra offers a range of tropical cocktails, which come in mugs that are....sourced from Africa. Apparently South-South cultural appropriation is OK? We got some wine (rather overpriced at Rs. 2,200 for a glass of Spi Valley) and the Zombie Raksha (Rs 850) which was not quite as terrifying as it sounds. It had a base of rum and fruits, with a generous dose of vanilla liquer. A little too generous in fact, it was pleasant and sweet but kept reminding us of cough syrup.\n*All prices without service charge and taxes*\nThere's a range of 'Sri Lankan tapas' to choose from as a starter. We chose the Rotti Pizza with 'Baby Jackfruit' (Rs. 600) a.k.a polos. The polos was cooked just right, and the gravy is just juicy enough to complement the rotti dough without being too drippy. As an overall experiment though, this pizza didn't end up impressing us too much. It was basically like eating polos curry with rotti, which is not something you would usually do anyway, unless it was Leftover Night.\nThe Black Hopper (Rs. 500) is basically a hopper made from batter doused in squid ink. It comes with soft buffalo curd, sprinkled with salt crystals, and olive oil on the side. It had the potential to be excellent, but ended up being only good because it was served a little cold. The squid ink adds a flavor that is nicely complemented by the whipped curd, which has a consistency slighly more substantial than whipped cream. Excellent for digging into with a peice of hopper.\nThe plain hopper (Rs. 250) was just a regular hopper with a small side of\nIt is a little bigger than the kadey variety though.\nThe Australian Mutton Curry (Rs. 1100) wasn't spectacular, but wasn't terrible either. I think the word I'm looking for here is 'average'.\nThe crab stringhopper kottu (Rs 600) however, shined like a beacon of brilliance in an otherwise not too thrilling night (except for the dessert but we'll get to that later).  The crab meat blended in seamlessly with the texture of the stringhoppers, and the gravy was soft and peppery, but not too spicy.\nWe capped off the evening with What the Hopper (Rs. 600), their signature dessert. It's a crunchy\n(treacle hopper) with a generous helping of whipped curd (I must say that this is a hit), chopped strawberry (very fresh) and treacle, lots and lots of oozing, sweet treacle. After we were done I used my finger to lick the plate. We gave this a six out of five.\nThe staff were extremely friendly, welcoming and conversational. They felt like great company. Sadly though, a lot of our food and drinks were delivered late, with some dishes actually sent to the table cold. This was very strange because we didn't go there on a busy night, so it can't have been that difficult to get this right. Unless delivering food to the table on 'Sri Lankan time' is a part of the service proposition here.\nThe menu at Kaema Sutra is largely blanded down to better accomodate palettes not too fond of spice, and might be for you if you're not a hardcore spice fanatic and want to appreciate the texture and flavor of Sri Lankan food without the orgasmic quantities of spices it usually comes drowned in.\nGiven, the dearth in options for gourmet Sri Lankan eats in the city, suited for varying palettes, I'd say it's still a good option if you're new to town, want to try some relatively authentic Sri Lankan fare, and have the disposable income to match.\nGiven, the dearth in options for gourmet Sri Lankan eats in the city, this is a good option if you're new to town, want to try some relatively authentic Sri Lankan fare, and have the disposable income to match.\nFancy Lankan food for fancy folk\nKaema Sutra serves good, modernized Sri Lanka fare at a bit of a premium price. While we highly recommend it for tourists, for locals it's not necessarily that mind-blowing.\n\nකෑම සුත්‍ර කීවම ලංකාවෙ ගොඩදෙනෙකුට එක පාරට මතක් වෙන්නෙ ආප්ප වුණාට මේකේ තියෙන්න ආප්ප විතරක් නෙවෙයි.\n",
  "url": "https://www.yamu.lk/place/kaema-sutra/review-208952"
}