{
  "name": "Kandoori",
  "address": "17, Charlemont Road, Wellawatte",
  "telephone": "0777511911",
  "close_time": " Open 11.30AM to 11.00PM",
  "description": "Kandoori is an Indian restaurant that serves just biriyani and other Indian food.",
  "tip": "Try the Avacado juice to wash down your meal, it's very thick and just plain delicious.",
  "review": "Kandoori's got some pretty legit biriyani, and we love it. Their food is a bit on the pricey side, with meals crossing over Rs 600, but given the quality we think it's worth it.\nWhile the service is a bit on the slow end, the staff are quite friendly. Food-wise, we went for a Mutton Biryani (Rs. 760) and a Makhani Paneer (Rs. 780). And then we decided to get some Devilled Beef (Rs. 420) as well.\nWe don't have any complaints where quality is concerned. Fragrant, well spiced basmati rice and generous pieces of mutton dotted this biriyani. Our only gripe was that the portion could have been larger, for the price.\nThe Makhani Paneer was super creamy, both the gravy and the paneer itself.\nA bit on the oily side, but delicious.\nThe beef was also well done. It isn't your traditional devilled beef, which comes dry: this was swimming in gravy and spice. We didn't like it as much as we enjoyed the biriyani and the paneer, but it's good in its own right — and should probably have been paired with something bready like naan.\nKandoori is spacious, well-lit and clean. There wasn't much of a crowd when we visited, but it can easily hold large groups of people. It's a good place for an outing which involves great biriyani.\nYAMU's been here a few times and their food is consistently good. Service could improve a bit I reckon, in terms of being a bit more efficient and quick, but they're friendly and pleasant so it's not too bothersome.\nKandoori's got some pretty legit biriyani, and we love it.\nKandoori is an Indian restaurant that serves just biriyani and other Indian food.\n\nහැබැයි මට්න් නම් තොගයයි.\r\nකාලා බලමුකො! එක පාර මට්න් කෑලි දෙකක් හැන්දට ගත්ත මම හෙමින් සැරේ රස බැලුවා.\r\n“මාර වැඩේ! මට්න්වලින් මට්න් රහක් එන්නෑ  කියන්නකො.\n",
  "url": "https://www.yamu.lk/place/kandoori/review-108753"
}