{
  "name": "Kurumba",
  "address": "427 Elvitigala Mawatha, Colombo 00500",
  "telephone": "0718489979",
  "close_time": null,
  "description": "A juice bar in Narahenpita that does juice right, for a really good price",
  "tip": "The fruit bowl is tasty, healthy and fresh.",
  "review": "Kurumba is a juice bar with great, fresh fruit served in innovative ways, and at highly competitive prices\nKurumba sells fruit bowls as well as smoothies and juices. The menu, like the location, is pretty minimalist, and we liked this a lot. ​\nWe particularly liked how they let us pick out the fruit bowl. The choices are laid out in three easy levels and you pick the items based on what's available.\nTo our pleasant surprise, a lot of the items\navailable, despite it being a weekday evening.\nWe went with an Alfonso mango base for our fruit bowl which had a lovely, smooth texture, kind of like yoghurt. The watermelon and pineapple was topped with orange, grapes and passion fruit, as well as a generous sprinkling of granola on top.\nThis would have been a great breakfast and at Rs. 450 for a big bowl, almost enough for two people (or one really hungry person very keen on breakfast). If you're feeling like less, you can get the cup for Rs. 350.\nWe tried a couple of their more popular juices. The Valley Girl (Rs. 220) contained pineapple, narang, kurumba and was very fresh.\nParadise Found (Rs. 240) reinforced the Orientalist aesthetic and combined mango, banana, passion fruit again with a base of kurumba. It had a very calming affect, we found.\nI'm a little skeptical of passion fruit in juices, because it can so easily all go to a sour hell. But in this case the passion fruit didn’t overpower neither did it disappear, just staying on the outside of the circle like that friend you like to keep at arm's distance but still like.\nKurumba is located at a fussy section of Baseline Rd, just past the Thimbirigasyaya Rd junction as you travel from Borella, making it really difficult to find parking to access the place. Once you're finally here though, the spacious, airy environment welcomes you inside with a minimalist aesthetic clearly designed to give you strong beach vibes.\nThe music gives you beach vibes too. And this not being a beach, it can get a little loud inside. The motivational quotes on the wall (like \"put on your positive pants\") can also make your eyes bleed a little, but overall they aren't too bad.\nThe exoticizing graffiti on the white walls, the minimalist wooden benches and chairs and the empty white spaces makes you feel like your inside the instagram feed of a particularly Orientalist new-agey tourist.\nHelpful, quick and efficient.\nKurumba is cheaper than most competing juice vendors, and does a far far better job than any of them.  It is very clean, very neat. The juices aren't too citrus-y, neither has any sugar been added to enhance the flavor. A perfect stop on the way to work for a breakfast supplement, or on the way back home from your workout.\nAs this is a first look at the place, we'll come back in a few months to let you know if they can keep up this level of quality at current prices. Or at all.\n",
  "url": "https://www.yamu.lk/place/kurumba/review-208500"
}