{
  "name": "Lantheruma (The Lantern)",
  "address": "De Fonseka Road, near Vajira Junction",
  "telephone": "0715301582",
  "close_time": " Open Lunchtime (roughly noon till 2:30)",
  "description": "Latheruma does a really tasty and cheap rice and curry lunch.",
  "tip": "There's lunudehi (lime pickle) in a jar on the one table inside.",
  "review": "Latheruma, near Visakha College, is a little buth kade that does a tasty rice and curry. They have good curries, different types of rice and basically unlimited papadum, dried chili and lunudehi.\nLantheruma is a classic Sri Lankan lunch buffet. This one is extra nice because A) everything is served in clay pots B) there are three different types of rice C) you can serve yourself the papadum and dried chili. They also have cutlets, manioc and some roti on hand, plus lunudehi (lime pickle) on the table.\nWhat you're seeing here is actually an unusually small amount of rice (which I asked for). The curries I tried were all tasty and generous - a nice chicken, fresh gotu kola, creamy parippu, crunchy beans and sour ambarella curry.\nThey have a lot of curries on offer at any time and you can choose a few. There was also a choice of okra, cabbage, manioc, two types of fish and manioc.\nIf you're vegetarian or pescetarian you've got plenty of choice. In terms of rice they also have choice - red rice, white rice or fried rice.\nFlavorwise the curries I tried were all really tasty, and not too spicy on their own.\nPrice wise I paid Rs. 170 overall, which included a cup of plain tea. I would guess that just a chicken rice and curry is around Rs. 150, and a vegetarian meal would be less.\nThey also do take-away packs, which a lot of people were getting.\nThis buth kade is just up the street from the YAMU office, on De Fonseka Road near the Vajira Road corner. This is near Visakha College so don't go anywhere near here with a car during school time. I walked and you could park a bit aways.\nThe place is packed regardless, mostly people that work in the area.\nThe interior is tiny. One table inside and one outside, in a sort of driveway. They've decorated it like a village kade with thatch, something that mainly gets in your face when you're waiting in line. It's still a charming and simple place, no airs about it.\nThis is a classic family-run place. There seem to be two generations of ladies running it with one fellow that clears plates and serves sometimes. They're quite nice, without the rude world-weariness you get from some busy kades. And the place is quite busy.\nI would say that their process isn't very efficient. The same people serve the food and take the cash which slows things down a bit. Mainly it's just busy, but it's worth it.\nThis place does a classic, tasty and cheap rice and curry. It's a family run place that does a good range of curries for less than 200 Rupees, and it's near the YAMU office. It certainly makes us very happy.\nThis place does a classic, tasty and cheap rice and curry. It's a family run place that does a good range of curries for less than 200 Rupees, and it's near the YAMU office. It certainly makes us very happy.\n\nLatheruma does a really tasty and cheap rice and curry lunch.\n",
  "url": "https://www.yamu.lk/place/lantheruma-the-lantern/review-43952"
}