{
  "name": "LeeSH",
  "address": "245, High Level Road, Jambugasmulla, Nugegoda",
  "telephone": "01128230190773251736",
  "close_time": null,
  "description": "A charming little sandwich bar owned by the loveliest couple with delicious food.",
  "tip": "Try their burgers and brownies, if available.",
  "review": "If you live in Nugegoda or go for tuition classes at Sasip you will definitely know LeeSH. It's a crowd favourite among the tuition kids. This quaint little shop has been around for a long time and since our last review, we were happy to see that their quality and standards have not wavered.\nThey have all your popular comfort foods like burgers, sandwiches, submarines, hot-dogs, what have you.\nWe started off with a Veggie Sub (Rs. 400). It was delicious with an enormous amount of thinly sliced cabbages, carrots, onions, tomatoes and lettuce on top of a small soy patty, with a fried egg topped with a slice of cheese and a drizzle of mayo. The veggies are fresh and crunchy with no additives so you can taste all the natural flavours. This is actually an ideal portion because I didn't find myself getting full nor was I looking around for more food.\nWe also tried their Chicken and Cheese Burger (Rs. 300). We would have preferred a bigger patty for that price, but all the same, the patty was juicy and tender with a nice meaty flavour topped with a handful of crunchy veggies and a cheese slice.\nWe also got a Tuna Burger (Rs. 300) which was our favourite. The tuna paste was homemade with a soft and mushy texture. It was well balanced in terms of flavour and included lots of cabbage, tomato and lettuce.\nThe Brownie and Ice Cream (Rs. 200) was top notch. It was served warm with Highland vanilla ice cream. The texture was soft and gooey with a layer of chocolate sauce on top. It wasn't too sweet either but I felt like it was a tad overbaked at the bottom. All in all, it was yum! Enough that we asked for some to takeaway.\nI really wanted to try their iced coffee because that's one of their most popular drinks but unfortunately, it wasn't available. So we opted for a Hot Chocolate.\nThe Hot Chocolate (Rs. 300) was by no means as good as our favourite at\nbut it was pretty decent. The thick chocolatey texture and the cocoa flavour were strong enough, and we didn't get a sugar rush from drinking it.\nThe service especially is something we want to mention here. The place is manned by this lovely couple who genuinely seem to care about that their customers' well being and always make sure that what they serve is clean, fresh and delicious. They are incredibly friendly and always have a smile on their face which is very refreshing to see.\nOur food arrived at a reasonable time so no complaints there. The kitchen is the first thing you meet as you enter and you can see how all your food has been made. They also use eco-friendly brown paper bags for takeaway.\nThe place is similar to what you would get on Pinterest if you type \"green decor\" with different shades of green complimenting each other. If you're a clean freak like me, the first thing you would notice is how clean the place is. The beautiful wall art and the wooden furniture gives the place a boutique vibe.\nOne thing I've always found irksome about the place is their operational hours. It is really confusing so be sure to check the timings we have put up here before you go or just call and check. It would be better if they could stick to consistent hours throughout the week.\nWe recommend this place if you want to enjoy some comfort food in a peaceful environment. You can even place your order beforehand and pick it up. Their prices have gone up since our last visit (4 years ago) but it's not unreasonably high and they do give you your money's worth.\nA great spot for some delicious burgers in Nugegoda.\nExploring the streets of Nugegoda in search of good food, we stumbled upon a charming little sandwich bar, Leesh.\n\nලීශ් කියන්නේ නුගේගොඩ පැත්තේ ගිය වෙලාවට අනිවාර්යෙන් ම ගොඩ වෙන්න ඕනේ තැන්වලින් එකක්.\n\nලීෂ් එකට කවුරු කොහොම ගියත් නිරන්තරයෙන් ලැබෙන ලෙන්ගතු සේවාව නම් කාගෙකාගෙත් හිත් ඇදගන්නවා විශ්වාසයි.\n\nනුගේගොඩ නගරයේ වීදි දිගේ හොඳ කෑම තියෙන තැනක් හොයාගෙන යද්දි අපට ලීෂ් කියන පුංචි සැන්ඩ්විච් බාර් එක හමු වුණා. පුදුමෙ තමයි මේක තියෙන්නේ අපේ අළුත් ප්‍රියතම බත් කඩේ, ඒ කියන්නේ බෝ සෙවණට හරියටම ඉස්සරහ පැත්තේ. මේ අපූරු පුංචි අවන්හල හොඳට වායුසමනය කරලා තියෙනවා. ඒ වගේම ඒක හරිම පිරිසිදුයි. ඒක කරගෙන යන්නේ ඔයාලට හමුවිය හැකි හොඳම ජොඩුව. එයාලා දරුවනුත් එක්ක  ජීවත් වෙන්නේ අවන්හලේ ඉහළ මලයේ. ඔයාලට සමහරවිට එයාල සෙල්ලම් කරන සද්දෙත් ඇහෙයි.\n",
  "url": "https://www.yamu.lk/place/leesh/review-188540"
}