{
  "name": "Let's Taco",
  "address": "33 A, Dr Lester James Peiris Mawatha, Colombo 05.",
  "telephone": "0114248301",
  "close_time": null,
  "description": "Colombo's first dedicated taco spot!",
  "tip": null,
  "review": "Five months after it's opening, Let's Taco is still setting an example for good tex-mex in Sri Lanka. It certainly hits places like Taco Bell out of the cricket stadium, but for a slight price premium. Be warned though, parking won't be the easiest to find here on busy days.\nWe started off with a small plate of Nachos (Rs. 900), the quantity of which was easily a full meal. The homemade nachos are mixed in with jalapenos, onion, tomato, cheese dip and avocado with a dose of lime providing seasoning.\nThe flavors mix in as you proceed to eat this messy dish, and by the end, what started off as something bland is a smorgasbord of creamy, spicy sensations.\nMixing and matching flavors is also what you have to do when you prepare your tacos. We picked the Siraccha Black Pepper Beef (Rs. 1,300). It came with guacamole and salsa sauce, as well as butter corn on the side. ​\nThe siraccha and pepper didn't compete for power, and the beef was in the end a democractic mix of tangy and peppery spices, a great overall combination that hit a six (yes, cricket metaphors are in for this post) when combined with the guacamole and salsa. Five stars.\nWe tried one of the homemade drinks, Zingy Orange (Rs.350), but it basically tasted like a variation of Orange Barley, and a little too sweet. The Mango Shake (Rs. 450) was a little steeply priced for its quantity, but tasted better.\nThe service was exceptional. Our waiter Nuwantha knew the menu inside out and wasn't afraid to give recommendations, all of which (at least the ones we followed) delivered.\nFor desert we had their signature Churro cup (Rs. 525). Note that there is nothing resembling a traditional churro here, only a cup made of the same stuff as a churro is. Said cup is stuffed with ice cream, chocolate sauce and other sweet things that were nicely balanced out by the texture of the churro. We loved it.\nThis is where Let's Taco shines the most. The interior is spacious and gives plenty of privacy in different rooms with subtly different atmospheres. Art is all over the place, and most of it is quite nice.\nWhile slightly on the pricier end, Let's Taco more than delivers on quality, ambiance and service.\nThe slightly high prices are worth it for the amazing tex-mex this place has to offer.\nA brand new Mexican fusion spot on Dickman's Road.\n\nනියම මෙක්සිකන් රසට ටකෝ කන්න ඕන නම් යන්න\n",
  "url": "https://www.yamu.lk/place/lets-taco/review-208423"
}