{
  "name": "Let's Brunch",
  "address": "53 Haig Road, Colombo 4",
  "telephone": "0112055606",
  "close_time": null,
  "description": "All sorts of weekend brunch treats by the coast, Continental and Lankan. ",
  "tip": "Make a reservation or head there early, they're very popular on weekends!",
  "review": "Let's Brunch is a pop-up brunch spot that time shares a space with\njust down Haig Road (Marine Drive). It's a popular joint with a menu that serves up international as well as local fusion spinoffs- like their Cinnamon Apple Waffles and Sri Lankan style crepes with\n.\nWe got a portion of the Eggs Benedict (Rs. 695) with crab on the side for an extra Rs. 295, slyly called The Cumberbatch. Much to our chagrin, we were told that they didn't have English Muffins available so the eggs would be served atop a slice of multi-grain bread which makes the price seem rather exorbitant unless the bread was home-made (it wasn't).\nThe eggs were poached excellently, with a perfectly runny yolk and were topped off with an adequate amount of tart hollandaise sauce. The crab, however, was intensely spicy for my taste and with the afternoon heat, wasn't a smart choice. Served alongside the eggs and bread was half a grilled tomato and two potato fritters. Does it taste as good as my man Benny C? No.\nThe Classical French Toast (Rs. 725) comes with a side of maple syrup, topped with strawberries. Aside from being absolutely delicious, this made for a pretty sight to behold so if you live on Instagram I'd suggest you put a picture up so you can garner all those likes.\nThe toast was well done, and paired with the maple syrup it's basically good enough to make your tastebuds cry. The strawberries make a sweet addition to the whole dish, so you get an occasional tart kick out of it.\nWe tried to opt for the cocktails, but they weren't available. Instead, we got a beetroot concoction creatively called The Beets (Rs. 525) which is also infused with carrot, apple and ginger. It's really thick and the beetroot is very dominant which makes drinking a little uncomfortable when you take a sip and you have chunks of beetroot chilling on your tonsils. Taste-wise, the sharp apple flavour paired with ginger is super refreshing although the carrot doesn't really do much.\nThe Lime Juice (Rs. 425) is honestly a sham because it's a glass of freshly squeezed lime juice for a ridiculous price. The balance of lime and water is fine, but the price just isn't justified.\nLots of wood, a magnificent view of Marine Drive, and the sea and the breeze taking your hair for a ride; what else can you ask for?  The focal point of the decor has to be long line of interesting posters they have up by the cashier. Very camera-friendly.\nThey also have pots full of meringues and adult colouring pages that serve as table mats which only adds to the charm.\nAside from being a little cruel on the wallet, they still serve quality food. I recommend this place if you just got paid and want to celebrate; especially with a juicy gossip sesh.\nLet's brunch shares a location with The Fat Crab and as the name suggests; offers an excellent brunch menu.\nFull English Breakfast, full Sri Lankan view.\n\nබ්‍රන්ච් අත්දැකීම ලබපු, නොලබපු ඕනෙම කෙනෙක් යන්නම ඕනේ තැනක් විදියට “Let’s Brunch” එක හඳුන්වන්න පුළුවන්. කෑම, බීම විතරක් නෙවෙයි, මෙතැන වාතාවරණය පවා හරිම සුන්දරයි.\n",
  "url": "https://www.yamu.lk/place/lets-brunch/review-171475"
}