{
  "name": "Long Feng (Cinnamon Lakeside)",
  "address": "115 Sir C.A. Gardiner Mawatha, Colombo 2",
  "telephone": "112491949",
  "close_time": " Open 12 PM to 2:30 PM, 7 PM to 11 PM",
  "description": "Long Feng has good service, but the food just doesn't push it far enough. It's fairly average Chinese, and within this hotel it should be more.",
  "tip": null,
  "review": "Long Feng is the Chinese restaurant at Cinnamon Lakeside. Their prices are reasonable, and their service is good, but the food just isn't spectacular. We had a rather mediocre meal when we visited for dinner.\nThe staff at the restaurant are very prompt, well-mannered and know the menu, which is good. They'll advise you against dishes even. Ambiance wise the place is fairly well lit, with some minimalist paintings on the wall and ceramics on display. It is by no means a romantic setting, unless you sit outside. It's a pretty sterile place so you could take your family there.\nWe decided to order the signature dishes off the menu, which led us to Fried Prawns With Wasabi Mayo (Rs 350) for starters. The presentation was honestly quite hideous. Taste wise, the wasabi was very subtle, with a bit of the flavour coming through and none of the heat. The batter wasn't crisp, which was disappointing.\nFor our mains, we got the Steamed Garoupa Hunan Style (Rs 1530) and it was pretty damn good. At the price it's worthwhile and it's got just enough heat to please a Sri Lankan palate. The flesh wasn't overcooked, and I liked how the jaw looked propped open.\nThe Singapore Style Noodles (Rs 600) were disappointing, though, and we're not sure why they're marked as a signature dish. The chicken was super dry. I guess I should just stop ordering this and always ask for a flat noodle since that's what I prefer. They give you a decent portion just enough for two.\nThey had some creative cocktails going on in the drinks options so we tried one called Peachy (Rs 590) and it tastes super syrupy to the point that it was kind of off-putting. It's got that saccharine sweetness that has no depth of flavour. Go with table water. Oh, and they don't serve the table water with strawberries inside anymore.\nOur dessert, the Lychee Ice Cream Cake (Rs 450) was pretty good, despite being an ice cream cake that barely tasted like lychee, save for the base and top.\nWe think this restaurant, being inside Cinnamon Lakeside, could do way better than it has been. There's just a sheer lack of excitement on looking at their menu, and it's not helped at all by the standard fare that's plated. Sri Lankans love their Chinese food, so there's no excuse for neglecting it, really.\nLong Feng is the Chinese restaurant at Cinnamon Lakeside. We had a rather mediocre meal when we visited for dinner.\nLong Feng has good service, not ridiculous prices, but the food just doesn't push it far enough. It's fairly average Chinese, and within this hotel it should be more.\n",
  "url": "https://www.yamu.lk/place/long-feng/review-91945"
}