{
  "name": "Loon Tao",
  "address": "43/12 College Avenue, Mount Lavinia.",
  "telephone": "0112722723",
  "close_time": " Open 11 to 3- Afternoon\n 6 to 11 - Evenings",
  "description": "Loon Tao, roughly meaning \"Way of the Dragon\" has lost its claim as a top contender in the Chinese restaurant racket. ",
  "tip": "Three's a crowd - If you have the numbers get their Garupa done two different ways. ",
  "review": "Loon Tao, roughly translating to ‘The Way Of the Dragon’ has always leaned towards slightly more authentic East Asian flavours. One of the few semi fine-dining Chinese restaurants in Sri Lanka the Tao chain promises slightly more authentic Chinese cuisine in an elegant setting. While their promise holds true, Loon Tao’s claim as a top contender in the Chinese restaurant racket has waned drastically\nLoon Tao’s flavours aren’t typically Sri Lankan Chinese. They’re more Chi-Lankan – comprising of the typical East Asian bite of pepper, garlic and fennel blended to fit the Sri Lankan palette.Up until now I have never had great qualms with their food. It’s usually pretty good and is presented to please the olfactory, visual and gustatory.\nI opened ranks with their hokkien style fried noodle with seafood at Rs.598. These are thick noodles, covered in a heavy coating of sauce and seafood. The creaminess rendered from the sauce in addition to the thickness of the noodles makes for a satisfactory and filling main. However I was mildly disappointed by the prawns in the seafood mix. While they were large, they felt slightly underdone; not tender in the least, with a slight rubbery texture.  For a small portion the serving is actually fairly large- more than enough for two I’d reckon.\nTo accompany the main I got Sri Lanka’s favourite – A small portion of hot buttered cuttlefish (Rs.668), an unorthodox crispy deep fried beef (Rs.598) and pak choy (Rs. 498) . It’s ridiculous how every price including mineral water (Rs.198) ends with the figure eight. Unlucky much?\nWhile it certainly isn't the best\nLoon Tao, roughly meaning 'Path Of the Dragon' seems to have steered heavily off course. They aren't what they used to be.\nHalf in an open-air beach shack, and the other half under the stars, Loon Tao serves delicious pan-Asian seafood on Mt. Lavinia beach, at a reasonable price. The restaurant’s biggest culinary strength is the simplicity of its cuisine.\n\nලූන් තාවෝ අඩක්, විවෘත වෙරළ කුටියක්. අනෙක් අඩ තරු විමන යට. ලූන් තාවෝ ගල්කිස්ස වෙරළේ සාධාරණ මිලකට සියළුම ආසියානු සී ෆුඩ් ඉදිරිපත් කරනවා. අවන්හලේ තියෙන විශේෂත්වය තමයි ආහරවල ඇති සරලබව. තදින්ම ආසියානු රසවලට හුරුවී ඇති මෙම අවන්හලේ කොත්තමල්ලි, මිරිස්, සුදුළූනු, මහදුරු, තල තෙල්, දෙහි හා ගම්මිරිස් වර්ග ගනණාවක් හරි පදමට දැමූ ආහාර වරදින්නෙම නැහැ.\n",
  "url": "https://www.yamu.lk/place/loon-tao/review-48466"
}