{
  "name": "Mabroc Bubble Tea",
  "address": "Mabroc Bubble Tea, Liberty Plaza Food Court, Duplication Road, Colombo 03.",
  "telephone": "0765703030",
  "close_time": null,
  "description": "Great bubble tea, plenty of flavours, and super value for money. ",
  "tip": "Get the Mango Bubble Shake if you're feeling summery!",
  "review": "We tried Mabroc for our\non the day of their opening and we loved it. We popped in two months later.\nAnd we weren't disappointed.\nMabroc's extensive range comprises of classic teas (hot and cold), shakes, fruit teas, herbal teas, and slushies - all complete with either tapioca pearls or popping bubbles. Their Bubble Cubs range, in contrast, has animal and rainbow shaped jellies replacing the bubbles.\nWe tried their Hot Milk Bubble Tea, Iced Toffee Bubble Tea, Strawberry and Berry Tea - all for Rs. 250 a drink and their Blueberry Bubble Snow, a tea-based slushie for Rs 280.\nChewy tapioca pearls and hot milk tea make a surprisingly great combo! Their hot milk tea was not too strong and wasn't overpoweringly sweet. Not sure how the Lankan uncles would feel about this change in classic milk tea, but we liked it.\nDistinctly tasting of tea with a strong toffee flavour coming through, the mix of milk tea and toffee syrup made for a great blend. If you're too lazy to eat a toffee, drink it.\nThe Mango Bubble Shake was sweeter and had less tea in comparison to the Iced Toffee Bubble Tea. It tasted strongly of a sweetly pleasant mango flavour -  almost like a mango yogurt drink without the milky aftertaste. It's the sort of summery drink you'd sip on while sunbathing in your bikini at the Galle Face beach. But you won't and can't because we have a\ngoing on.\nThe Strawberry and Berry Iced Tea had red popping bubbles infused with a thick, sweet liquid that literally pops in your mouth. It's a slight variant from your average iced tea. The tea wasn't too strong and the berry flavoring was just right. With the popping balls giving you a burst of sweetness from time to time, this made for a really refreshing drink.\nThe Blueberry Bubble Snow was a semi-thick slushie topped with chewy tapioca. While it didn't look as blue as your generic blueberry slushie, it made a satisfying thirst quencher on a warm Tuesday afternoon with tangy blueberry flavouring.\nLocated at the Liberty Plaza food court, Mabroc is a well designed cafe of its own. With seating limited to about 15 stools, the space is small, but well illuminated with songs streaming through their speakers. It's a cute spot to grab a drink and chill.\nThe service is standard. They're not super friendly, but they are not inefficient. The drinks are prepared within 5 minutes, so you don't have to linger for hours to get your drink.\n\nPriced at less than Rs. 300 a pop, Mabroc gives great value for money. For drinks that won't disappoint your tastebuds and rip a hole in your wallet, Mabroc is an excellent choice.\nBubble tea and chill?\nThe best bubble tea in town as of now!\n\nතව බබල් ටී ටිකක් බොමුද?\n",
  "url": "https://www.yamu.lk/place/mabroc-bubble-tea/review-142234"
}