{
  "name": "Maharaja Palace",
  "address": "1 A, Rajakeeya Mawatha, Colombo 07",
  "telephone": "0114886000",
  "close_time": " Open 11:30 AM - 2:30 PM, 6:30 PM - 11:00 PM",
  "description": "Maharaja Palace is one of the few fine dining Indian restaurants in Colombo. The prices are high but the portions are actually quite large now. Their food was always pretty good and it seems they've made some necessary improvements.",
  "tip": "They don't really mention it much but they have quite an impressive selection of wines, and even a bar at the back.\r\n",
  "review": "Maharaja Palace is one of the few fine dining Indian restaurants in Colombo. The prices are high but the portions are actually quite large now. Their food was always pretty good and it seems they've made some necessary improvements.\nWe've actually been to Maharaja Palace a whole bunch of times, albeit with some mixed results. One thing we do like is the fact that their management does seem to take customer feedback seriously and make the necessary changes. The prices haven't changed much over the past couple of years but this is still one of the more expensive Indian restaurants, but also one of the classier. Their portions have actually gotten larger, so we'd say three people could manage for around Rs. 1800 per head.\nIndian\nMaharaja Palace seems to be heading in the right direction with the changes they've made. The food is good and the service is excellent, so all that remains is to work on those desserts.\nMaharaja Palace is one of the few fine dining Indian restaurants in Colombo. The prices are high but the portions are actually quite large now. Their food was always pretty good and it seems they've made some necessary improvements.\nThere are a bunch of restaurants in and around Colombo that do relatively good, cheap Indian cuisine. However, if you're looking for a Indian fine dining experience, the choices are limited. Maharaja Palace fits that niche quite well, although we aren't quite convinced the food is as good as it could be for the price.\nMaharaja Palace is one of the few fine dining Indian restaurants in Colombo. The prices are high but the portions are actually quite large now. Their food was always pretty good and it seems they've made some necessary improvements.\n<em>Last night I had the pleasure of visiting one of Colombo’s finer restaurants, Maharaja Palace. It’s a recently opened authentic north Indian restaurant opposite Royal College. The place is absolutely beautiful - decorated with flowers and Indian paintings, expensive looking chandeliers, even the kitchen is a wonder of its own. \r\n</em>\n",
  "url": "https://www.yamu.lk/place/maharaja-palace/review-45888"
}