{
  "name": "Mainland China",
  "address": "No.8, Flower Road, Colombo.",
  "telephone": "0770771122",
  "close_time": null,
  "description": "Colombo's latest semi-fine dining experience with authentic Chinese cuisine.",
  "tip": "Steamed Coconut Dumplings with Honey Butter Sauce.",
  "review": "Colombo has been buzzing about Mainland China since they opened up on Flower Road.  They serve a delicious range of authentic Chinese cuisine, with the notable exception of pork. We dropped in for lunch and had quite a pleasant experience.\nTheir menu is pretty extensive with a range of Chinese staples like dim sums dumplings, Chongqing Prawns, Jiang's Chili Chicken, duck and Chinese Cabbage Soup, to name a few. The catch, however, is that they only offer one portion size for all their items which we'd say in general is enough for two. This means their price per head comes to around Rs. 1800 which puts them at the higher end of Chinese restaurants.\nWe started off with a Fragrant Pot Rice (Rs. 895) which is flavored with star-anise. Easily enough for two people, the rice was perfectly steamed with a strong fragrance. There was a generous amount of vegetables mixed in including mushrooms, bell pepper, carrots and broccoli (which is something I hardly notice in a pot rice). It was definitely not fried, which meant it was not the oily fried rice we are so used to. It was delicious and filling enough that you can enjoy it on its own, which isn't something we usually say about veg rices.\nNext up we tried the Wok Tossed Prawns in Black Bean Sauce (Rs. 1095) which was really delicious. There were about 10-15 prawns, tossed in a black bean sauce which goes well even with the rice. The prawns were well cooked with a soft texture that is easy to bite into. In terms of the flavor, it was a little bit salty for us.\nThe Sichuan Vegetable Hot Pot (Rs. 875) was a fragrant stew with lotus stem, shitake mushrooms, broccoli, carrots, baby corn, bamboo shoots and Chinese cabbage. The stew had a thick creamy texture with fresh and crunchy vegetables. The dish itself was enough for three people and had an abundance of veggies which is not something you can say about many hot pots. Personally, I would have preferred the dish a bit spicier.\nAnd now for the best part. The Steamed Coconut Dumpling with Honey Butter Sauce (Rs. 495) completely blew our minds! It was fantastic. They have nailed the texture of the dumplings. Also, the coconut filling was just the right amount such that it doesn't leave your mouth hanging open when you take it all in. The honey butter sauce was not too sweet and balanced, rather than overwhelming the other flavors. We were quite full at that time but somehow the six dumplings disappeared within minutes. We highly recommend you this.\nThey have a range of mocktails, iced teas, and refreshers (fresh fruit, lime soda, soft drinks).\nThe Peachy Mangifera (Rs. 495) mocktail was a concoction of mango juice and lemonade with freshly grated ginger and peach. It was very refreshing and ideal on a hot sunny day, especially if you're going for the spiciest dishes. While there was enough ginger to taste, we hardly tasted the peach.\nThe place was buzzing with customers when we went in. Although they recommend you make a reservation beforehand, they were very accommodating and served us a table near the window. Our food arrived within 10 minutes which is excellent considering how crowded it was.\nThe ambience certainly gives you the experience of a Chinese restaurant with its architectural designs of the windows and the walls, along with peaceful mood music. The two-part color coordination has been nicely adapted here. There's also enough space for large groups and families to host parties and special events.\nTheir prices may not fit everyone's budget, but in terms of quality and service, we didn't really have any complaints. Mainland China makes for a great Chinese dining experience.\nPricey and no pork, but a overall great Chinese dining experience.\n\nඉඳලා හිටලා හරි, ඔතෙන්ටික් විදියට චයිනීස් කෑම වේලක් රස විඳින්න ඕනේ වුණොත්, මෙතැන ඒකට හොඳින් ම ගැලපෙන තැනක්.\n",
  "url": "https://www.yamu.lk/place/mainland-china/review-211667"
}