{
  "name": "Malay Restaurant ",
  "address": "115 Hill Street, Dehiwela",
  "telephone": "0117777999",
  "close_time": " Open 11 AM till 3 PM, 6 to 11 PM",
  "description": "Malay Restaurant in Dehiwala is hugely popular, and after trying our their stuff we can see why. The portions: massive, the flavours: excellent and the prices: reasonable.",
  "tip": "The prices on the menu actually include taxes so you're only going to be charged service charge.",
  "review": "Malay Restaurant, which has been feeding hungry souls with large portions for reasonable prices since 1994,\n. But they are up and running now, so we decided to check it out!\nWe placed an order for a portion of Hot Butter Cuttlefish (Rs 850), Devilled Chicken (Rs 620), Babath in Hot Garlic Sauce (Rs 550) and Noodles with Prawns (Rs 560).\nThe Hot Butter Cuttlefish had a Sri Lankan twist. With curry leaves and peanuts replacing the capsicum, and a deeper shade of yellow than the signature HBC bright yellow hue, their Hot Butter Cuttlefish tasted good, although a little more spice would have really made this super Sri Lankan.\nFor Rs 560, their regular portion, meant for two people, was enough for four or more. Loaded with shrimp and spring onions, this was mild in terms of spice and made for a satisfyingly massive portion of noodles.\nTheir Devilled Chicken was authentic Sri Lankan style devilled chicken. Doused in tomato sauce, this was spicy with a generous amount of chicken (about 8 pieces) and would make for a curry worth sharing among four people.\nBabath in Hot Garlic Sauce, a Malay specialty, was satisfying, but a little too sweet for my liking. It was spicy, but mostly sweet.\nTo oblivious creatures like myself, don't let the bustling counter at the entrance fool you. Malay Restaurant is more than just a food joint that does takeaways and deliveries. There is a well lit, spacious dining area suitable for families and large crowds.\nAlthough the management did check up on us, the service was mediocre and slow.\nWith regard to health concerns, if we were to shut down food joints based on hygiene, Pettah, Aluthkade and the likes would have only a couple of restaurants to cater to gastronomical needs.\nBased on our recent experience, Malay Restaurant is just as good as it was with tasty dishes and large portions, but there is a lot of potential for their waitstaff to get better in terms of friendliness and speed of service.\nServing good meals since 1994.\nMalay Restaurant in Dehiwala is hugely popular, and after trying our their stuff we can see why. Massive portions, excellent flavours and reasonable prices.\nThis is Dehiwala at street level. Malay Restaurant is a small eatery that's somewhere between a restaurant and a hole in the wall food stop. True to its name it serves up a comprehensive selection of Malay food - which in Sri Lanka means lots of meat, particularly beef, offal, and sea food.\n\nගත්ත කටටම යාළුවා කිව්වේ ‘‘නියමයි, මමත් යන්නෙ කන්න තමයි හදන්නෙ මචං. කරගම්පිටිය පොඩ්ඩක් මෙහායින් තියෙනව මැලේ රෙස්ටුරන්ට් කියලා ප්ලේස් එකක්. යමං දෙන්නත් එක්කම එතනට’’.\n\nMalay Restaurant in Dehiwala is hugely popular, and after trying our their stuff we can see why. The portions: massive, the flavours: excellent and the prices: reasonable.\n",
  "url": "https://www.yamu.lk/place/malay-restaurant/review-143290"
}