{
  "name": "Mayura Hotel",
  "address": "46, Sri Kathiresan Street, Pettah",
  "telephone": "0112335109",
  "close_time": " Open 12:00PM to 4:00PM & 6:00PM to 10:00PM",
  "description": "Mayura Hotel serves great rice and curry on banana leaves, and excellent Jaffna crab.",
  "tip": null,
  "review": "Mayura Hotel is an epic place to stop by for some of the best crab we've had in ages. Just step aside,\n,\nand\n, you're no match for this little hole-in-the-wall inside Pettah's marketplace.\nThey only serve rice and curry here - with whatever side you'd like, whether egg, chicken mutton or seafood. The prices are from Rs. 170 to Rs. 390 (the highest being for crab). It's all served on a banana leaf, and though we just made a trip for the crab really (having heard of its fame in these parts), we were pleasantly surprised by how delicious the rice and curry itself was. Much fresher than rice and curry usually served in bath kades, and served with veggie sides, parippu and a nice omelet.\nSo let's get to the crab! It arrives bright red and looking spicy as ever with a side of dynamite crab curry (my favourite part). Now usually crabs piss me off because they're so delicious but you need to pick at them incessantly and I personally don't feel like there's ever enough meat in there to compensate for all the manual labour it took to retrieve it. This crab, though not jumbo or anything, an ordinary size, was loaded with meat.\nLook at this fat guy. Whether at the center or at the claws, there was plenty of meat for a proper satisfying filling meal. The meat was extremely soft, spicy, and as authentic as Jaffna crab curry gets. Zero complaints about this meal, absolutely worth the trip. Plus, being so excellently prepared, you don't have to sell your soul for a bajillion bucks to pay for the meal like at\nfor example. Just a crab without rice costs Rs. 300.\nThis is a crowded lunch hour. It's loaded with men probably from nearby businesses in this Pettah hub. The tables and chairs despite the crowd are kept very clean and service was great (everything arrived super fast), with just a few Tamil staff running the whole show. You'll see them walking around with big tins of steaming rice, ladling them onto banana leaves.\nHow you order is you just go to the end of the shop and tell the guy what you want and they've got a prepared batch of everything, though the omelettes come hot-hot. This is also where they pack it up for you if you want to take-away, like a lot of people do, if you don't like the crowded atmosphere.\nMayura Hotel crab and rice and curry were pretty amazing. If you're on the lookout for good rice and curry, and excellent crab, we definitely recommend take-aways from here.\n",
  "url": "https://www.yamu.lk/place/mayura-hotel/review-36038"
}