{
  "name": "Mlesna Tea Fortress",
  "address": "No. 445, Colombo Road, Kiribathkumbura, Kandy",
  "telephone": "0812384303",
  "close_time": null,
  "description": "A monolith of a building on the Colombo-Kandy road with decent food and plenty of great tea.",
  "tip": "Try their tea tasting on the ground floor.",
  "review": "Mlesna's Tea Fortress is located just before Kandy, so by this time, most of us road trippers are weary, hungry and very much in need of a bathroom (TMI?). Step into Tea Fortress for all those needs. They serve some excellent tea with decent food.\nTheir menu is extensive and carefully curated to suit the foreign crowd as well as the locals who would be sitting down for a quick lunch. The dishes can be pretty expensive unless you're going for something Sri Lankan.\nThe Vegetable Fried Rice (Rs. 600) came with a massive portion enough for at least 3 people (though they said the portion is for one) with a delicious side salad,\nand chili paste. The rice was nothing special, just your everyday egg fried rice so I wasn't that thrilled that it cost 600 bucks.\nWe also tried the Grilled Darne of Seer (Rs. 1700) which was absolutely fantastic! I highly recommend this. The fish was perfectly cooked with a delicious lemony orange sauce. The sauce had a thick texture which boded well with the marinated fish.\nThe Spaghetti Napolitain (Rs. 850) was again nothing special. To be completely honest, it was well below average. Certainly not worth paying that much for. It was indolently assembled with a chunk of spaghetti, a spoonful of pasta sauce and a cheese slice on top, all microwaved together. The consistency of the sauce was way off with a very watery texture and there certainly wasn't enough to go around.\nThe Baked Orange Cheesecake (Rs. 300) while tasted great, was more of a pudding than a cheesecake. The filling was very dense and solid as opposed to a creamy and smooth texture that is of a cheesecake. The biscuit base, however, was amazing. I finished that almost entirely by myself. I wouldn't say this was a bad dessert because the zesty orange taste accompanied by the sweetness of the filling parred for a filling and delicious treat but it is definitely\na cheesecake.\nThey have a great drinks menu with a separate section for tea which is wonderful. Aside from tea, you can also get coffee, hot chocolate, fresh juices and soft drinks.\nWe got a cup of Milk Tea (Rs. 150) which is definitely where they shine. The tea was excellent with a thick texture and strong tea aroma. The high grown BOPF and milk blended into a lovely strong brew.\nThe Hot Chocolate (Rs. 280) unfortunately, did not hold the same satisfaction. It was too milky for my liking and the chocolate had not been mixed well because I found quite a few lumps at the bottom. It's probably best to stick to the teas.\nTheir service is wonderful, very courteous, friendly and well-versed. We didn't have to wait very long for the food to arrive.\nThe place is a huge monolith of a stone building with a pond, giant tea filters, and a tea tasting room. The dining area is upstairs and it is set up very nicely, with comfy seatings and beautiful artwork.\nThey offer tea tasting at the shop below, which you can also experience here in Colombo as well. Just visit their\n.\nIt's a great spot to visit on your way to the hill country to stretch your legs and enjoy a cup of tea while exploring some of the local histories of the city. Just be mindful when ordering off the menu because the prices tend to be very steep.\nA great spot to visit on your way to the hill country to stretch your legs and enjoy a cup of tea while exploring some of the local histories of the city.\nA popular pit stop for meals, tea, and bathroom breaks on the way to Kandy.\n",
  "url": "https://www.yamu.lk/place/mlesna-tea-fortress/review-220379"
}