{
  "name": "My Sister's Kitchen ",
  "address": "53, New City Garden, Gadabuwana, Piliyandala (Delivery)",
  "telephone": "0773017515",
  "close_time": " Open 7.00 AM to 11.00 PM",
  "description": "Tasty home-cooked Jaffna style dishes - they do orders in bulk, so ideal for lunch or dinner parties. ",
  "tip": "Make your own rice / rotti to go with your order. ",
  "review": "My Sister's Kitchen now also offers sides in addition to curries, including pittu, string hoppers and sambols among others.\nMy Sister's Kitchen does bulk orders of Jaffna style curries, and they deliver too - we tried their mutton and sea crab and they were pretty awesome. The brains behind the recipes actually belong to the sister of local celebrity Danu Innasinnathamby, hence the name.\nThe menu includes mostly a range of meats - beef, pork, mutton, chicken, fish, prawns, crab (check their Facebook page menu in our gallery). And though she cooks up some non-Jaffna cuisine too like peppered beef and chicken in lemongrass, go for the Jaffna food because it's pretty special - refer the red hot chilli sea crab curry above.\nThere's a lot of masala and aroma in these dishes, so Jaffna cuisine isn't something you go for if you want something mild on the tastebuds. The mutton curry was good, the meat was tender and chopped up in little pieces, it was both spicy and sweet, and 1 KG seemed like plenty (it lasted for both lunch and dinner) though some of the bones were also included in the curry. This is the most expensive thing on the menu, at Rs. 2600.\nAs a huge fan of crab, I was really happy with the sea crab in murunga curry. This had plenty of sea crabs in them and parts of the crab body as opposed to the whole thing. Again, chilli-ridden in Jaffna style, with a large bowlful of thick red hot curry. (Still haven't found better crab than the ones at\nthough.)\nWe don't know any other Jaffna home cooks in Colombo and that too, with delivery. So we're definitely glad we've got My Sister's Kitchen around. If you've got a craving for very spicy aromatic Jaffna food and you've got a group to join you, this is a good choice to go with.\n",
  "url": "https://www.yamu.lk/place/my-sisters-kitchen/review-38335"
}