{
  "name": "Nihal's (Jetwing Lighthouse Club)",
  "address": "Jetwing Lighthouse, Dadella, Galle",
  "telephone": "94912223744",
  "close_time": null,
  "description": "The main restaurant at the luxe Jetwing Lighthouse Club in Galle, serving up special degustation menus and bespoke dishes. ",
  "tip": "Feel free to chat with Nihal or his staff before hand and tell them what your preferences are. ",
  "review": "Nihal's is\nfine dining restaurant, serving up decadent breakfasts and multiple course formal dinners. It's a labour of love of renowned Executive Chef Nihal Senanayake, who has been with the Jetwing group for decades now.\nIf you'd like an in-depth look into the restaurant's Epicurean Bubbly Breakfast, check out\n. We take you through the buffet and a la carte morning options. We also discuss their evening drinks and happy hour (which means discounted drinks for walk-in guests, and free drinks for hotel guests!)\nWe had a rather indulgent 7 course degustation menu courtesy Chef Nihal himself. It covered a wide spectrum of produce, preparation, and pairing. While the menu changes every day, you'll notice that most of the menus reflect Mediterranean sensibilities with lots of locally-sourced ingredients and a Sri Lankan touch.\nWe'll take you through each of our courses, just so you have an idea of what the usual dining experience would be there. Make sure you set aside at least 2 hours for dinner though - it's a full-fledged experience that cannot be rushed!\nServed on crisp fennel and pepper salsa, the fillet came drizzled with honey mustard dressing. The tea flavour was very, very subtle, but the cold cut of chicken flourished when teamed with the honey mustard.\nThe curry leaf baked cauliflower and leek soup came with a black tea twist, and was intensely wholesome in the monsoon gale. Again, I found the tea twist too subtle to discern, but the flavours of the fresh vegetable produce barely needed anything else.\nThe garlic sautéed bay prawns came served on inventive strips of kurakkan pancake with creamy lemon grass sauce. The prawns themselves were just so tender and delicious, and I enjoyed the texture building of the pancake, the prawn, and the delicately creamy sauce.\nA sour sop sorbet served as the much-deserved palate cleanser between courses. Nestled in a dish of ice, the sorbet was fresh and delicately flavoured. It would have actually served as a great dessert in itself.\nThe tenderloin of pork was wrapped in grilled bacon, and drizzled with port wine sauce. It came with some gently olive oil baked vegetables reminiscent of ratatouille and roasted black teadusted sweet potato mash. It was probably my favourite dish on the menu, barely beating the bay prawns due to its impeccable presentation. The other option was the fish, which we also tried.\nThe pan fried fillet of barramundi sat on a bed of sautéed young vegetables and shrimp buttercream with a side of cumin rice. This option was lovely, light, and fresh, but somewhat paled in comparison to the tenderloin. The highlight was definitely the shrimp buttercream sauce, which had hints of saffron and happiness.\nThe warm pineapple rum cake came with rum anglaise, raspberry florentine, and pineapple compote served with homemade coconut gelato. At this point of the meal, we were severely flagging and our once-favoured dessert was almost a chore. Almost. We still scarfed this down, especially revelling in the lovely fresh coconut flavour going on (which we were told was homemade - impressive!).\nThe ambience wasn't as spectacular in comparison to the food, mostly because the restaurant's charm lies in its rapport with the open, airy beachside. When we went, it was absolutely pouring and the plastic curtains had to be pulled down so both the view and the natural breeze were stilted, which was a pity.\nWe did quite like the solo violinist playing away in the corner while we ate, it made us feel like we were aristocrats on the sinking Titanic, but in a good way.\nThe service was incredibly quick, and very friendly. This was easily some of the best service on the island, with absolute attention to detail, lots of smiles, and perfect efficiency.\nChef Nihal himself also came to say hello before the meal and was happy to answer all our questions, and ask us what kind of cuisine we liked etc. It was a personal touch that added to the overall feel of individualised luxury.\nThis was a great dining experience, and each of our meals was perfectly curated. The options were extensive, the quality of both produce and preparation were impeccable, and we left absolutely satiated and impressed. It's a strong recommendation from us!\n",
  "url": "https://www.yamu.lk/place/nihals-jetwing-lighthouse-club/review-105965"
}