{
  "name": "No.1 Dewmini Roti Shop (Mirissa)",
  "address": "Udupila Road, Mirissa",
  "telephone": "0715162604",
  "close_time": " Open 8.30 AM–10 PM",
  "description": "Mirissa seems to love its roti, and no one does it better than No.1 Dewmini Roti Shop. It's a small, family-run restaurant that offers an impressive variety of dishes, along with some of the best savoury and sweet rotis we've had.",
  "tip": "These rotis are just perfect at any time of the day.",
  "review": "Mirissa seems to love its roti, and no one does it better than No.1 Dewmini Roti Shop. It's a small, family-run restaurant that offers an impressive variety of dishes, along with some of the best savoury and sweet rotis we've had.\nBefore we set out to\n, we decided to check out what was popular on Tripadvisor (which is ill-advised in general, but what to do), and Dewmini Roti Shop was rated No.1 (hence the name), with some rave reviews. This place is the definition of a family-run restaurant, with pretty much every member involved in some capacity. Their menu actually includes rice dishes as well, but everyone comes here for their roti. Both their sweet and savoury rotis are priced between Rs. 200-400 and make for a substantial meal.\nFrom their daily specials, we got the cheese, chicken and prawn roti (Rs. 320). This roti may look simple and relatively unimpressive, until you cut into it and see the amount of filling they put in.\nThis was just a joy to eat and we found ourself cleaning the plate out. The chicken was succulent and lightly peppery, while the pan-fried prawns tasted fresh and slightly crunchy. The melted cheese completed the dish by adding a creamy and salty touch, binding together the flavour of the chicken and the prawns. This is easily one of the best savoury roti variations I've had in Sri Lanka.\nTheir dessert rotis were just as impressive, if not more. We tried the banoffee (Rs. 270) as well as the chocolate peanut butter (Rs. 270) and they were so decadent that just thinking about it is makes me want to hop on a bus back to Mirissa.\nDewmini's Banoffee roti is only loosely based on its namesake. It comes with a filling of chopped bananas, chocolate and crushed cookies, topped off with a dollop of vanilla ice cream. It presented the perfect mix of textures—smooth chocolate, crunch from the crushed cookies and soft bananas—and a beautiful contrast between the warm roti and cold ice cream. Flavourwise, the three components in the filling worked well together.\nThe PB & chocolate roti was on par with the banoffee, which is to say that it was happiness-inducing as well. I'm a huge fan of peanut butter, so I simply had to try this one. While it doesn't have as many textures going on as the banoffee, the smoothness of both the chocolate and the peanut butter work brilliantly against the crispness of the roti. We also loved the fact that they didn't skimp on the filling, which is quite common with expensive ingredients like peanut butter. The real draw here is the savoury-sweetness from the peanut butter and chocolate, which leaves the best kind of aftertaste.\nThe best way to describe Dewmini Roti Shop is as a simple garden restaurant. They've got some plastic tables and chairs with seating for roughly 20. There's plenty of natural shade from the surrounding trees and greenery, and you may even see the occassional peacock go by. It's basically right outside the family's house, so the eatery has an oddly comforting feel to it.\nService is fast and friendly, with the entire family of six helping out with the cooking, cleaning and serving. They also conduct cooking classes, where over a course of four hours, they teach you how to cook a variety of curries, hoppers and other Sri Lankan staples. At Rs. 2,500 per head, it's definitely not cheap, but it seems more targeted towards tourists. From what we can tell, the classes are quite popular.\nRegardless of whether you're a tourist or local, Dewmini Roti Shop is a must-visit if you're in Mirissa. As far as roti goes, this family is truly deserving of that 'No.1' tag.\n",
  "url": "https://www.yamu.lk/place/no1-dewmini-roti-shop/review-56602"
}