{
  "name": "Noodles (Cinnamon Grand) ",
  "address": "Cinnamon Grand Colombo, 77, Galle Road, Colombo 3",
  "telephone": "0112497361",
  "close_time": " Open Monday-Saturday: 12 PM - 3 PM  & Daily: 6.30 PM - 11.30 PM",
  "description": "Noodles at Cinnamon Grand offers one the most complete dining experiences around the city at a surprisingly affordable price point, while maintaining a high level service.",
  "tip": "Call for reservations if you're going for dinner, since the place gets pretty packed.",
  "review": "Noodles at Cinnamon Grand offers one the most complete dining experiences around the city. Despite a menu that offers varying Asian cuisines, they manage to do all of it quite well, at a surprisingly affordable price point, while maintaining a high level of service.\nWhen you think about hotel restaurants, in most cases you’re looking at spending around Rs. 2000 per head, at least. Noodles, however, is a welcome exception from the norm with most of their mains ranging from Rs. 650 - Rs. 850, which is outstanding considering the ambience and service. I’m usually skeptical when it comes to restaurants that try to offer a bunch of cuisines, but Noodles does a great job by not trying to do too much while still offering a good variety of cuisines including Chinese, Japanese, Thai and Indonesian.\nWhen I got the menu in hand, I was trying to decide between three pork dishes (which is way harder than it sounds). Then when we asked the waiter, he just pulled out an iPad that had the entire menu with actual images, which we think is a really cool feature that other restaurants should also offer.\nAfter going through the images, I settled on the the roast pork tebasaki (Rs. 650). Tebasaki usually refers to Japanese fried chicken wings, but this was the pork variant served along with stir fried wansui noodles, which are a type of thick noodles. The noodles were silky and well seasoned with the onions and cabbage adding a bit of texture.\nThe hero of the dish, however, was the pork, which was cooked perfectly with an thin crackling like crispy skin, with a thin layer of well rendered fat which added a great flavour. The spicy sauce that came with the pork elevated the dish further by adding a bit of sweetness and a good amount of spice and heat.\nDespite the name, Noodles does offer a few rice dishes so we wanted to try out the Crab Rice (Rs. 650), since Rs. 650 is super cheap for any crab dish. The rice itself was flavoursome and not too oily, with a distinct umami taste. The crab comes mixed in with the rice so you can’t see it very distinctly but the flavour does come through. The portion is also pretty impressive, but this comes with quite a lot of green peas which may not be for everyone.\nThe spicy thai noodle with pork (Rs. 650) was our other main and we were happy to see how different it was from the other pork dish. This one came with rice noodles which were thin and light. The pork here was mostly lean with a good balance of seasoning and spice. We wouldn’t exactly call the dish “spicy”, but we found that adding a bit of soy and sweet chilli sauce helped make it bit more dynamic.\nWe tried two desserts, the first of which was their Pandan Cheesecake (Rs. 350). This was a slightly different take from most of the traditional cheesecakes, with a thicker cream cheese center which had bits of coconut agar mixed in. The pandan jello topping also complemented the other milder elements by adding a burst of sweetness.\nIf you’re looking for something with less sugar, the Coconut Milk Tapioca Pearl (Rs. 350) might be just right. It’s actually a fresh fruit salad topped with coconut milk sago. This is a great way to end the meal since it’s really refreshing with mangos, pineapple, strawberries, papaya and even rambutan. The sago added a bit of texture, but there honestly wasn’t enough of it so we’d just consider this a really good fruit salad.\nOne of the reasons we were so surprised by the prices at Noodles was because the ambience is on par with, if not better, than most high profile restaurants around town. It’s a relatively dark theme with soft yellow lighting which defuses across the dining room. Dark brown isn’t the most eye-catching colour but it works well here along with some comfy cushioned cane chairs. Our only gripe was that the chairs are slightly slanted backwards so you’ll find yourself leaning forward quite a bit when eating.\nThe service at Noodles also gave us nothing to complain about. As I mentioned earlier, the staff was friendly and attentive despite the busy dinner service. They always had two managers on the floor overlooking the restaurant so waiters were redirected efficiently. Our food did take around twenty minutes to come to the table but we think that’s okay since the restaurant was at capacity that night.\nAt the end of the meal, our bill for four came to just Rs. 5300 for four which is kind of ridiculously reasonable. It’s a stress-free, well executed dining experience which won’t leave a dent in your wallet. Next time you’re wondering where to go for dinner, think Noodles.\nNoodles at Cinnamon Grand offers one the most complete dining experiences around the city at a surprisingly affordable price point, while maintaining a high level of service.\nNoodles hits a sweet spot in the Colombo dining scene. They do a flavorful range of (mostly) noodle-based Southeast Asian dishes, and they're quite affordable as well. It's a busy spot just a year after opening, and for good reason.\nNoodles is an exciting new restaurant at Cinnamon Grand that promises the best of Asian noodle cuisine, from Thailand, Vietnam, China, Japan and Malaysia - the food is good, the service and ambience flawless, plus it's not too pricey.\n",
  "url": "https://www.yamu.lk/place/noodles-cinnamon-grand/review-92643"
}