{
  "name": "OneUp All Day Breakfast",
  "address": "11 Kinross Avenue, Colombo 04",
  "telephone": "0112508201",
  "close_time": null,
  "description": "A cozy cafe serving breakfast all day.",
  "tip": null,
  "review": "OneUp opened up one floor up from Tom Yum on Galle Road a couple of months ago. Our first look was glowing, and our full review is pretty luminiscent too. It's a small Aussie-themed cafe playing homage to\n, featuring delicious (if not expensive) brunch, and good regional coffee.\nStraight off the bat, the menu made us giggle with one of the options; Tony Abbot, 2015, no longer available. The rest of the menu options are also named after famous Australians, like Margot Robbie and Isla Fischer. We started with a couple of drinks, the Iced Chocolate (Rs.550) and the Apple, Strawberry & Mint Juice (Rs.600).\nBoth drinks were delicious. The iced chocolate was a simple concoction of milk, vanilla ice cream, chocolate sauce, and cocoa powder. I'm not sure that's worth Rs. 550, but it was still great because who doesn't want to start breakfast with dessert?\nThe juice was a bit more complicated, with fresh blended apple, strawberry, and mint leaves. It was refreshing, cold, and tasty, and the ingredients justified the price tag a bit.\nFor our mains, we opted for a Stone the Flammin Chooks, a super-sandwich of sorts. At Rs.1700, this is a meal in itself featuring fried masala chicken, avocado, slaw, cheddar, sriracha, aioli, pickles and focaccia. This is probably my favourite sandwich of all time, a veritable smorgasbord of flavours, crisp fresh ingredients, and soft, buttery bread. The chicken itself was perfectly spiced and fried, ensconsed in the thick-cut bread and schmears of rich guacamole. As for the name, we assume it's a play on \"\n\" meeting the Aussie slang for chicken, \"\n\".\nWe also opted for an Isla Fisher, because who wouldn't. Sacha Baron Cohen would be able to attest to how well-presented this dish was, a funky little garden of crispy hash browns, rosettes of smoked salmon, and blobs of poached egg garnished with feta cheese, rocket leaves, and drizzles of olive-oil infused salsa verde. Everything on this plate was perfectly executed, and made for a very filling portion. The home-made hash browns deserve a special shout out, because we'd eat them plain for breakfast every day if we could. We'd strongly recommend this, but wish there was one defining flavour (either spice or sweetness) to offset the other flavours at play.\nWe also ordered an extra side of Fried Chicken (Rs.400), out of sheer greed. It was basically the same as the chicken in the sandwich.\nThe space itself is pretty tiny, with space for just about 5 small tables and a window bar seating. It's cute enough, with some random potted plants and funky murals.\nThe service is pretty friendly, given that these guys are absolutely full every time we've visited. They asked us to wait a bit but then deftly accommodated us at the window. If they're packed you may be turned away or have to wait for 20 minutes or so, so watch out for that. Our food orders did take about 25-30 minutes to arrive, but they checked up on us whenever possible, so we appreciated that.\nIn our experience, the food here is always good, and some of it is spectacular, like the presentation of the\nor the sheer taste of the \"flammin chooks\" sandwich. However, since we're giving it a 5-star rating, disclaimers are necessary: prices are amongst the highest in the city - you're looking at about 5K for two mains and two drinks even though service charge and taxes are included in menu prices. If that price point and the potential wait doesn't faze you, head on over!\nA cafe serving some of Colombo's best brunch.\nBreakfast all day, everyday.\n",
  "url": "https://www.yamu.lk/place/oneup-all-day-breakfast/review-164183"
}