{
  "name": "Pages & Coffee",
  "address": "No. 437 /1, Cotta Road, Rajagiriya.",
  "telephone": "0710190400",
  "close_time": null,
  "description": "A great place to sit and enjoy some organic coffee amongst loads of books.",
  "tip": "Try the Hot Chocolate. They have odd hours so better check before you go. Also, they do not accept cards, only cash.",
  "review": "The concept of books and coffee is not something new, but Pages & Coffee have executed it in a way quite unlike anything else. It's at the heart of the city in Cotta Road towards the Rajagiriya flyover. Bear in mind, it's a little hard to find as they have no fancy board up. It's right opposite Green Cabin on 3rd Lane.\nBasically, the place is a house turned into a reading corner that happens to serve coffee and their very own mug pasta. There's a separate room where they have shelved the books on branches. There's no specific genre, but I saw some familiar names like Michael Connelly, Khaled Hosseini, and Danielle Steele etc. I found the books to be dusty, so I would've really appreciated if they had been better cared for.\nThey also have a very comfy couch where you can sit and enjoy a good read with no distractions.\nTheir menu is quite limited with a handful of beverages like coffee, hot chocolate, and a strawberry smoothie.\nThe Chunky Choc Ice Coffee (Rs. 400) was way too sweet for my liking. The abundance of chocolate has overpowered whatever else was added.\nThe Hot Chocolate (Rs. 400) on the other hand was a classic! It was delicious and chocolatey with the perfect consistency. An ideal choice to have while you dive into a good book.\nTheir food doesn't have a huge variety either. There was a kurakkan sandwich, a crispy chicken burger, and mug pasta.\nThe Double Cheesy Mug Pasta (Rs. 550) was decent. The pasta was cooked well and as the name suggests, it was very cheesy. There was melted cheddar on the inside topped with a little too much mozzarella. They could have gone easy on the mozzarella because it fills you right up, even before you reach half of the pasta.\nThe Crispy Chicken Burger (Rs. 550) Vishvi got left us conflicted. First of all, there was no crispy chicken on sight. Instead, there were tiny bits of barbecued chicken at the bottom of the burger which barely compensated for a patty. Second of all, the burger itself was very sloppy and not very tempting. The problem is, it actually tasted quite good. There were pickles on it which gave it a good kick but it's hard to get over the presentation. The fries were decent.\nThere are two people manning the place and they were both very friendly. The biggest problem here is that they take way too long to serve the food. The pasta especially took at least good 30 minutes to arrive.\nThe place is very simple and cozy with wooden furniture and minimal decorations. We do not recommend you step in on a hot day, it gets very stuffy in here. Best to come in the evening to get the best experience.\nWe really like the idea of the place and it's any book lover's dream to step into a cafe and see a dedicated place just for reading. Nonetheless, they could still improve on their execution.\n",
  "url": "https://www.yamu.lk/place/pages-coffee/review-219281"
}