{
  "name": "Panino (Cotton Collection) ",
  "address": "145, Dharmapala Mawatha, Colombo 7",
  "telephone": "0112332296",
  "close_time": " Open 10 AM–10 PM ",
  "description": "Panino specialises in sandwiches. In melts, to be specific. They also have a killer hot sauce.",
  "tip": "Some of the stuff from the menu isn’t available on mornings and weekdays, so a weekend lunch or coffee is ideal. Just get there early to grab a seat. ",
  "review": "Having previously tried the\nand fried egg melt,\nsays that it \"... was delicious — I need to try it at home — and although it was basically egg and\n, the spiciness of the sambol and the just-perfect texture of the toasted bread made it a memorable snack.\"\nIn addition to this, we also got their pulled chicken BBQ sandwich (Rs. 550) along with bottled king coconut water (Rs. 150). That felt like a ridiculous price to pay for a 300 ml bottle of\n, when you can get the real deal for a fraction of the price.\nThe king coconut water was... well, your everyday\njust lesser in quantity and steeper in price.\nPanino whips up some some really decent sandwiches. Hot, toasty, and just the right size, this place is good value for money.\nPanino is probably the only place in Colombo that specializes in ‘sandwich-cuisine’ and you are definitely going to get your money’s worth here.\n\nඇත්ත ම කිව්වොත් ස්නැක් එකකට විතරක් නෙවෙයි, දවල් කෑමකට වුණත් බඩ පුරවගන්න පුළුවන් විදියේ පනීනි මේ කට්ටිය ළඟ තියෙනවා.\n",
  "url": "https://www.yamu.lk/place/panino-colombo-7/review-54843"
}