{
  "name": "Ponnusamy Non-Veg Chettinad Restaurant",
  "address": "19/1, Horton Place, Colombo 7",
  "telephone": "0112665599",
  "close_time": null,
  "description": "A non-vegetarian South Indian Chettinad restaurant on Horton Place.",
  "tip": "Stick to the items you know well already, the menu is too huge and cumbersome to navigate or make sense out of",
  "review": "Ponnusamy is a bit of a puzzle ambiance-wise. It is located in Horton Place, and looks imposing and upmarket on the outside, but things function largely along the lines of your average saivar kade inside. Customers with Marxist leanings will rejoice at the subtle, subversive performance art at play here.\nThe service was one of our biggest question marks, so we'll start here. Many of the waiters seemed clueless about the food on the menu, and struggled to make recommendations. I wouldn't exactly blame them for this since said menu consisted of 194 items, all placed in very complicated categories, with some of the items apparently repeating themselves under different names in different sections.\nOrdering here is sure to give you a boost of dopamine because it is likely the most complicated task you will accomplish for the day. Needless to say, our orders were mixed up on at least two occasions. The hygene wasn't exceptional either, evidenced by the splotches of someone else's meals on our table mats.\nThe cutlery looks like it's made of porcelain and glass, but after you discover you can lift it with a finger, you realize it is deceptively solid looking plastic instead. More class-subverting performance art?\nIs nothing special. At all. The place is a warren of drab white rooms filled with boring, practical tables and chairs. People come in, get served, eat and leave. The ambience doesn't encourage you to hang around and enjoy the space, which is strange because they seem to largely cater to families.\nHere's where Ponnusamy delivered more than it failed. The food was largely good, and a small proportion of it was even fantastic. Some of it was hit and miss. The prices are quite reasonable for the portions and quality.\nThe Mutton Dosai was a clear hit. At Rs. 395 it comes with a quantity of soft, peppered, beautifully flavored mutton that is a neat surprise. The Chicken Tikka Masala (Rs. 625) and Channa Masala (Rs. 400) were both very good, and were made of different spice bases (some restaurants actually get lazy and use the same base, defeating the purpose of ordering different masala items) and complemented each other really well. The spices were nicely balanced and didn’t overpower the texture and flavor of the food.\nThe Parata (Rs 125) (not pictured - it disappeared too fast) was a highlight, I have never had a parata this soft and fluffy I kid you not.\nThe Garlic Naan (Rs. 200) (pictured above with the masala) was pretty average, not bad by any means, but you expect it to be nice and crispy, instead it ends up being a little hard and crusty.\nThe Gobi 65 (Rs.450), our starter, was a little overfried, and the outer layer gave off a slightly bitter aftertaste.\nWe'll put them both in the same category because they both completely failed to deliver. The Mango Lassi (Rs.250) (pictured above for its false-flag glass glass) tasted artificial.\nAnd the fruit salad (Rs 250) (one of the only things available) looked like the kitchen staff hadn't even bothered with it. The fruits were badly chopped and no lime or other seasoning was added. And someone please tell me what brand of vanilla ice-cream they used so I can avoid accidentally buying it.\nLargely shrug inducing on an overall basis, but the food mostly delivers, and the prices aren't bad. So if you're in to this style of cuisine, given the choices Colombo offers, put a visit.\nDecent food just about makes up for disappointing service and lacklustre ambience.\nA South Indian Chettinad non-vegetarian restaurant on Horton Place.\n\nමොනවා වුණත් තෝසේවලට නම් මෙතැන පට්ට. අනික ගණනුත් ශේප්නේ.\n",
  "url": "https://www.yamu.lk/place/ponnusamy-non-veg-chettinad-restaurant/review-208389"
}