{
  "name": "Red Orchids",
  "address": "35, Castle Lane, Colombo 4",
  "telephone": "0112555058",
  "close_time": null,
  "description": "Red Orchids is like the new Flower Drum, with the same staff and waiters, and again they do tasty classic Sri Lankanized Chinese food at affordable rates. ",
  "tip": null,
  "review": "Historically, if you ever thought of Sri Lankan Chinese food, the name that went with it was Flower Drum. However, they started to lose out on service and flavour, and while Flower Drum is still around, its taste hasn't quite been the same of late. To find that specific deliciously addictive taste again, you now need to head to a different place: Red Orchids.\nWe’ve been here before and we’ve had a great experience with the food. That's because this place has a lot of the kitchen and wait staff from the original Flower Drum. It was very good, and despite what seemed a small portion, was very very filling.\nWe ordered a small portion of the Red Orchids Special Fried Rice (Rs.750). We wanted to get a portion of the special noodles as well  but the very professional and friendly waiter insisted that the small portion would be sufficient for two. So we chose to put our faith in his advice and were justified in doing so.\nNot only were the long grains of rice cooked to perfection without being soggy, the rice was a mix rice with bits of egg, fish and prawn added in generous amounts.\nWe also got the Pork with Dry Red Chillies (Rs.800) on the advice of our friendly neighborhood waiter. This turned out to be a dish of small pork pieces and veges swimming in gravy. The pork pieces were cooked to soft perfection and were very flavourful. There were some dried red chillies but it wasn’t in enough number for us to really notice.\nBut the star of our lunch was by far the Crispy Fillet of Fish (Rs.880). These were thick pieces of seer fish covered in a pocket of flour and deep fried, then tossed in a sweet and sour sauce. The fish was soft, fresh and immensely flavourful. The pieces just break apart and melt in your mouth. So delicious. In fact, so was the covering that the fish was wrapped in. How it retained any crispiness while in that sweet sauce, I have no idea. But retain it did and it provided a wonderful additional texture to the fish. The sauce was delicious too. While there were small flakes of chilli in there, the sweetness was the most pronounced flavour. We’re not complaining. We wanted more of it.\nFor dessert we got the Lychees with Ice cream (Rs.350). Nothing to write home about. The lychees were as good as canned lychees could be and the ice cream was a bit too frozen to give any good flavour. It was just ok.\nService was really top notch. They were very polite, very knowledgeable, very helpful. We never even got a chance to serve ourselves at any point. The staff would appear from nowhere and re-serve us.\nNothing much has changed from the last time we came here. Same generic formal decor with a little bit of Chinese thrown around. Same commendable level of cleanliness.\nRed Orchids is definitely a great choice for a Sri Lankan Chinese meal. The place is great. The service is great. The food is great and filling while not being extravagantly expensive. All this cost us Rs.3705 with taxes and service charges, which was reasonable considering we could hardly walk after eating.\nRed Orchids is definitely a great choice for a Sri Lankan Chinese meal. The service and food are great and filling while not extravagantly expensive.\nRed Orchids is like the new Flower Drum, with the same staff and waiters, and again they do tasty classic Sri Lankanized Chinese food at affordable rates.\n\nශ්‍රී ලාංකීය ක්‍රමේට හදන චීන කෑම කන්න හොඳම තැනක් කියල තමයි රෙඩ් ඕකිඩ්ස් එක අපිට තේරුණේ. පොකට් එකට ලොකු තට්ටුවක් වදින්නේ නැතිව හොඳට රසට බඩ කට පිරෙන්න කාල එන්න පුළුවන්.\n",
  "url": "https://www.yamu.lk/place/red-orchids/review-140386"
}