{
  "name": "Room Service Deliveries ",
  "address": "Delivery Only",
  "telephone": "0115768768",
  "close_time": " Open 11.00 AM - 11.00 PM",
  "description": "Room Service is one of the more efficient delivery services around. Their delivery charges are higher than most others but they deliver from some high profile restaurants that you can't get otherwise.",
  "tip": null,
  "review": "Room Service is one of the more efficient delivery services around. Their delivery charges are higher than most others but they deliver from some high profile restaurants that you can't get otherwise.\nOrdering with Room Service is pretty straight forward, but can be a bit painstaking due to the fact that their website and Facebook page aren't up to date. All you need to do is call their hotline on\nlet them know the restaurant and the item(s) from the menu on the website, and then just wait for the food to be delivered. The issue here is that the menus on their site are a bit dated so the prices may differ.\nPayment can be made on delivery, but you need to keep in mind that VAT will still be charged, as well as a small amount for packing at some of these restaurants.\nThe good thing about Room Service is that their customer service is excellent and the gentlemen who took our order was polite, patient and willing to go through menu details and the different dishes. We actually ordered from them on two separate occasions and both times the delivery came in under an hour, everything intact with no spillage.\nWhat sets Room Service apart from most of the other delivery services like\nand Orderfood.lk is that they deliver from the likes of\n,\n,\nand\nwho don't generally do their own delivery.\nTheir services aren't limited to just food either, they also deliver laundry, flowers and even perfumes.\nThe caveat here is that their deliver rates are some of the highest around with deliveries to Colombo starting at Rs. 300 and suburbs costing quite a bit more. Only Hot Wheels currently charges more. That being said, we were still quite happy overall since everything was in order.\nRoom Service, while expensive, still offers one of the best delivery services around. They're also the only real option for those looking to get food delivered from some of the top restaurants in Colombo.\n",
  "url": "https://www.yamu.lk/place/room/review-47783"
}