{
  "name": "Royal Cashews (Crescat)",
  "address": "Crescat Boulevard, 97 A,  Galle road, Colombo 03, Sri Lanka.",
  "telephone": "0114061419",
  "close_time": null,
  "description": "Royal Cashew is a kiosk selling cashew varying from different flavours.",
  "tip": null,
  "review": "If cashew cannot unite our\nSri Lankan le, nothing can.\nRoyal Cashew is here to cater to all your nutty needs.  Their exciting flavours would probably make the\nakkis in their brightly colored\nunhappy. They have\nand I decided to hop into their Crescat outlet.\n\nThe best thing about Royal Cashew is their range of flavours. Unlike the usual roasted and devilled cashew nuts that you would find at the supermarkets, Royal Cashew offers a wide range of flavours to choose from.\nTheir flavours include Hot Pepper, Masala, Shrimp and Red Onion, Sour Cream and Onion, Spanish Tomato, Salted, BBQ, Burnt, Natural Dehydrated, Cheese Onion, Sugar Coated, Hot and Spicy, and Chilli Seasoning.\n100 grams of any flavour costs Rs 370 and this, in comparison to other packets of 100g cashews at supermarkets, is less pricy.\n\nThese didn't have a distinct shrimp taste which was pretty disappointing. I expected them to taste like prawn crackers but in cashew nut form. In contrast, it did have a strong red onion flavour coming through.\nOn the whole, it was pretty good. The type that would have you going back for more.\nSugar coated cashews are hard to find and that may be for a real good reason - they are not that tasty.\nThe crunch is lost. The milky cashew taste is lost. What you are then left with is just icing sugar. And diabetes.\n\nThe chilli seasoning really has a lot of chilli going on. If you are like me and love anything chilli, this flavor might be appealing to you. Unlike the mainstream devilled cashew nut taste, the chilli seasoning comes off stronger and  just hits your throat. It's a bit strong for casual nibbling though.\n\nThe kiosk is easy find and they accept cards (No American Express though. Boo you, Amex).\nIt's in the food court, at the basement level of crescat, adjoining The Brick Lane Cookie Company, and right opposite Roots. Very easy to find.\nThe service is pretty basic given that it's a kiosk. If you are the princess of Kavum Island, I am sorry, you won't receive royal treatment at an average kiosk although it is run by Royal Cashews. You just have to tell the nice man behind the counter what nuts you want and how much (weight). The minimum weight is 100g.\n\nRoyal Cashews has created a niche for itself. They have really experimented with the cashews that have secured a top spot in our Lankan hearts. I tried a few from their other flavors such as Cheese Onion and Spanish Tomato, and while they tasted different, they didn't taste bad.\nIf you're sick and tired of the basic nuts (\nyou might like the tastelifts Royal Cashews has given to good old\nHappy nuts, y'all!\n",
  "url": "https://www.yamu.lk/place/royal-cashews-crescat/review-127222"
}