{
  "name": "Sweetberry",
  "address": "4 De Fonseka Road, Colombo 4",
  "telephone": "0770203040",
  "close_time": null,
  "description": "Sweetberry is a small juice bar which specializes in berries (strawberries, raspberries, blackberries, blueberries, etc). ",
  "tip": "The regular smoothies are good.",
  "review": "Sweetberry does a variety of drinks with berries as their base. This includes juices, smoothies, and sodas, with their non-berry menu including a selection of hot and cold chocolate drinks.\nSweetberry's shares the building with a sweetshop which provides cupcake tiers, decorative teddybears, and chocolate boquets for parties. There's a table outside for four, but there's no shade or anything so you'll get burnt and sweaty if you go there during noon (like we did). They have a shady area as well, with a few bar stools, but it's a bit cramped.\nThe ladies behind the counter are pleasant and helpful, and service is relatively fast, with our four drinks ready in under ten minutes or so.\nDespite specializing in berries, their standards seem to have dropped a bit since our last visit a couple of years ago. We weren't able to try most of what we wanted as they weren't available. However, they did have a few drinks which were strawberry and raspberry based, so we went for those and a Hazelnut Chocolate just to check it all out.\nTheir Strawberry Juice (Rs. 250) was disappointing because other than the colour and a very slight tang of flavour, this was altogether quite bland. It's kind of watery, and as Imaad pointed out, was just the right texture and colour for a watermelon juice.\nMalinthe's favourite was the Hazelnut Chocolate (Rs. 300) which had an inkling of the hazelnut flavour and none of chocolate. It was quite thick and creamy though, and was pretty good as far as milkshakes go (except that it didn't really taste like much).\nAdding an element of fizz and sugary goodness (or evil, as you may have it) was their Raspberry Soda (Rs. 200). Imaad and I both liked this, despite what Malinthe called its 'artificial' taste. It\nsoda after all, and nothing really healthy or authentic about it. Reminding me of a berry-flavoured Fanta, this is light and energizing for a hot day.\nTasting strongly of yoghurt is their Strawberry Smoothie (Rs. 230).\nThis is thick and kind of creamy, with a very light strawberry undertone to it, and a strong yoghurt flavour. If you like\nor liquid yoghurt, you'd love this. If you want the strawberry flavour with it though, you'd likely be a bit disappointed.\nSweet Berry's is a nice place to drop in if you're passing by and want something fresh to drink. We wouldn't recommend going out of your way for this, but if you do, try out their Raspberry Soda.\n\nSweet Berry's is a nice place to drop in if you're passing by and want something fresh to drink. We wouldn't recommend going out of your way for this, but if you do, try out their Raspberry Soda.\nSweetberry is a small juice bar which specializes in berries (strawberries, raspberries, blackberries, blueberries, etc). The juices aren't cheap at around Rs. 300 a pop, but berries aren't cheap. They are good. Worth a stop.\n\nස්වීට්බෙරි හොඳ පලතුරු බීම සහ ස්මූදී හදනවා. එයාල ළඟ සාමාන්‍ය පලතුරු (අඹ, පැෂන්, අන්නාසි) තියෙනවා. ඒත් මෙතන බෙරි වර්ගවලට ගොඩක් අවධානය යොමුකරනවා. (බ්ලූබෙරි, ස්ට්‍රෝබෙරි, රස්ප්බෙරි)\n",
  "url": "https://www.yamu.lk/place/sweetberry/review-67205"
}