{
  "name": "Tea Avenue (WTC)",
  "address": "Level 03, East Tower, World Trade Centre.",
  "telephone": "0769693577",
  "close_time": null,
  "description": "Tea, waffles, cakes and more. Tea Ave initially opened up at Barnes Place: and this is their second (and newest) branch.",
  "tip": "Ask for the brownies to be heated!",
  "review": "Tea Avenue is a pretty solid choice whether you're planning a meeting or a hangout session, what with their perfect ambience and generally good food. They've got your usual selection of sweet baked goodies, along with a selection of hot and cold drinks.\nDespite being a tea place, they've also got a few options for coffee.\nWe tried their Cafe Mocha (Rs. 580) and were quite happy with it. One of the plus points of the drinks here are that they aren't too sweet: the mocha was slightly so, quite thick and creamy, and had a great balance of coffee and chocolate.\nThe Iced Blackcurrant Black Tea (Rs. 450) had a strong\ntaste which made it more tea-like instead of flavoured-drink-like, while also having a pretty decent blackcurrant undercurrent. It's quite a large mug, btw.\nOur Soursop Green Tea (Rs. 450) was very aromatic — it had a bubbly, fresh aura, and was super clear. Despite the rather steep prices, the drinks are all of large portions and good quality, so you don't feel like you're ripped off; and it's quite good value for money.\nA slice of their brownie costs Rs. 350 a pop which is a bit too much I think, given that it's a regular brownie. It's served quite cold, but you can ask them to heat it up for you, and the taste significantly improves when it's mushy and warm. The brownie in itself is rich, very chocolatey, and just solid choice chocolate lovers.\nWe really liked the Tiramisu, which was an absolute delight: light, fluffy, and a perfectly balanced in terms of texture and flavour. The coffee dusting on top was perfection, as was the creamy, cheesy undertone. Priced at 680 rupees, this is expensive but (yes, there's always a\nisn't there) it's also one of the best (if not The Best) slice of Tiramisu we've had here.\nOur Creamy Prawn Pasta (Rs. 800) was a bit too peppery for Bhagya but okay for me. The dish was very well made, but the portion was too little to be satisfactory. We also thought that there could've been more meat as the prawns to pasta ratio was quite unbalanced.\nTea Ave is known for their chilled-out spaces, and we're glad to see their signature touch here as well. Edison bulbs, retro walls, uncomplicated furnishing... they've done a good job. This place is more of a meeting space or a quick-bite space than their main branch over at Barnes Place though, and it's understandable given the location.\nWe think the pasta portion could be larger, but that aside it's a great place to hang out especially if you're in the area.\n",
  "url": "https://www.yamu.lk/place/tea-avenue-wtc/review-115624"
}