{
  "name": "Tea Triumph ",
  "address": "14A, Marine Drive, Colombo 03",
  "telephone": "0114062313",
  "close_time": " Open 9.00AM to 9.00PM",
  "description": "Tea Triumph is a very cosy tea lounge down Marine Drive - they've existed since 1940, and have a lovely range of quality, locally-brewn tea. ",
  "tip": "Visit in the evenings, for a nice sunset view while you have your tea. ",
  "review": "Tea Triumph is a very cosy new tea lounge that's popped up on the busy hub that is Marine Drive. It's a new lounge, but their tea factory Embilmeegama has been around since 1940. The range here is a treat for genuine tea lovers (they only do tea, no snacks), and the lounge is a lovely quiet space to unwind.\nOur photographs were taken by\n.\nWe saw a lot of tourists walking in here, because these guys have affordable, quality samples of what Sri Lanka is famous for. Generally you can get a big tin carton like in the picture above for Rs. 1500, or 25 teabags for Rs. 250. Locals get some great discounts, and the best part these days is that if you buy a packet or two of tea, they sometimes wave off the bill for the tea you have at the lounge (a cup of tea is for about Rs. 150 - 250).\nThe lounge is very cosy and has an old school charm to it - with crafted furniture, framed old photographs and mellow colours. It was raining on the day we were there, and that's actually an idyllic time to be here with a hot cup of tea, with a view of the passing trains and the sky.\nThe manager of the lounge was super friendly during our visit, making us our teas (mixing mine with milk because I suck at that), and telling us all about the brewing process. Apparently the finer the tea is ground and the longer it's brewn - 5 minutes being the maximum - the stronger the aroma and flavour. Since it's a small space, it's easy for the staff to keep a one on one rapport with their customers.\nWe asked him why they don't do snacks to go with the tea, and he asked us why we would want to diminish the taste of the tea with food - so you can tell these guys take their tea pretty seriously.\nIf you really enjoy your tea, this is a very good place to go relax. It's a simple, understated version of the posher tea lounges in town, and they've got a happy variety of quality flavours to pick from, for good prices.\n",
  "url": "https://www.yamu.lk/place/tea-triumph/review-40666"
}