{
  "name": "The Chariot (Bambalapitiya)",
  "address": "292, Galle Road, Colombo 4",
  "telephone": "0112580569",
  "close_time": " Open 7.00AM to 10.00PM",
  "description": "The Chariot, most popular for their branch in Dehiwala, is an accessible and affordable stop for baked goods and rice and curry. ",
  "tip": "Visit in the mornings for the best stuff. ",
  "review": "The Chariot in Bamba is a pretty popular mid-day stop for working folks and students in the area (Shakthi is right in front of it). It's easily accessible on Galle Road and they've got a range of short-eats and rice and curry that's all wiped out by 2PM. We got there half an hour after this, so we could only try the fried rice. UPDATE: we went back and tried the rice and curry.\nOur chicken fried rice came in a big portion, for Rs. 350. It was likely rice from earlier in the day and had just been microwaved, but it was still good and filling, with plenty of chicken pieces and veggies tossed in like a Chinese fried rice, with a nice deep red side of chilli paste.\nChariot is a very clean, simple and functional space, much like other bakeries that have upgraded their interiors to accommodate the hordes of people stopping by at lunch break. You make your order and payment at the counter and take a seat nearby and the food is brought to you.\nThe Chariot is no huge deal, but it does its job judging by how popular it seems to be with folks in the neighborhood on a regular basis. It's not the kind of place you run to for food but if you're in the block and in need of a big meal or a snack, this is an option.\nThe Chariot, most popular for their branch in Dehiwala, is an accessible and affordable stop for baked goods and rice and curry.\n\n''ෂහ්, ටොප් බන්. පතෝල මැල්ලුමයි බොංචි මාළුවයි නම් උපරිමයි. කිසිම අඩුවක් නෑ. බෝංචි මාළුවට හොඳට කිරි දාලා, නියමයි බන්''.\n",
  "url": "https://www.yamu.lk/place/the-chariot/review-46168"
}