{
  "name": "The Dining Room (Cinnamon Lakeside)",
  "address": "Cinnamon Lakeside, 115, Sir Chittampalam A.Gardiner Mawatha, Colombo 02",
  "telephone": "0094112491930",
  "close_time": " Open 6 AM – 10.30 AM",
  "description": "The Dining Room specializes in international buffets at Cinnamon Lakeside.",
  "tip": "Try the smoked seer – it is a nice addition to the buffet.",
  "review": "There's a good spread on offer, including breads, cereals, waffles, hoppers (both egg and plain), meats, and traditional Lankan breakfast items like\nand porridge. For drinks, they\nThe food is alright — it's decent but not mind-blowing. We went for several cuts of meat, sausages, waffles and hash browns. The beef cold cuts were average — the beef tasted more like corned beef than the real thing, so it wasn't THAT great. It was too soft, not the least chewy and tasted like something you'd get in a can that you could buy off a supermarket shelf. However, their smoked seer fish was pretty epic. It was a small but chunky slice, which was well-seasoned and had a very subtle fishy smell\nThe hash browns were typical hash browns. Crisp and slightly flaky on the outside and soft on the inside, they crumbled as you bit into them. This wasn't an exceptional dish, but again, it was only a side.\nWe liked that the coffee was served in colourful Dankotuwa mugs. It was brewed pretty well, with a rich and strong aroma. You can't go back for a refill though – the waiters come around and fill it for you. When I asked for a second cuppa, I got a refill of plain tea instead of coffee. It's an understandable mistake, given that the flasks they pour coffee and tea from look similar.\nThe Dining Room is one of Colombo's high-end restaurants, and has a refined, quiet and elegant ambience. It may not the place to hang out with a bunch of noisy friends, but it is perfect for a quiet meal with your loved ones. It's also a good spot for if you want to get some work done.\nThe breakfast option is decent, but not exceptional. There's absolutely nothing to complain about, but there's isn't a lot to get super excited about either. Besides, at Rs. 1,905, this meal is sure to make a dent in your pocket.\n",
  "url": "https://www.yamu.lk/place/the-dining-room/review-53558"
}