{
  "name": "The Angler",
  "address": "71 Hotel Road, Mount Lavinia",
  "telephone": "0112716626",
  "close_time": " Open 11:00 AM to 9:00 PM",
  "description": "So another day in our quest for a restaurant (not a hole in the wall/buth kadai) that serves a good rice and curry meal. We had a hot tip on The Angler a small restaurant down Hotel Road just up the road from the Mt Lavinia Hotel. We heard they served up a good homestyle curry with an emphasis on seafood, so expecting delicious piles of squid and prawn curry we rushed down to everyone’s favorite beachside suburb.",
  "tip": "Decent rice and curry, but very expensive.",
  "review": "So another day in our quest for a restaurant (not a hole in the wall/buth kadai) that serves a good rice and curry meal. We had a hot tip on The Angler a small restaurant down Hotel Road just up the road from the Mt Lavinia Hotel. We heard they served up a good homestyle curry with an emphasis on seafood, so expecting delicious piles of squid and prawn curry we rushed down to everyone’s favorite beachside suburb.\nThe place is easy to find. A yellow sign leads you to the 70s tourist time warp interior – red felt chairs, elaborate wood carving on everything, and a sort of inexplicable dimness.  The owners are friendly and suggested fish and prawn curries with a selection of vegetables, ash plantain, bitter gourd, and dhal.\nService was surprisingly fast (you get used to waiting ages for fresh cooked curry meals in Sri Lanka) and the food really did taste like a curry meal you get at home.  The pol sambol was very good, the prawn curry was light and there was a huge stack of papadums. However it must be noted that it didn’t taste like a particularly exceptional meal at home. Nothing was really outstanding, the fish, ash plantain, and dhal were just so-so, the portions just about fed three people and that became an issue when we were presented with the bill -  Rs. 3000.  Which seems a lot for a modest curry meal for three especially if you consider a downright delicious buth kadai meal can be Rs 150. Mind you, this includes Rs. 190 for each of three lime sodas, but still.\nThis isn’t to say our experience was bad, the rice and curry was fine and the hosts lovely but for the price you expect a little more than\nan average set of curries. So The Angler fails to fill this city’s dire need for a restaurant (shout out to Green Cabin for the best attempt), that serves the full spread of delicious vegetables, seafood, meat and sambals that, when you're lucky,  you find at people’s homes.\nSo another day in our quest for a restaurant (not a hole in the wall/buth kadai) that serves a good rice and curry meal. We had a hot tip on The Angler a small restaurant down Hotel Road just up the road from the Mt Lavinia Hotel. We heard they served up a good homestyle curry with an emphasis on seafood, so expecting delicious piles of squid and prawn curry we rushed down to everyone’s favorite beachside suburb.\n\nමේ අප හොඳ බත් සහ ව්‍යංජන පිරිනමන අවන්හලක් සොයා ගිය තවත් දවසක්. අප සෙව්වේ පුංචි තිප්පලක් හෝ බත් කඩයක් නම් නොවෙයි. මවුන්ට් ලැවීනියා හෝටලය අසල හෝටල් පාරේ The Angler නම් කුඩා අවන්හලක් පිළිබඳ අපට ඔත්තුවක් ලැබුණා. අපට දැනගන්නට ලැබුණු විදියට ඔවුහු හොඳ ගෙදර පිසින ආකාරයේ බත් හා ව්‍යංජන මුහුදු ආහාර ගැන අවධාරණයක් සහිතව පිරිනමන බව අපට අසන්නට ලැබුණා. ඒ නිසා හැමෝම කැමති මේ උපනාගරික සයුරුතෙර අවන්හලට අපි ගියේ රසවත් දැල්ලන් හා ඉස්සන් කරි ගොඩක් කන්න.\n",
  "url": "https://www.yamu.lk/place/the-angler/review-1980"
}