{
  "name": "The Paddington",
  "address": "44/1, Horton Place, Colombo 07",
  "telephone": "112681888",
  "close_time": null,
  "description": "The new address they relocated to is easily accessible and there is plenty of parking. From a food POV, it may not impress everyone but the place sure is somewhere we can all relax at.",
  "tip": "They have a private room near the front. ",
  "review": "If only their food was as good as their ambience, The Paddington would be my go-to spot in town.\nThis coffee-shop (which just moved) has an ideal location in the heart of Colombo and a spacious interior for groups but the food and drinks are nothing special.\nThe Chili Seafood Crepes (Rs. 1100) were an intriguing take on the traditional crepe with a creamy seafood filling loaded with stubby chunks of prawns. I expected a richer and spicier flavour from the seafood than just bland, melted cheese.Speaking of cheese, they'd haphazardly placed half melted cheese on top of the two crepes which created quite an eyesore. Nonetheless, the crepe was thin and not too doughy so at least it was enjoyable to an extent.\nTex Mex Grilled Chicken Burger (Rs.795) was too basic for me; from the presentation to the burger itself. If I was to ever have time to quickly throw together a burger at home, this is probably what I'd produce.\nThe chicken was juicy and fulfilling but the outter layer was not charred enough to be a perfectly grilled chicken breast. And the fries were not crispy enough. I'd not pay this much for a burger that looks (and tastes) like this again.\nMcDonald's, here I come for a better burger...\nThough the Cozy Hot Chocolate (Rs. 695) didn't amaze me, at least they had an acceptable one which was not too sweet unlike some places.I sure was looking for a richer taste of chocolate but the milky flavour overpowered the entire cup (extra chocolate never hurt nobody). Overall, the best part of the drink was merely sipping on the foam.\nWe loved the different settings they offer: from a laid back garden with swing chairs to a more intimate setting inside with leather seats, warm yellow lighting and a lot of brown wooden structures surrounding the place.\nThe interior gave the place a vintage vibe with the windows, door frames and monochrome pictures on the walls.\nMoreover, service at the Paddington was something I liked. The staff members were really friendly and checked with me occasionally if I was enjoying the food (although some may find this annoying).\nWe recommend this place ONLY if you are really (really) hungry or thirsty. However if you're looking for a place to chill with your friends while you kick back with no shoes on, then go here.\nWith mediocre food and drinks, as well as poor presentation, there is definitely a lot of room for improvement. Nevertheless, the place is a favorite among some people due to its ambiance.\nIf you're looking for a quiet hang out spot around Town Hall, that's good for large groups, consider The Paddington. Their food and drink are quite pricey, but they've got some winners like their Kraft Oreo shake and waffiza.\nThe Paddington is another mid-range coffee-shop which, while neither cheap nor original, has plenty of room to hang-out and a range of food and drink to keep you there.\n",
  "url": "https://www.yamu.lk/place/the-paddington/review-195520"
}