{
  "name": "The Grill by Paan Paan",
  "address": "84, Lorenz Road, Colombo 4",
  "telephone": "0117500205",
  "close_time": null,
  "description": "It's all about that char-grilled goodness.",
  "tip": null,
  "review": "Paan Paan's Grill offers their regular sandwiches and salads while having a second menu which focuses a bit more on meat. Their meats are supposed to be their speciality here, but that wasn't really the highlight of our meal.\nWe ordered two starters and two subs and a rice dish, along with a glass of lime juice.\nThe Garlic Toast (Rs. 220) was superbly soft and toasted enough to have a nice crunch on the surface. It was also quite buttery but lacked an even garlic flavour.\nWe don't know what the BBQ Chicken Wings tasted like because we never got it (and forgot to ask, unfortunately) but were billed for it. We got completely distracted because we were too engrossed by the staff having a\ncomplaining/gossiping session right in front of us. We just paid quickly at the end and bounced, and didn't notice it until we checked the bill much later. Bye, Rs. 400.\nOur Grilled Veggies with Feta Cheese Submarine was fully worth the price. You get grilled cucumbers, carrots, beans, onions and a few bell peppers and aubergines tossed in teriyaki sauce. The vegetables seemed fresh and were grilled lightly, so they were quite crunchy. We decided to be healthy with this all the way and opted for brown bread with it, which probably wasn't the wisest choice because we felt that white would've gone better with it.\nThe Beefsteak Sub was a disappointment. It was slathered in sauce and the beef were more of chopped cubes than thinly sliced steaks, and felt like it was cooked with gravy rather than grilled. At Rs. 700, this was definitely not worth the price.\nOn the other hand, the Rice with Chicken in Oyster Sauce is a portion large enough for two or three people to share. There's a reasonable amount of chicken in an unreasonable amount of sweet gravy-like sauce half drowning most of the rice out. It wasn't particularly great, but at Rs. 450 it wasn't terrible either. But if you're going all the way to Paan Paan, get bread. The breads they use are lovely.\nThey make a decent glass of lime juice. It's not watery, and there's a 50-50 balance of acidity and sweetness. I'd personally prefer a bit less sugar, but it was still quite good overall.\nThese are two things they could really improve upon. The Grill's seating is outdoors, and has simple wooden furniture, which is nice. What's not cool is that the tables were terribly sticky, and had sticky stains on it as well.\nThe staff seem a bit untrained, forgot an order, gave one glass of water and then looked askance when we asked for more (but props to providing table water without only selling bottled ones), and were gossiping rather loudly. They did check up on whether we liked the food though, and were quick on their feet.\nThey've got super soft bread with a light crispy crust, and most of their food's quite good. It's not\n, but we really liked the garlic bread, lime juice and the grilled veg sub, and it's not too expensive.\nTheir meats are supposed to be their speciality here, but that wasn't really the highlight of the meal.\nOh, my grill!\n\nපාන් පාන් ග්‍රිල් එකේ අනිත් පාන් පාන්වල තියෙන ජාතිවලට අමතර ව ග්‍රිල් කරලා හදන කෑම ඇතුලත් තවත් මෙනු එකක් තියෙනවා.\n",
  "url": "https://www.yamu.lk/place/the-grill-by-paan-paan-first-look/review-170809"
}