{
  "name": "Trainspotter (Global Towers Hotel)",
  "address": "11, Global Towers Hotel, Marine Drive, Wellawatta, Colombo 06",
  "telephone": "0114539000",
  "close_time": " Open Open 24 hours",
  "description": "Trainspotter at Global Towers is one of the few restaurants that's open 24 hours a day. Unfortunately, the entire experience is mediocre at best.",
  "tip": null,
  "review": "Our last trip to the Trainspotter Restaurant at Global Towers wasn't the best and frankly, nothing has changed. In fact, it's probably worse.\nOne of us decided to try out the lunch buffet at Rs. 950 per head. The buffet was an extremely limited range of basic curries with white rice and fried rice. The meats were a batter crumb fried fish which tasted about a day old, and a devilled chicken which was mostly just bones. A pity, considering the fact that the chicken actually tasted okay with adequate seasoning. Vegetable curries were spicy potatoes where the potatoes were heavily undercooked, a badly chopped chop-suey and the only saving grace: a mixed veg curry with peas, carrots and beans. The rice itself was on the dry side and the poppadoms were surprisingly fresh which was a plus.\nDessert was a sorry sight with a few scarce bits of cake, an unidentifiable cake like substance which tasted strangely like fish, a few sloppy slices of jelly and two bits of cheesecake. Everything except for the cheesecake bits tasted a little suspicious.\nOff the a la carte menu, we got a Beef Steak Sandwich (Rs. 540) and a Cajun Seafood Pasta (Rs. 900). The steak sandwich was alright, the bun was lightly toasted and had plenty of beef and button mushrooms along with some chopped bits of pepper for filling. The beef however, was too tough and was reminiscent of rubber tyres. The fries seemed like they'd been refried as they felt like cardboard and were dark brown around the edges.\n\nThe Cajun Seafood Pasta was a large dish with a few tiny prawns and bits of cuttlefish here and there. Chandana found the beans in the pasta a weird addition although I didn't mind. The dressing however, was a mix of tomato sauce and mayonnaise and to have all the undercooked penne drowning in this mixture was just unpleasant.\nThe drinks as poorly presented as they are, actually tasted fairly good and were a pleasant end to our otherwise tedious experience.\nWe ordered the Tequila Sunrise (Rs. 800) which looked pretty with a light orange-yellow ombre effect and a slice of orange for good measure. It wasn't the best preparation, but it was drinkable.\nThe Cosmopolitan (Rs. 800) was on the bitter side but had a nice pink hue to it. The cranberry didn't come through nor did the triple sec but the distinct fruity flavour was present amongst the bitterness.\nThe Blue Lagoon (Rs. 800) was a refreshingly crisp drink with a bit of an acidic hit.\nFinally, the Arrack Cocktail (Rs. 550) was the group favourite. All four cocktails had a LOT of booze in them which is always a plus.\nTheir service is just plain bad. Our waiter looked grumpy while we ordered, and even sighed and rolled his eyes as I was placing the order.\nWe ordered a Tom Yum soup for starters which never reached our table, but lo and behold we were billed for it. Our water glasses weren't filled or topped up and nobody came to check on our food which is just disappointing.\nThe ambience on the other hand is alright, with the restaurant nearly empty on most days and the quiet beachside atmosphere. Plus, the restaurant is called the Trainspotter because you can spot the occassional train rambling by, not Ewan McGregor.\nHonestly, we wouldn't really recommend this place.\nThe Trainspotter started out alright, but has slowly declined in terms of service and cuisine.\nTrainspotter at Global Towers is one of the few restaurants that's open 24 hours a day. Unfortunately, the entire experience is mediocre at best.\n\nට්‍රේන්ස්පොටර් කියන්නෙ කොළඹ 24 ම ඇරලා තියෙන රෙස්ටෝරන්ට් කීපයෙන් එකක් නිසා පාන්දර 3-4ට විතර බඩගිනි වුණොත් නම් මේ වගේ තැනක් තියෙන එක වටිනවා.\n",
  "url": "https://www.yamu.lk/place/trainspotter/review-147760"
}