{
  "name": "Tropical Bliss",
  "address": "No. 63 D.S. Fonseka Road\r\nColombo, Sri Lanka",
  "telephone": "0768894260",
  "close_time": null,
  "description": "New spot for fresh juices to beat the heat and fruity ice cream. ",
  "tip": "Check if they're open before you go.",
  "review": "Remember the days when you had to go looking for\nto get some fresh fruit juice? Well not anymore. New places are opening up on every corner and they serve a pretty decent glass of fruit juice. We tried to visit Tropical Bliss twice in the last week but it was closed both times. Well, third time's a charm.\nWe ordered three different kinds of juices including a Passion Fruit Juice (Rs. 150), Orange Juice with pulp (Rs. 150) and a Strawberry Milkshake (Rs. 300).\nWe received a Fruitti Ice Cream on the house. It was tasty, kind of like biting into a kulfi with lots of almonds (which is definitely not a bad thing).\nIt's a small place wedged next to the\non De Fonseka Road, with white plastic tables and chairs. While it is a lot cleaner than your average street joint, it was pretty noisy. It's also warm because they haven't air conditioned the place yet. A huge wall clock served as their only decor. While it looked cool, it didn't do much to perk up the lonely white walls.\nIn terms of service, it was very slow. It's just one person manning the place, so it took about good 20 minutes for our drinks to arrive.\nThe place is good to grab a quick drink to quench your thirst but then again since the service is slow, you're better off buying one of their ice creams. Anyhow, they're still new and figuring things out so, in terms of service and drinks, we hope they improve in the days to come.\nFresh fruit juices to quench your thirst down de Fonseka Road.\n\nඉස්සර ජූස් බඩගින්නට “රූට්ස්” එකක් හොයාගෙන දිව්වට, දැන් ඊට වඩා ලාබෙට ජූස් ගන්න පුළුවන් කඩවල් ඕනේ තරම් තියෙනවනේ.\n",
  "url": "https://www.yamu.lk/place/tropical-bliss/review-183975"
}