{
  "name": "Udumbara JU Caterers",
  "address": "4, Jayaratne Mawatha, Colombo 05",
  "telephone": "112501606",
  "close_time": " Open 9.00 AM to 5.00 PM",
  "description": "JU Caterers is an awesome rice & curry place - they combine tasteful ambience with bath kade prices.",
  "tip": "Go before 12 for a lunch packet. It gets busy.",
  "review": "Udumbara JU Caterers is one of our favourite rice and curry places in Colombo. It's been around since 1974 and besides being a restaurant they obviously also do event catering. The food is amazeballs, and they've managed to combine tasteful ambience with buth kade prices.\nThe menu includes typical rice and curry (chicken, fish, egg or veg), yellow rice, fried rice and chicken biriyani. We got the chicken biriyani, for Rs. 170, and it was\ngood. It included some superb parippu, manioc, gotukola, an interesting sweet achcharu, and a big spicy well-seasoned piece of chicken. Total value for money.\nHeading here and knowing it was an affordable rice and curry joint, I was expecting to do take-away because buth kades aren't exactly known for their dine-in ambience. This place is so comfortable and airy though, with a smooth white and wood theme, and the menu chalked up on a blackboard. From the crowd we saw at lunch time, it's popular among both the working folks and the Colombo-7 crowd. Service was very efficient.\nThere's the main room and an inner room, and overall seating for about 12. There's a tray of wine glasses and a water filter in the inner room if you're thirsty. I felt a bit posh drinking my water from a wine glass (but that's probably because I'm a godaya).\nJU Caterers is a super choice for lunch. The food is delicious (award winning according to\n), the prices are delightfully easy on your wallet, and it's a pleasant space to sit and enjoy your meal at.\nJU Caterers is an awesome rice & curry place - they combine tasteful ambience with bath kade prices.\nJU Caterers has a takeaway and dine-in outlet on Ward Place that serves up clean and tasty rice and curry. The regular rice and curry is Rs. 190, we tried the yellow rice for Rs. 250. It's all very good and the place is packed, you need to get there before one.\n\nඋදුම්බරා එකේ කෑම ටොප්. ගණනුත් සාධාරණයි. බඩයි, හිතයි දෙකම පිරෙනවා.\n\nඑතනම පැත්තකට වෙන්න තිබුණ ලීයෙන්ම හදපු කැෂියර් එකයි බිත්තියෙ ගහල තිබුණ ලී බුද්ධ පින්තූරෙයි ගැමි සංස්කෘතිය කියාපාන චිත්‍ර ටිකයි මගේ හිතට ගෙනාවෙ නිවිහැනහිල්ලක හැඟීමක්.\n\nජේ. යූ. කෙටරර්ස් ලට වෝර්ඩ් පෙදෙසේ ටේක් අවේ සහ ඩයින්-ඉන් අවන්හලක් තියෙනවා. එහි රසවත් බත් සහ මාළු තියෙනවා. සාමාන්‍ය රයිස් ඇන්ඩ් කරි එකක් රුපියල් 190යි. අපි රුපියල් 250ක් දීලා කහ බත් එකක් කෑවා. ඒක හරිම රසයි. හැබැයි මෙතන සෙනග පිරෙන නිසා දවල් 1.00ට කලින් එන්න ඕනේ.\n",
  "url": "https://www.yamu.lk/place/udumbara-ju-caterers/review-38503"
}