{
  "name": "Urban Kitchen",
  "address": "69 Hyde Park, Colombo 7",
  "telephone": "0115732732",
  "close_time": " Open 10.30 AM to 11 PM",
  "description": "Urban Kitchen is one of the city's newer dining halls. Located right next to Arpico, the lovely, large room serves a variety of cuisines from around the globe.",
  "tip": "If you're ordering a la carte, food takes about 20 minutes. Pizza, sushi and set Sri Lankan and Chinese lunches are served almost instantly. ",
  "review": "Urban Kitchen is nestled snugly between Arpico and APIIT at Hyde Park corner. Walking into the building, you are greeted with  different scents of food wafting up your nostrils and your ears going abuzz with the sound of frying coming from their open kitchen. They have quite an impressive menu with approximately 262 different items ranging from Mexican, Italian, Chinese to all time classics.\nThe menu could be daunting and might take you an average of ten mins to figure out what you want to be eating. Yet everything is neatly listed and options between chicken, beef, seafood, vegetarian and even duck, are quite good. The waiters are more than willing to help you with the order and seem to be well versed with the menu. When asked for suggestions/recommendations we were told to go for their wood fired pizzas. We opted for a Mexicana, although it was listed as a small portion it had eight medium slices which was a pretty good bargain for Rs 660. The pizza had a generous dose of mozzarella and cheddar with a sprinkling of beef, tomato salsa and jalapenos. The crust was perfectly crispy, paper thin and warm from the oven.\nWe followed the pizza with the Chicken Lasagna. This was one good lasagna with premium minced chicken and a fair amount of white sauce and cheese, accompanied by a fresh salad and cubed tomatoes. However we thought that the price tag of Rs 890 was a tad bit too much.\nOpting next for a dish straight out of the wok,we ordered a common favourite amongst most people; Chicken fried rice (small: Rs 450). It consisted of tossed chicken and finely scrambled eggs. It was a little too sticky for our liking overall, but an average fried rice nevertheless.\nWe also ordered the Szechuan style prawns priced at Rs 1100, which we thought was a complete waste of our buck considering the fact that it was literally prawns tossed in a bed of onions and carrots with no flavour, save for a dash of soya sauce. It was quite bland and watery.\nThe highlight of the entire meal was the 'coffee frappe' that came with an extremely decent price tag of Rs 295. It came in a tall glass chilled to perfection with notes of strong coffee, just as it should be. It had a crown of foam that tasted delicious.\nOverall they have a good veg menu, varying from falafels, burgers, pizzas, wraps, pad thai noodles and pasta. The notable mentions include their kids meal menu: macaroni and cheese, chicken nugget and fries, spaghetti with chicken bolognaise for Rs 350 each. They also have a Sri Lankan lunch for Rs 375 and the Chinese for Rs 475.\nCompared to the rest of the murky choices of food courts in Colombo that most often resemble dungeons of some sort, Urban Kitchen was noticeably cleaner,well lit and had neon green chairs to perk the place up. However, the open kitchen leaves a distinct smell of frying and food on your clothes, long after you've left the premises. It has a large seating area which also means it could be super noisy during rush hours.\nThey have a variety of food options and meat choices. Although their quantities are decent, the quality could definitely go up a notch or two. Service was efficient and the food only took ten minutes to arrive. Our total bill for two, topped off a bill of Rs 4247, inclusive of taxes.\nWalking into Urban Kitchen your greeted with different scents of food,wafting up your nostrils. They have quite an impressive menu with  approximately 262 items ranging from Mexican, Italian, Chinese to all time classics.\nUrban Kitchen is one of the city's newer dining halls. Located right next to Arpico, the lovely, large room serves a variety of cuisines from around the globe.\n",
  "url": "https://www.yamu.lk/place/urban-kitchen/review-113074"
}