{
  "name": "Xilaton ",
  "address": "126, Havelock Road, Colombo 05",
  "telephone": "94112508887",
  "close_time": " Open 10.00AM to 10.00PM",
  "description": "Xilaton is a Chinese restaurant in Bambalapitiya - the service is good and so is the food. We're especially fans of their hot garlic prawns which - get this - are slathered in cheese.",
  "tip": null,
  "review": "Xilaton is a Chinese restaurant that's been around for ages. It's usually got a few tour buses parked and loads of Chinese tourists dining in. Apart from that, this place seems to have lost popularity with all the recent competition. This was actually the first place where I had flat noodles, and I have fond memories of family night outs. We went by for lunch but it didn't quite live up to the nostalgia.\nFor starters, we tried the Vegetable Spring Rolls (Rs 569) on the recommendation of the waiter. It took a while to arrive and it was pretty bad. Filled with cabbage and vermicelli, it didn't have much going on and just tasted one dimensional and cheap. It didn't help that it came with cheapo corn starch tomato sauce that usually accompanies Rs 25 chinese rolls at a kadey.\nOff the specials, we ordered the Hunan Style Spicy Pork Belly (Rs 299) and it turned out to be the only good dish. With more capsicum than pork, it still manages to be a decent deal. There's a bit of lemongrass going on there as well, so it's quite flavourful. The fatty bits were more enjoyable than the meat though, as it was a little dry despite the oily gravy.\nWe decided to be adventurous and tried out the Garlic Butter Aubergine (Rs 569). We asked the waiter if it was good, and he said yes, but it was quite underwhelming. The garlic butter barely tastes of garlic, let alone butter, and the aubergine was so bland and overcooked that it just tasted like baby food. Avoid.\nI wanted to try find the flat noodles that I had 10 years ago, but what the waiter got for us was Seafood Kuaiteow Wet Noodles (Rs 769) that wasn't quite what I was referring to. We found this to be quite insipid given that the noodles were pretty much swimming in water cause there was no flavour going on, just some egg and two prawns.\nThere's quite a few waiters at Xilaton, so you have a dedicated waiter throughout your meal which is comforting. Our waiter wasn't much help when it came to navigating the menu, so we were disappointed about that.\nThe ambiance is honestly really boring. From where we were sitting, we could smell the antiseptic from the washrooms. The place is well lit with lots of natural light coming in through the glass wall. There's no music playing, but they had wrestling on the TV.\nIf you're looking for the regular Sri Lankanized Chinese staples, Xilaton won't disappoint. But, if you're looking for an authentic Chinese experience, you have much better options to consider. We'd recommend going for the hot butter cuttlefish, a spicy beef dish and fried rice. It seems like this place just exists to feed Chinese tourists by the bus load. You're not allowed to talk to them though, as a sign loudly announces at the entrance. We wonder why.\nIf you're looking for the regular Sri Lankanized Chinese staples, Xilaton won't disappoint.\nXilaton is a Chinese restaurant in Bambalapitiya - the service is good and so is the food. We're especially fans of their hot garlic prawns which - get this - are slathered in cheese.\n\nමේ වගේ ගාණකට මීට වඩා සෑහෙන හොඳ චීන කෑම කන්න පුළුවන් තැන් සෑහෙන්න තියෙනවා.\n",
  "url": "https://www.yamu.lk/place/xilaton/review-96104"
}