{
  "name": "Zephyr Talalla",
  "address": "Naotunna, Talalla",
  "telephone": "0773386606",
  "close_time": null,
  "description": "A villa-restaurant and bar affair with a great space and ambience gently, leading you into the huge and rather deserted Talalla Beach",
  "tip": null,
  "review": "Zephyr Talalla has some tasty (though not awesome) food and - if you're willing to pay beach tourist prices - it's a beautiful and generally satisfying way to enjoy one of Sri Lanka's less crowded beaches.\nTalalla beach, at least early in 2018, had more beach than most other beaches in the South, and less people. Zephyr functions as a villa as well, but not having stayed there, I will stick to the restaurant experience.\nThe Mango Salad (Rs. 700), while much anticipated, wasn't exciting. The main ingredients of mango and spinach went well but the kitchen chose to pair it with a standard mix of cabbage, carrot and cucumber.\nThis seems to be their go to salad base, because we got some with the burger as well. The seasoning was just as basic, and used olive oil and balsamic. Let me also add that the spinach was too oily, and that the mango could have been riper. Also machang, cabbage with mango just doesn't work.\nThe Mahi Mahi (Rs. 1600) was well cooked, retaining flavor and moistwure. The pan seared meat - wrapped and steamed in banana leaf - was beautiful, falling apart with ease. The basil butter is a light addition that worked well, but the greens/leaves are more for decorative purposes apparently. Also, the menu said it came with potato wedges, I was expecting a nice portion, instead we got like 6 wedges. Aiyo.\nThe patty of the Crispy Prawn Burger (Rs. 1100) was surprisingly good. It was nice and spiced but in a gentle way, I sensed some lemongrass, cilantro maybe?? But the crunchy powder fried exterior is excellent to bite into. Again though, we found that the fries and salad that came along with it to be very basic. The whole dish looked very boring, but tasted less so.\nHaving had some excellent (and I mean excellent) brownies at Salt, Hiriketiya a couple days back, our chocolate urges were still unsatiated.\nBut while the brownie at Zephyr (Rs. 650)  was decent, it was by no means spectacular. And again, in another basic move, the kitchen had reheated it before serving. We saw through this move right away. Good cake doesn't need reheating.\nWe had the Mango and Coconut Milkshake (Rs. 800). It was thick, so thick it’s practically a meal. In fact at Rs. 800 for a juice, it is lightly touching the bottom limit of prices of the mains. Go figure.\nThe mango was good, but perhaps a tad on the sour side. The coconut stays on the background but provides a slightly crunchy texture which was very nice.  I think there was yoghurt in it. A tad too thick and salty for my linking but this could be a matter of preference.\nWalk into Zephyr Talalla and it feels like you're already walking right onto the beach. The space is open plan, and the bar/restaurant somehow contrives to be in the background along a path that leads through green lawns through a small copse of trees, right into the sandy expanse of Talalla Beach. The ambience is not overdone to the level of it being a santized space that feels like its been airlifted from Greece, but it retains a nice combination of minimalism with a local touch.\nWith a nice ambience and average to good food, Zephyr is a chill place to relax if you're prepared to pay 3-5,000 for a meal for two.\n",
  "url": "https://www.yamu.lk/place/zephyr-talalla/review-212125"
}