{
  "title": " 5 Things to Take When Hiking in SL",
  "abstract": "Here's a quick list of handy items to take with you the next time you head for a hike.",
  "author": "Staff",
  "date_published": "1:40pm",
  "content": "Over the past couple of years Sri Lanka has become a sort of hidden hiking paradise. Our resident hiking specialist, Buddhika, has been at it for years and we’ve even got a pretty\nfor those looking to get into it.\nHowever, other than the more straightforward trails, the best locations like\nand\nwill take you through some rough terrain. Here are a few handy things (besides the obvious stuff, duh) to take with you the next time you’re heading off the beaten path.\nDuct Tape is an absolute must have when you attempt the more arduous climbs. It’s especially true here in Sri Lanka since there aren’t ‘hiking paths’ per se for most of these difficult spots. This means that wear and tear on your clothes and items are almost inevitable, along with other unfortunate events like cracked water bottles and damaged tents. Duct tape works as an inexpensive all in one fix that’ll save you a lot of frustration. It’s also excellent at preventing shoe cuts and blisters.\nThis is something we at YAMU swear by for multiple reasons. At face value Axe Oil is a decongestant which works wonders when you’ve got a cold or blocked nose. With nearly all of the hiking trails being at higher altitudes and colder climates, catching a cold is surprisingly easy, especially overnight. Just dab a bit of the oil on your forehead and along your nose before bed to both help you sleep and keep the system clear.\nOn top of that, leeches are also a (yucky) factor when it comes to the greener locations but a rubbing in a few drops of Axe oil will generally keep them (and other insects) away for a few hours. If you’re worried about mosquitoes specifically, citronella spray will get the job done.\nFinding clean water on hikes isn’t always easy. Actually a big mistake made by many drinking from clear water streams and assuming it’s good for drinking. Though not impossible, this  does make brushing teeth a bit of a chore, which makes mouthwash a much easier and faster way to keep your hygiene in check. Besides this mouthwash also insanely versatile as a disinfectant for small cuts and scrapes and even as a hand sanitizer\nCooking during overnight hikes or camps is a nightmare for most since you’re trying to travel as light as possible. This is where instant noodles’ are an absolute godsend. All you need to do is carry a small saucepan with you to boil water. Besides this, eating peanuts is also an excellent way to staying full and keep your energy up throughout a hike.\nResealable or ziplock bags are a must have when you’re heading out for a hike. Getting packaged biscuits and food are a common practice when travelling, but if you’re dealing with stuff like chips, there’s a lot of air those packages that take up space. A simple hack with this is to transfer all packaged dry foods into resealable bags, and since it’s airtight you can even take some precooked food. Another very handy tip is to also store your phone in a resealable to which will make it mostly water proof in case rain breaks out.\n",
  "url": "https://www.yamu.lk/blog/5-things-to-take-when-hiking-in-sl"
}