{
  "title": " Three Infamous Bandits of Sri Lanka",
  "abstract": "One was called the Sri Lankan Robin Hood, the others were just bad.",
  "author": "Aisha",
  "date_published": "2:48pm",
  "content": "Despite being highway robbers, murderers and even rapists in some instances, bandits from Sri Lanka's bygone eras are romanticised to the point of hero worship; mostly because they kept crossing the law enforcement officials with impunity and, somehow, managed to break free, even when captured.\nHere are three who've gone down in history as bandit heroes: criminals who are hailed as saviors.\n(25 March 1832 — 7 May 1864)\nOne of the oldest legendary bandit figures in the country, Saradiel is such an icon that there's a whole mountan named for him —\nas he made that mountain, and a secret cave in there, his hideout. Unlike the other two figures we're mentioning in this post, Saradiel wasn't just a petty criminal or a highway robber: to this day, he's known as the Robin Hood of Sri Lanka because he plundered from the British Colonialists and their henchmen and distributed the looted goods among the poor, mostly those in his village.\nHe was the leader of a gang of robbers, and was eventually captured when one of the members of the group (a traitor called Sirimale) defected and ratted them out. Acting on a tip-off, the Mawanella police were able to corner Saradiel. The shooting which ensued resulted in the death of Constable Shaban, the first policeman to die on duty; and that's the day on which fallen policemen are commemorated in Sri Lanka even today: the 23rd of March.\n(\n—\n)\nNotoriously popular that he now has a song dedicated to him, Podi Wije hailed from one of the ancient and historical cities in the North Central region. His banditry and reputation gained him the name\n, tying him down to the region and further strenghtening the bond between him and the villagers, given that\nis used as a term of endearment — Little Wije from Polonnaruwa.\nBorn in 1956, the story goes that he was underpaid and abused by his employer, upon which he stole the money owed to him and ran away (aka went into hiding because he was afraid to go back home and face the wrath of his father). He fell in with a group of young men and embarked on his career of crime which continued until he died in a\nin a jungle.\nDespite having gone down in history as a notorious gang robber and having been tried for several rape cases, he's romanticized to the extent that his crimes are overlooked. Many newspapers now portray him as a victim of circumstance who had no choice but to turn to a life of crime because of how he was mistreated by those wealthier than him, and the\nalso carries an interview with his daughter in which she reiterates that Podi Wije was a man who was well-loved among the villagers.\n(1948 — 1975)\nMaru Sira's execution was one of the most sensational in the country: as was his reputation as a bandit who continually slipped through his captor's hands. Suitable to star as the protagonist in the Sri Lankanized version of Prison Break, Maru Sira (whose real name was D.J. Siripala) escaped from imprisonment no less than three times. He was sentenced to death\nfor a murder, and when he was eventually captured (yet again, yes), his captors were so afraid that he'd somehow manage to get away that they tranquilized him with sedatives strong enough to knock him unconscious.\nSince he'd practically overdosed on Largactil, he had to be carried to the scaffold on the morning of his execution and laid across the trapdoor. The noose was then placed around his neck (while he was lying down) and the trapdoor was opened. Controversy arose not over the fact that he was given the death sentence, but over the fact that he died a slow and suffocating death (literally, because he died of asphyxation). Ideally, he should have died instantly with the snap of his snack, which would only have happened if he'd been able to stand upright for his execution. Yes, that sounds lurid — and it is — but that's what death by hanging is, too.\nEven though all of these people were wanted criminals during their time with bounties on their heads (Saradiel's capture promised a 200 sterling pound reward), the severity of their crimes seems to be softened down in media reports as they're more often than not portrayed in a sympathetic light. I assume it's because they all were from impoverished families and were doing their best to provide for their families; and because everyone universally just hates the cops anyway.\n",
  "url": "https://www.yamu.lk/blog/three-infamous-bandits-of-sri-lanka"
}