{
  "title": "\"Muwanpalassa\"; The Longest Radio Drama Ever by Sri Lanka",
  "abstract": "Muwanpalassa was a very popular audio drama that took the hearts of many people from all backgrounds. It’s also known as…",
  "author": "",
  "date_published": "1:07pm",
  "content": "This is a story about a village that everyone has heard of, but no one has ever been to. But anyone who was born before the 90s knows everything about this village, its people, and their daily life. The village is “Muwanpalassa”.\nA few decades ago, before the television invaded Sri Lanka, the only form of entertainment we had was the radio. Back then, Muwanpalassa was a very popular radio drama that took the hearts of many people from all backgrounds. It’s also known as the longest running audio drama in the history of radio in Asia.\nMr. Mudalinayaka Somaratne was the brainchild behind Muwanpalassa. He wrote this script upon the request of Mr. S.B. Senanayake, the director of Radio Broadcasting Corporation (SLBC) at the time. Mr. Senanayake wanted a story that reflects the rural life of Sri Lanka, the challenges they face and how they overcome them.\nMr. Somaratne started writing this script after doing a thorough research about the village life in Sri Lanka, and as a part of that he visited a bunch of rural areas, such as Minipe, Mahiyangana, Laggala, Meemure, Kaikawala, and Diyanilla. He saw how people live in countryside, and how they are being exploited.\nThis story takes you to the British colonial period of Sri Lanka. It starts with the arrival of a British army officer, who randomly discovers Muwanpalassa during his journey to find details on the\ns.\nIn this village, he meets a lot of interesting people, like Weda Maama, Weddikkaraya, Binaramalee, Aarchchila, Manike and Pina. Later on, the role of Weddikkaraya was changed to Kadira, while Arachchila became the Korale Mahaththaya.\nAll of these characters were based on the actual people of Mr. Somaratne met during his research. The first episode of this show was aired in 1964.\nMuwanpalassa was a great hit among the people all over the country. But unfortuanately, Mr. Somaratne moved to California in 1971 and as he couldn't continue compiling the script of Muwanpalassa anymore, the show was taken off the air.\nThe fans of Muwanpalassa were pretty devastated by this news. They started sending letters to SLBC, clamoring for its re-emergence. Hence, Mr. Thevis Guruge, the director of the SLBC at the time discussed with the voice actors of this drama and asked them to put together a new script.\nWith the new script written by Mr. Victor Miguel, the SLBC started telecasting Muwanpalassa again. Mr. Miguel continued writing this script for 25 years, while breathing life into its popular character Kadira.\nAfter his untimely death in 1995, Mr. Sri Nimal Padmakumara stepped in and wrote the script for Muwanpalassa for another 15 years. Later on, the Chairman of SLBC requested Mr. Somaratne, the initial writer, to compose the script of Muwanpalassa once again.\nThereafter, from all the way from America, he began to compile the story for Muwanpalassa and send it to Sri Lanka, so these characters can live a little while longer.\nThe recent passing of Mrs. Rathnavali Kekunawela, the immensely famous actress who contributed her voice to the role of \"Menike\" in Muwanpalassa, shook the audience of this beloved radio drama.\nThe modern day world has many forms of entertaintment, but the love that people have over Muwanpalassa hasn't been faded, not even for a little bit. It's not all about the brilliance of that storyline or the characters, but it also reminds them of a much simpler time.\nYou still can catch the new episodes of this beloved show on Mondays at 8.30pm on Welada Sewaya (FM 94.3 , 94.5).\n",
  "url": "https://www.yamu.lk/blog/muwanpalassa"
}