{
  "title": "10 Airbnb  Holidays In Sri Lanka",
  "abstract": "10 Airbnb Holiday destinations that are worth checking out.",
  "author": "Bhagya",
  "date_published": "11:05am",
  "content": "With some holidays coming up we looked through\nfor some alternatives to the usual hotel excursions. While Airbnb is popular among tourists, locals haven't really caught on as of yet, but they really should because they offer great value for money as well some breathtaking locations and just generally awesome spots. Most of these places tend to get booked out during the weekends so make sure to book it early.\nIt should be noted that we haven't personally visited any of these places, so our choices are based on the information on the page as well as customer reviews. All the photos on this post are also from the respective pages on\n.\nThis is an artsy house in Mirissa which would be ideal for a group looking for a place to stay at while going whale watching. At just $118 per night for 6 guests this place is an absolute steal.\nThe place comes with a spacious garden, 3 bedrooms (4 beds), a fully fitted kitchen, bathrooms and internet. Another great feature is that it's in close vicinity to both the Mirissa beach (5 minute walk) and the Garadu ganga.\nStay Golden Cabana is one of those unassumingly awesome little places. It's basically a small wooden cabana right in front of the beautiful Arugambay beach. It's a simple, private, clean and comfortable wooden beach cabana. Double and single bed with attached private en-suite bathroom with free wifi. Oh and they allow pets as well!\nAs the name suggests this a villa in Nilaveli. You get a private stretch of beach right in front of the villa, which apparently makes for some great views. The villa itself has a modern interior design, with all the essentials. The rates here are bit different in that they charge a flat $150 for 2 guests and then an additional $20 per extra guest. So if you were to go with 6 guests the total would come to around $230, which is still great.\nSo this is a bit different from the others on the list since this is a eco hut, which basically means no electricity. Don't let that deter you though since this is a part of Ruuk Village which has on location staff to help with anything you'll need. The best part though is the fact that Ruuk Village is located right next to the main lagoon of Kalpitiya. They also provide a good amount of activities like kite surfing and dolphin tours. This is one place on the list that we've visited, you can read\n.\nAirbnb is just a gold mine if you're looking for bungalows in Nuwara Eliya. This particular villa is located just in front of Lake Gregory, which makes for some great views in the evening when they they light up the walkway. The interior has modern touches to it with wooden floors, fireplaces, a pool table as well as TV and wifi. The central location is also perfect since it's close to the lake, the golf club and The Grand Hotel area.\nClub Lespri offers a range of rooms priced between $35 - $60 and unlike most of the places on the list, it offers similar services to a hotel in that it has cable TV, a pool along with a hot tub and room service to go along with all the essentials. It's located in the hills about 15 km away from the Peradeniya botanical gardens. At 3600 feet above sea level, you get some amazing views of the surrounding mountains.\nFar Cry is a cottage in Habarana bordered by the Galkadawala forest sanctuary and lake. The building itself is beautiful in a somewhat uncanny way due to the wooden pillars. They've got pretty much everything you'll need plus a private pool all for under $100 per night which is a steal.\nBronckenhurst is a beautiful bungalow in Nuwara Eliya with colonial architecture and a well maintained garden. At $380 per night it isn't cheap but if you split that 12 ways then it comes to just $32 per head which is still brilliant. This is just a classic Nuwara Eliya bungalow with modern amenities to boot. The garden is massive and just simply stunning. This is probably the closest thing to Downton Abbey you'll experience in Sri Lanka.\nThis is one of our favourites on this list. It's a secluded tree house on the Rumasalla headland between Galle and Unawatuna Beach. The tree house itself looks absolutely brilliant, with windows all around so you can really take in the view of the surrounding jungle. Shifani actually saw this place and booked it straight away.\nStonyhurst is the most expensive place on our list, but it's also just plain beautiful. This is a classic\n(stone bungalow) in every sense of the word. Just like the Brockenhurst, this too has a great looking garden but what sets Stonyhurst apart is the interior design which is colourful and modern while maintaining that classic colonial feel. The bungalow comes fully equipped with everything from heating, fireplaces, kitchen, wifi and cable TV. It's expensive but once you see this beauty you can't unsee it or get it off your mind.\nAnd that's it. From this round at least. There are lot more places on Airbnb so we recommend\nand looking around. Some are quite cheap, some are expensive - there's a range. We have stayed in a few Airbnb places and the system does work in Sri Lanka but, as always, be careful when doing business with anyone, online or off. Tell us in the comments if we've missed anything. Happy holidaying!\n",
  "url": "https://www.yamu.lk/blog/10-airbnbs"
}