{
  "title": "10 Beachside Restaurants In Colombo (And Mount)",
  "abstract": "Here's quick list of 10 beachside restaurants we feel are pretty good.",
  "author": "",
  "date_published": "11:01am",
  "content": "Colombo is a city by the sea, but it unfortunately doesn't have much beach. Views yes, but if you want beachside dining you need to go to Wellawatte or further south.\nThese are a few of our favorite places for beachside dining.\nWhen it comes to value for money, The Station is pretty difficult to beat. They tick all the right boxes with a great view of the ocean, cheap booze, good food and one of the best hot butter cuttlefish in town.\nSeafood Cove is Mt. Lavinia Hotel's seafood restaurant (well duh). If you're looking for a quiet meal on the beach, Seafood Cove is definitely worth a visit. Unlike most of the other places on the list that shares the public beach, Mt.Lavinia Hotel has it's own private beachfront. To experience the full range of their seafood offerings you need to drop in after 7 pm for the seafood market. One recommendation would be their fish and chips.\nBarracuda, like its neighbor The Station, is known mostly for their Sri Lankanized Chinese, with an emphasis on the HBC. This is also a nice beachside spot to just chill with friends. They have seating both on the beach and under the mangrove canopy which looks beautiful under the lights after sundown.\nBeach Wadiya is one of Colombo's classic beachside restaurants, located in Wellawatte's accessible stretch of beach. It's been around since the 70's so they know what they're doing. While the food tastes good and is generally consistent, the beach itself is not in the best shape. With a bit of cleaning, it could be like the good old days.\nLa Voile Blanche is a chic, white-washed beachside restaurant in Mount Lavinia. If you're looking to have a fancy(ish) meal on the beach, LVB might be a good choice. They've got a unique theme to go along with some decent food, great dessert and good service. This is also one of the few places that offers a comprehensive selection of non seafood based dishes. Also, they do an excellent tiramisu.\nBoat Haus Cafe has been a popular seafood spot among Mount Lavinians for a while now. They offer fresh seafood and classic deviled dishes, all of it at pretty reasonable rates. The best feature at Boat Haus Cafe is their selection of fresh seafood. You can choose from the day's catch and have it prepared to your liking.\nLoon Tao is the main option for those looking for Chinese cuisine by the beach. The restaurant’s biggest culinary strength is the simplicity of its cuisine, leaning heavily on traditional Asian flavours and the access to fresh seafood. It's neither the best seafood nor the best Chinese you'll have, but they manage to strike a good balance while maintaining consistency.\nRasa Malaysia is one of the lesser known of the beachside eateries. The food won't blow your mind, but if you're fan of Malay cuisine you might enjoy their offerings. They also do a pretty good hot butter cuttlefish with a bit of a Malay spin on it.\nWhile quite a few of the places on this list serves alcohol, The Shore By O! is the only full fledged bar by the beach. They have a decent food menu, but we usually drop in for the drinks. Since it took over the former Golden Mile, Shore has been very popular because of their affordable prices and solid cocktails.\nWrapping up our list is another oldy, Buba. It may not be as happening as it was back in the day, but that actually may not be a bad thing if you're looking a less crowded spot to hang. Their prices are a bit steeper than other places since it's mostly targeted towards tourists now, but the food is tasty and their location, past the main beach stretch is also pretty great.\n",
  "url": "https://www.yamu.lk/blog/10-1-beachside"
}