{
  "title": "10 Contemporary Powerhouse Women in Sri Lanka",
  "abstract": "Women who brought pride to the country over the last year.",
  "author": "Aisha",
  "date_published": "11:24am",
  "content": "From electing the\nto building up from the ashes of the civil war, fighting for\n, and conquering Mt. Everest, Sri Lankan women are as resilient as they are a silent force of power. This Women's Day, we're featuring few amazing women who have made waves and impacted people's lives both locally, and internationally.\nRecipient of the prestigious Queen's Young Leader award, Nushelle created Building Bridges, a series of workshops utilising arts and theatre to help kids primarily from war affected communities, shortly after she had hands-on experience with working with communities from two rehabilitated villages: one was home to the Tamil community, many who had been conscripted during the war, and the other with Muslims who were victims of the LTTE's ethnic cleansing.\nShe wanted to work with the children on rehabilitation and reconciliation, without the latter being reduced to a mere buzzword; and Building Bridges, she says, 'encourages participants to think deeply about how our personal and social identities are constructed, to find outlets for expression that bypass violence, and to engage in team projects that require understanding and compromise, using media that are fun and 'extra-curricular.'\nIt's expanded to include a new visual arts series in Mattakuliya headed by Irfadha Muzammil, while Nushelle is working on a series of workshops for school-leavers this August.\nYou don't get to hear about many marine biologists, especially Sri Lankans who are doing their best to save the whales (and our oceans). It's ironic how Sri Lanka's an island but is utterly careless of her shoreline and marine life... and this is where Asha de Vos comes into the scene. She says she started her journey as a mere six year old, and was a\nAsha's the only Sri Lankan to have a PhD in marine mammal related research, and is also a TED Senior Fellow and a guest blogger for Nat Geo, which is pretty darn cool. Best is, these aren't the only things she's involved in or been featured in: her work in marine conservation focusing specifically on Sri Lankan Blue Whales have given her global recognition.\nHaving studied interior designing and currently working as an Interior Design Coordinator for Shangri-La Colombo, Irfadha's been involved with Building Bridges right from the beginning. She currently runs a 12-week long visual arts series focused on cultivating critical thinking, currently for kids in Colombo. Having started off as a translator while working with children from two villages in Mulaitivu, she pulls inspiration and materials from what she's studied and converts them into course material and projects for the kids.\nIrfadha works to promote art, and hopes that it will one day be integrated and accepted into our school systems as much as the math and science streams are. \"One doesn't necessarily have to be proficient in sketching or painting to be a\" good artist\" or that by partaking in art impoverishes learning \" serious subjects\" ( hello maths and science!) somehow,\" she clarified.\nMaking history as the first Sri Lankan to ascend Mt. Everest, Jayanthi ascended the massive mountain just in time for sunrise: sharp at 5:03AM. The expedition at the mountain alone for her and her travel partner Johann Peries took two months — in addition to years of preparation — in order to acclimatize the climbers with the area and the four camps located on Mt. Everest.\nJayanthi spends the rest of her time\n(WMC).\nHaving won the Fulbright Scholarship to pursue her MFA. Film-making at the New York Film Academy, Ishani worked at Young Asia Television and ITN for five years as an Assistant Producer and Producer respectively. She's also the writer and director of Kakkutta, a poignant short film which got selected to no less than six film festivals, and was consequently invited to speak at Wellesley College, USA, about the movie. She's furthering her education after having secured a grant to read for a Masters in Arts in Education at Harvard.\nHaving barely hit a quarter-century as yet, Crystal is possibly the youngest business editor in the mainstream print media industry. She's also the\n; a store created by her mother and herself, which supplies handmade footwear. Having started off with marketing her wares on\nand Instagram, she's expanded her team and her business, all while having a full time job and pursuing her degree.\nAdamant on providing affordable and beautiful footwear, one of Crystal's other goals was to provide a sustainable mode of income for unemployed women in her neighbourhood and preserve a dying art; ergo the focus on crochet, and upping the number of female employees as the business grows.\nIf you think environmentalists are cool cats, you'd love to meet\nof the Environmental Foundation Limited, Anya Ratnayake: she literally works with Lanka's wild cats.\nstates her bio at the Urban Fishing Cat Conservation Project. The cats' natural habitats are under threat, especially as urbanization crowds out and fills in our wetlands. Her projects include collaring, capturing, and re-releasing the animals into safer environs in the wild.\nRecognized as a shaker and maker of the communication industry, Caryll was listed in\n; a list which recognizes women in the Asia-Pacific region. With nearly 20 years of working experience, she specializes and excels in Media Relations, Corporate Communications and Crisis Management, and has also been awarded Leo Burnett's Star Reacher Award.\nThe co-author of\n, Hasanah is also an independent researcher, women's rights activist, and Attorney-at-Law. Her work focuses on highlighting contemporary issues faced by Muslim women, especially with regards to the MMDA, the flawed and sexist Quazi court system, and the challenges faced when attempting to reform the Act. Her co-author Hyshyama Hameen — equally noteworthy, btw — pointed out that Hasanah is\nAnd there you have it: a handful of women amongst many who've helped shape Sri Lanka for the better. If you have any amazing stories to share, please drop us a message or do so in the comments :)\n",
  "url": "https://www.yamu.lk/blog/contemporary-powerhouse-women-in-sri-lanka"
}