{
  "title": "10 Cool Home-Run Businesses ",
  "abstract": "Check out 10 fascinating home-grown craft businesses in SL, from jewellery to stationery and make-up.",
  "author": "",
  "date_published": "4:33pm",
  "content": "Don't want anything mainstream, and want to support homegrown businesses? Check out our list of entrepreneurs. Whether you want personalized jewellery, stationery, clothes, accessories, or even body products, we've got you covered. :)\nEvery piece displayed and sold by the Feather Project is crafted by Melanie, who decided to start making dream catchers because she couldn't find a place to buy them in SL. Soon requests started pouring in, and a little business bloomed. She's moved on from exclusively creating dreamcatchers to making personalized jewellery as well, and the Feather Project's been up and running for nearly two years now. Melanie was running it as an on-and-off thing, until the Design Market in December 2014 kicked off and her stall became super popular.\nWho doesn't love stationery? I'm a huge fan!\nInitiated by Sithmini Jayanaga in 2011, ArtyCrafts creates stationery and are popular for their customised, handmade journals. They also make uber cool greeting cards and photo albums, so if you want a special album to store memories of a particularly remarkable event, this is where you can get one made. Sithmini loves the sense of fulfillment she gets as soon as she creates each piece, as well as the fact that she's her own boss.\nBath Bliss legit makes you soap, the old fashioned way — by mixing together fat and alkali. Nausheen began creating her own body care products when she realized that there wasn't any handmade body care stuff available in SL. After receiving a gift pack of handmade body care which included soap, her curiosity kicked in. She also loves simple and effective skincare; which in turn resulted in her creating her own healthy version of skin care products clear of chemicals. As an artist who dabbled in oil paints, she's now planning on releasing a few new soaps which are inspired by famous paintings.\nBTW, Environmentally Friendly PSA: she doesn't use palm oil in any of her produce because of how much damage it does to the environment.\nShabna's an online shopping fanatic, and used to constantly get things down for herself. When her friends admired nearly everything she picked out, she started placing orders for them as well, and then this habit gradually evolved into a business. Spanning items from make-up to elegant perfumes (think Bath and Body Works), you can count on TBA to get you the best of what there is.\nRunning just over three years, she's got an 8000+ strong fan base on her FB page.\nA full-time working mom of two, Dinusha's always been interested in design and homeware, and looks at her home business as a means of de-stressing herself. She imports most of the items she has on sale, and does her best to get things down to SL which are multi-purpose as well as aesthetically pleasing. Amassing over 4000 likes on FB over the last year, she's part of a monthly pop-up sale, the details of which are posted on her\naccount whenever the time draws near.\nDeeandra calls Minnie a brand which makes \"'easy-breezy' shirts for men, accessories for women and in time, a lot more.\" Having studied fashion and textile design for two years, Deeandra makes each piece just once, and has a universal goal of wanting to make people look good and feel good. Despite being creative since she was a child, she started Minnie as a business venture just over an year ago. If you want absolutely unique accessories, check them out for those, and for miniature handmade pan pizza pendants (non-edible, obviously. Sorry).\nA psychology student, Sara wanted to challenge herself and 'put herself out there', so she started her own line of handmade jewellery about an year ago. With a knack for creating something out of anything (including necklaces out of bus tickets), she's always on the lookout for ideas, be they minute and distinct facial features, or micro details of nature.\nPaper Frills is run by Charmalee Kulatunga, who identifies herself as a paper crafter. Having started off as a hobby, she had too many excess cards on her hands one day, which her father offered to show around to his colleagues at work. They all sold out within the day, and voila! She was inspired to make more and turn it into a little business.\nRunning since 2010, she now has over 7000 Facebook likes. Pretty neat, just like her cutesy hand-made cards.\nSavanthi, Kushan, and Dyan are the heads behind this venture. All three of them have full-time jobs, but still make enough time to keep their customers happy with their neat creations. They're most popular for nail and string art, with which they do amazing things, but in addition to specializing in custom wall art, they also do signage, event decor, and corporate items. Keen to take up new projects and challenges, they approach everything they get with a 'why not?' attitude.\nMonai's products range from wooden jewellery to clay bowls, mirror frames, wind-chimes and many more. Run by a trio consisting of Naomi, Dilshan, and Abdullah, the team identifies their art collection as 'free-spirited'. They're all currently obsessed with geometrical designs. They began with a few black and white art work at the Colombo Design Market in Dec 2014, and have expanded since then. Plus, they also do custom wedding decor, and run a small studio at their homebase in Nugegoda.\nInterested in fashion and accessories amongst many other things, Yashasvi and Shabna paired up to begin their own line of business in the handbag department, keeping it purely online so that they have time to invest in other ventures. They find the fast-changing trends in fashion a welcome challenge, and loves how it keeps them on their toes at all times.\nA photo posted by Patched (@patchedsl) on\nWe updated the list and added these guys too. Patched specializes in patchwork and quilting, and also kiddie prayer mats. Their quilts are bright and colourful, and judging by their FB posts, is a favourite.\n",
  "url": "https://www.yamu.lk/blog/10-cool-home-run-businesses"
}