{
  "title": "10 Coffee Stops In Colombo",
  "abstract": "Here's a roundup of places to get coffee in Colombo. ",
  "author": "Shifani",
  "date_published": "10:33am",
  "content": "Great coffee is very hard to find in Sri Lanka for some reason. We're\n    better as tea-people. Still, Colombo's handful of coffee shops continue to\n    be as popular as ever - here is a roundup of where you can get a freshly\n    ground cup in the big city. If you know of any places we might have missed\n    out on, even restaurants that do a great coffee, share it with us in the\n    comments.\nWhight & Co grows their own coffee and roast it in the 'Roasting\n    Room Cupping Lab', which you can peek into from the main restaurant. The\n    coffee has a distinctive, high quality flavour, and they do a superb cold\n    drip coffee for Rs. 340. The food here is quite good too and very well\n    presented - you can get a flavoursome, filling burger dish in the Rs. 700\n    range, or go for a more Sri Lankan meal for Rs. 1000. This is one of those\n    few places in Colombo that's total value for money.\nCharcoal is another one of our favourite\n    haunts in the city, tucked away quietly down a road in Mount Lavinia. The\n    ambience and service is always very welcoming and pleasant, especially in\n    the evenings. They serve some very good food in the Rs. 300 range, and the\n    iced mocha we got here for Rs. 350 really hit the spot. It's a slightly\n    milkier version of the caffe mocha with a good amount of espresso and a\n    mild bit of chocolate - fun fact: they use Hansa coffee.\nThe Brown Bean Coffee has always\n    been a favourite of ours at The Good Market. Now they've got a permanent\n    stall at the Good Market Shop at Lakpahana. They use Peruvian Coffee beans\n    which have a unique smokey flavour which works well with both cold and hot\n    coffees. If you're looking for a place to get a really good cup coffee, The\n    Brown Bean Coffee is one place we'd definitely recommend. Their coffee is\n    organic, tastes great and is quite affordable.\n\nJava Lounge is one of the better ones as\n    far as mainstream franchise-type coffee shops are concerned. Besides their\n    main branch at Jawatte Road they've also now got\n, next to\n    the Kapruka office. The food and coffee are alright, though nothing to brag\n    about (we like their ice caramel machiato, Rs. 430), but it's mostly the\n    typical comfy-and-efficient ambience that makes it popular and constantly\n    full of regulars. With drinks in the Rs. 500 range, it's a tiny bit more\n    expensive than some other coffee shops, and it's one of the few\n    grab-a-coffee-to-go options in the city.\nCup Cafe is the lovable underdog on this list. It's a 'no-frills coffee shop',\n    a small space hidden in plain sight opposite ODEL, popular among tourists.\n    The coffee is good - we got a nice big, refreshing glass of iced coffee for\n    Rs. 380. They also have a tasty range of burgers, sandwiches and desserts\n    that haven't disappointed us (Rs. 500). If you're stopping by here for a\n    tall cup then also try the lime tart.\nHansa Coffee is one of our favourites,\n    mentioned time and time again on different reviews as a reference point.\n    They have been consistently good, and they have their very own brands of\n    coffee and chocolate. It's another small, understated coffee place, with\n    comfy cushions and a staff of one or two, a great\nand enjoy\n    a hot, steaming cup. They've got a small menu of chocolatey desserts and\n    sandwiches, and some interesting drinks, all very affordable - from Rs. 150\n    to Rs. 350. The Brownie Shake and the Espresso Chocolate Truffle are some\n    of the best on the menu, while there's a variety of coffees to pick from\n    (Thai coffee, condensed milk coffee, spiced coffee).\nCoco Veranda is one of the oldies,\n    competing with the likes of Coffee Bean and Java Lounge. They used to be\n    quite good, though lately they're just alright - still, they've got a\n    steady and loyal customer base that isn't afraid of throwing a dignified\n    hissyfit if you say anything bad about the place. On our last visit we\n    tried the lattes - mocha and creme brulee - and for Rs. 540, they weren't\n    impressive. Still, it's a very cool, chic place to hang out at, and\n    ambience is what makes our coffee shops so well frequented. You also get\n    some decent desserts and savouries here in the Rs. 400\n    range.\nThe Coffee Bean is another popular go-to\n    for coffee, albeit it's more expensive than the other coffee dons, with\n    drinks in the Rs. 650 range and food for Rs. 750. It is definitely a notch\n    above the other mainstream coffee shops in terms of quality - the desserts\n    are always fresh and reliable, the lattes are good (caramel all the way),\n    and the food is nothing spectacular but satisfying. Besides the Matiland\n    Crescent HQ and the one you get at the airport, they also have\n. Service is generally good, and it's an ideal spot for\n    a business meeting or a quiet read, so if you don't mind chalking out about\n    Rs. 1500 for a coffee date, this is one of the good ones.\nBarista is the most successful coffee\n    franchise in the city. It puzzles me as to why, because there's nothing\n    fancy about the coffee or food here, which is alright at best. It is\n    however, like Coffee Bean, a very convenient place to meet up at,\n    especially since you get one in all the big neighborhoods now (Horton\n    Place, Bambalapitiya, Kirulapone etc). Plus their standard of service and\n    drinks has been consistent. We personally like the ambience best at the\n    outlet in the Laksala building opposite Viharamahadevi Park - it's an old\n    colonial style structure, sharing space with the Laksala store, and a\n    lovely green park of sorts. Things are affordable, with sandwiches in the\n    Rs. 200 range and coffees for Rs. 400.\nThe Commons Coffee House despite its\n    name is better known for its food and ambience than the actual coffee\n    served here. It's a comfortable, large space that works as a cafe but also\n    doubles as a chic place to have dinner. They do some great rottis and\n    interesting desserts in the Rs. 350 range, and we think the coffee tastes\n    alright as far as coffee in Colombo goes, somewhere between Barista and\n    Java lounge.\n",
  "url": "https://www.yamu.lk/blog/coffee-in-colombo"
}