{
  "title": "10 Delivery Options For Office Lunch",
  "abstract": "It's easy to forget to pack lunch to work. We've all been there. What do you about it? If you have the time, you…",
  "author": "Bhagya",
  "date_published": "2:17pm",
  "content": "It's easy to forget to pack lunch to work. We've all been there. What do you about it? If you have the time, you step out for lunch. Otherwise, you've got to order in. Here's some of the most reliable options we've come across that have always helped the situation.\nAK is probably our most regular delivery options here at YAMU HQ. They’ve been consistent with both the food and the delivery times. There’s been some drama about AK’s delivery lately, but we haven’t really come across any serious issues. They’re minimum delivery order is Rs. 750 so you’ll need a convince a couple of mates to order as well, but if you make your case they’ll sometimes deliver one item.\nHazari’s is another Middle Eastern restaurant that’s got their delivery game on point. It’s actually a surprisingly small operation but they’re very efficient and reliable. If you’ve got 4 or 5 people their full rotisserie chicken which is outstanding for Rs. 1150. Besides that they even have their own take on rice and curry along with a bunch of other rice options.\nWe’ve got a bit of a love-hate relationship with Naniyori. On one hand, we love their bento options which offer the best value for money Japanese. On the other hand, they regularly  take over an hour to deliver, which is really frustrating if you don’t order early. Steamboat, their Chinese / Thai counterpart, also does delivery and we’ve heard good things about their Thai executive lunch.\nJapanese food delivery choices are still limited, and while Kami Maki isn’t the best Japanese around, they do a pretty good job of delivery. Like Naniyori, their reasonably priced with a respectable selection of Japanese staples. We’ve had  their katsu rice dishes delivered in the past and found it to be quite satisfying.\nChinaman is a brand new Chinese delivery restaurant. We can’t really speak for consistency at this point, but our recent order came in around 40 minutes which is pretty good. They also have a bunch of set menu options which come in classic chinese take-out boxes which is both easy to eat in and dispose of.\nLet’s be honest, Fast food franchises still offer the most efficient delivery services, and McD’s is our pick of the bunch. They’re minimum order amount is only Rs. 500 and they’re generally very fast. And if you’re pulling an all nighter at the office, they deliver up until midnight.\nIf you’re not in the mood for rice, Paan Paan’s got a great range of pastries, subs and even some pretty fresh salads. They don’t have their own delivery, but you can place your orders either through Quickee.lk or Foodie.lk. Unlike other restaurants most of their stuff is already ready to go so it shouldn’t take too long either.\nHealthy Living were one of the pioneers of the healthy food movement in Colombo and the best part is that they deliver. They’ve expanded their menu and now offer bunch of variations including rice and curry, a few Thai dishes and salads. However, You’ll need to to place your order before 10 AM since they deliver all the orders together.\nSticking with that healthy theme, Calorie Counter is the other option we recommend. They serve up some restaurant quality dishes which have been pretty consistent from our experiences. They deliver both through Quickee and Foodie, but we suggest ordering about an hour in advance since certain dishes take longer to prepare.\nYes, we know it's cliche, but they have always been reliable with delivery. Apart from the pizza, they've also got some rice options like the Birizza. If you're really hungry and you want food really fast, this is the way to go.\nLet us know what's worked best for you in the comments.\n",
  "url": "https://www.yamu.lk/blog/delivery-options-for-office-lunch"
}