{
  "title": "10 Healthy (And Tasty) Foods To Try In Colombo 2015",
  "abstract": "This World Diabetes Day we're going to have a look at how to eat healthy in Colombo.",
  "author": "Bhagya",
  "date_published": "4:44pm",
  "content": "We're changing things up a bit this week, and focusing on eating healthy in Colombo. Healthy food tends to get a bad rep for not tasting that great or just being too expensive to eat on a regular basis, but Colombo actually has a quite a few places that serve up healthy food without compromising on flavour. From restaurants to homecooks to Good Market vendors, Colombo's got a bunch of different options for those looking to make a change. Be sure to also check out our take on\n.\nJeewa's and Kumar's is one of our favourite GM vendors and they've gained quite the following over the past year. They offer a bunch of different stuff ranging from local curries to fajitas, and their polos dishes have become legendary among regulars at The Good Market. For just Rs. 50 you can get some of the best pol roti and lunu miris anywhere in town and if you really want to test out their polos, go for their polos burger which is absolutely brilliant and an awesome alternative even for meat lovers.\nLife Food is The Good Market Shop's resident health bar that specializes in salads and healthy beverages. Our pick from their salad range is the strawberry salad (Rs. 500). The name actually doesn't do it justice since there's actually so much going on in this salad with strawberries, lettuce, avocado, cucumber, feta cheese and caramelized cashews, served with a subtly sweet strawberry dressing. This salad is an intriguing mix, it was fresh and sweet with the feta cheese adding a bit of saltiness and the cashews adding that needed crunch.\nWhen someone says eggs benedict, with elements like bacon and hollandaise sauce (which is basically egg yolk and liquid butter), healthy isn't the first word that comes to mind. Calorie Counter takes an entirely different approach with their rendition of the classic breakfast dish. They've pretty much replaced all the usual elements with healthy alternatives like;\nWhile some may not see this as an actual eggs benedict we like Calorie Counter's spin on the classic.\nCC's strawberry, watermelon and blueberry salad makes for a brilliant change up from the usual veggie salads. This one is practically a sugar free fruit salad that was still adequately sweet and extremely refreshing. We liked that they didn't mess around too much with the ingredients, really letting the freshness of those fruits come through beautifully. Think of it as sort of a dessert salad to have as a palate cleanser after the mains.\nThe Healthy Living rice and curry comes in chicken, fish or egg. We've had it time and time again and it's been consistently good. It's not like most\npackets you come across, where you get copious amounts of white rice, which is essentially the most unhealthy part about most R&Cs. Instead you'll find that Healthy Living's portion is almost equal parts brown rice to veggies with a decent portion of chicken curry made from chicken breast, which means the overall calorie count on this will be quite low.\nIt's hard enough finding a good salad in Colombo, let alone one that you can get delivered. Right now only Healthy Living and\noffer this service but hopefully others will come on board. However, having a salad delivered can be a bit iffy since the ingredients need to be fresh, but in this case we didn't come across any issues. The salad comes with lettuce, red cabbage, grilled chicken, bread croutons, green apples and grapes as well as a salad dressing. All in all this salad has a bit of everything with the crunch of the lettuce and the cabbage, the slight sweetness from the fruits and the savouriness of the chicken. At Rs. 350 this is also one of the cheaper salads around as well.\nWonderbar's offerings revolve around the central theme of being \"gluten, sugar and dairy free\".  The Basil Seed and Mango Pudding describes itself as a 'guiltless coconut dessert', and it does taste pretty guiltless. Luscious and creamy, the mango flavour is very subtle in this one. While the mango adds that sweet undertone, the oddly spicy flavour from the basil seed is what makes this unique. This is the sort of dessert that doesn't ruin your diet and makes you feel good, too.\nWonderbar is pretty much the only place we know that offers cashew milk. This may not be for everyone since there is a difference in texture compared to your usual dairy milk, but it also has less than half the calories and fats of whole milk. While Wonderbar offers a bunch of flavours, we particularly liked the Strawberry Cashew Milk which tasted pretty close to a strawberry yogurt with a light and smooth texture and just a very subtle sweetness.\nThe seafood salad is a hefty bowl, basically a fresh cool garden salad, speckled with plenty of fishy chunks. This one comes with a mix of fish, calamari and prawns along with cucumber, carrot, onions, green and red peppers as well as a bit of chilli.\nEat Right's chicken wrap is as healthy as it gets (save for the roti carbs) - soft thin roti totally loaded with fresh bell peppers, lettuce, tomatoes, carrots, and long thin slices of lightly cooked chicken. It was quite tasty, with a welcome textural crunch but a bit mild in terms of heat so we went ahead and added some chilli sauce which really completed this dish. This one shares many ingredients with the salad so you can expect similar nutritional benifits as well.\nThis is honestly just a snippet of what Colombo has to offer for those looking to eat healthy. Each of the places we've listed has a range of other dishes that's worth trying, so be sure to follow the links and check out the full reviews. And if you're free on Saturday mornings drop by The Good Market to try out their ever growing selection of vendors.\n",
  "url": "https://www.yamu.lk/blog/10-healthy-dishes-in-colombo"
}