{
  "title": "10 Lankan Recipes You Can Try at Home",
  "abstract": "A quick guide to feeling  a little like Master Chef Sri Lanka!",
  "author": "Yaseen",
  "date_published": "7:31pm",
  "content": "Want to make your\nhappy? Want to impress that cute girl with your curry skills? Here are some of the most popular Lankan recipes you can make at home. You're welcome!\n\nParippu is a thick Lankan lentil dhal. It's versatile, it's amazing. Parippu can serve as a curry, a spread or a soup, if you've got some imagination.\n\nFrom your nosy neighbour to your loyal dog, kottu roti is everyone's favorite. An ensemble dish consisting of rotti, vegetables, and meat (and sometimes cheese) thrown together and cut up frantically, it's a drunken post-party favourite. If you really want a kickass kottu, but you can't wait till 5 PM, you can make it yourself!\nHere's the king of Kottuland, Hotel De Pilawoos, showing you how it's done.\n\nQuestion : What is a murunga? Is it a straw? Is it a stick to beat your kids up with?\nAnswer : it's a weird looking veggie that weirdly tastes amazing.\nMurunga curry with some dosai and beef curry make a match made in heaven!\nSambols (a mixture of ingredients used as a condiment or addition) are the keystone of any complete Sri Lankan meal. How heart broken would our\nbe without\n? What would our roast\ndo without\n? How would our appas survive without\n? What would our lives mean without sambols?\nLearn the Holy Trinity of Sambols and make the Sambol Gods happy!\n\nBesides being an amazing spot to serve you breathtaking sunsets, Negombo is also a hood for spicy curries that will make you gasp for air like a little\nthat has hit the Negombo shores.\nshows you how to make dope Negombo Prawn curry down below.\n\nAmbulthiyal is the new black. Created with a strange black Sri Lankan spice called\nit's visually pretty weird. Loved by all, even your girlfriend's scary dad, this dish is not your average fish curry.\n\nPani Roti looks difficult, but it's actually not so bad. It's a Sri Lankan pancake of sorts, filled with a sweet dessicated coconut and treacle filling.\n\nBring on the pittu party! A steamed rice and coconut cake, it's a great breakfast favourite.\n\nto find out how to make pol pittu and\nto find out how you can make your own mani pittu!\nTime to throw those fancy English butter cookies out the window. Gnanakatha is a very simple (and possibly unhealthy) tea time snack, great for snacking and conversation.\nfor the recipe.\n\nThe best way to have rice without any curries? Kiri Bath! It's the holy grail of plain rice dishes! Served with lunu miris, it makes for one of the best combinations. It's also a stalwart of Sri Lankan New Year (avurudu) celebrations or to mark any auspicious beginning.\nfor the recipe.\n",
  "url": "https://www.yamu.lk/blog/10-lankan-recipes-you-can-try-at-home"
}