{
  "title": "10 Places To Get Pizza In Colombo",
  "abstract": null,
  "author": "",
  "date_published": "10:23am",
  "content": "Colombo has gone from a few pizzerias to a lot in just a few years. Here are 10 of our favorites places to grab a pizza in Colombo.\nGiovanni's is a new Italian pizza place on Thimbirigasyaya Road and one of our favourite new additions to the local pizza scene. It's pretty much a one-man show, with Dimuthu manning the clay oven. There's a small bistro kind of feel to the place and the pizzas have been consistently outstanding on each of our visits. Depending on what he has in stock he'll sometimes have Italian sausage or other delights, so we just go with whatever he recommends.\nSantoré has become a favourite among pizza lovers in Colombo, since they first started off in 2013. This place is right up there in terms of authenticity with a great variety of pork based pizzas with high quality salami, pepperoni and chorizo. These are thin crust pizzas so you're getting less bread, but more toppings, usually with a healthy drizzle of olive oil.\nOro 1889 serves really tasty, fresh and authentic Italian fare. Their location, despite being in a small mall, is charming, personal and the husband and wife team running the place are really friendly. Their prices are slightly higher than some of the other places, but this is one of the few places that would be great on a date night, plus the service is excellent.\nHarpo's has been around for a while now and has established a great reputation among Colombars. They may be pricier than other pizzerias, but they justify that by delivering some great pizzas with plenty of toppings and high quality ingredients. They've also got great customer service and very efficient delivery.\nDomenico's is another new pizzeria in Thimbirigasyaya that opened up last year. Affordable Italian pizzas aren't really something you come across quite often but Domenico's is looking to change that with a varied menu and 13'' pizzas priced as low as Rs. 990. They've also added pork-based stuff to the menu which is good. They deliver, which is great for a place that isn't even a year old.\nWhile they might not be the most authentic wood fired pizzas in town, we still feel Cafe Michaelangelo does some pretty yummy pizzas. While they don't offer pork based products, they make up for it with some interesting, local influenced dishes like the beef pethi, HBC pizza and pol sambol pizza. We tried the hot butter cuttlefish pizza, and it turned out be pretty legit.\nRocco's in Rajagiriya is one of the many pizzerias that has gained popularity for its delivery. They aren't one of our top choices but some of their pizzas are pretty good. One thing we really need to give them props for is their menu, which is  possibly the most extensive one we've come across, so it's quite possible we missed some good ones.\nArthur's Pizza is a modest new pizzeria in Mt. Lavinia next to the Lion Pub. They're not the most authentic but their thick crust pizzas have a home-made taste to it which makes it quite comforting. There isn't much of a choice for those living in the suburbs, so we're grateful Arthur's exists.\nFor us what Pizza Hut offers can be best described as Sri Lankanized pizzas. They're not terrible, but the problem is that they hardly offer value for money compared to some of the newer places. One thing we can't fault them on is accessibility and efficiency in terms of delivery. Their desserts options are also surprisingly good.\nDomino's also falls in pretty much the same boat as Pizza Hut, but in terms of flavour we'd say we prefer them. It's not cheap or fashionable but Domino's is good for an occasional guilty pizza.\nNote that we've only put places that specialize in pizza here. There are spots like Il Ponte or Echo that do a good pizza plus a lot more. And, as always, comment if we've missed anything.\n",
  "url": "https://www.yamu.lk/blog/the-pizza-compendium"
}