{
  "title": "10 Things You Need To Know Before You Have Sex",
  "abstract": "Things every person needs to know before they have sex - for the first or the hundredth time.",
  "author": "Kinita",
  "date_published": "11:24am",
  "content": "Sex isn't a dark sordid secret - it's one of the keystones of humanity.\nDespite this, friendly and accurate advice on sex and sexual health is hard to find in Sri Lanka. In fact, many schools lack delivery of comprehensive sexual and reproductive education. We’ve even found out that some school teachers staple up the sex-related pages of the Biology text book (what a waste of education. And staples!).\nAre you ready?\nWhat is consent? It means that you're in charge of your body and you are aware of it. As long as you're not harming anyone, you get to choose what you do with it, who gets to touch it, and when and how that happens. Consent means both partners agree\n.\nIf you're not really into it, DO NOT let anyone coerce, wheedle, emotionally blackmail, or make you feel uncool for not having sex. Violence is not only physical, it's mental or emotional too.\nIf you're not sure if someone wants to have sex with you, just ask. Any response except for a resounding \"YES\", means they do not want to have sex, and you shouldn't try and make them via emotional coercion (\"why don't you love me?\"), coercion (\"if you don't have sex with me, I'll tell people about us\"), intoxication (wait till they're drunk or on drugs to try and sexually approach them) or any other types of persuasive methods.\nNo means no.\nYou'd be surprised at how vague the average person's knowledge of male and female anatomy and functioning is. There's a lot more going on than just penis and vagina, and if you're going to have sex, you should probably know what you're using.\nFor example, according to the\n* over 50% of Sri Lankan male youth claimed they didn't know about the menstrual cycle, and some 60% of Sri Lankan female youth said they didn't know about the male reproductive system or physiology.\nAny sexually active person can get them, and they aren't always physically obvious or noticeable to the eye.\nYou're not immune if it's your first time.\nAnal or oral sex does not protect you from STIs\nYou cannot use a\nbag as a condom. You cannot use anything except a condom as a condom. Just use a condom.\nALWAYS insist on a condom unless you have gotten tested and have discussed family planning with your partner.\nThe best ways to avoid unwanted pregnancy is:\nComplete abstinence\nUse a condom\nUse regular oral contraceptive pills\nUse an IUD or implant\nAn injectable\nUse an emergency contraceptive (also called the morning after pill. This should be used ONLY in emergencies, as it's not good for your body and  if you use it often, its efficiency drops)\nGood, consensual sex with a partner you trust releases endorphins, leads to greater intimacy, and stronger bonds. However, if you're in pain, if you're miserable, if you don't feel good during or after intercourse, STOP. You don't have to grit your teeth and bear it like you're getting your tooth removed. You do not have a duty to have sex just because everyone else is doing it, you need to \"prove your love\" to anyone, or because you're in a relationship. Okay, sometimes things could get uncomfortable, in which case you should have...\nOpen and honest communication is probably the best thing for anyone's sex life, whether you're with someone new or your long term life partner. You'd be surprised at what respectful conversation could do for your relationship and comfort. Talk about what makes you uncomfortable, what you like and want more of, or how you feel.\nIt's not all slow-motion grunting like in the movies. The consequences of sexual activity are vast, in terms of pregnancy, infection, relationships, and emotions. Make sure both you and your partner are ready, consensual, and of a legal age.\nTeen pregnancy is a very real problem in Sri Lanka, mostly due to a lack of information  –\n6% of 15-19 year olds girls have had a baby/or were pregnant. Since abortions are legal only in very particular circumstances in Sri Lanka, many illicit methods and clinics that provide this service in less-than-optimal conditions, which could lead to infection or even death.\nHIV/AIDS is not rampant in Sri Lanka, but it is still present and the number of cases have increased in recent years. Make the most of Sri Lanka’s free healthcare, and get yourself and your partner tested before you have sex.\nFind out where you stand in Sri Lanka's legality before you have sex. The local age of sexual consent is 16. Individuals aged 15 or younger in Sri Lanka are not legally able to consent to sexual activity, and such activity may result in prosecution for statutory rape.\nAs it stands, \"unnatural acts\", which is read as homosexual activity, are still criminalised in Sri Lanka.\nSri Lanka has topped the Google search list for the word ‘sex’ consecutively since 2011, this shows that there are a lot of questions about sex out there which end up getting answered by the easiest source - pornography. In reality, porn isn’t a great source of safe or reliable sex practices - there’s rarely any condom usage, and sex is usually way rougher, faster, or louder than it is in reality. Get ready for a lot more mutual communication, fumbling, and hair!\nSo don’t expect anything more than a needle jab from your nurse, and remember that porn is about fantasies, and real life sex is about mutual pleasure and connection.\nThe United Nations Population Fund (UNFPA) has a wealth of accurate and reliable information on sexual and reproductive health in Sri Lanka, which you can access via\n\nThe UNFPA has also developed an app that provides easy-to-understand sexual reproductive health information in English, Sinhala, and Tamil (\n')\nHealth Education Bureau \"Suwasariya\" Health Helpline- 0710 107 107\n- 011 26 67163\n- 0112 588 488\n0112 588 488\n- For minors suffering abuse. Call 1929.\n- Cyber harassment or cyber bullying (including sharing of photos etc).\n- Call 1938.\n- For mental health issues. 0112692909.\n\nMake sure you check out our video for a more in-depth overview of the dos and don’ts when it comes to sex. YAMU has created this content in consultation with experts at UNFPA Sri Lanka.\n",
  "url": "https://www.yamu.lk/blog/10-things-you-need-to-know-before-you-have-sex"
}