{
  "title": "10 Tiny Ways To Not Be A Garbage Person",
  "abstract": "Easy ways to make less garbage and be less garbage in Colombo.",
  "author": "",
  "date_published": "3:32pm",
  "content": "The garbage crisis in Colombo is genuinely scary and the product of decades of our negligence. It seems like a problem that's beyond repair, but there are a few tiny things to do to stop being a total garbage person. Most of our tips are food-related because that's what we at YAMU do best!\nBring Your Own Bag! You can buy a tough reusable cloth supermarket bag at all supermarkets now (for about Rs. 60-70), or just bring your own bag along. Vegetables are a bit more tricky - instead of getting each vegetable individually wrapped in plastic, just take a scrap of paper with you and ask them to stick the price stickers on to that. Keep some old newspapers with you if you're worried about your fruits getting bruised.\nVote with your rupee - if you know of brands with sustainable practices, opt for them. Use sites like the\nas a guideline. If you have proof of brands doing crappy things like mass dumping, using way too much plastic as part of their policy, or refusing to recycle etc, avoid them but also let them know (politely). Most brands these days are highly perceptive to their image and social media, so drop them a Facebook post or email explaining why you hope they'll change their policies.\nIf you're a menstruating human, live with one, or even know one,\n. But they also kind of suck for the environment, as the most popular form of sanitary wear in Sri Lanka is the disposable sanitary napkin,\n, and has\n. Instead, you can try opting for\n, menstrual cups (both available at the Good Market shop), or if you have the disposable income eco-friendly tampons (not tampons with plastic applicators) or pricey\n.\nAll you need to do is carry around a lunchbox or two (if you anyway take a lunch box to work or school, just wash it out and keep in your bag). When you dine out and have leftovers or get takeaway, just hand them your box and ask them to put the food in that so you can avoid wastage of food or usage of styrofoam and plastic. This can work for coffee and juice too - if it's part of your daily routine, just pack in a little thermos. Some restaurants like\nwill even give you a discount if you bring your own box!\nIf you're getting delivery, it's a bit more tricky. You can choose to opt for restaurants like\n,\n,\n, or\nthat avoid plastic packaging, or at the very least ask the restaurant to avoid sending plastic utensils if you're at home or office.\nUnless you're trying to drink hands-free, straws are kind of pointless. If they're unwrapped, their insides are inevitably coated with dirt, dust, and if you're unlucky insects and eggs (I've witnessed this twice). Also, they're disposable, non-degradable bits of plastic that just\n. If you really need a straw, some restaurants now have reusable metal ones. I picked one up at\nand I carry it around with me if I'm feeling particularly thirsty (not even a joke). You can pick yours up from the\ndirectly for wholesale orders.\nFurniture, shoes, books, all often last a lifetime if you take care of them. Fortunately, Sri Lanka has a big (and rotating) expat population, so a lot of people end up leaving their stuff behind. Don't buy new, buy lovely pre-used stuff at lower prices instead! Or even\n. Here are some spots we suggest for\nThis is one tip the tuk tuk drivers of Colombo have known for years. Why waste money on shiny plastic bottles of water when you can just carry around a funky empty whisky bottle like a goddamn hipster or drink out of a Smirnoff litre bottle at work and scare your co-workers? If you're not as daring, you can opt for a normal glass bottle, a thermos, or a sports bottle. You can refill them with water at work, at a restaurant, or at\n.\nThis is less of a tip and more of a compulsory point. Make the garbage collector's lives easier (and yours, because they won't collect unsorted garbage now). You need to separate them into\nOk, this is definitely on the more difficult end of the tips we've suggested here because you'll have to go out and buy a little composting bin from Arpico. You'll also have to ensure rats and stuff don't get at your bin because you'll be throwing away organic material, from tea leaves to bread crumbs (some people avoid meat residue). But if you've got a garden, you know the benefits of good manure! Your compost can then go towards feeding your garden, where you can grow vegetables for consumption and continue the positive cycle. Here's\n.\nThink before you throw. Instead of throwing your stuff, you can:\n",
  "url": "https://www.yamu.lk/blog/10-tiny-ways-to-not-be-a-garbage-person"
}