{
  "title": "10 Things I Love About Living in Sri Lanka",
  "abstract": "Sri Lanka is the best of both worlds, with a side of paripu.",
  "author": "",
  "date_published": "11:21am",
  "content": "Pretty much anywhere outside South East Asia, living with your parents is\n. In Sri Lanka, if you're unmarried and living independently, people squint at you and wonder what's wrong (grand family estrangement? secret lover? family found out dark sexual habit?). The pros of living with your parents in SL are endless: you save the lion's share of your salary going rent-free, get to eat your mum's dope chicken curry whenever you want, and people still think you're dateable. Score.\nWhenever I've approached a home (either for children, specially abled, or the aged) to donate meals for the residents, we've had to book in advance because there are just so many Sri Lankans who routinely donate to causes near (in terms of location and emotion) to them. If you've lived anywhere else, you'll realise how unique and surprising this is. Sri Lanka isn't\nfor nothing.\nThat smell that permeates the air after a swift and furious tropical storm is amazing. It's essentially just the chemicals released by minerals in the soil reacting with minerals in rainwater, but it's mesmerizing. A close second is that heavy, pregnant, still atmosphere of humidity just before a long-awaited storm breaks out. Dang.\nThe world appears to be divided into 3 dog zones :\n1. No dogs at all (Iran, Maldives etc)\n2. Dog and dog ownership are controlled by the government. No strays, only trained and leashed and documented pets (North America, Northern Europe).\n3. Dogs run wild like feral scrappy savages (South East Asia, Africa)\nSri Lanka is a total outlier, where you get posh fluffy pet dogs, but also plenty of stray dogs that are friendly, well behaved, and spunkily unafraid of humans. Why? Because they're used to getting a small ear scratch and the occasional leftover buth packet from humans on their turf. It's pretty rare to see a stray dog being kicked, abused, or worse, as you'd see in most other busy South Asian streets, so strays don't have that cultivated hatred or fear of humans. And it warms my soul.\nThis one seems like a stale, obvious one, but if you live in Europe or China for more than a week during most non-summer months, you'll feel a constant chill and sense of dread. That's seasonal depression for you, caused by BUTTLOADS OF CLOUDS. Everything is grey. Skies are grey, peoples' faces are grey, clothes are black...or grey. You'll realise how vibrant colours, skies, and life is in Sri Lanka lickety-spit. Give me a sunburn over wearing 87 layers just to head to work any day.\nWhere else can you find the ear-splitting glory of the Lankan dinner dance?\nWith hundreds of varieties of bananas and mangoes, and heaps of exotic fruits like the Ceylon Olive (veralu), Indian Gooseberry (nelli), Batoko Plum (lovi), Velvet Tamarind (gal siyambala), Sri Lanka's fruit game is strong. It's a playground for delicious tropical sorbets, cocktails, and cooking. Best part? You're not paying crazy Whole Foods prices, none of these would cost you more than Rs. 50 a pop! Don't even get us started on the flowers (my favourite? Monkey's tails!)\nSri Lanka is less loud, messy, and in your face than India, and less sterile and flavourless than upscale cities around the world. You've got yourself the colour, vibrancy, and happy madness of Asia, alongside some decent roads, relatively low crime rates, and easy living. It's the best of both worlds, with a side of paripu.\nIn an increasingly lonely world, it's easy to feel isolated or disconnected. Not so in the paradise island. If you're a local, you undoubtedly have a flock of 837,292 relatives who want to know where you are, who you're seeing, what your latest exam qualification was, etc.\nIf you're a foreigner, never fear. You'll get plenty of these questions, plus a couple of bonuses (\"Ah you're from England? My cousin's husband visited London last year. You know him?\") Everyone else needs to rely on Instagram likes to feel connected or relevant. Not you. If you're single, rest assured that at any given time there are dozens of people personally invested in getting you married off. Tinder can go suck it.\nWhere else are you going to find hill country, beaches, wildlife parks, tea estates, ancient cultural sites and temple ruins, private islands, waterfalls, and a chic capital, all within a couple of hours of each other?\n:\nBasically just coconut, chilli, & happiness.\n: Full moon holidays, bank holidays, religious holidays, who knows, just embrace them (thanks to our commenters for this one). We've got a\ntoo!\nGot your own favourites? Want to tell us we're buffoons? Head to the comment section below!\n",
  "url": "https://www.yamu.lk/blog/10-things-to-love-about-living-in-sri-lanka"
}