{
  "title": "10 Yummy Things You Can Do With Marmite",
  "abstract": "We adventurously tried out a ton of stuff with Marmite. And we liked it for the most part.",
  "author": "Aisha",
  "date_published": "4:27pm",
  "content": "Everyone knows that black little tub. You either love it or hate it – there's no in-between.\nLuckily for the guys over at Marmite SL (who wanted us to try out a bunch of Marmitey goodies), we at YAMU aren't fussy and we like our food, regardless of whether there's Marmite in it or not. Taking that into account, we crashed a food-tasting event (created exclusively for us) where we sampled about 15 different items made with or of Marmite.\nWe liked some of them, absolutely loved the others, and didn't like a few of them. There are ten combos we think are great to try out at home.\nThis is something you can easily get at your local bakey or kadé. Drizzle a bit of Marmite on top of the pattie (we used a spoon, and it did the job well), and give your regular snack a much stronger flavour. This works well with a slight drizzle — we'd advise against using a lot of Marmite, because the taste can be a bit overpowering otherwise.\nThe pizza we tried was chicken and cheese. This combo worked well. The Marmite complements the cheese, so we'd suggest you opt for a cheesier pizza if you want to try this. It's a good way to add a twist of flavour.\nWe've tried this before, and this is one of our favourites because of how beautifully simple and uncomplicated it is. Use the Marmite as a dip. As always, don't scoop it out plentifully. Use the dip sparingly. Another creative dip is the 'tomamite' — a concoction of tomato sauce and marmite, which has an interesting sweet and tangy flavour to it.\ngo well with Marmite, especially since they are nice and crispy on the outside. They pair even better with tomamite, as the tomatoey flavour complements the dough and the\n. We're guessing Marmite would also go well with\nsince they are thin and crunchy. We also tried\n, but that was a no-no. It was too starchy and fluffy for the Marmite to work as a good dip.\nIn this part, we focus mainly on how the Marmite works when it's used a part of the dish, instead of as a dip. Some of these creations really surprised us with how good they were. Have you ever heard of caramelized Marmite? No? Well, today you will. We're going to start off with what our favourite.\nThis cake was a stunner. It was light, buttery, and fluffy, and had a bit of Marmite in the dough itself — but the winner was the topping. Coated and topped off with confectionary sugar and caramelized Marmite, the way sweetness and bitterness contrasted in this cake was truly amazing. This was our favourite, and a clear winner. The beauty of this creation is how little Marmite is actually needed — just a spoonful added with the sugar while it  is caramelising.\nThis is really easy to make, given that you can easily grab all the ingredients off a store shelf. This one had chicken ham, cheese, lettuce, tomatoes and, obviously, the burger-bun. Just layer them all on top of the other, and apply the Marmite on the bun for additional flavour. It goes great with the ham and cheese\nWe slathered some Marmite on to the\n(pretty much like what your mom may have packed you for your school breakfasts) and then sprinkled some Marmite-infused\non top. This is your regular, traditional\n— grated coconut, chillies, chilli powder and onions mixed together — with like a teaspoon of Marmite mixed in instead of salt. I personally think it could have used more salt, but Bhagya felt it was just right.\nThis was really really good — a definite win. We loved it, and definitely recommend a dash of Marmite to spike your everyday chicken curry. It's really simple to make as well. Cook your regular Lankan chicken curry, and once you switch the stove off, just add a tablespoon of Marmite into the gravy and give it a good stir.\nAdd a dash of Marmite to your regular toss-up of\nstir-fried veggies and meats. This is a good combo, and adds an indescribable (how would you really go about describing how Marmite tastes?) flavour to the overall dish.\nTake half a cup of white vinegar, 1 1/2 teaspoons of Marmite, 1 teaspoon of Dijon Mustard, and a teaspoon of honey and whisk them all together to create this tangy, zesty little dip.\nThink of this as dessert. Marmite goes\nwell with dark chocolate.\nAlso, let us save you the trouble and give you a hint as to what\nto try it with (in our very personal opinion):\npasta and peanut butter. This is of course highly subjective, and you can most certainly try it out with them and let us know if you like it.\nMeanwhile, the recipes for the Toffee Cake, the Kottu, and the other stuff we've approved of can be found\n.\nHappy cooking!\n",
  "url": "https://www.yamu.lk/blog/10-yummy-things-you-can-do-with-marmite"
}