{
  "title": "11 Things To Do During A Powercut - 2016",
  "abstract": "Here are our crafty tips on how to survive the power cuts!",
  "author": "",
  "date_published": "3:20pm",
  "content": "It's power cut time! Here's how to battle the heat, the darkness, the despair. For the 2016 October Power Cut Schedule, check out\nor\n.\nAssuming it’s during the day, big shops will have AC and you can wander around comfortably enough. Reliable spots are the malls (Crescat, Liberty, Majestic) or big outlets like ODEL or House Of Fashions. Also any of the Softlogic spots (Nike, Giordano, Levis) should be on generators. Places like Independence Arcade and Racecourse aren’t air conditioned in the hallways, but the shops should be.\n.\nYou don’t have to stay at a hotel, but Lankan hotel lobbies are some of the coldest places in existence. Dress up like an Indian tourist and loiter. If you’re really balling just check in to some place like\nor any of the budget city hotels and let their generators burn.\nLight a coil or citronella candle, or arm yourself with repellant. Alternately, cover your lower body and put one of those food cover things over your head. It won't be very effective but at least you'll look edgy.\nThere’s a guy who sells kiddie pools on the Athurugiriya Road (heading towards Templers Rd), near the Wetland Park, just past a bridge. He’s on the side of the road and easy to spot. Fill it up, grab what’s left of your rapidly melting ice, pour yourself a drink and get your swim on, ie. dunk yourself in a shallow body of water.\n(\nCinemas are notoriously, blissfully cold. Who cares if they're showing Kung Fu Panda 3 and you’ve already watched it 3 times? In your pursuit of high impact, functioning A/C, this is one of your best bets. Think of the ticket price as rent.\nAs night descends, your options get narrower. But all that darkness can be a good thing because it means no ambient light/ light pollution. If the gods have any mercy, it should be a clear night. So what better time to find a clear patch of sky and land, and gaze upon the constellations.\n: if your phone’s still alive and you’re feeling extravagant with the battery, download Sky Guide to identify what you’re looking at. See if you can spot Jupiter.\nIf you’ve got wheels, hit the streets. Journey > destination and all that. It isn’t loitering if you’re in a vehicle. Marine Drive is nice and it hasn’t got street lights even when there is electricity, so it shouldn’t make too much of a difference. If you don’t have a car, use what little phone battery you have left to convince a friend to take you out.\nThe power’s off, which means your fridge is too. This might be a good opportunity to rustle up a picnic basket with short-life items and head to Viharamahadevi Park - or any grassy outdoor place that isn’t hostile towards people enjoying themselves.\nIn case you’re one of the few people that uses a smartphone, you’ll realise it’s a central point of modern existence. Get a legit heavy-duty\nand make sure you’re not stranded, or worse still without some sweet tunes.\nThe lights are off, your wife can’t choose Keeping up with the Kardashians over you, and you can light some candles and pretend you’re a romantic fellow. Pop some deodorant on though, because nothing kills the romance like B.O. If you’re lucky enough to avoid a water cut on top of the powercut, take the candles to the shower.\nIt's dark, you're probably stuck with people you know or love (or both), and there isn't much to do. Board games are boring (unless it's the Game of Thrones roleplay one), so you'll have to just regale each other with conversation. Ghost stories are the best in these instances. They will scare your siblings so bad they won't be able to go to the bathroom alone, and they will scare your lovers into having to lean in for a snuggle. Win!\n\n",
  "url": "https://www.yamu.lk/blog/things-to-do-during-a-powercut"
}