{
  "title": "15 Book Nooks In Colombo ",
  "abstract": "The best places to hide away and read in busy Colombo.",
  "author": "Shifani",
  "date_published": "3:43pm",
  "content": "Colombo isn't a very bookworm friendly space, meaning you don't usually see a lot of people reading in public. But there are still a few places you might not have noticed that make awesome little book nooks, if you're in the mood for some reading outdoors.\nWhen you say 'book nook' what comes to my mind is cushions, coffee and quiet. So we've tried to make a list of places that do these best.\n213, Dharmapala Mawatha, Colombo 07\nis one of our favourite haunts - quiet and simple, tucked away and still at the busy crossways between Kollupitiya and Town Hall, it's a good place for a book.\nThe ambience is superb. Not only do you get the lovely fragrance of scented candles and old antiques wafting through from the Paradise Road store around and below you, but the furniture, art and service all get a thumbs up too.\n: It is a small space, and if you're there on a weekday you can have the place to yourself, but on weekends it can get fully taken up, especially the cushy sofa on the inside.\n: Cafe latte for Rs. 325\nColombo 07\n, not an option if the weather's bad, is otherwise an amazing reading spot, with beautiful old trees and an expanse of clean, green, quiet. Fun fact: the romantic poet Keats got most of his inspiration while sitting under trees.\nThere are plenty of benches strewn across the park, so if you can find one that isn't occupied by lovers, set up a little cushion and stretch out with your book. Ideal after 4PM.\nAlthough the seats are constantly kept clean, spontaneous bird poop is heinously unpredictable.\nBring your own, or get some ice cream or hot corn at the other end of the park near the kids' section.\n40/1, Josephs Lane, Colombo 04\nis one of the best places to read a book, and my personal favourite. It's an A/C'ed book-store with huge leather cushions.\n: This spot gets plus points for the smell of new books and the tea and coffee stall in the front (oh and if you want to take a break from reading, they've also got a collection of movies and a DVD player to watch them on).\nThey have a small but interesting selection of books. Lots of fantasy and illustration books if you like that - if not, BYOBook.\nRs. 250 for a coffee, Rs. 200 for a milkshake.\n60, Stratford Avenue, Colombo 06\nFormerly known as Cafe Che,\nin Kirulapone has a cosy little room upstairs with one of the comfiest sofas we've ever been on.\nThe room is A/C'ed too and it's pretty private. There's two other seats in the same room so maybe you can take a friend with you who wants to spend the weekend the same way.\nThe only catch is, this is a restaurant and a pricey one, so while hogging up the whole room you might eventually feel obliged to buy food for Rs. 400+.\nRs. 250 for a tea or smoothie.\nElvitigala Road, Colombo 08\nYes, kind of creepy. But hear me out.\nis beautiful. If the weather is pleasant and not too hot, then this is a great place to contemplate and read or write some serious shizzle, what with the most glorious trees in the city being here. Perhaps an existential novel or some Edgar Allen Poe verses. Just kidding, don't be morbid.\nThe cemetery looks quite cheerful in the day time, with bright red flowers, majestic stone tombstones, and sometimes poetry on the stones that provide sufficient reading material on their own.\n: Ghosts. Also, you might have to steer clear of the guards (which is easy since the grounds are insanely large), since loitering in a cemetery is bad manners.\nNone.\nGalle Road (8th Lane), Colombo 03\nis actually not a physically comfortable reading place. It's got a lot of books inside it, the interior is ACed and smells great, but it's a garden cafe so all seating is outdoors.\nThis is a pretty, pleasant place to sit down and relax. The music is nice and unobtrusive and there's usually some interesting art inside the gallery if you feel like a mid-book break. There's seating downstairs and more private spaces upstairs.\nThe place is usually teeming with tourists and Colombo hipsters, so privacy with your book will be rare, but hey, at least you'll look fashionable.\nRs. 100 for tea, Rs. 150 for ice cream. Try the peanut butter milkshake.\nAlfred House Gardens Road (off R. A. De Mel Mawatha), Colombo 03\nBritish Council's revamped library is an awesome place to read, with comfy chairs and even comfier bean-bags at the back for kids (but you can just go chase the kids away and sit there like I did).\nThe floors are nice and carpeted and given that it's a library it's wonderfully quiet, plus you have a whole library to pick your material from.\nLibraries should be the obvious option for reading a book, but ours have a few glitches. British Council is kind of small so it's almost always packed with people, which is a problem if you like some privacy with your book. The Public Library near Viharamahadevi has the books but it's generally rather dark and uninviting with stiff furniture.\nThere's a canteen downstairs that sells great biscuit pudding if you're on a book break.\nGalle Road, Colombo 03\nThe beach is a great place to read at (and write) if the weather's good. Galle Face gives you a great view of the waves from a nice dry spot on the rampart.\nLater on in the day, the rampart crowds get thinner and there are little wooden benches next to the big Galle Face flag-pole that make for ideal reading places. Or sit on the steps or the grass. You've also got the option of flying a kite during a book break.\nYou're screwed if it rains.\nNearby you've got isso-vadey stalls (after 5PM) and kadala shops.\n854, Sir Marcus Fernando Mawatha, Colombo 07\nWe've got another park-like option\nbesides Viharamahadevi and the Borella kanatte.\nLots of green and trees and quiet. Green spaces are generally inspiring for writing too.\nMinus points for no back-rest.\nNone.\nVajira Road (off R. A. De Mel Mawatha), Colombo 04\nI love the M. D. Gunasena book nook upstairs. Even\nhas seating, but the one in their Duplication Road store is much cosier.\nThere's a vast book range available around you (check out the Marvel and DC Comics encyclopaedia downstairs), and they also get points for the woolly blankets on the cushy sofas.\nThere's just one sofa and two other cushy seats, so if you're there on a busy day, it's likely the seats will be taken up.\nNone.\n24, Fife Road, Colombo 05\nis actually one of the best places to read a book.\nIt's small, colourful, and not at all crowded in the evenings. There's a sofa on one side, a little bed-sofa on the other and a long cane chair on the other end, so you can take your pick when it comes to finding a seat to sink into with your book.\nIt's crowded during mornings and just jam-packed on some Sundays when they host poetry readings.\nRs. 150 for coffee, Rs. 130 for chocolate brownie.\nAloe Avenue, Colombo 03\nis one of the best coffee shops in Colombo. It's on Marine Drive so it makes use of the ocean view.\nThere are plenty of different kinds of reading spaces here - by the window (my favourite), in a sofa nook, outside. The interior is nice and mellow, and the service is good and unobtrusive. We love their cold drip coffee.\nIf you get hungry, it can get expensive.\nRs. 340 for a cold drip coffee.\n44A, Horton Place, Colombo 07\nis a very cute little cafe at the end of a kids' shop. It's an open space with a long cushy bench, and some garden furniture.\nIt's small, and usually quiet. They've got great honey-infused brownies and throw pillows - win.\nThe sunlight and the openness is part of its charm - so this isn't an option during rainy weather.\nRs. 300 for a fudgey brownie, Rs. 300 for fresh juice.\n14A, Marine Drive, Colombo 03\nis great for a quiet read, especially when it's raining outside.\nIf you buy a carton of tea, they usually wave off the bill for the cups of tea you're having. You get a view of passing trains and the sunset through the glass wall. The long sofa is the best spot.\nThey've only got tea, no snacks.\nFlavoured tea for Rs. 200ish (our favourites: Mango, and Spices / Indian chai)\n37/3, Pedris Road, Colombo 03\nis our latest addition to the list - it's gorgeous inside and outside and they serve good coffees in a myriad of ways: black, short, long, iced, with milk, flavoured, etc. You name it!\nYou can choose to read inside or outside, on comfy Parisian bistro looking cane chairs, impressive armchairs or on a cosy sofa. And it's super quiet and peaceful.\nTheir food isn't as tasty as their coffees.\nRs. 380 for a cappuccino, Rs. 500 for a hot chocolate.\nSo that's our list of bookworm-friendly nooks in Colombo. The best place to read is at home snuggled up in blankets, but if you're feeling restless and want to head out with your story, then these are some of the best options. If you can think of other great book nooks we should check out, comment and let us know.\n",
  "url": "https://www.yamu.lk/blog/colombo-book-nooks"
}