{
  "title": "15 Sri Lankan Hotels in the Wild",
  "abstract": "Luxury and leopards, champagne and forests.",
  "author": "",
  "date_published": "3:04pm",
  "content": "The paradise island's reputation for ecological diversity is seriously brag-worthy. We're not sure why anyone would choose to stay in a glitzy monolith of a city hotel when you can stay in a tree house and spy on elephants flirting with each other, or in a chalet where you can watch egrets flap down on your deck, or do leisurely laps in your private infinity pool above the tree tops.\nTurns out the wilderness of Lanka isn't just for backpackers and hikers. Into luxury and intrigued? Here are some of our favourite hotels in the wild, in no particular order. We've included some that we've reviewed, and the rest that we hope to in the future. Feel free to tell us what we've missed.\nArguably one of the Jetwing Hotel group's best hotels, Vil Uyana is nestled over a man-made lake in the historic Sigiriya district. This luxurious creation of a private nature reserve is unparalleled in the country, and the private chalets and service are rumoured to be impecccable.\n\nEvery single one of the Back of Beyond properties (of which there are 4) are absolute escapes into the wilderness. With a minimal carbon footprint, you're shunning A/C, eating locally-sourced produce, and experiencing nature first-hand. Slap on your mosquito repellent, dust off that fancy camera lens, and settle in to one of their properties for delicious food and a real Lankan nature experience whether you're in Yala or Tangalle. Our favourite?\nand its charming little natural stream.\n\nUga's Jungle Beach in Trincomalee is some serious luxury swank. It's got pristine swimmable beaches, an upscale selection of cabins and villas seamlessly incorporated into the natural landscape, as well as jungle expanses and a sleek pool.\n\nThe Banyan Retreat is a treat for eco-lovers, birdwatchers, and people who enjoy genuine rusticity. It's really not for those expecting glamping, lavish buffets or unsustainable luxury. A bit further East than Udawalawe, Hambegamuwa is a relatively untouched spot with a lot of great\nand fresh air. It also seems great for group yoga/meditation retreats or general detoxing. Leave anything that beeps or flashes in the car, and spend a few solid hours on the lake or stargazing at the universe.\n\n98 Acres is possibly one of the island's most popular spots for luxury in the wild. The resort is set on 98 acres (obviously) of tea estate, and features a bunch of individual chalets constructed out of upcycled material like old railway sleepers and straw. Based in tourist haven Ella, you'll also have plenty to do should you ever feel like leaving the estate.\n\nOne of my personal favourites on this list (and on the island), the Ark is one of the most private and naturally stunning locations you'll find here. A stay at the Ark can accomodate between one to three couples, but the booking is given on a fully private basis which means that you'll have the entire chalet and hill to yourself. The infinity pool overlooks the tree tops, and often the clouds. Chic, private, and beautiful, it's barely an hour away from Colombo.\n\nTouted as possibly the best yoga retreat in the world, Ulpotha has been a retreat for thousands of years. It's not a hotel in the traditional sense, and offers itself up as a retreat that you can experience as you wish. We can't quite put it better than their site does :\nUlpotha's foundations are thus laid on the timeless grounds of nature, history, tradition and myth. The surrounding hills continue to harbour cave-dwelling ascetics and practising shamans and the land remains infused with the still potent therapeutic spirits of the gods, kings, priests and romance of its storied past.\nBarely 10 KM away from Buttala National Park, Tree Tops is a genuine jungle experience nestled in the wilderness of SouthEast Yala. You'll actually find wild elephants roaming through the hotel's premises. Do expect simple camping experiences though, as there is no electricity. although bathing features heated showers. Meals are meant to be excellent and local too. This is as authentic as it gets.\n\nIf chilling in a boat while you watch wild elephants frolic on shore is your thing, you need to swing on by the Gal Oya Lodge stat. Darling of international travel mags and eco-thirsty tourists alike, the lodge is a beautiful essay in wild luxury. Spread over 20 acres in quieter Gal Oya National Park, the resort's so secluded you're best off getting there by helicopter, stuffing your bag with books and binoculars, and immersing yourself in the pristine wilderness. Or the pool, eitherway.\nTea Trails is undeniably gorgeous. Repeatedly cited as one of the island's best hotels, it comes with experiences and price tags that are pretty dang spectacular. With private butler service, lovely colonial bungalows, and vistas that make your soul ache, this is the stuff honeymoons and true bespoke luxury are made of. You can expect to pay\n, or around $700 per night on double board for their usual package inclusive of meals, drinks, alcohol, room service, laundry etc.\n\nOne of the relatively undiscovered beauties on this list, Living Heritage is a quiet resort dealing in private experiences. Each chalet at this Eastern hils resort boasts a private courtyard, outdoor plunge pool and hot water garden shower. It's also nestled in a grove of the\nor \"God's Forest\" that features a heap of local wildlife and a waterfall. What more could you ask for?\n\nBravely shying away from Lanka's usual affinity for beach resorts, Tri is perched on a natural hill by the Koggala Lake. If you're automatically turned off by the idea of a hotel down south not featuring the Laccadive Sea, have a little faith. With stark nautiladae patterns, a sparkling infinity pool, and clean cement lines, the eco-resort is a testament to sleek design and chic style. It's also supposed to be completely sustainable.\n\nThese guys essentially pioneered glamping in the country, with a selection of beautiful fully-furnished tents, superb personal safari guides, and a location just outside the Yala National Park. If you're serious about your single malt and even more serious about your\nhead over to Leopard Trails and start creating your next experience under the stars.\nProbably one of the most obvious ones (yet we slipped up and forgot it at first), Saraii Village has been one of our favourite spots for star gazing and bird watching. It's a treat to sleep in a tree house, dine under tons of stars, explore nearby Yala and enjoy amazing locally sourced food. You're also near Weerawilla Bird Sanctuary as well as Udawalawe, so you're spoilt for choice in terms of wildlife!\nJust on the edge of Yala National Park, Cinnamon's luxury hotel is home to 68 rooms/suites and a bunch of grey lemurs. Their sprawling property peacefully co-exists with the local fauna, and it isn't too surprising if you see a crocodile, elephant, or even wild boar ambling about around the nearby lake. While relaxing in luxury, keep in mind that the hotel's resident naturalists and partnership with Nature Trails means you can really explore the area's diverse wildlife via guided safari tours or even unique night safaris.\n",
  "url": "https://www.yamu.lk/blog/13-sri-lankan-hotels-in-the-wild"
}