{
  "title": "15 Totally Weird And Awesome Ice-Creams In Colombo",
  "abstract": "We went on an ice cream hunt for the most uncommon ice creams around town. Some were meh, while most were amazing.",
  "author": "Aisha",
  "date_published": "11:28am",
  "content": "Colombo's thrumming with new food, new drinks, and tons of new eateries. Most of them end up tasting pretty average and a few stand out, while a few others have specialities that makes them stand out a mile apart from the others. Some of these specialities come in the form of dessert, and in the form of pretty neat ice creams.\nWe decided to go on an ice-cream hunt to locate the most uncommon ice-creams we could find around town. Some of them were meh, while most of them were amazing.\nHere's a list (in no particular order) of our faves.\nWe know this sounds completely whack (\nbut it's mindblowingly amazing. Like Bertie Bott's Every Flavour Beans, this is pure magic because of how the combo — let me repeat it again for added effect,\n— of spice, fruit, and ice-cream flows flawlessly together. The olive was more of an aftertaste and didn't hit you immediately, but the pepper was very flavoursome; you're even able to crunch on it as well. Paradoxical as it may seem, this ice-cream's probably good for that sore throat and runny nose. Don't worry though, the pepper wasn't overpowering and this was more than just edible.\nThis little beauty packs a punch. It's\ntangy, and is almost akin to having a\ntoffee. A very very very tamarind-ish\ntoffee. There's also some tamarind sauce poured over, as well as the tamarind flavour being strongly infused in the ice-cream itself — so bewarned, if you can't stand sourness, this is going to leave you crying. We loved it though, and it left us extremely happy. Even Malinthe was surprised at how good it was. This stays true to its flavour, and is very authentic. The sweetness of the ice-cream barely comes through but it emerges just enough to not make it seem like you stuffed your face full of the fruit.\nWe need a different section for spice-flavoured ice-creams, since there's quite a few of those. Quite strong, even harsh, the force of ginger was strong in this one. I can imagine not many people liking it because of how strong and non-sweet this is, but we really enjoyed it. Like the pepper, this felt like it's good for you and that it should be had instead of meds for when you're down with a cold and flu. It also had quite a lot of chunks of ginger in it. Reminded me of the ginger plainteas made by my grandmom. Yum.\nThis is one of the subtler flavours which we tried. You could taste the wheatey flavour and you actually get the wheatey texture as well — I'm positive I bit into a bit of it — but it's very subtle. Despite its subtlety, it was unmistakably wheat, and tasted a whole lot like\n. This one reminded me of the\nporridges made during Ramadhan, especially as this left the senses slightly confused at finding and tasting wheat in your ice-cream. It's like you expect it to be porridge, but it's not.\nThis is as crazy as it sounds, and literally sparkles in your mouth. It's sour and they've put so much chili that your mouth tingles. This ice cream is actually spicy, and it works. If you like sour and you like spice, this is something you've got to try out.\nThis wasn't as strong as it used to be, Malinthe said. He's the one who's taking all these pictures, btw. Though the coffee flavour came out nicely, he apparently didn't get much of the arrack. Texture-wise, there were no complaints, what with it being soft and creamy.\nSounds crazy, but the manager said they were inspired by the sweet caramelized onions you get in a seeni sambol. Indi said he really liked it, and that it tasted of Durian to his mind — somthing strange but still really likable. This is such a weird mix of flavors that it's hard do describe. You get sweetness and cream, but also a saltiness and chew from the dried fish. Surprising, but it works. Mind blown.\nDespite its small size, this perfectly rounded scoop was unexpectedly good. We expected it to taste akin to caramel syrup — or like any other caramel ice cream out there, but it wasn't so. The bitterness of the burn came out quite well (you were actually able to taste it) and the caramel flavour wasn't too sweet.\n(for three scoops of different flavours)\nThis was a perfect replica of an avocado in terms of flavour. And texture as well, especially if you think of blended/ creamed avocado. Soft, milky, and smooth, you could easily mistake it for an avocado smoothie if not for the icy-ness of it. We tried it with the burnt caramel, and the combo was just lovely — what with the burnt flavour contrasting with the creamy taste of avocado.\n(for three scoops of different flavours)\nWe were curious upon seeing rhubarb flavoured ice-cream in Park Street Mews's home-made ice-cream flavours, and gave it a go. It's a bit difficult to describe, but we thought it tasted a tad like a berry-flavoured ice-cream. This was also deliciously creamy and well textured, just like the previous two we tried alongside it.\n(for three scoops of different flavours)\nThis Green Tea flavoured ice-cream was very authentic. It had a herbal taste (duh), and at times, the flavour made you feel like you were eating the actual leaves. It was slightly bitter, as leaves are wont to be, and not very creamy. We loved the flavour, but thought the texture could've been improved as it was a bit too hard.\nThis is on point. We'd give it a 5/5. Super creamy, it actually has chunky bits of frozen oreos mixed in it, along with a generous mixture of chocolate chips (which we love, so we'd give it bonus points just for that). The cream itself tasted of Oreos too, so they've gotten their flavouring down right. Having expected just ice-cream with the biscuit mixed in, this was a pretty nice surprise.\nBeautifully presented in a pancake like dish (not a waffle-cup), this reminded me a bit of those rose-flavoured sherbets served up in tall glasses in Bombay Sweet Shops in terms of flavour. It also smelled strongly of roses, and was garnished with dried and, I think frozen, rose petals. We weren't huge fans of this because of the texture — it was creamy but not quite, with there being more ice crystals than cream. It also melted a tad too fast, and was super sweet. If you like everything pink and rosy (no pun intended) you should check this out.\nSlightly creamier than its Rose Petal flavoured countepart, this was also presented quite nicely, with cinnamon and honey garnishing. The flavours came out strongly here as well, and it was sweet, but not as sweet as the former. We liked this, but we wouldn't go back for more (which we'd pretty much do for the ice-cream at Park Street Mews and Uga).\nI don't know how I was expecting this to be any different from honey, and it wasn't really. This was really smooth, and predictably quite a bit sweet (but not overwhelmingly so). It was also doused in generous doses of thick liquid gold. Not bad, overall.\nSo there you have it, people. A round-up of the most uncommon ice-cream flavours we can get around Colombo. If there's anything else we should try, or that you've tried and would like to share it around, hit us up in the comments.\n",
  "url": "https://www.yamu.lk/blog/ice-cream-in-colombo"
}