{
  "title": "15 Underrated Spots In Colombo (Restaurants, Bars, Etc)",
  "abstract": "Colombo's restaurant scene has grown quite a bit over past decade. While there are tried-and-tested favourites, there are…",
  "author": "",
  "date_published": "11:34am",
  "content": "Colombo's restaurant scene has grown quite a bit over past decade. While there are tried-and-tested favourites, there are also quite a few places that tend to fly under the radar, relatively unnoticed and under-appreciated.\nHere are a few places we feel deserve a lot more attention.\nColombo has no shortage of Asian eateries with a new restaurant seemingly opening up every other week. Chinese remains the predominant cuisine, although Japanese restaurants have also increased in numbers. With so many places to choose from it's understandable that certain gems have been overlooked.\nCafe Japan, my personal favourite among the Japanese restaurants, is an illusive, family run Japanese restaurant hidden away on 10th Lane in Colpetty. They've actually been around for the past 15 years but only a select few know of the place. They offer delicous home cooked Japanese dishes using fresh produce with sizeable portions at reasonable prices.\nWe think that YUMI at Taj Samudra is one of the best Japanese restaurants in town, but unfortunately it rarely seems to get the attention it deserves. While most Japanese restaurants tend to stick to the traditional look, YUMI goes for a more trendy, modern vibe which works very well.  Coupled with their excellent and innovative maki sushi options, YUMI makes for a great spot for Japanese and just quality dining in general.\nSunlight Garden is Chinese restaurant in Colpetty that hardly gets much attention from locals. When it comes to value for money, this place is right up there. The food is somewhere between authentic and Sri Lankanized, which actually works very well and the portions are massive. Chinese expats frequent the joint, but on our visit we couldn't see a single local customer.\nSince we seem to have more Asian places than anything else, we can fit all the other places here. These are places - some old, some new - serving western or Sri Lankan fare that we think should be more popular.\nHVN is Casa Colombo's restaurant. Just like the hotel, HVN is a more than a bit over the top with its golden ceiling, ginormous black fans and painting of four rishis. That aside, their food is actually really great and quite affordable. While the menu isn't huge, the few dishes they do offer are creative and tasty.\nThe Boulevard (run by the same people that do Tasty) has been hidden away on Queen's Road for a while now. The theme at Boulevard is a cross between a cafe and a fine dining restaurant, and while many have failed at this, they actually pull it off. They offer both a cafe menu and a fine-dinning(esque) menu. We tried a few dishes from the latter and came away very impressed. This was also one of the few places that really nailed a\nThe Fat Crab (run by Don Stanley Caterers) has great food and an amazing beach view, thus we're surprised that it's not more buzzing. It's one of the few crab dedicated eateries in Colombo, and their prices are OK. We've tried the crab curry with kade paan and found it quite nice with a well spiced curry and tons of meat in the crab. They've also got their Mongolian restaurant, Genghis, in the same premises in case you want to mix it up.\nThe Sovereign German Restaurant is the lesser known of the two main German restaurants, with the other being\n. They serve extremely hearty German fare in a kitschy but welcoming location in Nugegoda. The food is meaty and come in massive portions, just the way we like it.\nWe're getting a lot of new Cafes as well, they're second in growth only to Chinese restaurants. Sadly a lot of these are mediocre but still draw large crowds, mostly due to intelligent marketing. On the other end of the spectrum we've got places that serve up excellent coffee and food, barely seeing half as many customers.\nCup Cafe is a small coffee shop located beyond the Baptist Chapel Road. With excellent desserts, coffee and food, this is better than your average coffee shop. The service is also great with a staff that zealously tries to ensure that customers order exactly what they're in the mood for.\nAbove the many layers of candles, sarongs and cutlery of Paradise Road, tucked away on the store's upper balcony is the Paradise Road Cafe. While the cafe has existed for several years, it seems relatively unfrequented by the average Colombar. They offer a small menu with dishes like gnocchi which is very difficult to come by in Colombo. It's just a lovely place, perfect for a meeting, socialising or even some alone time.\nWe actually haven't yet gotten around to reviewing Brown Bean's shop at the Good Market shop at the Lakpahana, but we've had their coffee time and time again it's been consistently good. They use a Peruvian coffee which has a distinctly unique flavour. The best part is that their prices are lower than most other coffee shops around Colombo.\nWe tend to have this bad habit of finding a bar or pub that we're comfortable with and then just sticking with it. While the choices for bars may not be as extensive as restaurant, there are a few good ones that have gone unnoticed or assumed to be wrongfully dodgy.\nThe Castle Hotel is the finest of dodgy bars. It is housed in a beautifully ageing on Castle Street, near the Slave Island railway station. This isn't the most woman friendly bar but the drinks are cheap and the bites are usually excellent. It's been featured on CNN and all over but we still think it's underrated. And it'll be bulldozed in a year.\nZaZa is probably my favourite posh bar in Colombo. It isn't really one of the first places that comes to mind when people think of bars in Colombo, but we think it should be. It's a bit dark but both the drinks and the tapas were excellent and they've got one of the best happy hour offers around with one for one on beverages and finger food from 5.30 PM - 7.30 PM.\nWe can see how people can assume EAP is dodgy and avoid it, but it's not really that dodgy at all. In fact, EAP is a surprisingly pleasant place to have some arrack and devilled bites in the evening. Hobbits love it.\nAce Pub is a great rooftop bar located above the Steam Boat/Naniyori restaurant building in Nawala. It's got a lovely view of the city at night and they serve reasonably priced drinks, inoffensive sushi and decent Chinese.\nSo those are a few of the places that we think deserve more attention from the average Colombar. The thing about underrated spots is that even we may have overlooked some, so please let us know of any other hidden gems in the comments section.\n",
  "url": "https://www.yamu.lk/blog/colombos-underrated-restaurants"
}