{
  "title": "15 Weirdest Sri Lankan Things That Happened in 2016",
  "abstract": "The strange and beautiful happenings in Sri Lanka's 2016",
  "author": "Kinita",
  "date_published": "11:07pm",
  "content": "Sri Lanka is a weird and beautiful place to live. With tales tinged with gal arrack and magic coconuts, legendary creatures like giant crocodiles and men descended from lions, plus plenty of hilarious political intrigue, we don't need fiction when our reality is so deliciously strange. Here are our favourite moments from 2016.\nTitles are links to news articles, in case you want proof.\nA 17-foot croc hung out in the Nilwala river. This is the stuff Japanese horror films are made of. Also potentially around 40 handbags.\nWhat was meant to be the world's biggest Christmas tree ended up being the world's biggest flip flop. Despite all the inaccurate facts being published in newspapers, the random and pointless social media outcry, the changed plans that resulted in a sparkly spaceship structure, the tree is finally up. How did the Grinch steal Christmas? One Tweet at a time.\nNo, we couldn't make this stuff up if we tried.\nAh, sexual repression! Bosom (lol) friend of hormonal boys the island over.\nWell not exactly. But\n. Because they are divine flashing behemoths of the mean streets of Colombo, transporting souls even as\n, and normal mortal rules shouldn't stick to them. Only\nshould.\nA rat explored the icy largesse of Keells Super's seafood section. The unfazed attendants carried on as though this was normal, so we assume it was part of the merchandise. At Rs. 44 on the kg, that's quite a lot of rat for your rupee, so we're not complaining.\nOk, so this might be a hat tip to South India, but we'll take what we can. Who knows what could be next? Bakamoona? Ammatasiri?\nWith numerous instances of restaurants and bars in Mirissa refusing to serve locals, it's pretty clear racism is as prevalent as Russians with sunburns on our sunny shores. Move over,\n, we thought we were racist Caucasians wayy before you got cracking.\nSari, not sorry ladies. All the ammis of St Joseph's school were told their bodies needed to be hidden under 9 yards of cultural shame before they picked up their own sons. Hello, sexual repression and misogyny, is that you again?\nA stalwart of our already spectacular aviation industry, this Sri Lankan pilot took \"flying high\" a bit too seriously and got too drunk in Frankfurt to be allowed to fly. Hilarious or scary? Both, much like everything else on this list. If you want to learn how to be like him, use\n.\nThe Joint Opposition queued up at Seenigama Devalaya to dash coconuts. This totally effective ritual was mean to compel the gods to stop the activities of the Financial Crimes Investigation Division.\" Ironically enough, a bunch of their wallets were stolen mid fervent dashing.\nIs this the greatest news story of all time? Yes.\nA country famous for its paper and hats, Panama's list of secret financial accounts were released. Lo and behold, dozens of Lankan businessmen and their savoury cohorts were featured. Basically the Hi! magazine of dodgy financial activity.\nBastion of ethical, well-researched journalism, the UK's Sun newspaper published a radical expose about Beyonce's \"enslavement\" of Sri Lankan women...via yoga pants.\nA recent Christmas carol sesh organized by the archdiocese of Colombo had lyric booklets featuring Tupac's Hail Mary. of Sadly, refrains of Tupac's angelic chorus \"Makaveli in this... Killuminati, all through your body/ The blow's like a twelve gauge shotty/ Uh, feel me!\" did not ring out.\nHere's hoping 2017 continues in the same vein of oddity! Jayaweva, my gentle fellow islanders.\n",
  "url": "https://www.yamu.lk/blog/15-weirdest-sri-lankan-things-that-happened-in-2016"
}