{
  "title": "16 Good Seafood Places In Colombo ",
  "abstract": "Here's a round-up of some of our favourite places for cuttlefish, crab, et al, in Colombo. ",
  "author": "Shifani",
  "date_published": "11:26am",
  "content": "Fresh seafood is the best part about living on an island. There are plenty of places that do good seafood in Colombo, whether crab, sushi or our beloved hot butter cuttlefish, but these places are our favourites.\nNihonbashi is one of Colombo's most famous restaurants - they serve the best sushi in the city, fact. The tekka maki (tuna sushi) (Rs. 480 - six pcs), salmon (Rs. 200), prawn nigiri (Rs. 180) and gyuu no tataki temar (Rs. 180) - all good. It all comes down to putting the best ingredients together. The tuna in particular is really, really good - apparently they get the export quality stuff before it goes to Japan.\nBarracuda has grown into one of the best beach side hangouts in Colombo. They do a good take on Sri Lankan Chinese, and their hot butter cuttlefish is one of the best around (Rs. 980 for L). This one is as good as it gets with a light, flavoursome and crunchy batter on top of perfectly cooked cuttlefish.\nMinistry of Crab is a high-end restaurant on Dutch Hospital premises, and - like Nihonbashi - is run by chef Darshana Munidasa. It specializes in crab cuisine and the food is just plain mouth-watering. The crab meat we tried was succulent and the spicy sweet gravy of the chilli crab dish, especially, was flawless (this one is a must-try). 9/10 for quality in this department. MoC, however, is merciless on the wallet - about Rs. 7K per head.\nThe Station is in the same neighborhood as Barracuda and they've got something in common - good hot butter cuttlefish. While mostly everything we tried here was very good, the highlight of our meals was the HBC (Rs. 600). The Station's rendition made it into\nlist; the crispy golden fried batter has a great balance of seasoning and spice along with well cooked cuttlefish with just the right texture, perfectly suited for the local palate.\nThe Beach Wadiya is a very popular beach side hangout. Of the stuff we've tried, the hot butter cuttlefish (Rs. 575) was by far the best dish. Unlike most other spots, they fry the cuttlefish in a thin bread crumb batter which was a great change up from the contemporaries. We've also heard great things about their baked crab.\nThe Fat Crab, atop Don's Deli on Marine Drive is well known for their seafood. The crab curry with kade paan costs Rs. 1900, and the crab, while not the largest we've come across, had a ton of meat in it and the curry had a great balance of spices. You know you've got the curry right when you're willing to eat just the gravy and bread.\nThe Manhattan Fish Market is a reliable bet for good seafood, albeit an expensive one. We've tried the Sexy Hot Whole Fish and it's sexy as hell, but for a whopping Rs. 2790. It's huge and the steaming whole fish was unwrapped in front of us, letting out this mouth watering fragrance. It came poached in a soupy broth of veggies, scallops and calamari, and plenty of bread to dip into it. The fish was soft and just falling off to the touch. The broth, spicy and delicious with the bread, was the best part about this dish.\nCafe Japan is another great place for Japanese seafood. On our last visit we ordered the assorted nigiri (Rs. 2000). At most other places you'd just get the platter of sushi, here we got the 10 piece sushi, salad, miso soup and tonkatsu (breaded fried pork). The sushi had just the right wasabi hit to it and the fish used was very fresh.\nAs far as street food/kades in Colombo go, the Yarl Eat House is one of the best. For just Rs. 200 to 400 max, they do a superb Jaffna style, spicy rice and curry with your choice of meat. Yarl is especially famous for its crab which is generous, though it brings your price of meal up a bit.\nBoat Haus Cafe gets a fresh catch everyday and the prices are pretty good. Authentic seafood-wise, it doesn't get much better than this. Once you pick what you'd like, they also prepare it the way you want (grilled, steamed, pan-fried, batter-fried, etc). We got 150g of grilled seer fish (Rs. 570), which was basically the size of a small steak. While the preparation was simple, it still tasted great - due to the freshness of the fish. We've also enjoyed their tiger prawns and cuttlefish.\nThe Lagoon is a fine dining seafood restaurant located in Colombo's Cinnamon Grand Hotel. The haul of the day is displayed prominently at the centre of the room on a thick bed of ice - mud crab, lagoon crab, mussels, modha and more. This is one of Colombo's classier seafood restaurants, the catch is always fresh, the preparation is clean, and the seafood is very good - enormous crabs and excellent fish, although expensive at Rs. 1500+.\nThe Sunday buffet at the Harbour Court of The Kingsbury is pretty good. It's the best in terms of salads and veg, highly competitive in seafood, and good for everything else. It's Rs. 3,500 all in. Their signature dish is oysters and caviar and, if you like oysters, they have them. We also like mussels and they have a tasty selection of this somewhat rare treat. In addition, there's a lot of prawn, crab, cuttlefish and other fruits of the sea.\nMayura Hotel is an epic place to stop by for some of the best crab we've had in ages. It's basically a tiny kade in Pettah, very popular for their fresh rice and curry served on banana leaves to office goers and tuk tuk drivers alike. For Rs. 430, you get a very fat, meaty crab, with rice and curries and an omelette. Great value for money. We made a video there even:\n\nSeafood Cove is Mt. Lavinia Hotel's specialist seafood restaurant. It has a great location on their private beach front. The fish and chips (Rs. 600) is a definite winner both taste-wise and portions-wise. You get three very sizeable fish fillets fried in a golden brown batter along with some of the best chips we've had in a while, and a salad. The fish is cooked perfectly tender with the batter adding the crunch. What we liked about the batter was that they had in a bit of chili powder which really did enhance the flavour by adding a bit of heat.\nSea Fish is one of those parts of Colombo that's been around since the 1970's. It's in a neglected little corner between Slave Island and Pettah next to ye old Regal cinema, and unexpectedly serves up some fresh, well prepared seafood. Sea Fish does some decent seafood and if you order wisely it's not too costly either. If you're in the Fort neighbourhood and you're a seafood person, it's one of the few places there to sit down indoors for a comfortable meal.\nBrought to you by the same management as one of our favourite Colombo eateries, The Bavarian, Off The Hook is a new seafood restaurant and bar. The menu is similar to Cinnamon Grand's\n, where you pick from an assortment of seafood, choose how you want it cooked and then pick a sauce and side. The seafood is spread out over ice at the back of the restaurant so you can choose. Prices vary depending on the weight. We wouldn't call it a sushi place, but the modha fillet here (Rs. 1540 for 350g) is great - it's served with a creamy garlic butter sauce and mashed potatoes, the fish is soft and cooked perfectly, falling apart in ribbons as you slice through.\n\n\n",
  "url": "https://www.yamu.lk/blog/seafood-in-colombo"
}