{
  "title": "17 Indian Restaurants In Colombo",
  "abstract": "Here's a round-up of where to get Indian food in Colombo. ",
  "author": "",
  "date_published": "10:58am",
  "content": "Indian restaurants are pretty much as popular as\nin Colombo. Sri Lankan tastebuds can't seem to get enough of either the masala, tikka and buttery naans of Northern India or the often vegetarian milky sambars and vades of the South. There are a whole load of places in Colombo that do biriyani and dosa, especially the roadside kades, but here's our roundup of some of the good places that specialize in Indian food.\n191, Galle Road, Colombo 4 | Rs. 50 - 200\nSaraswathie Lodge is an old favourite that also made it into our\n. Situated on Galle Road, this clean, efficient saivar kade is easily accessible and always occupied. They do a wide range of quality South Indian meals and you can have a very filling meal for under Rs. 150.\n43B, Haig Road, Colombo 4 | Rs. 200 - 500\nIndian Chaat Corner is one place that stands out among the others on this list, because it's more a quick-bite cafe than a restaurant or a kade. Instead of the big plates of biriyani and naan that you have to sit down and brace yourself for at other Indian places, you get some great, authentic Indian street food here. The puris and chaats feature a variety of textures - biscuit, namkeen (murukku-like), masalas - a pleasant explosion of sweet and savoury flavours.\n42, Horton Place, Colombo 07 | Rs. 1000 - 1500\nIndian Summer is one of very, very few fine dining Indian restaurants in Colombo. The food is not as great as at other Indian veterans like Shanmugas and Chanas, it's actually a little milder and not as spicy. Presentation, service and ambience is quite good though, so if you're up for a fancy Indian dinner, this is one place to consider, ambience wise.\n1A, Rajakeeya Mawatha, Colombo 07 | Rs. 1500 - 2000\nMaharaja Palace is another fine dining Indian restaurant. The prices are high but the portions are actually quite large now. Their food was always pretty good and it seems they've made some necessary improvements. Their chicken korma is to die for.\n147, Vajira Road, Colombo 5 | Rs. 500 - 1000\nAmriths on the square between Vajira Road and Havelock Road is one of the many mid-end Indian options in the city. The food won’t blow your mind, but it’ll probably be better than you expect.In short, Amrith has strong vegetarian dishes, along with their naans. The meats aren't bad and they have a good range.\n53/3, Ramakrishna Road, Colombo 6 | Rs. 500 - 1000\nShanmugas is one of the oldest and most reputed vegetarian Indian restaurants in the city. They're comparatively pricier, but the food is very good and the service is excellent.They offer a varied and extensive vegetarian menu with pretty much all the classics.We've tried their tikka masala, ulunda vadai, masala dosa and chili parota and it's all good stuff.\n39A/1 Marine Drive, Colombo 4 | Rs. 1000 - 1500\nSpice Coast does pretty good biriyani and Indian fare on Marine Drive. If their paneer 65 is any indication, their chicken 65 should be quite good. Fried and not very healthy, but a good Indian nosh. They also unexpectedly serve a great batch of Sri Lankanized Chinese cuttlefish from their Chinese menu.\n68, W.A.Silva Mawatha, Colombo 06 | Rs. 500 - 1000\nCurry Leaves is one of Colombo's oldest Indian restaurants. Their strength lies in their biryani. Curry Leaves is old school, from the look to the staff to the menu and the preparation of the dishes. Their murgh chicken biryani (Rs. 660) is apparently what their well known for - while it wasn't the best chicken biryani we've had, it was pretty solid. The positives here were the light and fragrant long grain basmati rice, and the abundance of well seasoned and spiced chicken.\n17, Charlemont Road, Colombo 6 | Rs. 1000 - 1500\nKandoori is my own personal favourite for good old Indian chicken biriyani: it was not too oily, spicy, with pastey bits of masala chutney in it, and for Rs. 440 we got a big portion that's okay for two if you're not in the mood to pig out. The chicken comes well cooked and incredibly soft. It's a popular family restaurant and they do a wide variety of North Indian dishes, and reliable Indian preparations of meats.\n50, W.A. Silva Mawatha, Colombo 6 | Rs. 500 - 1000\nChana's on W.A. Silva Mawatha is a small North Indian restaurant that has found it's way into two of our Top-5 lists (\nand\n). So they're pretty good. The menu at Chana's is more or less North Indian. They've also got some street food like pani puri and samosa chaats priced at around Rs. 200. Their naan and chicken tandoori were highlights of our last review.\n100/10, Independence Avenue, Colombo 7| Rs. 1500 - 2000\nAgra is another one of those rare fine dining Indian restaurants in Colombo. They're not cheap but we think their food is definitely worth the price.Their menu is predominantly North Indian, so you'll have a great selection of Tandoori, rice and Indian bread options to choose from.Their Nawabi biriyani (Rs. 1175) has both chicken as well as mutton and is served with a fried egg - when you charge Rs. 1000+ for a biriyani, it has to be really good, and in this case it gladly was; they also do a great classic butter chicken.\n9, Abdul Caffoor Mawatha, Colombo 3 | Rs. 1000 - 1500\nSet inside what seems to have once been a charming house, Navayuga is cosy, and their menu is pretty wide ranging. They have a refreshingly large menu to pick from - the menu declares pages of specials from Chettinad, Andhra, Hyderabad and general North Indian food. So whether you want typical Indian like chapati and vadai or you want to try out specific dishes from other parts of India, like the Sura Puttu from Chettinad (shark flakes), they've got it.\n381, Galle Road, Bambalapitiya, Colombo 4 | Rs. 200 - 500\nYou can pretty much stuff your face full of tasty Indian dishes at Chennai and it'll cost you less than Rs. 400, guaranteed.The parotas here are impressive. They were crispy, light and flaky. The tangy korma that it came with was probably the best of the side dishes we had.\nCinnamon Grand, Colombo 3 | Rs. 500 - 1000\nChutneys at the Cinnamon Grand hotel serves good South Indian fare, with a menu neatly divided between the four Southern states' (Karnataka, Andhra Pradesh, Tamil Nadu, Kerala) vegetarian and non-vegetarian cuisines. They also have some interesting Indian desserts, like the pesari pappu payasam - a yellow mung dhal flavoured with jaggery and coconut milk which came to Rs. 350. It was thick, hot and rich. Pretty authentic in taste and had the right ghee to jaggery ratio.\n2, Victoria Place, Narahenpita | Rs. 500 - 1000\nRed Fort Restaurant is a small North Indian Restaurant on a small side road just off Baseline Road. The restaurant looks like an old abandoned house with wild grass and a kid’s playground at the front.it’s a quaint, comfy place to have a meal. We really didn’t expect much from the biriyani considering it was only Rs. 325. The steaming golden flakes of rice sat on top of healthy chunks of chicken and a fried egg: the portions are generous, to say the least, we gave the biriyani a solid 7/10, and if it wasn’t so oily it would have been an 8/10.\n82 Dharmapala Mawatha, Colombo 3 | Rs. 1500 - 2000\nMango Tree is a hugely popular Indian restaurant on Dharmapala Mawatha serving mainly North Indian cuisine. The food is very rich, and while standards do seem to have slipped, it can still be good. They have an extensive menu and a cocktail list that almost matches in length and variety. A smoky murgh tikka (Rs. 800) can offset the treacly richness of a paneer makhani (Rs. 695), and opting for a plain naan over the butter (Rs. 195) will definitely help you through a couple of creamy curries.\n2, Mile Post Ave, Kollupitiya, Colombo 3 | Rs. 500 - 1000\nWhile we haven't tasted every biriyani in the city, nor have we dipped into that vast underbelly of aunties churning outsawans, Amaravathi's mutton biriyani (Rs. 590 - good for sharing between two) stands out as one of Colombo's finest. Their rice is a paleish brown, deeply simmered in a heavy chicken stock and infused with mint, caramelised onions, cinnamom, cardamom, the works. You get the feeling it's actually taken its hue from the surrounding stock and spices, not indiscriminate tablespoons of turmeric or colouring - the flavours really soak into the grains and give it that distinct savoury 'biriyani' taste.\n",
  "url": "https://www.yamu.lk/blog/indian-restaurants-in-colombo"
}