{
  "title": "17 Kinds Of Kottu In Colombo ",
  "abstract": "This peculiarly Sri Lankan fast food has found its way into our hearts and seems like it's going to stay there. …",
  "author": "",
  "date_published": "5:04pm",
  "content": "If there's ever been a dish that Colombars identify with, it's kottu. Its popularity is due to its late-night availablity. Catering to post-clubbing cravings, this peculiarly Sri Lankan fast food has found its way into our hearts, and seems like it's going to stay there.\nWith the advent of cheese kottu, that artery-slathering, milky madman invention, the hype was revived and since then kottu just hasn't been the same. However, there's plenty of other renditions of the dish that are just as good or even better that deserve recognition. Without further ado, here's the ultimate kottu dishes available in Colombo.\nEasily found at most Pillawoos joints, this spicy kottu is not for the faint of heart. Whenever we order this, we always ask that's it's made less spicy. All the chilly that goes into this gives it a rich red colour that would scare the daylights of a\nuninitiated with the ritualistic manner in which we devour spicy food. They add lime, too, and that's what gives the tart kick we identify with a good masala. Add a few cheese wedges to this and the heat balances out, giving it a softer orange colour. We prefer the chicken masala kottu over other meats. Sprinkle some lime before you dig in for a good kick.\nAh, the glorious cheese kottu. This clever invention brought kottu back into the limelight, with many a clubgoer and/or stoner patronising its milky, cheesy goodness. Typically, they add one or two cheese wedges and about half a bottle of kal kiri. The milk softens the rotti and helps spread the cheese all over everything, the onions, the veggies, the meat and whatever else you've asked to be put in it. Cheese kottus are mostly ordered with chicken, though you can get it with beef, too. It doesn't quite work with pork kottu, though, don't mess with pork kottu.\ndoes a pretty fancy take on it with a creamy cheese sauce poured on top of a bed of kottu.\nBest served at\nin Colpetty, the chicken palandi kottu is arguably as good as chicken cheese kottu if not better. Using curd instead of cheese, this kottu has a tart kick that's also fatty and milky in a way that works with spices at play. There's generally some cardamom and cinnamon in a palandi, so, if you're getting the real deal, it's quite flavourful. Bear in mind though that this is a very wet kottu, more so than the cheese kottu. Some might not take to the tart, milky taste, though.\nTechnically, this is a string hopper pilau, but it's often sold as a kottu, so we're including it here. This is just what it sounds like, really. String hoppers that have been chopped up and tossed with veggies and meats. It feels much lighter than the rotti kottu, and if you're a fan of string hoppers, you might prefer this.\nInvented by\nin Dehiwela, this one gave many a heart attack when they first heard of it. No, it's not made out of dolphins, and we're not sure why it's called that. Marketing gimmick or not, it's a name that's stuck and a dish that's worth keeping around. Using larger chunks of roti that's more like a parata, with lots more chili flakes and served with chili paste, it's a super spicy take on the original that's become quite popular with even Plaza Hotel in Colpetty serving up a mean rendition.\nAnd it's not just the roti chunks that are bigger, you get larger chunks of chicken, too, making for a satisfying mouthful. It's not for everyone though.\nMostly made at home when you're bored with slicing bread and want some excitement in your life, the bread kottu is a result of sheer creativity, really. The fluffier the bread, the more it's going to absorb all the flavours from the curry and the tastier it's going to be. We actually took a loaf of bread to the nearest\nand they were happy to make one for us. Let us know in the comments if you know of any place that serves this up, and if you've got a crazy recipe that we need to try.\nIt's pretty much a scrambled egg instead of roti, with spices and a meat of your choice, served up by\n. This one comes down to the quality of the meat that's being featured. It's the priciest kottu that isn't a kottu. If you're looking to cut carbs and savour the flavours of a good kottu, this is a great alternative to a protein shake, though with lots of oil.\nMostly found around the suburbs of Colombo, like Boralesgamuwa, Ratmalana and Maharagama (we recently had it at\n), this is definitely the most distinct kottu. Bacon, ham and pork would make anything better, really, but what makes this rendition stand out is that they use pork curry. A dark, spicy pork curry, with lots of black pepper and plenty of fat. Chewing through the juicy fatty bits of pork is just an incomparable sensation to the typical kottu and makes this dish worth seeking out.\nYou can't really chop a crab into a kottu like any other meat, because the shell obvs, but still\nmakes it work. With one claw of crab included as a sort of garnish, they add lots of crab meat into the kottu bringing in a much more subtle flavour that your typical kottu. It's not super spicy, even when you add the gravy, so don't expect a Jaffna style crab feed sensation from this.\nThe crab meat is nice and soft, so it makes the kottu feel much more delicate than you'd expect.\nArguably the most popular kottu, beef kottu is a staple, sort of go-to kottu when you're just hungry and don't want to spend too much money. It's pretty straightforward: lots of meat and plenty of heat. You get slightly different versions of this, mostly differing in how they prepare the beef. Sometimes it's devilled, sometimes it's curry. Either way it's beef, so it's all good.\nFor the pescatarian, there is the kiri maalu kottu from Uva in Colpetty. Cubes of fish with a kiri hodi gravy make for a much less spicy kottu that still packs a lot of flavour, with some sour notes from goraka bringing a little kick.\nOn the tastier end of the seafood kottu spectrum, the prawn kottu has a good crunch when it's got a lot of prawns. Most places will give you a lot of the smaller prawns, which actually work quite well with the bits of rotti. You can order these thoughout the day from Chop Chop.\nA mythical creature, the HBC kottu is a marriage of two of Colombo's favourite foods. With the crunchy, buttery goodness of cuttlefish and the spicy carbload that is kottu, these two make for great bedfellows when they're tossed together. Here's how you do it. First, grab a veggie kottu with or without cheese from a Pilla, then hit up your nearest Chinese joint for an HBC. Toss the two together, adding some chili paste in there, too, and have at it. It's the bomb-diggity.\nObvs, there's vegetable kottu and egg kottu that exist and serve as budget options or perhaps dietary choices for some. An egg kottu is pretty much an omelette chopped up and tossed into kottu. Usually quite peppery, this is kind of like the egg fried rice of kottu, really.\nWe're not sure how many vegetarians eat kottu, since it's a meal that's often shared amongst others and most popular for the versions with meat, but any kottu place will make a veggie kottu if you ask. It's the cheapest option, and usually just includes potato, tomato, onions, carrots and leeks. We really do wish that there was more to it, like brinjal or mushrooms, to bring in a meatier umami flavour.\nYou can actually grab\nkottu at lunch time at the Matara Buth Kade on Galle Road, Bambalapitiya, but there's likely places in Slave Island that serve it, too. A delicacy amongst the Malay community,\nor tripe is an unusual protein that doesn't appeal to everyone.\nThere's also a brilliant invention known as kos kottu that does not use any roti or flour. Instead, kos madulu (flesh of jack fruit) is cut into thin strips to look just like the godamba roti strips in a typical kottu. Steamed just right so that it doesn't get too soft, it's made so that it falls away piece by piece. Then, just like any kottu, ginger, garlic and veggies are added and sautéed.\nThis might be the healthiest kottu you can find, but it's super difficult to come by. Apparently Mr Kottu used to serve these, but not anymore. We were lucky enough to find a man named Asela in Siddamulla, Pannapitiya, who serves it at his restaurant, but even there you have to order in advance. Stay tuned for a How It's Made episode on this clever invention and our review.\nWell, there you have it. These are just the one's we've encountered. Have we missed anything?\n",
  "url": "https://www.yamu.lk/blog/the-ultimate-kottu-showdown"
}