{
  "title": "20 Years of Harry Potter",
  "abstract": "After 400 million books sold, on 26th of June 2017, the world of Harry Potter is celebrating its 20th birthday!",
  "author": "Dinithi",
  "date_published": "10:10am",
  "content": "\n\"We’ve all got both light and dark inside us. What matters is the part we choose to act on. That’s who we really are.\" - Sirius Black\nAn idea that originated in the mind of J.K Rowling on a commute is now by far the most popular book series in the world. There's almost no one that has not heard of the name Harry Potter, and very few have not yet read the books.\nAfter 400 million books sold, 8 major movies and 2 theme parks, today, on 26th of June 2017, the Wizarding World is celebrating its 20th birthday. This is the biggest milestone in the Harry Potter world as it is the celebration of the first book being published.\nIn celebration of this, Bloomsbury has released anniversary edition covers for each of the four Hogwarts Houses, in paperback and hardback. They look simply amazing! So, if you know your house, go ahead and\none of these because you just\nto have a special edition book to commemorate this monumental day.\nSince it's the 20th anniversary of Philosopher's Stone, these editions are only available for the first book.\nThere's more. Pottermore has finally launched an official\nwhich is completely free.\nThe Wizarding World Book Club kicks off in June, and to take part you just need to read (or re-read) a Harry Potter book each month – or more, as the books get longer. You can then join in a conversation about it on\n, or simply check Pottermore to learn more about each story.\nNow there's an official place for all your Harry Potter arguments about Snape's morality, Dumbledore's past or even the ridiculous ones like Sirius and Remus's romantic relationship (jk!).\nWe also came up with a few things you can do to celebrate 20 years of Harry Potter from the comfort of your home.\nIf you're someone who has never read Harry Potter in your life, or someone who has stopped reading it midway (which is highly unlikely), here's your chance to start! Also, shame on you for waiting 20 years, but better late than never. If you don't own the books, you can always get them delivered to your doorstep via\nor just step into any Sarasavi, VijithaYapa or M.D Gunasena.\nGather up some of your Potterhead friends and start a Harry Potter movie and books marathon, where you read all the books and watch all the movies for a month. But if your friends aren't willing, don't worry. There are so many marathons happening on Twitter, Instagram and YouTube you can always join them. That's the beauty of the internet, you're never alone!\nNow, this might be a little hard for you to do from the comfort of your home, but those lazy friends of yours who didn't wanna read might enjoy this. You can organise Harry Potter themed parties where you can dress up as your favourite Harry Potter character while chewing on some Chocolate Frogs or Bertie Bott's Every-Flavoured Beans. You can get these at\nin Battaramulla or Liberty Arcade.\nIt's a bit hard to find Harry Potter costumes in Colombo, but\ndoes have the famous Harry Potter glasses. You can always DIY costumes and if you're creative enough, it might end up looking like the real thing. I mean, how hard is it to make Luna's glasses right? If not, you can always order them on\n, but it won't be cheap.\nThis tastes almost exactly like the real thing (well the Butterbeer in the theme parks and studio). Plus if we can make it in office, you can definitely make it at home!\nIf you're lucky enough to be born on June or July, you can host a Harry Potter themed birthday party with home bakers like\nwho would be willing to make you a customised birthday cake. The collage above is from my friend's party and the cake was made by a lovely lady named Yamuna (071 810 0277).\nBritish Council is celebrating the 20th anniversary over the course of three months with loads of cool events for children as well as adults. If you're a fan, there's nothing you would enjoy more.\nThe celebrations will be held at their libraries in\n,\nand\nand end with a festival at the Colombo premises. To name a few events, there will be a book reading, magic show, sorting hat ceremony, tie painting, dramatic reading, table Quidditch (only in Kandy) and creative writing.\nIs it just me or every time I watch that scene it makes my stomach growl. It's actually pretty easy to make and it definitely tastes amazing, so what better time than the present? There are lots of recipes out there but we recommend\n.\nI could go on forever but somehow I don't believe you'd want to spend the rest of your day reading this. So to wrap it up, here's to 20 years of Harry Potter that gave children and adults the world they wished they lived in and to J.K Rowling for that exemplary writing that no other book has come close to.\n“The greatest thing Harry Potter has given the world is the freedom to use our imagination.” – Oprah Winfrey\n\n",
  "url": "https://www.yamu.lk/blog/20-years-of-harry-potter-2"
}