{
  "title": "2016 Celebrity Deaths : From Harambe to Muhammad Ali",
  "abstract": "We've witnessed an exceptional amount of celebrity deaths this year.",
  "author": "",
  "date_published": "12:07pm",
  "content": "While deaths are natural, and we saw the demise of plenty of celebrities last year too (remember Terry Pratchett?), this year appears to be host to an inordinate number of iconic deaths. From veterans of the silver screen to award-winning authors, 2016 has seen us bid adieu to some stellar, inspirational characters. Except perhaps for the gorilla, but more on that later.\n- Described as enigmatic and exploratory, Bowie was a dramatic and inspirational character in the music industry, crossing genres and creating blends of pop, jazz, soul, and more all infused with his performances. He always presented himself as an outsider, and had carved an identity for himself as a 'rock 'n' roll chameleon', with his more prominent roles being\n(a pun on the line\nEach role was reflective of a theme, be it a time of drug addiction or sexual identity. His last album, Black Star, dealt with his oncoming death head-on, with a harrowing music video released just three days before his death. Opening with the line \"look up, here, I'm in Heaven\", the video sees Bowie on his death-bed.\n- Best known for his role as the stony hearted yet passionate portrayal of Professor Snape, the much loved British actor succumbed to cancer.\n- Her\ncontinues to be one of the more poignant classics which deals with racial injustice in the United States. The novel is set in Alabama, and made it to the banned books list. It's still banned in numerous schools and libraries across the USA.\n- Dubbed as \"one of the most influential artists of the rock and roll era,\" Prince is best known for Purple Rain, an academy award winning American rock song.\n- Relatively unknown until his death at the Cincinnati Zoo, Harambe was shot and killed fearing the safety of a 3 year old boy who somehow managed to fall into the gorilla's enclosure. His death first lead to discussions and arguments about parenting, animal cruelty and similar important topics, but somehow degenerated to pure memes as months progressed.\nKnown as one of the most controversial and charismatic sports figures of his time, for refusing to be drafted for the Vietnam War and then converting to Islam, the three-time world heavyweight boxing champion lived with Parkinson's Disease for over 30 years.\n.\n- With an absolutely stunning voice, Grimmie was a YouTube sensation who rose to fame for her covers of hit pop songs and collaborations with other YouTubers like Kurt Hugo Schneider and Sam Tsui. She met with an untimely death while signing autographs when she was gunned down by one of the men in the crowds.\n- A veteran Sri Lankan dramatist and actor, Nandasiri was best known and loved for his comedic role in\n. Also involved in theatre, he played leading roles in numerous dramas including\nand\n- Loved for his comedic performances, Wilder starred as Willy Wonka in the film adaptation of Roald Dahl's much loved novel\n. He lived with Alzheimer's for three years prior to his death, but kept it away from media attention.\n- One of Sri Lanka's musical legends, pundit Amaradeva was a multitalented vocalist, violinist and composer. He's hailed as the inspiration of many leading musicians in the local entertainment industry, and is credited not only with influencing them, but with\n-  Where do you even begin with Cohen? Singer, songwriter, poet, novelist, recipient of Canada's highest civillian honour... he started bagging awards in 1964 with a literary competition prize for his first novel\n. Cohen, much like Bowie, was aware of his mortality and infused it into his later works which touched upon the themes of redemption, mortality and love, all incorporated in his album\nHis last album before his death,\n, is even more chilling, leaving us with lines like \"you want it darker, we kill the flame\".\n- Considered one of Sri Lanka's best English poets, Ranasinghe is well known for her haunting poems. A German Jew whose parents were victims of the holocaust in Nazi Germany, she eventually married a Sri Lankan and settled down here. Her works are also studied in the local O/L and A/L literature syllabi. We made a little tribute to her, with Imaad reading one of her poems, which you can watch on YAMU TV\n.\n- Despite political ideologies, you just have to admire Jayalalitha's determination and gumption. Starting off as a pretty actress in Tamil Naadu, she went on to become the Chief Minister in a male dominated arena of Indian politics for five terms, lasting 14 years, shedding her charismatic pretty-actress persona and commandeering respect by donning the title\nthereby establishing herself as a mother figure instead.\n- Known for her classic beauty and acting, Gabor was a Hungarian-American socialite who made more headlines for her multiple marriages and divorces; which she, more often than not, used to laugh at. She's reported as having said \"I am a marvelous housekeeper. Every time I leave a man, I keep his house.\"\n- Propelling to fame with\n, George Michael is best known for his songs like\nand\nHe campaigned avidly for LGBT rights and came out as gay in 1998. He's one of Britain's most successful entertainers, with Billboard deeming him the 40th most successful musical artist of all time.\n- More popularly known for Princess Leia, Fisher wanted her obituary to read that she died of drowning in moonlight, \"...strangled by my own bra.\" However, she was much much more — she was a mental health advocate who was open about her own issues (addiction and manic depression), and refused to be identified purely by it. Those who\nlove her for everything else she represented: an incredibly strong woman who continued to battle her issues out in the open and helped others understand and come to terms with their own.\n- She co-starred alongside Gene Kelly in\nand is Carrie Fisher's mother. Reynolds died of a stroke just a day after her daughter passed away. Tragic!\n- Former Prime Minister of Sri Lanka, twice appointed. He was involved with the government and held ministerial positions since 1970, when he was appointed as the Deputy Minister for Justice under President Sirimavo Bandaranaike. December 31 was to be observed a national day of mourning, but was quickly brought forward to December 30.\nOther (more obscure) things that we lost in 2016? Common sense with the entrance of Trump into world politics, hope with Brexit, and humanity with Aleppo and all the other hundred and one ignored wars and deaths around the world.\nWhat a year indeed.\n",
  "url": "https://www.yamu.lk/blog/2016-celebrity-deaths"
}