{
  "title": "24 Hours in Colombo",
  "abstract": "24 hours, 15 Colombos.",
  "author": "Kinita",
  "date_published": "1:14pm",
  "content": "Lacing Sri Lanka's Western coastline, the city is small enough to explore in a short time (600,000 inhabitants, 37km²), but vibrant enough to keep you entertained. Colombars are a diverse lot, with a mélange of cultures, ethnicities, and architectural styles, all of which get along well. Most of the time.\nColombo's probably best experienced over a lifetime, but if you've got slightly less time, here's a guide to 24 hours in the city.\nHead over to\non Marine Drive and wake up with some locally grown and home-roasted coffee. Watch the Laccadive Sea sparkle at you, and breathe in the lightly salted air. You can also try a Sri Lankan breakfast if you're feeling adventurous - ask for curry and string hoppers with the works.\nis busy, it's messy, it's loud. It's also a lovely bubbling melting pot of local culture, language, and business. If you're looking to just walk about and take in the eclectic charm that life in South Asia affords, or just do a bit of shopping on the cheap, this is the spot. You'll find everything from trinkets to leather to coconuts.\nPick up some thambili (king coconut) to sip on, and check out the Red Mosque, the Kathisaran Temple, or St Philip Neri's Church, all old religious edifices dating back a century or so. If you find creepy life-size dolls and political history interesting, you could also explore the\n.\nPlaying neighbour to Pettah, the\nis home to some of the city's oldest and grandest buildings. Boasting colonial façades and bustling financial spots, Fort is a great area to walk about and envision what the city would have looked like in the colonial heyday. A lot of the façades still retain the old name plaques and balustrades too.\nOur\ninclude the Cargills Miller building, the Old Parliament Building, and the\n. The\nis also in the area and features a stunning view of the port lit up at night.\nThe\nis a Colombo staple. A favourite amongst locals, expats, and tourists alike, it's a quirky, leafy oasis in the city. You can look forward to consistently good fare, plenty of vegetarian options, and cold beer in the rising afternoon temperatures. They also have a gallery featuring hot new local artists and a shop inside which caters to pretty much any souvenir needs you may have. Barefoot handloom fabric (usually in the form of a sarong) is beautiful, sustainable, and the uniform of the true Colombar expat.\nWe'd recommend you pick up a book from their store and settle down with some black pork curry and an icy Lion lager (Sri Lanka's proud, crisp brew).\nThis is essentially the worst time to be out and about in Colombo. Unless the prospect of searing heat, blaring traffic, and end of school day hysteria sound appealing to you, we'd recommend you hide. Any local lady of leisure will tell you that this is the best time for a siesta. You can catch your 40 winks back at your hotel, lounging by a city hotel's pool with a cocktail (\nor Cinnamon Grand), or at a spa with a nap-inducing massage (Spa Ceylon or\n).\nThe\nis one of the most eclectically engaging spots on the island. Despite Buddhism's reputation for austerity, the Gangarama is an actual smorgasbord of history, clutter and randomness. The premises is so absolutely stuffed with gifts, donations, and collections like vintage luxury cars, currency, statues, antiques etc, it's a museum in itself. In the heart of the swirling colours, gold, and ostentation, you'll find an old bo tree around which you can sit down for a moment of calm contemplation and mindfulness. Also be mindful of the dress code, no shorts,vests, or short dresses are allowed.\nThe ticket price (technically a \"donation\") also gets you into the\ntemple, on neighbouring Beira Lake. Designed by Bawa in the 1970's, it's a serene and spiritual spot, open to the elements, inviting in the gentle laketop breeze.\nThe\nhas been one of the city's oldest and most frequented promenades since 1859, when Governor Sir Henry George Ward bravely tried to set down lawns by the sea (an exercise in futility valiantly repeated numerous time since then). It's about 500 metres of urban park, perfect for kite-flying, street food, and canoodling under umbrellas.\nYou must try the isso vadey, a crispy prawn and cracker concoction the colour of the setting sun.\nis street vendor and a GF institution in itself, you owe it to yourself to let their incredibly knowledgable waiters gently guide you through a streetside culinary journey.\nThe\nprecedes the Galle Face Green by a few years. Built in 1864, it is a bastion of historical elegance. It's played host to numerous heads of state, royalty, and society weddings. The property is undeniably romantic and has gone through a much- needed renovation of late. We'd recommend you step down to their terrace for some al fresco drinks and watch the sun slip into the horizon.\nService is slow, but so are the waves lapping on the shore. Welcome to the island life.\nIf you're just here for one night, you may as well shell out and make it count. Both\nand the\ncombine international standards and consistency with elegant, vibrant local flavours and design. As you'd expect, MoC boasts a variety of fresh seafood, and their garlic butter crab is slaveringly divine.\nThe Gallery Cafe is an older institution, housed in Geoffrey Bawa's former office, and serving up some of the city's best dessert. We'd recommend you make reservations in advance for both. In case you'd prefer purely Sri Lankan fare at a reasonable price, we'd suggest\n.\nWind down after a heavy day the way true Lankans do - with a thundering tipple. Shed your bags, shed your guide map, shed your inhibitions, and settle down for an evening of stellar views and over iced drinks. If you're looking for careworn glamour and a lovely view of the port, head to the Harbour Room at the\n. If your tastes are marginally classier and you actually want a good cocktail, try the\nfor possibly the best view in the city.\nIf gazing at visages rather than vistas are your thing, try the\nor the\n. They both have a popular selection of bars and lounges to libate and satiate. We'd suggest arrack-based cocktails for some local flavour, like an Arrack Attack or Arrack Sour.\nAt this point, a cosy bed and shower is probably your best bet. If you're still up and at them after this whale of a day, we're impressed. Colombo does have a few night clubs, but they tend to get quite crowded. If you're insistent on going out and exploring the night life, we'd recommend\nfor some slick tunes and less offensive crowd. If you prefer a solid nap time, check out our list of hotels in the country\n, or our list of hostels\n.\nEnjoy Colombo. We'll see you when you return!\n",
  "url": "https://www.yamu.lk/blog/24-hours-in-colombo"
}