{
  "title": "24 Hours In Nuwara Eliya",
  "abstract": "Here's a quick guide on where to stay, things to do and places to visit while you're in Nuwara Eliya.",
  "author": "",
  "date_published": "10:15am",
  "content": "Nuwara Eliya, with its chilly climate and generally relaxing atmosphere has been a prime vacation destination for both tourists and locals alike. So here's a quick guide on where to stay, things to do and places to visit while you're there.\nI love Nuwara Eliya. It's probably my favourite holiday destination in the country, but the one big issue is that getting there can be tedious. Its not the longest drive, but 5 hours is still quite long. Don't get me wrong, the views during the journey are beautiful but it's also often quite tiring.\nMy advice would be to leave Colombo as early as possible (ideally around 5 AM), so you can avoid the bulk of traffic in the towns on the way as well as the trucks and containers that you'll inevitably come across as you reach the hill country. If you're considering public transport, finding a bus won't be too difficult, but there aren't any trains that go directly to N'Eliya, so you'll have to get down at Nanu Oya.\nThankfully, Nuwara Eliya has a multitude of lodging options catering to pretty much every budget. As far as hotels go,\nand\nare the oldies, and still offer a very complete experience.\nThe Glendower Hotel, though it doesn't offer quite as many amenities, is still a solid and budget friendly option.\nIf you're going with the family, there's plenty of bungalow options on\nas well.\nand\nare great options depending on the number of people.\nOne thing that's great about Nuwara Eliya is that you can walk and walk but not feel too tired or get sweaty. The town in itself is far different from any other in the country with its colonial style buildings, that I always find myself wishing they were more common here in Colombo.\nIf you're a fan of flowers, taking a stroll through\nis a must. They've got one of the largest variety of flowers you'll experience anywhere on the island, and the park is just plain beautiful.\nAnother one of Nuwara Eliya's most popular attractions is\n. After the renovations a few years back, the lake transformed into a social hub. It's now called Gregory Park, and we think the management have done a great job of maintaining it. They've got boat rides on the lake, a paved pathways to walk and cycle as well as a bunch of different food stalls.\nIt's considered by most a crime to not have a good cup of tea while in Nuwara Eliya. One of the best places to do so is at the\nwhich is about 2 km from the town. They offer a bunch of different teas from their different estates. Honestly, I'm not a huge fan of tea (blasphemy!), but this was damn good.\nNE is also a great place to purchase flowers. The prices, compared to Colombo, are much cheaper and selection is also excellent.\nI know sleeping is kind of defeating the purpose of going on a vacation, but Nuwara Eliya is just so perfect for it that a small evening nap is almost a must. I mean look at how peaceful this dog is.\nNuwara Eliya has no shortage of eateries either. If you're looking to grab a warm cup of coffee in the morning,\nis a great choice. They use Nacha Coffee brought down from Thailand, which makes for a great macchiato. What pleasantly surprised us was that their pastries were also top notch.\nis a popular stop at the N'Eliya market. It's more or less a bakery, but one secret is that they offer some of the best ulundu vade you'll have anywhere in the country.\nYou can't visit NE and not have strawberries. While you can buy fresh strawberries at a bunch of places,\noffers the classic strawberries and cream as well as other desserts like strawberry pancakes.\nat The Glendower is one of the oldest restaurants around. They offer mostly Sri Lankanized Chinese and it's not too bad, but my dad (who lived in NE for 28 years) tells me it's nowhere near as good as it used to be.\nA new find for us was\n, located in the basement of The Grand Hotel. They do a great take on Thai cuisine in a beautiful setting with some impeccable service to boot. If you prefer Indian, The Grand Indian is also a good option. Though it does tend to get crowded fast.\nSo, there you have it. Nuwara Eliya has plenty to offer if you know where to look. As always, if we've missed anything (besides the Racecourse), do let us know in the comments.\n",
  "url": "https://www.yamu.lk/blog/24-hours-in-nuwara-eliya"
}