{
  "title": "24 Hours in Galle",
  "abstract": "A day of walking, sun, sea, and excitement in Sri Lanka's Southern capital. ",
  "author": "",
  "date_published": "12:30am",
  "content": "Possibly one of the island's most elegant spots since 1588, the Galle Dutch Fort is a testament to Sri Lanka's trifecta of colonization. It pairs Portuguese foundations with Dutch design and British accents (like the beautiful\ncoat of arms on the outer esplanade entrance). Meanwhile, the juxtaposition between the Fort's old stone churches and its predominantly Sufi Moor inhabitants provide a charming microcosmic case study of the island's multi-cultural roots.\nIf you're a rise and shine sort of person,\ndoes a morning session that combines elements of meditation and relaxation via Vinyasa (flow) yoga. It's around Rs. 1900 for a 75 minute drop-in class. Alternatively, you can head down to\non Bonavista Beach for a surf lesson or session and some healthy oats and fruits breakfast and coffee.\ndoes a beautiful breakfast spread, whether you want to start your day with bacon and eggs or a nice local kiribath and curry. Our favourite is a mix - string hoppers and curry with a side of bacon. Delicious.\n, one of the island's oldest colonial buildings, is pure elegance. They do a lovely egg hopper breakfast which will leave you absolutely satiated. You can expect beautiful colonial structures, and impeccable service at both establishments.\nIt's going to start getting unbearably hot at around this time, so go exploring around the Galle Fort's ancient structures. The thick stone walls and high roofs will keep you cool indoors, and you'll get some serious historical exploration time in. Notable structures include the\n,\n, and the All Saints Church. Seeing as the Fort is small enough to easily walk about, these won't take you more than an hour or so altogether. You could then head on to the\n, a 1671 Dutch warehouse now housing artefacts from ancient shipwrecks.\nThe new kid on the block,\nis a great addition to the heritage site. Seamlessly fitting into Church Street's existing aesthetic, the hotel's languidly open and breezy Mediterranean vibe is established by its Moroccan tiles and whitewash. Check out their restaurant, the\n, for some deliciously fresh produce and cuisine. We'd recommend the seafood or the local fare.\nAt this point, the Fort's cobblestoned streets will be hot enough to melt your flip flops. You'd be well advised to be indoors for this part of the afternoon, either shopping or napping. If your meal didn't lull you into a sleepy haze, then you could always flit around the Fort's lovely boutique shops. You'll come across heaps of jewellery and\n, along with a couple of other funkier, newer additions like\nand\nselling beautifully curated miscellaneous items.\nAlternatively, you could just head straight to the\n, a shopping complex with a host of shops, bars and restaurants where you can while away a few lazy hours.\nGrab some gelato from\n, on Pedlar Road. It's just opposite the famous\n, which serves up a pretty good standard of food, and has been one of the Fort's longest-standing establishments. The ambience is quite lovely, with eclectic decor and dim lighting, so you could probably have a pretty good dinner here later on in the evening too. You can take your gelato to the\nand stroll about, getting a beautiful 360 view of the coastline. The historic ramparts are gorgeous and impossible to miss.If you're lucky, you'll be able to catch a glimpse of a rampart diver diving into the wicked-looking rocks below.\nDrive down to\n, barely 15 minutes away by car or tuk tuk. You'll be welcomed by a sprawling beach laced by sparkling waves calmed by the reef, and the scent of pizzas in the oven. Settle down with a passion fruit mojito and your swimmers, because you probably won't leave for a while. This is a gorgeous spot for a sunset swim, especially during the season (November to March). Their thin crust pizzas are also incredibly popular, so if you've still got space post lunch, go for it.\nIf you haven't stuffed yourself on the glorious pizzas at Wijeya's, you're probably ravenous by now. You could either eat a seafood spread on the beach at Unawatuna if it's season, or else head back to the Fort for some quality dining at the\n. You'll be spoilt for choice - there's fresh and inventive seafood at\n, contemporary Western at\n, or light dining and drinks with a view at\n. We'd vouch for the quality at all of these spots. They're a bit pricey, but worth it if it's your last meal in the Fort. Plus, they all serve alcohol.\nThe Fort, being a heritage site, tends to shut down by around 10- 11 PM. It's also a surprisingly densely residential area, so locals aren't too keen on a nightlife scene. You can, however, grab yourself a nice bottle of wine at the chic\n. The lighting is dim and warm, the service is good, and the bottles are affordable. You'd usually find a chill crowd on a weekend evening too.\nYou've had a day of walking, sun, sea, and excitement. 11 PM may seem early but you're probably tired by now. Some of our favourite spots to bed down in and around the Fort include\n,\n,\n,\n,\n,\n,\n, and\n.\n",
  "url": "https://www.yamu.lk/blog/24-hours-in-galle"
}