{
  "title": "26 Places Open During Avurudu",
  "abstract": "If you're unwelcome in your village and have to fend for yourself in Colombo, this avurudu, here are some restaurants…",
  "author": "",
  "date_published": "9:46am",
  "content": "If you're unwelcome in your village and have to fend for yourself in Colombo, this avurudu, here are some restaurants that are open.\nColombo doesn't have many themed restaurants, but The Sizzle is an exception. The catch here is that everything sizzles, and by that we mean everything whether it be food, dessert or even the drinks. The latter of which is achieved by adding a bit of dry ice.  The menu is quite extensive, with a good selection of seafood and pretty much all the usual meats, sans pork. The prices are pretty high, but the food is quite good and the service is exceptional.\nHPB is a secluded, creative hideaway just off Havelock Road. It's a great place for a romantic date, or just to get away during the afternoon. The ice creams here are highly recommended.\nIf you love mayo, which apparently most of you do, you'll probably enjoy Dinemore's submarines. And even if you're not a particular fan of the creamy condiment, you might be willing to make the occasional exception. The chicken is tasty - I think it's sautéed with pepper, onions and capsicum – and there's a good bread to filling ratio. Not many seem aware of this, but they've also got a mean beef chop on their Indian menu that's great value for money.\nPaan Paan is a bakery which rapidly expanded to three outlets and a range of items. Their sandwich bar makes excellent, healthy sandwiches, melts and submarines as well as offering breads, pastries and sweets. Their sandwiches stand out because they bake the bread themselves, and the bread is really good.\nChana's on W.A. Silva Mawatha is a small North Indian restaurant that has found it's way into two of our Top-5 lists (\nand\n). So they're pretty good. Oh, and they've got gulab jamun. Exciting!\nNihonbashi Honten. Not just the city's best Japanese restaurant, but one of the city's most seminal eateries, full stop. Where else can you get a Wagyuu burger? Or diamond-priced cuts of Kobe beef? Four person portioned bowls of tsukune nabe? Darshan's Munidasa's gift to Colombo doesn't just offer slices of Japan plonked on a plate in the form of hasty sushi or donburi - the sometimes baffling Nihonbashi menu stretches to include the most aspirational, exotic offerings of Japanese cuisine. And it's open during Avurudu, so you can swing by for a fine dining experience.\nKyung Bok Kung at Hotel Juliana does a pretty authentic take on Korean cuisine. The setting might be slightly dubious, and the DIY style might not be for everyone, but order the right dishes and you'll be glad you dropped in. Korean eating is best with a group, it's family style and you get to experience more variety that way. All the dishes come in one portion size which is usually enough for 2-3 people. The style here is that you can BBQ your own food on the table, there's a heating element provided. It can get a bit messy if you aren't careful, but it's definitely a unique experience.\nZen is somewhat hidden away at The Zylan Luxury Hotel on Rosmead Place. Being a boutique hotel, the interior decor and overall look of the space is quite tasteful with polished cement floors, large paintings, a beautiful grand piano and a tiny, well-maintained bamboo garden. This is honestly a great place for a private meal considering the fact that it's rarely ever crowded. Despite being quite underrated, Zen remains one of the better Japanese restaurants in Colombo, if you're a fan of Japanese cuisine and you prefer a private meal in a peaceful setting.\nNoodles at Cinnamon Grand offers one the most complete dining experiences around the city. Despite a menu that offers varying Asian cuisines, they manage to do all of it quite well. It’s a stress-free, well executed dining experience which won’t leave a dent in your wallet. Despite the name, Noodles does offer a few rice dishes, too. The spicy thai noodle with pork comes with thin, light rice noodles. The pork here is mostly lean with a good balance of seasoning and spice.\nRoyal Thai remains the reigning king of Thai food in Colombo. Although the original chef has left the establishment, the food and ambience here is still top notch. It's one of those rare places where almost everything you order is going to be delicious, whether you have a thing for Thai food or not. Ambiance-wise, it's a very soothing, well thought-out space, with wood carved and woven partitions and a classy touch of Thai decor. The flavours you expect from authentic Thai - lemongrass, kaffir lime, ginger, cilantro - all come out well in their dishes and are nicely balanced. The food is clearly cooked with restraint; Royal Thai doesn't give in to the temptation of Sri Lankanizing their curries to appease the local palate - you really get that poignant hit of Thai flavour you're looking for.\nA good place for a burger, and a great place to just relax and unwind with tea and dessert, Streat360 offers up street food from around the world. There's a good variety including sandwiches, burgers, wraps, and even rice & curry. You can go for a New York style beef burger with Canadian poutine fries, or an LA style kimchi burrito, or even nasi goreng. If the weather's good, the outside of the restaurant is better than inside. The restaurant is tucked in a quiet corner off the residential part of Ward Place, so it's quiet outside, and there's cute cafe furniture against brick walls and old windows.\nServing up possibly the best deal on ribs in the city, &Co is new to the scene but it's pretty good. It's part of The Steuart, a hotel housed in a beautiful old colonial building just between Dutch Hospital and Chatham Street. &Co is their pub and restaurant. It's a big, handsome space, built on the old, solid bones of a venerable building. There are brick walls, hardwood floors and hardwood beams. It's definitely got a charming ambiance. The food is good for a night out with drinks.\nThe Cakery's moved a door down from where they previously were, and their new place is really awesome. Plenty of natural lighting, good food, a decent variety of well prepared drinks, and comfortable seating arrangements makes this one of the newest hangout spots where you can sit back, relax, and eat to your heart's content. Their stacks are really good value for money and quite filling.\nIl Ponte at Hilton is one of the older Italian restaurants in Colombo. It may not be as popular as it was back in the day, but their food is still pretty solid all-round. Their pizzas are really good and considering the flavour and quality of the ingredients used, we'd say it's good value for money. If you're in the mood for lasagna, they won't disappoint. You get a generous amount of mozzarella baked over a substantial portion of lasagna, cooked just right, and they don't skimp on the minced meat.\nPeople love Subway because you feel like you're getting exactly what you want. The sandwich makers will ask you what bread you want, what meat and veggies you want, and which sauces. There's a range of options: five types of bread, an epic host of veggies and pickles, chicken, beef, turkey, tuna, and sauces like red chili, honey mustard and sweet onion. The fillings are plenty and delicious. We suggest you go for the Parmesan Oregano bread every time - it's heavier than the other breads and tastes better.\nThe Manhattan Fish Market has delicious seafood and ridiculously friendly staff - it's an awesome place to dine at if you can handle the bill. The sexy hot whole fish is sexy as hell. It's huge and comes wrapped in aluminium foil. Your waiter will unwrap it carefully, as the mouth-watering fragrance of steaming whole fish wafts out of it. It comes poached in a soupy broth of veggies, scallops and calamari, and plenty of bread to dip into it. The fish is soft and just falls off to the touch. The broth, spicy and delicious with the bread, is the best part about this dish.\nBarracuda has grown into one of the best beach side hangouts in Colombo. They do a good take on Sri Lankan Chinese, and their hot butter cuttlefish is one of the best around. This one is as good as it gets with a light, flavoursome and crunchy batter on top of perfectly cooked cuttlefish. Colombo doesn't actually have many options when it comes to great places to chill by the beach, so Barracuda is a welcome spot. You're seated just a few meters from the ocean but it's still cool because most of the tables are shaded under beautiful mangroves. It also looks great at night under the lights. You can also sit out on the beach, but we recommend that after sunset.\nResidence By Uga tries to push Sri Lankan ingredients further than they've ever gone before. For the most part, it works. It's an expensive restaurant, but there's a really high level of creativity and attention to detail going on here, and we think you get your money's worth. If for nothing else, go for the cocktails and ice cream. They verge on mind-blowing.\nPizza Hut was the pioneer in bringing pizzas to the Sri Lankan masses, and a decade ago they were also arguably the best. They've got a good selection of pizzas with most of the seafood and meats, apart from pork based products. Theirs always some gimmick or the other on offer, whether it's meatballs in your crust or cheese pockets or some such. You can get delivery pretty much any day of the year, usually till about 11PM.\nMcDonald's is McDonald's, but Sri Lankan franchises can vary widely. As franchises go, McDonald's is pretty reliable. They also have a range of Sri Lankan stuff, like McRice and the McSpicy and Seeni Sambol Bun. The Colpetty branch is a landmark on the Galle Road (past Durdan's) and a prime location for families and couples to hang out. There's a big playpen if you have kids. They also deliver within city limits.\nKFC remains a popular destination amongst Sri Lankans. While their menu is by no means cheap, the good Colonel's chicken is still consumed by a vast swathe of society. What can we say, it's fast and it's fried. It's perhaps spicier than what you'd get in the west, but the copious quantities of oil appear to have remained globally intact. They've got delivery available, too.\nThe Burger King in Colpetty has a nice location, takeaway, and bigger burgers by popular demand. They have rice now as well. It's a well-run franchise.When Burger King first opened early this year they encountered a social media storm strong enough to topple a government. They responded by making their patties bigger. Their fries are generally huge and quite toothsome.\nDespite the name, however, TSF doesn't deal purely with sandwiches. They also offer a range of burgers, wraps, fries and drinks. They're a little bit pricey for the quality of food you're getting, but they do a nice diner ambience with friendly service. They're also offering free delivery from the 12th to the 14th of April 2016.\nCoco Veranda's a familiar sight down Ward Place, and has a loyal customer base who continues to clamour for their sugar-heavy drinks and decadent cakes and desserts. They also offer a variety of burgers, pastas, and your regular cafe fare.\nThe Perera and Sons bakery has been around over a hundred years and their fish buns, seeni sambol rolls and vegetable patties- as a treat after school, have inducted generations into the fraternity of the short-eat. They've got over a hundred branches island-wide.\nLil' Orbits at the Majestic City food court is a great stop for a packet of mini-donuts with a side of creamy chocolate dip. They also recently introduced pizza cones, which actually turned out to be pretty good.\nAlso, keep in mind that all the hotels will be open and most of their restaurants, too.\n\n",
  "url": "https://www.yamu.lk/blog/24-places-open-during-avurudu"
}