{
  "title": "27 Bars To Drink In Shorts & Slippers",
  "abstract": "If you need to take your pants and shoes off to wind down and enjoy a drink with your friends, these places won't mind.",
  "author": "",
  "date_published": "11:29am",
  "content": "If you need to take your pants and shoes off to wind down and enjoy a drink with your friends, these places won't mind. You have to at least wear shorts, though.\nInn On The Green is well known for its British Pub-like atmosphere and Open Mic Nights. If you prefer a more laid back experience to that of other contemporary bars in Colombo, it's a great place to unwind. It's also one of the coolest spots in Colombo, temperature-wise at 21°C. The food is quite pricey, though.\nThe ambience is easily the key draw of Cloud Red. You've got a 360° view of Colombo's undulating skyline; watching construction, traffic, and trees flit about below you. The perfect time to arrive is around 5:30. You can catch sunset near the pool, then watch as the sun dips and Colombo gets gradually sparklier as headlights and lamps are switched on.\nCafe Francais is a strong choice for drinks, wine, and unwinding on a Friday. It ticks pretty much all the boxes for an upscale bar - chill beats, unintrusive crowd, solid wine list. It's also virtually the only spot in the city for proper French bistro-style dining, featuring food curated by the Pourcel brothers. Best part? They don't care if they can see your toes or knees.\nColombo Courtyard's bar duo actually fare quite well with their cocktails, even if they are some of the priciest in the city. The only real workaround to the extravagant prices is to drop in during their happy hour, which is from 5.30 PM to 7.30 PM, when they offer a 50% discount on cocktails and beer.\nRandoli's menu mostly revolves around Sri Lankanized Asian dishes. The real winner here is the kochchi miris dip. It's so spicy, but also just so good. This will most likely make you sweat bullets and tear up, but you'll find yourself going back for more. It's got a tanginess to it that really brightens up whatever you're having with, whether it's fried fish or french fries.\nThe New Colonial Hotel is at the high end of dodgy bars. What sets the New Colonial apart is that it's essentially a dive bar in a surprisingly gentrified space. The only downside is that the food is horrendous. The drinks are fine and affordable enough.\nThe Vespa is a fantastic dodgy bar a stones throw from the beach in Kollupitiya. Down Sea View Lane, it's an absurdly large property for what is essentially just a crumbling verandah and an expansive, ill-tended lawn While the Vespa has the usual dodgy bar clientele, they're quite nice and it's not a cramped inside space, so people seem more chill.\nThe Bavarian has a classic pub theme, with it's mostly wooden interior. While the wooden furniture adds a great aesthetic, it doesn't make for the most comfortable experience. It's quite a small space so it does tend to get a bit stuffy when it's at capacity, specially during dinner. The food is excellent, but a night out would be decidedly pricey.\nWhite Horse has always been a playground for Colombo's underage, bright young things. It's also been a playground for Colombo's not-so-bright things. Which probably explains why the occasional fight breaks out: the big bundied, arrack drinking men in the corner toss a few lewd comments at the girls whose male counterparts then indignantly intervene for their honour...you know how the rest goes.\nIf you're looking for a different spot to chill with your friends over a few drinks or even a bottle, consider Grand Solis. It's ideal if you live around Nawala, as it's way, way less crowded than Machang and similar places. The food isn't spectacular but it's good enough for bites.\nIf you come early and they're not busy the service is fine, good even. Once it gets busy they can't really cope. If you do catch a waiter they'll say it's not their table and promise to get someone that never comes. It can be fun, though, once you've secured a tower of beer, to sit back and enjoy the live band that plays on Friday and Saturday.\nThis is one of those bars that doesn't really get much attention. It seems like it'd be expensive, but it's not. Their Happy Hour offers one-for-one on drinks and tapas from 5:30 to 7:30 PM. The look of ZaZa is pretty unique, much like the rest of the hotel. They've got some neat cane seats with cushions that are illuminated and a nice spot next to the pond.\nAs far as beach bars go, The Shore By O! is by far the most popular. Not all their drinks are excellent, but they do the best beer cocktails around and their bites aren’t too shabby either. Even though Shore is open from 11 AM to 11 PM, they don’t serve alcohol between 2 PM to 5 PM on weekdays. Shore wins style points purely for its location. While Mount Lavinia beach isn’t in the best state, Shore still offers a beautiful view of the ocean. They’ve also got one of the longest bars around.\n7 Degrees North at Cinnamon Lakeside is actually one of the older bars in town, which makes us feel really old. Their location by the Beira makes for a great place to chill, and we like the fact that they're trying to keep things interesting with their ambitious cocktails. The prices, however, are quite high.\nSugar Bistro's main draw lies in the fact that they offer a lot of variety, depending on the occasion, whether it be a casual meet-up for drinks or even something more formal. The outdoor terrace area is perfect for those looking to grab a coffee while the interior with its mix of urban and rustic elements is appropriate for both a casual meal or a business lunch. The waiters are friendly, patient and genuinely enthusiastic which is pretty rare.\nThe Lion Pub is one of a Mount Lavinia's oldest food establishments, and has since become somewhat of a landmark. It may not be as popular as it was back in the day, but the food is surprisingly good, the portions are generous and the atmosphere is perfect for a cool Lion lager.\nSomething of a godsend if you don’t reside within happy proximity to Colombo’s more central drinking establishments, Machang is one of the least dodgy options for purchasing some really, really cheap beer. The food is rather wonderful as well. Their hot butter cuttlefish, fried rice and devilled pork are the perfect boozy bites.\nIf you're looking for a cheap drink around Fort, however, it's worth seeking out. Note that they close at 9 PM, so best for pre-drinks. The vibe is quite energetic and the clientele seem to be in a good mood, when we were there, at least. It's one of the more comfortable 'dodgy bar' experiences we've had.\nGSSC is\n-level value for money, and the indoor seating has great ambiance, but you've got to get there early to grab a table. Otherwise, the outside area can be a bit underwhelming with the lack of lighting. You can put a drink and chill without anyone bothering you. Their handallo is super good.\nWe like Mintage — they serve up some pretty good Sri Lankan Chinese along with cheap booze. That's a classic combo. The bar area is considerably smaller than the restaurant but they've managed to make the most of the space with a few enclosed booths that small groups can reserve. It can feel a bit cramped, though, when it's crowded.\nSo Heladiv Tea Club isn't necessarily the first place that comes to mind when it comes to going out for a drink in Colombo, but they've actually got a very respectable selection of booze and some unique tea cocktails to boot. Shots are super cheap. Heladiv is a chilled out spot to spend some time regardless of the time of day. The interior is tastefully decorated with soft lighting, subtle yet classy wallpapers and some comfy couches.\nWe like the ambience. It's big, warm and yet doesn't feel empty. It's a good pub, and they're not faking it. This actually is an old building and there is classic character seeping out of the walls. Their BBQ Ribs are pretty damn good at a decent price. They do fish and chips well, too. You may feel a little out of place in shorts and slippers as the waiters are all nicely dressed. They are wonderful, though, they know the menu, they're pro-active and also generally fun and nice.\nThey've got a great view, cheap booze, good food and one of the best hot butter cuttlefish in town. As you'd expect from a beach restaurant, The Station has a great selection of seafood. In terms of cuisine style they emphasize Chinese and Thai. They also serve all the major meats as well as pork, which is always nice to see. What better combo than devilled pork and lager.\nEAP doesn't seem to be frequented by women - but that doesn't make it woman unfriendly. You'll guaranteed be in the company of numerous groups of convivial men tipping their glasses to the weekend, their baila refrains framed by the sounds of Star Movies descending from the elevated television set. It's remarkable that EAP doesn't charge service and yet the service here is amongst the best we've experienced in the city. The waiters are actually nice to you.\nPopular among expats and crowded on quiz nights, the drinks aren't really cheap but the vibe is chilled out. The music might be too loud for those not short of hearing, but no one seems to mind and they shout over to each other.\nLa Voile Blanche is a chic white washed beachside restaurant in Mount Lavinia. The service is friendly and the food is pretty good, albeit a bit expensive. Their cocktails are fairly priced and quite tasteful, and they've got a great view without being as crowded as their neighbours Shore by O.\nShorts and slippers make total sense in this heat, and bars ought to understand that. We're the glad the ones listed above do. Remember not to drink and drive. Always bring along a designated driver. Cheers!\n",
  "url": "https://www.yamu.lk/blog/27-bars-to-drink-in-shorts-and-flip-flops"
}