{
  "title": "37 Visa-Free Countries for Sri Lankan Passports",
  "abstract": "Countries that let you in without a fuss with your Lankan passport",
  "author": "",
  "date_published": "4:47pm",
  "content": "Being Sri Lankan is superb, if all you want to do is just stay in Sri Lanka, drink some thambili, and rub your belly on a beautiful beach somewhere. If you'd like to go explore the world, things get a bit trickier. Globally ranking at #189 on the\n, the Lankan passport is as useful as a screen door on a submarine.\nAs disheartening as this map below looks, it's not all bad:\nBefore your heart quails and you start advertising yourself on Craiglist looking for a greencard marriage, have a look at the countries that are gracious enough to let us in. We've highlighted our favourites!\n\n1.\n- No visa required for first 3 months\nApart from the Bahamas being one of the sexiest honeymoon spots in the world, with great drinks (Bahama Mama anyone?), pristine beaches, and friendly locals, you also get to hang out with this chill pig pictured above.\n2.\n- No visa required for first 6 months\n3.\n- Visa on arrival for 90 days\nA volcano, a lake, and a desert all walk into a bar. This 3 in one holiday in Bolivia's Licancabur is more bang for your buck! Also Bolivia has plenty of llama, certified to be one of the world's sassiest animals.\n4.\n- Visa on arrival for 90 days\n5.\n- Visa on arrival\n6.\n- Visa on arrival\n7.\n- Visa on arrival\n8.\n- No visa required for 6 months\n9.\n- No visa required for 90 days\nWhether it's the Amazon, the Andes, the Galapagos, or the quaint colonial Quito you're yearning for, Ecuador has got you covered. Much like Sri Lanka, it's a relatively small country packed with diversity.\n10.\n- No visa required 3 months\n11.\n- Visa on arrival for first 90 days\n12.\n- No visa required\n13.\n- e-Tourist Visa for 30 days, only through specific airports. Not a very reliable system though, from our experience VFS is still the most reliable route.\nWe could have used a picture of the Taj Mahal, some artistic camels in the desert, or the bustling Mumbai metropolis. Instead we used this dapper moustachioed man. Because he's fabulous. Follicular fancy aside though, the Indian visa will take you some time and patience so despite the e-Tourist visa claims, you should apply in advance.\n14.\n- No visa required for 30 days\nIndonesia is stunning. It's incredibly diverse, with everything from wild party beaches, to volcanic hiking (why do a lot of the countries on this list features beaches or volcanos?), to yoga retreats and high-end resorts.\n15.\n- No visa required for 1 month\n16.\n- e-Visa valid for 3 months\nIf you're a wildlife fan, Kenya absolutely has to be on your bucket list. They offer some of best safaris in the world and one of the few places where us Lankan lions can visit hassle free to actually see some real lions.\n17.\n- No visa required for 90 days\n18.\n- Visa on arrival for 90 days\n19.\n- Visa on arrival\n20.\n- Visa on arrival for 30 days\nMaldives is one of the most accessible options on this list. A short hour to Male, flights are super cheap (you can get a round trip ticket from Rs. 16-20k), and there are hundreds of resorts and islands to choose from. It's the perfect luxe beach spot, especially for couples.\n21.\n- Visa on arrival\n22.\n- No visa required for 30 days\n23.\n- Visa on arrival for 30 days\n24.\n- e-Visa available for 28 days, but you must arrive via Yangon Airport\nDespite how closed-off Myanmar appears to be, its natural and cultural beauty are absolute wonders. With gilted temples, a rich and varied religious history, and a few rambling colonial structures, Burma is definitely a worthwhile visit. The eerie emptiness of the oddly overdeveloped Napyidaw is also interesting to experience, especially if you'd like something to compare Mattala airport to.\n25.\n- Visa on arrival for 90 days\nIn the wake of the two intrepid Lankan climbers, Jayanthi Kuru-Utumpala and Johann Peiris, you could do a little Everest mission of your own. No, we don't expect you to climb or summit it, but at least have a steaming hot cup of tea and let it fill up your landscape. With charming monasteries and a simple, peaceful way of life, Nepal is one of those heartbreakingly beautiful spots that will change you.\n26.\n- Visa on arrival for 30 days\n27.\n- No visa required for 30 days\n28.\n- No visa required for 30 days\n29.\n- Entry Permit on arrival for 60 days\nMore volcanoes!! Samoa is one of the lovely pristine Polynesian islands, more preserved than you'd imagine. If you want less tiki bars and buffets, and more achingly intense natural beauty and the true \"Samoan Way\" or Fa'a Samoa, you need to etch this on your list. The downside is that it would take you more than 24 hours, at least 3-4 flights, and some $ 3000 to get there from Colombo. However, if you're already in New Zealand, or Australia, it's not too difficult.\n30.\n- Visa on arrival\n31.\n- Visitors permit on arrival for 1 month\n32.\n- Visa not required for 1 month\nAh Singapore! The long lost cousin that wanted to be like us, then did vastly better than us, and now we wish we were like. With little natural resources, they've created an empire based on quality, a huge service industry, and setting themselves up as a hub for Asian trade, finance, and entertainment. Just about 4 hours, and a measly Rs. 20,000 roundtrip flight away, Singapore is your ideal weekend getaway for a concert, a family holiday, or just some decadent good living.\n33.\n- Visa on arrival for 30 days\n34.\n- Visa on arrival for 7 days\n35.\n- Visa on arrival for 1 month\n36.\n- Visa on arrival for 3 months\nWe don't know too much about Uganda, but they do have rich forests, with some cool wildlife stars like lions and gorillas. It's the perfect opportunity to drop some shade on your husband's jolly pot belly and furry shoulders by pointing and squealing \"aney look darling, that fellow looks like you\". It will never get old. Not for you at least.\n37.\n- Visa not required for 30 days\nHappy travels you intrepid explorers! Try not to fall in a volcano.\n",
  "url": "https://www.yamu.lk/blog/srilanka-visa-countries"
}