{
  "title": "4 Colombo Hotels For Sale, And A Hospital",
  "abstract": "The Sri Lankan government is selling off some Colombo hotels, and a hospital.",
  "author": "",
  "date_published": "10:16pm",
  "content": "The Hilton Colombo, Grand Oriental, the Colombo Hyatt, and one hotel without rooms (Water's Edge) are for sale, as is one hotel with doctors (Lanka Hospitals). Who's selling? The government of Sri Lanka, AKA you, or at least your money. Bet you didn't know you owned a hotel, did you?\nThe Finance Minister said they're\nfrom the sales, or about 150 billion rupees.\nThe big question is why the government owns these things in the first place. Destination weddings, dinner dances and private healthcare are hardly in the public interest. You could say the goal was to generate returns for EPF payers or Sri Lanka Insurance, but in at least one case, the government was losing colossal amounts of money.\nThe losses on the Colombo Hyatt project as of 2015 were equivalent to 65% of all the business every other hotel and restaurant did in 2014 (\n). That is, the government spent more money\nrunning a hotel than the rest of the economy spent running them, and restaurants.\nAside from returning money to the public, you could also say this is a good idea because the government isn't especially good at the hotel business. The\nis a historical treasure with an amazing view of the port, which is almost entirely neglected. According to\n(not by YAMU), the Grand Oriental Hotel had the latest technology - electricity in the rooms and electric fans. It hasn't advanced significantly since then.\nand\nare competently run, but they're still not something a people's government especially needs to be investing in. High tea and grand weddings are lovely, but they're probably best left to private business. Lanka Hospitals, also, seems to be a profitable hotel, but the government's business is usually\nhealthcare, not private hospitals only open to those that pay.\nIf the government is looking to raise money through assets, there are some other properties they might consider. Perhaps not for a sale, but maybe to lease or monetize in some way.\nSince successive Presidents have never used it, the official President's House could be leased out or used for some public purpose. Gordon's Gardens is contained in the grounds and, aside from one public viewing years ago, is never used by average people. Make the thing a museum or something, or just let someone refurbish it and make it a nice hotel.\nBesides the President, countless Ministers are given very nice colonial mansions at public expense. Why not let them use their own residences (as the Prime Minister does), or live in a block of flats near Parliament?\nThis is more prickly, but the government, through the military and police also maintains a network of fantastic guesthouses and grounds throughout the country. They are impeccably maintained (by military labour) and often in the best locations.\nThe military also maintains basically a parallel (and much nicer) version of Trincomalee. The Navy section of that city is beautiful and has the best beaches (Marble Beach, for example). They've opened up a few military-run hotels, but hardly the best uses of the space.\nAnd that's just the beginning. The government could actually do an audit of the properties it owns and see if it's getting the best possible use out of the resources. If not, sell or lease and let people with ideas have a chance, and return money to the treasury.\nFor now, however, these Colombo properties are the only places that will be on the market. If you can round up a few hundred million USD they could be yours. If you can't, be content with the fact that your tax rupees give you a small and somewhat unrewarding share in them right now.\n",
  "url": "https://www.yamu.lk/blog/sl-government-sells-hotels"
}