{
  "title": "4 Homegrown Books to Read For the Galle Literary Festival 2017",
  "abstract": "Local and international books to crack open if you're intent on participating in 2017's FGLF.",
  "author": "",
  "date_published": "10:24am",
  "content": ", but they're useful if you want to really immerse yourself in the talks and events. We've collected four great local books (in no particular order) that will be featured this year in talks, meals, or other events. Each of them weaves a journey that keeps Sri Lanka at the heart of their narratives, either in setting or sentiment.\nAll of them are available at the\nbookshop or at the festival shop itself.\nA somber narrative by former GLF Director,\ndelves into the very real story of Commodore Boyagoda, who was the highest-ranking prisoner of war captured by the LTTE. The book is a must-read for anyone invested in learning about (and learning from) Sri Lanka's marred last few decades from a \"subtle and intimate\" perspective.\nWe haven't got our paws on this tiny tome yet, but plan to do so soon. It's set during Sri Lanka's period of civil strife, revolving around a young man and his arranged marriage, and the intimacy this introduces, in a period and area of horror. It seems small enough to finish on the chugging train ride from Fort to Galle, but potentially heavy enough for us to head straight to the\nfor a stiff drink upon arrival.\nWe're somewhere in the middle of the latest Ferrey, eagerly awaiting the riverbank of denouement on the other end. This 2016 release is a funny but slightly bitter novel that explores the eternal raging battles of Good, Bad, and Evil on different cultural planes. We're not sure how it ends, but this is probably our favourite Ferrey ride so far. And also, a blissfully non-war, non-harrowing read.\nMunaweera's second novel,\n, has stirred up the literati worldwide with a look at what's termed the \"multigenerational immigrant experience\".\n",
  "url": "https://www.yamu.lk/blog/4-books-to-read-for-the-galle-lit-fest-2017"
}