{
  "title": "4 Pieces Of The Kingdom Of Jaffna",
  "abstract": "Best known for its kovils, Jaffna's Nallur area is also home to some ancient historical sites.",
  "author": "Thulasi",
  "date_published": "4:24pm",
  "content": "The Nallur area was once the seat of the kingdom of Jaffna.\nNow it's the cultural heart of Jaffna and home to an astonishing density of kovils (including the Nallur Kandasamy Kovil). With the temple festival kicking into high gear—it ends on September 13 — this might be the best time to also revisit some of the historic sites associated with this ancient kingdom.\nNote that we're telling the stories of these places according to local folklore. There hasn’t been enough research to corroborate the community’s claims about them, but they're fascinating nonetheless.\nJust a few metres away from the Nallur temple, on the Jaffna–Point Pedro Road, is a gold-plated statue of Jaffna’s last king. The old statue made of plaster of Paris was damaged during the war. The current statue was installed after the war ended in 2009. King Sankili II’s rule ended in 1619, when he was caught and executed by Portuguese invaders. According to local lore, he was not necessarily known to be a popular or benevolent ruler. There are contrasting stories on his claim to the throne and whether he was the previous king’s nephew or his illegitimate son.\nEither way, he is said to have come to power by killing the legitimate heirs, and annoying the colonial government in Colombo by beheading 600 of Mannar’s local populace who had converted to Christianity. Sankili II is thus better known for the historical fact of being the last king of Jaffna than for his popularity.\nThe royal palace that Sankili took over has long since been destroyed except for one solitary remnant – the arch to the Palace Gate. That arch alone is still standing – the sole testament to a bygone age, of palace intrigues and forgotten history.\nAccording to folklore, the many queens of the Jaffna kingdom and their attendants had a private bathing tank (no longer private) known as the Yamuna Aeri, located behind the palace. Local legend has it there was once a tunnel leading from the palace to the tank so that the ladies, who probably practised purdah could not be spotted by the common people. This tunnel was visible until recent decades, but fears that it could be misused by the LTTE led to it being sealed by the Army.\nKnown in Tamil as the\nor minister’s mansion, this building is in better shape compared to the palace structure. A picturesque and old-worldly home, now overrun with unseemly graffiti, it seems increasingly out of place in urbanised Nallur.\nA visible throwback to a bygone era in Jaffna’s history, it is also full of quiet—albeit filthy—nooks, that make it the venue of choice for young lovers. There are rickety steps leading to a possible upstairs, but they are best left unexplored given the general state of disrepair.\nThe history of the ancient kingdom of Jaffna is obviously deeper than these four pieces, but if you're wondering around Nallur it's a compact way to get a sense of what once was. When you're done you can visit the dueling\nempires nearby.\n",
  "url": "https://www.yamu.lk/blog/kingdom-of-jaffna"
}