{
  "title": "48 Hours in Ella",
  "abstract": "A short guide on the what to do and see in Ella.",
  "author": "",
  "date_published": "10:21pm",
  "content": "Ella is an incredible place purely for its stunning views, weather, hikes and sights.\nIt's incredibly touristy, mostly because it's a connecting point to the East Coast, and some of the signboards proudly proclaim it as being a 'tourist town.' Needless to say, there's a ton to explore, both gastronomically and adventurously — but it will definitely take you some time to discover all of them! Here's a little list of how to make the most of your weekend there.\nThe rolling vistas of Ella are a breathtaking sight to behold, whichever mountain you decide to conquer. We recommend\n(not to be confused with Sri Pada) for your first day as it isn't too arduous — there are steps leading the whole way up, and some off-beaten paths which I'd honestly take over the staircase any day; mostly because you can climb stairs anywhere in Colombo and it's harder to find a nice mountain. Also, it's actually easier making your way through mountain paths than steep cement stairs, the latter is more taxing on the knees. You need to stay up for the afterglow that descends over the place after sunrise, because that's worth viewing. Head down for breakfast a couple of hours later.\nYou won't be short of options here. For some place in the middle of the hill country that's difficult to access, Ella has one of the best Fish & Chips we've tried in the country! Go to\nthat's more than enough to feed two people. It's right in the centre of town just like most of the other restaurants in the area. Given the cool climes, the heat isn't a factor you need to reckon with so you can easily walk around town and just explore the area. You're not going to be able to grab breakfast\nlunch on time if you're planning on wandering around, so we suggest dragging your breakfast out and eating heartily to make up for lunch as well.\nThe historical\nand caves are about a 15-20 minute bus ride away. Bathing is dangerous depending on the weather and the rainfall, or difficult depending on the lack of water (both these situations depend on when you visit) but can be done nonetheless, so just behave responsibly and don't do anything stupid. No really, people die all the time thanks to being careless. If you're planning on a nice splash around in the water, you might as well\nand then head over to the falls which are further down (you'd still need to get a bus or a tuk, it's not walking distance).\nYou've had a really packed day and tomorrow isn't going to be any easier on your feet. If you've had enough of being on the move and would like to be around\nlives up to its name whilst providing all those facilities. Don't get too late though because it gets incredibly crowded and you'll eventually have to wait to snag a table. Head to bed early, because you're going to be up a couple of hours before dawn again.\nWe say this because (if you really want to see the best of Ella) you'll have to start this hike incredibly early.\nis one of my favourite spots because of how absolutely stunning the view from the top is.\nThe hike takes about two hours, so arm yourself with torches, fully charged phones, and plenty of water to accompany you along the way. You're bound to get lost at some point or the other (\ndoes, or so I'm told. I've missed my way both times I went there. Plus, there are about 16 different routes to get there so you're likely to just get mixed up between all of them) but the hike is worth it.\nOnce the sun's nicely up, there's usually an old aunty and uncle from the area who appears and sets a kettle to boil atop some kindled firewood so you can have a cup of steaming hot tea, plain tea, or coffee.\nThe hike down will take another two hours, after which there's a 2 km hike from the base to the Ella town railway station. Given that you spend a couple of hours chilling at the peak and absorbing what the views have to offer, you'd probably reach town at or after 10 AM.\nFor lovely brunch views, a relatively uncrowded restaurant and lovely service, head over to the\n. The food isn't the greatest but we recommend it for everything else.\nThereafter, here are two options you can choose from, both which will take pretty much the rest of your day:\nThat's most of it, folks! Nightmail leaves at around 6:50 PM from Ella to Fort, or you can go to Badulla and get a bus, or the Superline express. Just remember to book way ahead in advance because commuting to and fro is tough if you don't have transport sorted out.\n",
  "url": "https://www.yamu.lk/blog/48-hours-in-ella"
}