{
  "title": "48 Hours Around Sigiriya",
  "abstract": "From historic ruins to magical forests and  quartz mountain ranges.",
  "author": "",
  "date_published": "2:42pm",
  "content": "Be you a traveller, a history buff, or a lover of sweeping vistas and great views, Sigiriya and its surrounding area has a lot to offer. The ruins of Sri Lanka's first and second kingdoms (Anuradhapura and Polonnaruwa) each are about 1.5 hours away; but in this article, we'll be highlighting four other non-mainstream places to visit.\nWe're taking\nAbout one and a half hours away from the Sigiriya town, Ritigala is an ancient forest monastery swathed by myths dating back to the third century. Legend involves Hanuman, Rama, and a mystical man-bear demon, while the forest itself teems with endemic wildlife. There are a few monastic ruins, and the Ritigala mountain range is peppered with hundreds of caves. The mountain is off-limits though, unless you have a permit.\nDirections:\nYou'd need to squish yourself between boulders and hoist yourself up in places, but the view from the top is definitely worth it. A huge rock/ small mountain a stone's throw and directly across from Sigiriya, Pidurangala offers stunning views: not only of the rolling plains and lakes stretched out below you, but also the best possible view of the rock fortress itself.\nDirections:\nA massive forest filled with ironwood trees (aka Sri Lanka's national tree),\n— the ironwood garden — leads to the island's only rose-quartz mountain range. It's a small range, so you can traipse over most of it quite easily. Climb as high as you can for winds strong enough to knock you off and for an unexpected view of treetops and the zone's quintessential lakes.\nDirections:\nReminiscent of Sigiriya, Yapahuwa comes complete with ruined castle walls, a moat, and a defensive fortification. The most striking feature here is the 70-degree staircase where you'd find two familiar stone lions somewhere near the top. Familiar, because they're featured on our (no longer printed) 10-rupee notes. Climb\nto the top for rock pools, ruined stupas, and the casual views you have now come to expect from this area.\nDirections:\nYou can easily find buses and tuks to get around, if you don't have a private transport. Buses off the main road are a bit more infrequent, so be aware of the time and route — just ask around, people are more than willing to help out.\nThere are plenty of small eateries as well, especially down the Inamaluwa-Sigiriya Road. Stock up on snacks for the longer rides, and on a couple of bottles of water as well.\nPlenty of holidays coming up over the next few months, so make good use of them. Happy tripping!\n",
  "url": "https://www.yamu.lk/blog/48-hours-in-and-around-sigiriya"
}