{
  "title": "5 Ancient Customs That Have Been Missing From Sinhala-Buddhist Weddings",
  "abstract": "There are few items that have been missing from Buddhist weddings. What are they?",
  "author": "",
  "date_published": "6:38pm",
  "content": "“Marriage” is a significant and an important milestone that provides the legal basis for the concept of family, and an eternally cherished bond between those who share it. This is why it's considered as a token bearing the\nculture of Sri Lanka.\nSinhala-Buddhist weddings have a bunch of rituals and customs that are unique to them. Those things can be seen even in the modest weddings of the 21st century. But there’re a few items that have been missing from them, and the present-day society doesn’t even know that they existed.\nLet’s back up a little bit. We're talking about the pre-colonial period of Sri Lanka.\nceremony is a momentous and sacred event in a Sinhala-Buddhist wedding. This involves performing a set of specific rituals for the bride and groom, to shower them with blessings as they’re about to start a new life together as husband and wife.\nNowadays, most of the weddings take place in hotels or banquet halls. Usually, these hotels/banquet halls have a readymade\n, and they redecorate it as per our request. Decorating a\nshould follow several certain rules and requirements. As there’re plenty of wedding planners who are willing to provide these services, it isn’t a hectic task.\nBack in the day, there weren’t any readymade\n, or wedding planners to build them. Each\nwas freshly built by the villagers, according to the auspicious time and date given by the person who prepares the\n. Colorful coconut leaves (\n) were used to decorate the\nIn modern weddings, the wedding feast usually takes the form of a buffet. You grab a plate, stand on the line of the buffet, serve yourself, go back to your table and eat. Back then, there was no such thing as eating at a table. In some areas, the meal was enjoyed while sitting on a mat.\nAccording to the contemporary experts, there were four distinctive events in the traditional wedding feast.\n- In this part, the bride’s side serve food to the relations and neighbours who helped to make the wedding a success.\n- Aadara Batha was enjoyed by the newly married couple. In some districts, the bride and the groom shared the same plate.\n- It was customary for the groom to take the bride to his house after the wedding ceremony. It took the form of a parade, called\n.\nAll the important relatives and the elders of the village participated in this.\nwas served to the rest of the people who were left at bride’s home, once the others took off for the\n.\n- The meal that was served by the groom’s side, to welcome the bride and her family after they reached the groom’s house from the\n.\nAltogether, these four events make the\n.\nCurd and honey (\n) was the most popular dessert back then and at the end of the wedding feast, a tray of betel leaves (\n) was shared among the elders. The Saddharma Rathnavaliya, the ancient book mentions this as “\n” (The feast starts with the rice, and ends with sharing betel).\nEvery wedding had a\n, a gathering of all the guests and the family members to greet the newlyweds, advise them, thank everyone for helping the wedding and apologize if any mistakes have been made.\nIt was held as a\n, where the elders sang\n(A form of poetry) to pass their blessings to the newly married couple.\nThis custom still can be seen at some traditional weddings, but instead of\nthe elders of the family speak on behalf of the bride and groom.\n“Leaving for honeymoon” was not a term that could be heard at the ancient Buddhist weddings. It was called\n, a parade where the groom brings the bride to his own home.\nThe newlyweds took a decorated bullock cart while the other members of the family followed them from other bullock carts. The last cart of the\ncarried the dowry of the bride. This parade is considered as an event that showcases the pride of both families.\nThe common belief was that the bride should leave her home as the same bride who was blessed at the\nceremony. Therefore, the bride and the groom didn't change their attire when participating in this\n.\nIn the modern society, the dowry does not seem to be as important as it used to be. That being said, “a woman shouldn’t be given away empty-handed” hasn’t completely left the belief of the Buddhist community.\nNowadays, there are two different dates for the wedding and the homecoming. But back then, both of them happened on the same day. It started once the\nreached the groom’s house. The previously mentioned\nwas served during this event.\nThe beautifully decorated\n(pandal) could be seen at the doorstep of the groom’s house to welcome the bride and her family.\nThere wasn’t any sort of legal effect on the concept of marriage, until the Dutch colonial period of Sri Lanka. All of these rituals and customs followed auspicious times, which is another thing that we can see in modern Buddhist weddings.\nAs an embodiment of a decent society and a celebration of love, marriage is one of the most important turning points in the life of any person. The emergence of yet another good generation is reflected by this event.\nIt’s true that following such rituals and customs exactly as it is isn’t an easy task in the modern day world. But it’s important to remember where our roots are because that’s a part of our identity as a noble nation.\n",
  "url": "https://www.yamu.lk/blog/5-ancient-customs-that-have-been-missing-from-buddhist-weddings"
}