{
  "title": "5 Avurudu Games And Activities You May Not Have Heard Of",
  "abstract": "Some Avurudu games aren't just games: they're sacred rituals for blessings, health, and prosperity.",
  "author": "",
  "date_published": "10:07am",
  "content": "Annual Avurudu games and festivities used to be a huge deal, with the whole town/ village (or whatever your hood is called) gathering for fun and games. It was a time of real-life community engagement, the only time where it was okay to beat up a person with a pillow in public, and to let out all that pent up energy by smashing clay pots into oblivion. Large-scale\ns have died down a bit, at least in more urban areas: but there are immensely popular games and competitions that everyone knows of thanks to it being persistently present at every\n-related event. Really, who\nheard of\nand the rest?\nThis is amazing because you get to lob coconuts at someone. It's also pretty dangerous and could conk you out, so please don't try this for fun at home. Or anywhere else.\nTo play, split into two teams and draw a line in the ground (trace it out in the sand) demarcating a Northern and Southern section. This is respectively called the\nand\naka the upper and lower team. The goal of the game is to take turns hurling coconuts at each team: a striker from the\nthrows one at the striker in his opposing team, who has to counter-strike the coconut heading his way with another coconut held firmly in his hands. This continues until the strikers' nuts cracks, no pun intended. Each person from each team takes turns doing this: the winning team has a nut or two intact at the end of the game while the losing team has all their nuts cracked.\nYou'd think that we'd have much more water-related activities based on the fact that we're literally surrounded by water in addition to having tons of lakes and rivers, but nope.\nis more popular down south and apparently around the more lake-filled North Central Province as well. It's a rowing competition, only with the risk of falling into the water. Given how there were games involving throwing coconuts at each other, this seems as safe as a walk in the park.\nImage courtesy of\nIntricate and expensive, Beeralu lace was a craft that was passed down from one generation to the other; but is now a dying art. Using wooden bobbins and pins, the design's first sketched out and then attached to the\nwith pins stuck in along the entire design. I was told that Beeralu weaving competitions were part of Avurudu activities once upon a time. Didn't know that? Neither did I. But hey, if there are palm-frond basket weaving competitions, this most probably did happen as well.\nThis is mostly a religious ritual, and quite similar to\nin terms of what it symbolizes — it was to invoke the Goddess Paththini to help out in hard times, especially when there were illness and drought in the land. To describe it simply, the two teams (\nand\n) meet at a tugging field that's been specially prepared for the sport. Both teams have a sambhur or a buffalo horn hooked to each other, which is then pulled. The team whose horn breaks first loses the 'game'.\nA localized version of\n,\ninvolves lots of running and shouting and just being jolly overall. Including both boys and girls (or men and women), it requires a spacious, unobstructed area with a clearly demarcated large circle etched on the ground. One person is blindfolded and is 'it', while the others need to avoid getting caught — all within the confines of the circle. If you run out, you're out. If\nruns out, he's helped back in. The last un-caught person wins.\nFew of the avurudu activities (like\nand\nare actually much more than just games. They're more of rituals and rites in honour of the goddess Paththini — one of Sri Lanka's guardian deities — for protection and blessings.\nThe more common and identifiable games and activities now are a lot less ritualistic: eating buns, running marathons, conducting beauty pageants, while also involving some rough-and-tumble with games like\n\nIf you know of more, do let us know. Meanwhile, have a great Avurudu!\n",
  "url": "https://www.yamu.lk/blog/5-avurudu-games-and-activities-you-may-not-have-heard-of"
}