{
  "title": "5 Cool Things You Can Do With the YAMU App",
  "abstract": "Our app is great. Here's why.",
  "author": "",
  "date_published": "11:10am",
  "content": "Our wonderful in-house team of developers has done a stellar job on the YAMU app and we're here to show off a bit. If there are any glitches or you've got an issue,\nor drop us a mail to dev@yamu.lk.\nSo download the app, free on\nor\n, log in to use all the facilities, and get exploring. Here's what's new, here's what you can do, and here's how to use it.\nOur site's had\nfor a while now, but we've just got\non board, and we just launched it on the app too. It's easy, it's generally quite fast, and the number of restaurants on the service is growing. Ordering is easy and intuitive, you don't need to speak to anyone on the phone (unless it's a lost delivery guy), and our orders usually arrive within 45-60 minutes.\nDelivery charges depend on your location, but it's generally between Rs. 50 and Rs. 200 so you're better off grouping orders together.\nThere's a strong representation of people who think our reviews and ratings are perpetually incorrect, and this app feature goes out to them. Well, it's for anyone who wants to weigh in on a restaurant, hotel, or other establishment themselves. You can write a review, create a rating, or just disagree with the writer. It's all one touch away from each place's landing page. Just click on the red pencil button.\nIf you're on a review and want to call them for a reservation or a query, just click on the green number and it will take you directly to your calling facility on your smartphone. If you're on a review and want to get directions, just click on the magenta map button and it will take you directly to the location on your phone's map app.\nis one of the most community-driven spots on YAMU. Anyone with an account can ask a question (on anything about life in Colombo), answer someone else's question, or join a discussion. You can also enable notifications so you're immediately told if someone responds to you or there's a new question up. In fact, you can enable notifications for most functions including new restaurants or events.\nOne of the most useful functioning features of the app is the map location. Turn on your GPS, click on the home screen button saying \"Nearby Places\" and find out what's in your immediate vicinity. You can then go on to click on whichever review you like and learn more before you decide to visit.\nThe app's in great working condition now and we highly recommend it(obviously out of no personal bias). Just log in, and you can use it for a whole bunch of everyday functions like directions, delivery, and dissent, which we think is useful. Our team is also in-house and highly responsive, so you can drop us a line and let us know if there's a bug. Happy apping!\n",
  "url": "https://www.yamu.lk/blog/5-cool-things-you-can-do-with-the-yamu-app"
}