{
  "title": "5 Easy (And Fun) Ways To Eat Local",
  "abstract": "Want to choose local produce but don't know where to begin? Here are five easy ways to make more sustainable and…",
  "author": "vidya",
  "date_published": "2:25pm",
  "content": "Not so long ago, we told you why\ndeserves our attention, and why we should favour what’s grown within the country to that which is flown thousands of miles to get here. While restaurants can do their bit to honour local produce, good choices—like charity—begin at home. Here are five easy ways to eat local, and make more sustainable and healthy choices:\n\nLong before industrially grown, pest-resistant, commercial varieties of rice and wheat swamped our shelves, a greater variety of indigenous grains specific to Sri Lanka’s ecosystem were a commonplace part of daily diets. Thankfully, at least some of these heritage grains are making a comeback, thanks to initiatives like the Good Market. At the Good Market shop opposite the Racecourse, apart from well-known millets like\n, you can also try grains such as\n, also known as the common or white millet, a mild and pleasantly chewy grain that can replace rice, apart from traditional varieties of rice. While millets are particularly\n, packed with calcium and magnesium among other things, traditional rice varieties are also a good deal more nutritious than the polished rice we commonly consume.\n\nWithout a doubt, we have a long way to go before we can claim to have an excellent Sri Lankan mozzarella or Cheddar. (And we do understand your delight at spotting a good Brie in the supermarket). But that doesn’t mean we shouldn’t extend our support to the few local cheesemakers who are attempting to make a dent in that challenging sphere. The Good Market shop always stocks a small selection of local cheeses, such as those made by\n, a small village farm in Giriulla. We are particularly excited to see the evolution of\n, a promising cheese brand that is venturing into rare varieties such as goat’s cheese, halloumi and cheese curds.\nNothing can quite beat the ease and convenience of breezing into a supermarket for all your fruit and vegetable needs, but if you take the time to visit an actual\nor fresh market, the experience is bound to be much more rewarding. For starters, local markets are more likely to stock seasonal vegetables and fruit than supermarkets, which are firmly geared towards stocking the most popular items. On my weekly market runs, I’ve often found seasonal produce that makes it to supermarkets: mild, nutritious red amaranth leaves, a huge variety of local chillies in a fascinating array of colours, and citrus fruits such as naarang that are a refreshing counterpoint to mandarins from China. Besides, the produce at local markets is less likely to be plastic-wrapped and chemically treated to stay fresh, which is just a win all round.\n\nEvery Saturday, my morning indulgence includes a visit to the Colpetty market. Specifically, it includes a lot of dawdling at Shop no. 9. In one corner of the Beema vegetable stall, beside the neatly arranged bell peppers and colourful squash, is a small selection of exotic produce that is all cultivated in Sri Lanka. Over the weeks, I’ve found fennel that is grown in hill country, snow peas and shoots from Hatton, green peppercorns from Peradeniya, galangal leaves and roots from Dambulla and even jalapeno peppers that are cultivated in Kandy. I look forward to this weekly ritual because it opens my eyes to the bounty that is cultivated within the compact land mass of Sri Lanka. In addition to Colpetty market, the Good Market on Saturday is also a great place to scout for exotic ingredients such as lavender grown in Nuwara Eliya, which eliminates the need to depend on a kind relative to bring (or ship) it from abroad.\nWe don’t need to tell you why this is cool. If you have the luxury of a backyard, you can cultivate a little kitchen garden. Balconies lend themselves well to plants such as chillies, basil and curry leaves, microgreens, tomatoes and sweet potatoes. Fresh, homegrown, fertiliser-free produce — what’s not to love?\n",
  "url": "https://www.yamu.lk/blog/five-easy-and-fun-ways-to-eat-local"
}