{
  "title": "5 Great Faludas (On Galle Road)",
  "abstract": "The best faludas along Galle Road sweet houses, with all the kasa-kasa, sev and ice cream that you love. ",
  "author": "Shiran",
  "date_published": "11:52am",
  "content": "Rose syrup, noodles (aka: sev), basil seeds (aka: kasa-kasa), milk and ice cream. These unlikely components make faluda, a beverage-dessert popularised in the Indian subcontinent through Mughlai influence.\nThe concoction itself looks deviously extra-terrestrial. What with the translucent tentacles (sev) , the gelatinous, little disembodied eyes (kasa-kasa) and the fleshy pink hue of rose binding to milk. Like something Greedo would have downed at the Mos Eisley Cantina right before Han shot first.\nUnfortunately, like with other Mughlai influenced dishes such as biryani and tandoori, us Lankans struggle to get it right. Galle Road is peppered with indistinguishable ‘Bombay Sweet’ shops purporting to sell faluda, but most just serve up glorified rose milkshakes.\nWe tried 12 faludas on Galle Road to pin down the top 5.\nWith its bright pink and yellow signage, Hamra at the Dehiwala junction cannot be missed. Run by a Kandyan-Muslim family, the store serves up a pretty looking, tasty faluda that isn’t the most authentic.\nThere's a generous shot of rose syrup which overpowers the entire drink. The presentation is quite pleasing with the kasa-kasa clustered in a corner, and some colourful sprinkles of jelly on the dollop of ice cream.\nHamra loses points for serving their faluda with a straw too skinny for the kasa-kasa and for lack of sev. It's a decent spot to cool down if you’re swapping buses at Dehiwala Junction or meeting a friend.\nA cool shaded spot in Wellawatte, this place get brownie points for serving faluda in a hefty beer glass. If you’re going to serve a dessert the colour of a disney princess’ dress, you may as well serve it up in the most masculine medium possible.\nThe rose and milk are pre-mixed into a shade of bubblegum pink, with a generous scoop of ice cream and a meagre smattering of jelly and kasa-kasa.  It looks and tastes great, but with no sev and little kasa-kasa, this doesn’t feel too much like a faluda.\nFairly new to the game, with shiny furnishing and a blaring sound system, the staff seem inexperienced and bored. Once you break the ice, they do get chatty and helpful.\nRich Bombay Sweets gets major kudos for boasting those sev noodles on the top. The generous helping of kasa-kasa and jelly pieces certainly help. This is by far one of the most elaborately presented faludas we've tried. But does it taste as good as it looks?\nThe texture is wonderfully diverse with all that’s packed in there. You’ll be happy to find more noodly sev goodness at the bottom and, surprisingly, some chunks of tender cashew. The cashew plays quite well with the rose. The only let-down is the watered down body of the milk.\nThe Holy Grail of Faluda, Bombay Sweet House was founded somewhere between the 40s and 60s by a Gujarati migrant named Dawoodbhoy. Being the original ‘Bombay Sweet’, Dawoodbhoy most likely introduced faluda to the island, at least commercially.\nToday, his son Fakhrudeen runs the place and has kept it true to its name. You won't find any Lankan short eats here, just sugary, greasy, aromatic halwas and, of course, their signature faluda.\nWhat we were served, though, was  a ghost of the decadence promised. The presentation was sloppy, with big wet chunks of ice and a foamy scoop of vanilla ice cream. Despite the looks, it tastes like the real deal.\nThe rose and milk are in perfect proportion. They use a nice fat sev here and the whole thing is well balanced. Bonus points for the friendliest staff and owner, with Fakhrudeen always willing to recount the story of his pioneering family.\nJust look at that thing! It’s like the dessert avatar of My Little Pony. Deep bubble-gum pink. Dense, floating clusters of kasa-kasa. Crowned by a scoop of ice cream. Even the turquoise straw adds to the simple, but beautiful, presentation.\nAfter a quick stir, the first sip hits you with an explosion of texture. This is what a faluda should feel like - weird. I found myself bouncing on my seat, lapping up that discombobulating flow of kasa-kasa, fat sev, ice cream and rose infused milk. It’s a sensory short-circuit– but a good one, I promise.\nHere's the kicker, though. Faluda House is a branch of Bombay Sweet House, run by Fakhrudeen’s son. So, while Sweet House has been dethroned it's still all in the family.\nWith such a broad spectrum of ingredients, there has to be the right balance struck by the miscellaneous flavours and textures at play.\nMost important is a decent rose to milk ratio. Too much rose and the whole thing tastes sickeningly candied.. Too little and you're stuck with bland, soppy milk, only laced with meagre tendrils of rosy goodness.\nThe sev and kasa-kasa are vital for adding weight and texture. Kasa-kasa is known for having cooling effects on the body, with Indian Parsi’s recommending it to pregnant women. Together, these ingredients add a playful, wet, chewy-crunchiness to the whole experience.\nFinally, the mode of delivery: the straw. It might not be edible, but choice of straw can make or break your faluda experience. It needs to be wide enough to accommodate the ingredients and ensure that the whole process is actually enjoyable and not a jaw-straining suckfest.\nA good faluda requires both playful inventiveness and respect for history. Most street-side spots attempt neither, choosing instead to imitate the mediocre product that everyone's selling. There's a faluda hiding in every street corner in Colombo, waiting to be tried. We can't promise that any of them are any good, though.\nDespite consuming enough sugar to bankrupt a Caribbean plantation colony, we’ve only scratched the surface. Look forwward to a shortlist of faludas from non-‘Bombay Sweet’ shops. Or, better yet, a Faluda map of Pettah.\n",
  "url": "https://www.yamu.lk/blog/5-faludas-on-galle-road"
}