{
  "title": "5 Hot Neighborhoods In Colombo ",
  "abstract": null,
  "author": "indi",
  "date_published": "10:36am",
  "content": "Colombo is not a planned city. Shops and offices are in in residential areas and the city has evolved organically and, at times, randomly. That is changing with a new zoned plan for Colombo, but the living heart of Colombo is, for the most part, improvised. So which parts of Colombo are currently the most interesting?\nThimbirigasaya Road was once infuriatingly narrow and then under ruinous construction for a long time. Now it has opened up, which has created a new hotspot as it enters the city. Â\nA lot of new and interesting shops, restaurants and offices have opened around here. We mention these places because they're interesting, but also because they're in a (relatively) high concentration. This shows the effect of widening Thimbirigasyaya and the natural development that's led to. If you turn down Jawatte you get to\n(and\n) and if you continue down Thimbirigasyaya you get to\nand\n.\nThis places Thimbirigasaya advantageously between the suburbs of\n/\nand\nproper. For a long time this advantage was obscured because it was quite possibly the worst road in Colombo, but they smashed out some houses and gardens and the road is passable now. Now people going from the population centers in the suburbs are going through Thimbi every day. And they're stopping there as well.\nThe road, once a feeding ground for Colombo's working bullocks, is becoming a hub, especially around the Thimbirigasyaya junction.\nThimbirigasyaya, named after Thimbiri trees that no longer seem to be there, was once an extremely narrow road, but now it's been widened and there's a lot going on.\nHorton Place is another road connecting Rajagiriya and Battaramulla to Colombo, in this case Colombo 7 and 3. This has always been a nice area, but now it's seeing more and more activity. Horton Place is emerging as a central space for the arts in Colombo, but it's also near the nexus of coffee.\nHorton Place is also near what we call the coffee nexus. In a few square kilometers you'll find Coffee Bean and Barista's (on Horton Place); Cioconat, Caffe Pascucci and Tea Avenue (on Wijerama); and the Barnesbury and Paddington (on Barnes Place). And that's not even everything. There's a lot of coffee around here, and traditionally artists plus coffee has been connected to good things.\nMarine Drive actually spans multiple districts, running from Colombo 3 to, now, Dehiwala. Like Thimbirigasyaya, it only really developed after the road was widened, again, smashing through existing properties to become wide enough. We'll start on the Dehiwala side, which is the most interesting.\nThis is only fraction of what's happening on Marine Drive. New places are emerging there almost weekly. It also has less traffic than other roads (except during prayer times around the mosque) and it is rumoured that they're planning to extend it down through Mount Lavinia.Â\nFor years Marine Drive was neglected and a hidden gem, but it's getting more and more polished every day.\nWhile Slave Island is undoubtedly developing, most of that area is already parceled out to big developers. The area around Gangaramaya Temple, however, is a bit more free-wheeling. The big Altair apartment complex is going to change a lot, but right now it's already pretty happening, especially around the Park Street Mews.\nThat area - with the news and happening Cafe Francais and the Harpo joints Park Street Mews Restaurant and Curve - is probably the nicest private leisure stretch in the city. It's also connected to a lot of interesting stuff in the neighborhood.\nThis part of Slave Island will change a lot as new apartment buildings come in, but it already has a good base of tourists and local attractions.\nIf Colombo had a royal crest, it could read Liberty, Majesty, Unity - the names of its major malls. We'll leave out Crescat because that's not a word. Liberty Plaza has long been neglected but it's undergoing a major renovation. The new Movenpick Hotel is also rapidly coming up next door, and Cinnamon Red is already packed up the street. The Liberty Roundabout is emerging as a center of Colombo life.Â\nWe know that we've pushed the definition of Liberty Roundabout a bit, but what we've mentioned is all within walking distance. We haven't mentioned the Liberty Cinema and Colpetty Market which could both see significant changes and more post spots like Movenpick emerge around them.\nThe entire area on the north side of Dharmapala Mawatha is also quite interesting. Colombo 3 is considered posh and expensive, but the land between here and the Beira is actually filled with low-income houses on a few perches. It's a central and yet ignored area.\n: This is about as north as Colombo gets, but they're redoing the Crow's Island Park (which actually has a nice stretch of beach) and Northshore College is already operating here. If the road into here is widened, it's actually not far from the city and is close to Peliyagoda and the highway interchange. It's also a nice area, but perhaps more valuable in the long-term.\n: Currently this is office space for tech companies like CodeGen. It's also home to the Elphinstone Theatre, which is being redone. Over time this central point between Borella and Colombo Fort could become quite happening.\nWhat we haven't mentioned here are the places which will obviously develop, ie, the places where the government is pumping in money. That includes Dutch Hospital, the Racecourse and Independence Arcade. These places all have retail space to rent and are invigorating the neighborhoods around them, but there are not what we'd call organic development.\nSo that's our opinion as to what some hot neighborhoods in Colombo are and might be. It's just an opinion, so please don't take it as investment advice. These are some places that have evolved some nice restaurants and shops and things to do, but that could all change. What remains is that the city itself is vibrant and alive in a way its never been and it's stitching itself into fun and coherent neighborhoods before our eyes. It's definitely a fun time to be in Colombo.\n",
  "url": "https://www.yamu.lk/blog/5-hot-neighborhoods-in-colombo"
}