{
  "title": "5 Independent Coffee Shops (Colombo) 2014",
  "abstract": "Indi looks at 5 of Colombo's indie coffee shops",
  "author": "",
  "date_published": "5:08pm",
  "content": "Colombo is getting coffee franchises but, thankfully, we're getting a lot of independent coffee shops as well. These are five independent coffee shops which we think are excellent and worth a visit.\n\nThis is our favorite coffee shop. Run by the owners of Cricket Club, this place brews an excellent if limited selection of coffee (no eight varieties of frosty mochachinos here), has amazing food and a breathtaking view of the ocean (especially at sunset). They grow their own coffee beans here so the place is connected from field to cup.\n\nUnlike the other place here it's also plenty big, so you can bring a gaggle of school kids. But please don't.\n\nLocated just before the Mount Lavinia Hotel, this coffee shop is far, but we highly recommend it. The coffee is good (local Hansa beans) and the food is, from what we've sampled, wonderful. The burgers here (with homemade tomato relish) are much better then the Burger King up the street.\n\nThe downside is that the cafe area is a bit small, but they have a big performance space and terrace. They also host a lot of evening events and art classes. Truly a coffee shop with character.\n\nThis gem is hidden in plain sight, across from ODEL and next to the mosque down Kannangara Road. It looks like there's no parking, but you can actually park in the Baptist Church round the bend (turn left at the roundabout). Coming that way you walk through an outdoor section into a nice coffee-shop run by a very nice Singaporean (we think) gentleman.\n\nThey do a divine lime tart, good coffee and virgin mojitos and solid food, including lunchtime rice.\n\nCocoon is, quite literally, a cocoon in the middle of bustling Colombo. Down the Lionel Wendt road (down the street from Stafford International School), it's a cozy, well-decorated coffee shop on an unusually quiet and walkable street.\n\nWhile the location is awesome, we weren't super impressed with the food or drinks. That said, we had a lot of commenters telling us we were wrong.\n\nThis tiny coffee shop down Fife Road was, for a long time, the only independent one in Colombo, but it's dropped in our list simply because it's so small. They do the best ice coffee, make their own chocolate and are generally creative and awesome. The only rub is that the space is so tiny you can hear everything everyone else is saying, and they can hear you.\n\nThat said, this is the originator and they supply the coffee at many other shops, so it deserves respect.\nAll of these places are run by locals, usually with the owner on site, so you're almost guaranteed good service or quick redress if anything goes wrong. They also each have their own creativity that isn't found in a binder or dictated by a foreign corporate board. While the big franchises generally have bigger spaces, more parking and bigger menus, we think these coffee shops with character are well worth your time.\n",
  "url": "https://www.yamu.lk/blog/5-independent-coffee-shops-colombo"
}