{
  "title": "5 New Year’s Resolutions for Every Sri Lankan",
  "abstract": "Here's a few simple new year's resolutions every Lankan should look to adopt to make life easier for everyone around.",
  "author": "",
  "date_published": "9:37am",
  "content": "Every year we make new resolutions for ourselves. Now don’t get us wrong here, we’re not talking about making a list and posting it on Facebook. Even if you don’t expressly do so, we all end up thinking about how we want the new year to be different. On this list we’re not telling you which resolutions to make for yourself. Instead, these are a few things Sri Lankans could change to would make life a lot more pleasant for the people around them.\nAt this point we Sri Lankans are almost proud of being consistently late for just about everything. Like literally any function. If a group of Lankans show up for a gathering thirty minutes late, you’ve actually lucked out. It’s so bad that we call it “Sri Lankan Time”. If you actually want people to show up at a certain time, you’ve got to tell them to show up about an hour earlier so that they turn up on time. But yeah, let’s all try to be a bit more punctual in 2018.\nGetting around in Colombo is more frustrating than ever, especially during rush hour (which is more like three hours). The worst part is that if you look around you’ll see that most of the cars have one person in it. Combine this with the ever growing number of bikes and tuk tuks and you end up with the the nightmare that is Colombo from 5 pm - 8 pm. For 2018 let’s try to work with colleagues to carpool so that more people travel together and save time, parking and fuel costs. Alternatively, we’ve got services like PickMe who’ve improved their technology and operations, making them a viable daily option.\nAs far turn-offs go, bad breath is right up there and we Lankans are frequent offenders. This is actually not due to particularly bad dental health, but rather because of our cuisine. We use so much onion and garlic in our curries and malungs that we inadvertently end up with bad breath. Speaking from experience, try to avoid meetings directly after lunch time ‘cause you’re asking for trouble. Obviously carrying a toothbrush and paste to work is a pain, and while drinking enough water after eating will help a lot, something like a mouthwash will help cut out any odour completely.\nHere's a resolution that you may have made in previous years, but ended up putting off to the next year. OK, lame joke. But procrastination - habitually and consistently delay tasks - is a problem that plagues about 20 percent of the population worldwide, and about 80% of the Sri Lankan populus (I’m making this up but you know it’s for real). Sri Lankans are skilled and very resourceful but we’re also incredibly lazy. Like if we can put something off for later, we will put it off for later. All jokes aside though, something as simple as a making a list of tasks to complete for the day can help get out of this habit and significantly improve productivity.\nSri Lankans are known for our incredible hospitality and that’s true (for the most part). However, we have a bit of a Jekyll and Hyde complex when it comes to the internet. As of late comments sections on Sri Lankan websites and Facebook have become incredibly toxic, making online interactions quite unpleasant. While anger at certain instances are understandable, we’re seeing a lot more name-calling and arguments based on conflicts of opinion. This could be on politics, sports and even food (we know this better than anyone). Internet arguments rarely solve anything and in the worst of cases can be detrimental to your occupation so let’s try to be a bit nicer on the internet going into 2018. Hell, you can just not comment, which also works brilliantly.\n",
  "url": "https://www.yamu.lk/blog/5-new-years-resolutions-for-every-sri-lankan"
}