{
  "title": "5 Spots for Stress-Free Dining with Kids",
  "abstract": "Dining with young kids in Colombo can be tricky! Here are some of our favourite spots in the city for stress-free…",
  "author": "Michelle",
  "date_published": "11:37am",
  "content": "Colombo can be a little difficult to maneouvre when you've got young kids in tow! We thought we'd let you know some of the best spots for dining without hassle in the city. Let us know your family's favourites too!\nWIth both covered and al fresco space, Il Ponte whips up salads, pastas and pizzas made to order, including a basic margarita (cheese and tomato sauce) if the kids decide that day that they’re not eating toppings.  While you’re waiting for food to arrive, there’s a small outdoor playground, just adjacent to the restaurant and pool area. This area can see more than a few mosquitos, but lets the kids burn off energy, and you can have drinks sent over while they play.  With a bar Happy Hour from 5-6, and 2 for 1 on pizzas from 5-7, it can also be good value.\nOn days that you know they won’t sit still, head to The Sandwich Factory.  With both an indoor baby-proofed toy room with a/c, and an outdoor climber and play area (bring sunblock), the space is ideal for families.  The menu is that of an old-school American diner, with a separate kids section to order from.  Make sure to ask which items are spicy, as though all options can be made to order, some of the sauces and seasonings can be hot.  If you’re not looking to have a full meal, it’s also just an easy place to go for an hour to have a milkshake.\nBring along a bucket and shovel, the venue will do the rest.  With a basic snack menu available up to 7pm, and full dinner menu available after, you can come early for the sunset and have a play before dining.  Book an outdoor table and kick off your shoes, while the kids build castles — some evenings the hotel will even pass out markers to keep the young diners entertained at, rather than under, the tables.  Worried about sand before bed?  Showers are available in the rest rooms to rinse off before heading home.\nWith balloons, booths and a sound level that even the kiddies can’t crack, TGI Fridays is a decent place to bring the young ones along for meal out.  The menu is very kid friendly, with generous portions of salads and sides to share, as well as mains ranging from chicken fingers to (incredibly large) burgers.  They take reservations, and you can book a booth or corner table.  Wait staff are attentive, and most importantly, dole out crayons and colouring sheets as fast as the food.\nA great place for lunch / snacks / yummy baked goods, and with a designated indoor kids play area, this is a brilliant space to head for an hour (or three).  It was originally borne from The Good Market (also a great, kid friendly venue) and has the wide ranging menu and earthy, cravingfriendly options to match.  If you don’t want the little ones to end up with a sugar high, great choices beyond the cakes and cookies are the bagels and, for the more adventurous palates, mini quiches.\n",
  "url": "https://www.yamu.lk/blog/5-spots-for-stress-free-dining-with-kids"
}