{
  "title": "5 Things To Do In Colombo's Monsoon",
  "abstract": "Trapped here in the YAMU office with nothing but a plastic Christmas tree and a dismal view of the steely grey Indian Ocean,…",
  "author": "Kinita",
  "date_published": "5:09pm",
  "content": "Wait, wasn't the moonsoon supposed to be over already?\nLiving on a tropical island has its plus points, like coconuts and baby elephants. However, pretty much the only three negatives we have going on right now are all out in simultaneous force:\nTrapped here in the YAMU office with nothing but a plastic Christmas tree and a dismal view of the steely grey Indian Ocean, we came up with some great ideas to keep you high and dry.\nWhether you have kids, are a kid, or are an adult with a penchant for escapism, pillow forts have got your back. Stay in, grab those sheets and pillows, and make your living room a teensy little escape from the big bad outdoors. Who needs real life anyway?\nThings you need:\nDengue is no joke, and your repellent shouldn't be either. Make sure you slather yourself liberally with some quality mosquito repellent, because once the rain stops, stagnant pools of water become prime mosquito residential property. We're talking Barnes Place prime. We'd recommend you stay away from the harsher chemical household sprays and lotions, and invest in proper citronella oil. It's locally grown, sourced, and produced, so you'll also be supporting sustainable agriculture. You can also put a few drops of essential oil in diffusers around your home.\nThings you need:\nIt's raining. You'll be perfectly justified in cancelling all your plans, skipping obligations, and catching up on some literary loving. Storms lend themselves to poetic moods, and provide the perfect pathetic fallacy. Colombo's bookstores pretty much all stock the same stuff, but there are some\non right now which are worth looking into. Just promise us you won't buy 50 shades of grey. You can just look out the window for that (grey skies, not dubious fetishes).\nThings you need:\nHot brews of coffee and rain are a match made in stormy heaven. Colombo's lucky to have a whole new smorgasbord of lovely boutiques, restaurants and cafes open this year, but if you're not feeling upto braving the rain, then start brewing at home!\nThings you need:\nWho wants to cook or dress up to go out in this weather? Pizza is great sneaky storm food, perfect for battening down the hatches, getting under a blanket and watching a 3 hour period drama (or the Notebook, if you're alone and the storm is giving you the feels).\nThings you need:\n",
  "url": "https://www.yamu.lk/blog/5-things-to-do-in-colombos-monsoon"
}