{
  "title": "5 Things You Can Book Right Now",
  "abstract": "5 great things you can book online in a second - from car painting to indoor cricket!",
  "author": "",
  "date_published": "11:55am",
  "content": "Running errands, arranging appointments, and getting stuff done can be annoying - especially when you've got to book in advance! Check out\nif you want to book something.\nThey've also got this easy and convenient\non Facebook Messenger which works as a sort of personal assistant that you can use to book whatever you like from their site.\n\nAs of now, the site has a lot of listings and will soon become a full-fledged booking marketplace. Here are a few spots you can already book online in a minute or less!\nDon't get ripped off by auto mechanics again. Choose a reputed brand and technicians to maintain your vehicle at a fixed price, and at a time and date that's actually convenient for you!\nAdulting is hard work. You're undoubtedly battling work-driven fatigue, back pain, or general stress. Get yourself a proper, luxurious full body ayurvedic massage for as low as Rs. 3500 with no booking hassle.\nAlternatively, if you're thinking of booking an appointment with a tattoo parlour and don't want to go through the ordeal of using the phone, then you can choose from a number of places on the site!\nWhether it's a proposal, wedding, concert, or celebration, aerial flower drops are the final word in over the top romance! Book a time and date for your special occasion and have your event showered in gorgeous petals.\nWhen it comes to pet care, your pets deserve only the best. Book an appointment with a certified vet in no time at all. From consultations to pet sitting, they've got vets that'll do their best to keep your little friends healthy and happy.\nKeep up with your health appointments! Whether you want to book a dentist or an appointment at the gym, these guys pretty much have it all.\n\nStay tuned to the sponsor of this article,\n, for more of their listings, booking options, and other offers! If you're a business looking to register, just\n. You can also introduce your merchant if it isn't listed on the website.\n",
  "url": "https://www.yamu.lk/blog/5-things-you-can-book-right-now"
}