{
  "title": "5 Things Trump Could Learn From Mahinda",
  "abstract": "Here's a few lessons Trump could learn about being a bossman from Mahinda.",
  "author": "",
  "date_published": "1:37pm",
  "content": "Donald Trump seems confused that America isn't run like a family business. Perhaps he could learn a few lessons from Sri Lanka's former bossman, Mahinda Rajapaksa.\nThe Donald should wear just one color tie (red) and grow a moustache. Moustaches are powerful. If he can't grow a moustache he could just get a fake one, like his hair.\nProtection is also important. It is important to carry something magical, like a small golden mace. It is also helpful to wear more rings, and to tie various things around the wrist. Donald may have the Secret Service, but he's sorely lacking in protective amulets.\nIt's a bit late for this, but if you're going to exploit a government, it helps to have some experience.\nDonald Trump doesn't know how the levers of power work or even where the bathroom is. Thus he can't get normal government things done, like passing legislation through his own party, or writing executive orders that don't get immediately thrown out in court. Part of this is because he has awful or illegal ideas, but George W. Bush got plenty of those through because he knew how to work the system.\nThis is something Mahinda could have taught Mr. Trump if he just visited Beliatta for some kos and conversation. Mahinda was not an intellectual per se, but he did have decades of experience as an MP, Minister and Prime Minister. For being a politician, some political experience helps.\nWorking with siblings is fine, but avoid children. They tend to want high-profile jobs which contribute little besides bad press. Race cars? TV stations? Selfies?\n? Not helpful. Send your children abroad or hide them away.\nMr. Trump has delegated everything from relations with Mexico, peace in the Middle East and reforming the entire government to his son-in-law Jared Kushner.  Unless he can marry into Mexico, Israel, Palestine and 400 government departments, Mr. Kushner may not find his life experience that helpful here. Perhaps this is possible in Utah.\nMahinda could tell him, from hard won experience, that this is the wrong sort of nepotism. You should have brothers, strong brothers, well placed in politics, the military and business. Brothers you can rely on. Children are a liability.\nMr. Trump, however, doesn't have well-placed siblings. He should probably delegate these tasks to reliable lackeys.\nIf you're looking for an excuse for anything, war is a good one. Mahinda didn't start a war, but he was the first Sri Lankan leader to whole-heartedly wage it. While it lasted he also had cover for whatever he was doing... because the war. Afterwards, this became 'because he won the war', but that only lasted for a few years. It's better to actually be at war as people are ungrateful.\nThe US has actually been at war for over a decade now and Trump could continue it - bombing Muslim countries while complaining that Muslims are violent. Unfortunately, the American population is not that excited about killing random brown people anymore, though ISIS is a handy foil. It turns out war still requires a bit of paying attention and organizing stuff, which the Donald seems to struggle with.\nMahinda controlled the media through beatings, not tweetings. A few well timed disappearances can do wonders for your coverage. You needn't actually do anything yourself, just create an environment that encourages acts against the media and doesn't punish them.\nTrump's strategy of tweeting his dumb ideas drives traffic and revenue for the media while not really furthering his agenda. It can be better to administer a few beatings and watch your dumb ideas go unquestioned. If Donald wants some advice, Mahinda's brother Gotabaya is a US citizen and currently unemployed.\nActually, Mahinda's not doing much now either, if Mr. Trump wants a consultant. He is brown, but perhaps you could give him a letter to assure people that he's not a Muslim, so that they don't beat him instead. If Donald Trump wants to run America like a third world strongman, he might as well get advice from the best.\n",
  "url": "https://www.yamu.lk/blog/5-things-donald-trump-could-learn-from-mahinda"
}