{
  "title": "5 Tips For Eating Like A Chinese Person",
  "abstract": "Sri Lankans tend to eat Chinese food like it's rice and curry. The way Chinese people eat, however, is very different. We met…",
  "author": "",
  "date_published": "1:58pm",
  "content": "Sri Lankans tend to eat Chinese food like it's rice and curry. The way Chinese people eat, however, is very different. We met a Chinese national (who goes by the name Kasun) and went out to dinner with him to get some tips.\nThese are a few things that seemed important to him.\nKasun explained that he could usually tell everything he needed from reading the Chinese characters, what the protein was, how it was cooked, what style, what sauce, etc.  Another interesting thing, 'meat' on a Chinese menu seems to refer to pork, much like 'mas' in Sri Lankan food often default refers to beef.\nKasun also said that most menu items had four or five characters, which seems to be considered elegant and balanced. There's a lot of information in the Chinese menu that's lost in translation.\nThis tip is of course useless if you don't speak Chinese, but it's interesting to know.\nCopious amounts of green tea are served (and drunk) at most Chinese restaurants. As soon as a cup is finished we found it refreshed, but go easy, the cups are small but you can find yourself having drunk quite a lot without noticing.\nAt Min Han, we have frequently complained to the waiter that dishes randomly appear and the rice appears last. However, according to Kasun, this is how most Chinese like to eat - in courses. Dishes are brought out and shared as they're prepared.\nThe way Sri Lankans often eat is mixing everything together with rice (like we would with curries), but in many cases Chinese diners don't order rice at all. Kasun said that this means his bills often end up higher than mine because he's not getting full on rice, instead ordering more meats and veg.\nIt's a different way to eat, tasting each dish on its own rather than mixing them all together.\nWhen eating rice, Kasun said he uses chopsticks, but that's nearly impossible with a plate. He said most places offer bowls and people eat out of them, bringing the bowl close to their mouths to eat.\nSri Lankan waiters are used to going around the table and serving more rice and sides as needed. Kasun said that most Chinese people prefer if dishes are just left on the table so people can serve themselves. We tend to agree with this, and the rotating Lazy Susan's at the center of most tables make this easy.\n\n",
  "url": "https://www.yamu.lk/blog/eating-chinese-food-with-a-chinese-person"
}