{
  "title": "6 Idiots You Find In Traffic",
  "abstract": "Our Top  6 traffic violators, featuring photos from Sri Lanka Traffic Violations.",
  "author": "",
  "date_published": "2:24pm",
  "content": "Ah, traffic. It's hard enough without idiots on the road, but idiots there are aplenty. We pored through months of photos on\n(like!) to find the most common offenders on the roads. Here's the Top 6:\nNo creature is more endangered than a zebra crossing in Sri Lanka.\nCars will park on the zebra like it's dead, or they weave through pedestrians with blatant disregard. Sri Lanka also has constant reports of people being killed on pedestrian crossings, often children and families. It's just too much. Save the Zebra!\nTraffic? No problem. Just make your own lane. This is what the good folks at Sri Lanka Traffic Violations call the Idiot's Lane. Because it's for idiots.\nThe fun part about this is that the end result is usually no one getting anywhere. When you create a lane on the other side, you end up blocking traffic in all directions. Congratulations!\nLord defend us from Defenders. Todays VVIPs (VIP isn't enough) break every traffic law possible and act mad at everyone else.\nThe latest outrage is not the government convoys, it's people that put their own (illegal) flashing lights on the dashboard, to complement their high-beams and honking horns. This species is an offender in basically all categories here, plus some other novel ones, like abducting people.\nWhen you gotta go, you gotta go. This type decides they need to turn late and is quite happy cutting across every lane of traffic in order to do it.\nThere's actually a range of diverse offenders in this category. You have the chap here who has decided to enter traffic while traffic isn't moving, inconveniencing everyone.\nYou also have the head-starter, people that ignore turning lanes and just creep ahead, blocking lanes behind them, parking on pedestrian crossings, whatever.\nThen there are people who decide to take u-turns in the middle of traffic, just because.\nThese mysterious markings on the pavement actually mean something, they mean to keep the space clear. for many people, however, they regard it as just another part of the road.\nThe result, of course, is that no one moves. Traffic can be completely stopped but people will not leave the box clear. They'd rather move 2-inches ahead than let intersecting traffic get through. The result is congestion in every direction.\nThis is by far the most common offense on Sri Lankan Traffic Violations. Never mind people that can't drive, at least they move along after a while. People that can't park are the worst.\nAre those all the idiots you find in traffic. Of course not. Tell us if you can think of more, and check out\nfor constant amusement/sadness.\nThis post is also available in\n, and is brought to you by\n!\n",
  "url": "https://www.yamu.lk/blog/5-idiots-you-find-in-traffic"
}