{
  "title": "6 Must-See Foodie Instagrammers",
  "abstract": "Check out some of the island's most delectable food Instagrammers!",
  "author": "Imaad",
  "date_published": "10:03am",
  "content": "You've probably experienced the mouth-watering, stomach churning frustration when an amazing photograph of food turns up on your newsfeed.\nFoodporn is a guilty pleasure that proves a basic truth: we all love to eat with our eyes. I'm personally a fan of the top-angle shots, but there's many ways to get that perfect shot.\nHere are some foodie Instagrammers we've come across who constantly post absolute eye candy.\nSurovi loves to travel just to experience different cuisines. She's been to at least 23 countries and sampled their food. Her favourite cuisine to cook is Italian and her all time favourite Italian dish is Spaghetti alle Vongole with Bottarga. Her day job finds her working at Cake Labs.\nFavourite dish: Pork chops at\nDihan stumbled into food photography by accident. Starting out as an amateur street photographer, he found himself in an odd predicament when Coco Veranda called him in for a food shoot. He explained, \"I messed up that shoot but they were so nice, I got a chance to come back and try again.\" Today, he's a creative director at Exotic Melon and works as a food photographer.\nFavourite dish: Teriyaki Chicken at\nStyle in Sri Lanka is a cultural travel blog that strikes the balance between down-to-earth local experiences and luxurious indulgences. Run by British photographer Alice Luker, this Instagram feed is rife with beautiful visuals and a fascinating perspective on Sri Lanka. Alice has spent the past 10 years visiting Sri Lanka, and her depth of experience and love for brinjal is really intriguing.\nFavourite dish: Brinjal at\nHow do two crazy people bond? The two broke headliners met at a photography class at AOD. Hubble is a vegetarian and Shanaz eats just about anything. Together, they eat out and write and post pictures about their experience. They stand out particularly for their style of writing, which incorporates a lot of emojis.\nFavourite dish: The entire menu at\nA self-taught cook, Yashasvi loves to photograph food as much as she loves to make it. Her photos are legit camera phone photos, so this is as authentically Instagram as it gets. She's most inspired by new flavours and rare combinations.\nFavourite dish: Sri Lankan food, including street food.\nShakthi loves discovering brilliant takes on classic dishes and she's always up for trying something new. She'd like to show off Sri Lanka's growing food culture and culinary talent, particularly to those travelling to the island.\nFavourite dish: Black olive and feta ravioli at\nOh, and YAMU has its own Instagram, too.\nFollow us so you can feast your eyes on more foodporn, featuring staff cameos and stunning sunsets from our office balcony.\n",
  "url": "https://www.yamu.lk/blog/6-must-see-foodie-instagrammers"
}