{
  "title": "6 Things to Do If You Want to Move to Australia",
  "abstract": "Planning to move to Australia? Here's how to get a visa, a job, and a plan. ",
  "author": "Kinita",
  "date_published": "2:53pm",
  "content": "Great jobs, surfing, amazing dining, sprawling beaches, globally-ranked universities, breathtaking natural landscape, slightly crazy wildlife, and some of the best cities in the world. Moving to Australia is a no-brainer for most. As far as migration goes, it can be relatively easy, as long as you’ve done your research right. Here are a few steps you should go through, as a Sri Lankan considering moving.\n\nAs obvious as this may seem, just moving abroad to get away from your nosy aunty or overbearing parents just isn’t enough. What’s your plan? Do you want to work, start off at university, or start a business? Create a formal plan, start applications where necessary, and start figuring out what type of visa you’re aiming for. As a general rule, you’re far more likely to be approved for a residence visa if you are professionally qualified.\n\nPeople here vaguely say “Australia” like they’re going down to Dehiwala. In reality, Australia is a continent of its own. You may be abjectly unhappy in one city and perfectly content in the other. Factor in a bunch of things when you’re making your decision - weather, opportunities, costs of living, and even diaspora. Victoria, for example has some 44,000 Sri Lankans resident there, while New South Wales’ Lankan population numbers 24,000 and Queensland almost 7600. So if you want a piece of home, plenty of Sri Lankans to spend time with, lots of local shops and markets to eat curries and get paripu ingredients from, choose wisely.\n\nThe Australian migration point system is easier to understand than, say the rules of cricket (but don’t bring up Lankan cricket with an Australian if you want to assimilate). In total, you need 60 points in order to qualify for migration. Points are allocated for age, education, work experience, English language scores (IELTS, PTE), spouse qualification or studying in Australia. Alternatively, you can also get points for either a state or relative sponsorships.\n\nThere are certain professions that are in high demand or will qualify you for state or independently sponsored visas. Peruse the\n, and figure out where you fit in or what you’re qualified for. The most highly demanded occupations include IT, Engineering, Accounting, Architects, All Senior Manager categories, Building and construction professionals, Agriculture professionals, HR Professionals, and Trade workers.\nIf you’re the type that likes a new adventure and is keen to leave the motherland behind, you’re fine. If not, consider taking non-perishables to recreate a little piece of home.\n\nCheck out\nor even life in Australia. You’ll be surprised at the extent of online resources available. There are also plenty of services you can use in Sri Lanka that will guide you through the entire process, such as the\n.\nIf you’re looking for reasons to move, keep in mind that apart from Australia’s strong economy, you’re also going to be able to access world class medical facilities, educational and vocational opportunities of a very high quality. If that isn’t enough, both Sydney and Melbourne are often placed on the\n. Good luck with your planning and move!\n",
  "url": "https://www.yamu.lk/blog/6-things-to-do-if-you-want-to-move-to-australia"
}