{
  "title": "6 Things You Hate About Sri Lanka But Miss When You're Away",
  "abstract": "Proof that absence does, indeed, make the heart grow fonder.",
  "author": "",
  "date_published": "3:27pm",
  "content": "Ah, Sri Lanka. The motherland. A paradise island. Home of beach cricket, palm trees, and hot hot\nWhere the weather is warm and road\nrules are merely suggestions. It simultaneously enchants and aggravates you. But then you find yourself away from the island for education/work/general gallivanting and suddenly those things you couldn't stand while you were in Sri Lanka seem almost appealing when you're away. From risking your life in a tuc to Sithila's aunt's dog's vet's cousin telling your parents she saw you with 'that boy' again, here's a list of Sri Lankanisms we love to hate.\nAs Sri Lankan as overtaking from the left, telling it like it is is probably a requirement for citizenship. Whether it's an aunty telling you to 'go easy on the buffet child, your\nhas come out a bit' or your own mother telling you you'll never get a man 'dressed like that', Sri Lankans are stone cold savages. But it's only when you live abroad that you realise that beating around the bush is\noverrated - you'd rather give it to someone straight and be spoken to just as truthfully. Thick skin is your greatest strength in Sri Lanka - our brutal honesty even made it on to\n.\n\n\nFeel free to fight me on this, but no other country's politics has as much pure, unadulterated entertainment value as ours does. From fisticuffs breaking out in Parliament to a politician once tying a civil worker to a tree, Sri Lankan politics is in a league of it's own. Of course, living on the island and bearing the repurcussions of political gaffes may irritate you, but then you move away and realise how much you took for granted. Theresa May running through a wheat field has nothing on us.\nYou truly never know a good thing until it's gone. The very same aspects of living at home that you despised previously become the ones you miss most when you're away. You having to eat whatever's on the tables means you don't have to cook. Your siblings constantly roasting you becomes an outlet for any repressed aggression. And a curfew means you can be tucked in with Netflix by 10pm, legs shaved and group chat on mute. Winning.\n\nEveryone knows the all-too-familiar feeling of walking into a family gathering and immediately feeling eyes on you. Instinctively, you look to your left and, sure enough, there's a gaggle of aunties staring you down and whispering fervently, stopping only to start in on someone else. No one likes a good goss like a Sri Lankan. Being the subject of said gossip isn't great, but when you live abroad and need to catch up on 6 months of gossip in 3 hours, Sri Lankans are nothing if not efficient. Where else will I get a physical reenactment of the huge fight my neighbours had with their daughter on the street because she eloped with a white guy?\n\nLove it or hate it, Sri Lanka's got some things that you don't get anywhere else. So try to take full advantage of the country and all its eccentricities while you're here, because you're going to miss them all - yes, all - when you're away.\n",
  "url": "https://www.yamu.lk/blog/6-things-you-hate-about-sri-lanka-but-miss-when-youre-away"
}