{
  "title": "6 Things to Know about CIBF 2017",
  "abstract": "Here's a heads up about new features in CIBF 2017.",
  "author": "",
  "date_published": "3:10pm",
  "content": "The Colombo International Book Fair 2017 kicked off last Friday, and hundreds of bibliophiles all over the country are lining up towards the BMICH entrance like a bunch of possessed book hungry animals.\n\nNews has it that there're 300 - 400 local and foreign book stalls at CIBF this time, so our book lovers have all the more reasons to be overjoyed. You can find more details about the event on our\n, but first of all let us give you a quick heads up about the new features of this years’ book fair.\nAs you all might already know the Central Environment Authority (CEA) of Sri Lanka imposed a Polythene Ban with effect from 1st of September 2017.\nThe organizers of CIBF 2017 have implemented a strict no-polythene protocol, but yet some of the book publishers seem to be ignoring that.\nBringing your own bag to the book fair would be a useful act as it helps save the environment while avoiding unnecessary struggle of carrying so many bags in your hand.  You can simply buy a biodegradable bag at the entrance gate as well.\nUsually, the most spectacular English novel collections are presented by the Jeya and Makeen book stalls, but this time there’s one other place to pop in for that.\nThat’s M.D. Gunasena chamber of books which has a range of good and trending English novel collections.\nThe Sherlock Holmes stories written by Arthur Conan Doyle took readers to a whole different dimension. Chandana Mendis’s Sinhala translations of those books opened up that world to the Sinhala readers.\nUnlike in previous years, this time book fair doesn't have a separate room for Chandana Mendis publications, but his new book\nis available at most of the other book stalls. You can get it with 20% off discount.\nSusara Publications at J hall gives us an awesome deal this year. You can get a book folder for Rs.1000 and fill it with books as much as you like, but under two conditions.\n1) The selected books should be Susara Publications.\n2) They should be Sinhala translations.\n\nFour or five average sized books can be fit in this folder, which means you'll be paying only around Rs.200 for each book. They also have book folders made by their choice, which contain 3 - 7 books for the same price.\nThe Sinhala Bargain shops are located at N hall. Some of the popular local bookstores like Sarasavi, M.D Gunasena and Sadeepa etc. have established their bargain stalls here with pretty good discounts.\nSarasavi bargain shop has a range of old Sinhala and English books and they give 75% off for Sarasavi publications. A 50% off discount is offered by M.D Gunasena bargain shop, and most of their books are Sinhala novels and Buddhism related ones.\nHaving a visit to this section will save you a lot of money as every book stall here gives at least 40% off on their books.\nThe H hall is where you go for this.\nhas the biggest collection of books while Sarath Books has an impressive bunch of rare books for a decent price tag. There're two separate racks at Warnasooriya Book Depot, which are packed with some good novels for just Rs.100.\nApart from all the special bargain offers, all the book stalls at CIBF give 20% off on all books, and in some it’s 30% off. Prabha Publishers at D hall is one such place.\nSome new faces have been added to the front of food joints at this time’s fair.\nwith their hand made coffee, and\n, the homemade goodness of Sri Lankan cuisine are serving food at CIBF 2017.\nIf they don't interest you, there're enough stalls where you can find comfort in a cup of Maggi, KottuMee, good old Elephant House Ice cream, Coca-cola or even Nescafe.\nThere’s also a free foot massage service for our readers to sooth those tired and achy muscles after trudging around the crowded halls.\nSo there you have it; six new things to know about CIBF 2017. If there’s anything we’ve missed, please do let us know in the comments. Happy book hunting!\n",
  "url": "https://www.yamu.lk/blog/6-things-to-know-about-cibf-2017"
}