{
  "title": "7 Great Things About Living In Sri Lanka",
  "abstract": "Sri Lanka is 68 years free, and we took a look at things that rock about living here.",
  "author": "",
  "date_published": "7:18am",
  "content": "Following the news, or being stuck in the daily grind, or being caught in the usual doom and gloom conversation would lead you to believe that things are perpetually at 'suck' for Sri Lankans. But is this really the case? As modern Sri Lanka turns 68, we looked at a few of the many things that make us proud as Sri Lankans.\nSri Lanka was a \"pilot project\" in autonomy and\nadult franchise in the British Empire, starting with the Donoughmore Constitution (1931 - 1947). This means Sri Lanka has had \"one person, one vote\" for 85 years now, making it the oldest democracy in Asia.\nSri Lanka's national electrification ratio is 94%, up from 70% in 2005. While we have low fixed line penetration (thanks, SLT!), our mobile penetration is pretty high:\nWhile people do complain about the traffic in Colombo, expressways and roads out in the provinces are awesome: The A9 to Jaffna, the A6 to Trinco, the A11 to Batti, the A26 via the 18 hairpin bends, the A4 via Pottuvil... the list goes on. They're all great roads.\nNo matter how much people try to stir up the stir fry, Sri Lanka has a pretty integrated society. Everyone can name a handful of close friends from backgrounds different from their own. Sri Lankan neighbourhoods tend to be mixed, and everyone is connected through a mutual love for (and sharing of) each other's delicacies.\nSri Lanka is a welfare state. While the Americans are still figuring out the details on universal healthcare, we've had that stuff for ages. The average life expectancy of a Sri Lankan grew from 68.1 years in 1980 to 75.1 in 2012. Our Infant Mortality Rate dropped from 29 to 8 (per 1000 live births) in that same period.\nSri Lanka has free Primary, Secondary and Tertiary education. We have a literacy rate of 92%, the highest in South Asia. While the rest of the region is known for (sometimes violent) opposition to educating girls, Sri Lanka has the following stats:\nWhile frequent protests and a woefully underfunded system give an impression of the Sri Lankan university system failing, there are quite a few bright sparks as well.\nSri Lanka has been known throughout history for the quality of the spices that originate on these shores. It's no surprise that\nis also known for the variety of spices used in them. And there's so much regional and ethnic variety that no kid running a Sri Lankan stall at a world food fair should ever worry about lack of options. Just look at this beautiful crispy\nand reconsider your migration plans.\nDespite sometimes getting on the news for all the wrong reasons, Sri Lankans are pretty great people overall. We rank\n, there are annual dansals where people feed entire neighbourhoods for free, and pretty active\n.\nSri Lanka also\n. The numbers are so large that in 2014, Sri Lanka exported 2551 corneas to countries including China, Pakistan, Thailand and Japan. Even late president J.R. Jayewardene, better known for his 1978 constitution, donated his eyes.\nFrom the rolling, parallel hills of Sabaragamuwa to the chilly peaks of the central mountains, the rainforests of the Knuckles range to the savannah of Minneriya several dozen kilometres away, the coral reefs of the East, and the South, Sri Lanka has so much natural beauty packed into a tiny 66,000 square kilometre whole. You could literally go from bathing in an icy waterfall to surfing in a sunny, dry beach in the span of a couple of hours. There's not a lot of places in the world that can offer that variety.\nSri Lanka turns 68 today. There's a lot to be fixed and bettered in this country, but there's a lot going for it too. We're proud to be Sri Lankans.\n",
  "url": "https://www.yamu.lk/blog/7-great-things-about-living-in-sri-lanka"
}