{
  "title": "7 Places To Cool Down",
  "abstract": "So, where is Colombo's best A/C? Thermometer in hand, we embarked on a quest to find out.",
  "author": "",
  "date_published": "2:14pm",
  "content": "With global warming a hard fact, it seems like there's no escape the rising heat wave that's hit Colombo. We've had our A/Cs serviced to survive this onslaught, but not everyone has an A/C office to seek respite from the heat.\nSo, where is Colombo's best A/C? Thermometer in hand, we embarked on a quest to mark out the coolest spots in the city and here's what we discovered.\nI actually quite like this place. The drinks are affordable. Heladiv is great for pre-drinks if it's just two or three people. The place is quite small, though.\nAs kid-friendly as they come, there's plenty of space, indoors and outdoors for your kids to play while you escape the heat. Their decor is cute and the place is clean.\nThis library has always been a favourite escape. It's transformed, now, and much smaller than it used to be, but it's still cool and comfortable to hang around. It's a library, so you have to be quiet. Grab a book and while away the hours.\nStep inside and you're struck by the fragrance of essential oils and the gorgeous full bloom of colours that is Barefoot's aesthetic. It's both a treat to your eyes and your olfactory senses. Grab yourself a sarama, a book or spa items while you're at it. The really good A/C is downstairs by the ladies garments.\nIf you happen to be in Colpetty and you're looking for a place to chill out and grab a nice cold beer, hit Inn On The Green. It's never too crowded, and the music is not too intrusive. On Tuesday nights, they've got a great open mic night going.\nRegardless of whether you're a ManU fan, Cheers Pub is a certified cool spot that will hurt your wallet a little, but it's worth it. Grab a pitcher of beer and chill out while watching a match, dig into a burger and forget all about the outside world.\nWe're not sure how you'd go about spending too much time in a wine store, but, if you're chronically indecisive while being an insatiable wine snob, this is the place for you. The room with the premium wines goes as low as 16°C.\n",
  "url": "https://www.yamu.lk/blog/7-places-to-cool-down"
}