{
  "title": "7 Sri Lankan Artists On Instagram",
  "abstract": "Here's 7 Sri Lankan artists we found on Instagram whose work will surely make an impression.",
  "author": "",
  "date_published": "12:40pm",
  "content": "While Instagram might be most obviously used for photographs, it's also an amazing platform for artists to share their work, and more interestingly, their creative processes. As someone who dabbles in the visual medium, it's always cool to see a work in progress, or a photo of an artist in their studio. It's inspiring, and makes you wish you'd make the time to let your creative juices flow.\nHere's 7 Sri Lankan artists we found on Instagram whose work will surely make an impression.\nIsuri is an illustrator and comic artist based in Colombo. She's got an MA in Illustration to her name, and her distinctive style can be spotted from a mile away. The simplicity of Instagram's design and purpose is what she loves about it. She spends her time making illustrations, children's books and comics. Oh, and she has a beautiful voice and sings those gentle indie songs that you can't not love.\n25 year old Firi Rahman is a self-taught artist who focuses on monochromatic realistic drawings, working with pens, pencils and charcoal. He's been active on Instagram since 2012. He uses hashtags to target an audience of art lovers, and likes that people don't have to follow him to come across his work. He's found that sketches of celebrities bring in a ton of likes, and he's been inspired by other artists on Instagram. Following them has helped him learn about new techniques and materials. His Instagram has led to commissions for his followers, and even landed him a solo exhibition at the Saskia Fernando Gallery.\nSachi is a designer, illustrator and filmmaker with an ardent passion for comics. Most of his illustrations are done digitally with his artworks involving abstract subjects, pop culture, Sri Lankan yakas or a combination of all of the above. He mostly follows comic artists as it allows him to gain insight into their work process, turning Instagram into a learning tool.\nColombo's art scene is seeing an emergence of young, abstract artists taking on technically daunting tasks instead of focusing purely on storytelling and narrative. Kavan Balasuriya is one such artist. He's got a BA in Fine Art from the Central St Martin’s College of Art & Design, University of the Arts, London. His Instagram is a window to a world of reverse processes and monochrome. It's just quite out there and intriguing.\nRuwangi is an illustrator and muralist inspired by science fiction and the monsters in her head. She is responsible for the visual aesthetic of Jambutek Recordings, Sri Lanka's premier electronic music label headed by Asvajit. You've probably seen her work at the infamous Pettah Interchange parties, at the Rio, and most recently the Transworks House. She's also got a tumblr called\nwhere she geeks out on sci-fi, creating her own characters, usually riddled with existential crises.\nMuvindu is a casual anarchist when it comes to his artistic approach. His collage work is purposefully violent, presenting contradictions with juxtapositions. It offers a perspective on reality that's both aesthetically intriguiging and makes you think of its meaning. He's quite a creative force, being a filmmaker, music producer and visual artist, all in one. He's exhibited at Saskia Fernando Gallery, and he's currently working on his second exhibition, so look out for updates on his Instagram.\nShamanthi is a graphic designer by trade, though illustration is her true passion. As a literature graduate, it seems only natural that she's got a knack for editorial illustrations. She's a regular contributor to Indian Quarterly, with one of the issues\non the cover. Her style incorporates zentangles driven by actual meaning. She's currently working on putting together a body of work for her debut solo exhibition, so stay tuned.\nArt Space Sri Lanka, while curated, is an online portal that aims to include the best of Sri Lankan emerging talent, providing a platform for artists without gallery representation locally. We love that they've taken to Instagram, which only strengthens their concept of working without a gallery. Go check out their website, too, and get yourself some original Sri Lankan artwork.\nSo, there you have it. This is just the tip of the iceberg, though, so do hit us up with more Instagram accounts of your favourite Sri Lankan artists!\n",
  "url": "https://www.yamu.lk/blog/7-sri-lankan-artists-on-instagram"
}