{
  "title": "7 Things That Happen in Sri Lanka's Boys Schools",
  "abstract": "Ever wonder what happens behind the walls of an All Boys' School? From pranks to love letters, here's what goes on in the…",
  "author": "",
  "date_published": "12:15pm",
  "content": "We've all heard horror stories about the goings on of the Boys' School. It's a mad, mad world past that realm and many a tale of notorious pranks, and other shenanigans have been reported through the years. Here's a few things that happen in a day in the life of the average school boy.\nOkay, so this happens in every school across the globe, nearly every day. But the lads have a different way of going about it from doing it the classy way: casually sauntering out the front gates, or the crazy way: jumping right over the walls onto the streets.\nTake a trip down memory lane:\nUsually a favourite past-time activity for the more idle minds, this would involve a book and a crushed piece of paper (makeshift bat and ball) and of course, an empty classroom.\nThe idler minds would skip the empty classrooms and simply make do with a classroom where the teacher isn't present. Convenience is key.\nApparently there are certain scribes in each classroom who can be trusted to do the writing FOR you if you're a shy\nand don't know how to woo the girls with your limited lau vocabulary. The girls knew they were lucky if they got a lau letter from the scribe himself and would swoon (not really) at the clarity and juxtaposition of their declarations of lau (i lv u Tinu pls b my gf).\nThere were only two types of pranksters. The ones who didn't really do anything (writing slang on the board and then being forced to erase it after getting caught) and the ones who did too much (firecrackers in the bathrooms). Some of the most notorious pranks in Lankan history have been recorded as being played by Boys' Schools. Most of the perpetrators have remained anonymous to this day.\nSo men are generally prone to resorting to violence to solve problems rather than talking it out beforehand. Punches were thrown, nether regions met the hard kick of someone's knee, and of course the general drawing of blood. Fights in Boys' Schools were a whole other problem to deal with because most of the time intervention was nearly impossible.\nThis happens in all schools really, but it's worth a mention especially since 'eating is a basic human right' and students did not commit a crime by eating in class. This is in remembrance of all the good soldiers who lost their snacks after being caught out by the teacher. RIP.\nAhhhh the good old days when you can mercilessly torture a teacher and get away with it. A lot of the gents told me that that's what they miss the most about school life and I don't doubt them for a second. Stories about tying the math professor's shoelaces together, forging love notes from one teacher to another etc.\n",
  "url": "https://www.yamu.lk/blog/7-things-that-happen-in-sri-lankas-boys-schools"
}