{
  "title": "7 Things That Happen in Sri Lanka's Girls Schools",
  "abstract": "The mad world of Sri Lanka's all-girl schools.",
  "author": "",
  "date_published": "10:38am",
  "content": "Like me, if you went to an all ladies' school, then like me I'm sure you've gotten up to your fair share of devil's play. If you haven't, then I am so sorry.\n\nOn the outside, the walls remain silent and undaunting but whoa damn on the inside there's a trillion hair bobbles flying all over the place, catapulted from a ruler on the far edge of the classroom and all the tribal screams emanating from an unsupervised classroom could compete with the Aztec warcry.\nYeah, all-girls' schools aren't exactly the picture of innocence. The innocence ends after we've got past 6th grade, and then it's No-Man's Land. Literally.\nSo what exactly happens amongst the secretive walls of all girls' schools? Read on, and educate yourselves.\nHonestly. The loudest noise you'll hear is the teachers telling us to 'BEHAVE LIKE GIRLS'. And yet you had girls sitting atop the tables carving 'MCR' or whatever into the wooden desks with a paper cutter, flinging books across classrooms, and a lot of other delightful activity in the background.\nLOL this isn't true.\nFor some reason people seem to think that if they pack their daughters off to an all girls' school the whole BOY thing wouldn't be such a big problem, but it's the complete opposite. Boys had to be the MOST discussed topic especially since there wasn't a single male presence around for miles.\nYou know how we're pressured into behaving like ladies and hence have to keep our emotions all pent up? Well when we reached boiling point, all hell would break loose. Sounds of hair ripping, curse words, screaming, it was all pretty terrifying.\nThe toilets were a disgrace to humanity. Discussions about body issues, inter-cousin marriages, detailed descriptions of outings with male human beings and hormones. Hormones everywhere.\nThanks to the self-appointed Queens of the Classroom, and their loyal sheep following we knew just how to handle a tyrannical rule. We even had our guerillas who rose against the monarchy, and lost many a good soldier to the Gossip Battles and gunfire via threats to tell the teacher.\nCDs, Adult Novels,\n, sanitary napkins, notes during Math period, you name it we knew how to do it.\nSure there were times we wished we were in the company of any other wild species rather than female humans but most of us wouldn't have had it any other way. Most of us.\n",
  "url": "https://www.yamu.lk/blog/srilanka-girls-schools"
}