{
  "title": "7 Types of People You Get in Sri Lankan Buses",
  "abstract": "Meet the 7 types of bus people. ",
  "author": "Aisha",
  "date_published": "12:18pm",
  "content": "Half of us at the YAMU office are regular bus users, whether we like it or not. We generally do, but some of the time we don't because of these particular strains of people you get in there. (Not to mention the music/ TV either, which we'll write about it our next post). We end up discussing in excruciating detail about how annoying or perverse that aunty or boy was in the bus, so much that we decided we might as well make a post about the most notable few. The hilarious comics are by Shifani, who's clearly very good at this.\nHere they are, and let us know what others annoys/ amuses/ frustrates/ makes you laugh, too!\nThese guys like to spread out. Like a tree taking firm root after spreading forth and prospering (or not), these men just love spreading their legs poles apart. They make it a point to have the junction of their legs angled at 90 degrees or more, making it quite difficult for any other person to sit next to them. You can either keep nudging towards them hoping they get the hint and move over a bit, or you can sit with 3/4 of your body out on the aisle.\nOne word: Aunties.\nThough to be honest, even a few non-aunties are guilty of this. These are the people who are so unaware of your existence, that you practically don't exist to the point that their handbags literally takes up space which some part of your anatomy already occupies. If you're seated, prepare to have your head violently jabbed by an oversized handbag, though if you're standing, your back or your kidneys are more at risk. When seated next to you, they're almost as bad as the mansplayer in terms of taking up seating space, because those dang handbags generally shares it with you.\nYou get the lean-on-me-esque ones, and you get the sneaky elbow-when-you're-sitting ones. Quite common, these guys are the bane of every bus-girl's existence. They're annoying, they're frustrating, and they literally can get arrested for sexual harassment, so please do kick up a helluva fuss and make that man regret the day he suddenly decided to go out and feel people up.\nOne of Bhagya's pet peeves, these people who just stand the whole way when there's plenty of place to sit. And sometimes, they stand over the only available seat in an otherwise occupied bus. They basically act like a seat-blocker, preventing you from getting a seat as well, unless you ask them to kindly move aside. And then, when you eventually sit, they will stand right there, right\nThere's a limit to PDA, but these guys have clearly not heard about it. Going beyond mere snuggles, mothers avert their children's eyes, and little school kids stare in open-eyed wonder, suddenly bursting into giggles once in a while. They generally hog the\n, and everyone else who sits there gets bad rep; but as of recently, they've moved down the line and can be found everywhere. Meanwhile, we look elsewhere in discomfort, except when they're directly in your line of vision and you end up wishing they'd just get a room already.\nReally though, it's kinda awkward. Why.\nEarphones plugged in, staring dramatically and silently out of the window, unaware of the people and flurry of activity around him, this guy has tragically\nromantic scenarios following the script of\nplaying out in his head. His sad demeanor is quietly hidden away from his fellow commuters, but is quite visible to the passers-by in the street, and other commuters in other vehicles. Kinita loves examining bus-people's faces and wondering what their stories are. Who am I kidding, we all do.\nThen there's the rest of us,\npeople who enjoy observing their fellow commuters and learning about their lives. Quiet, with an earphone plugged in but playing the sound of silence. These guys are further complemented by those people who love shouting into their phones, or by those aunties and uncles who sits behind you and talks about Latha's daughter, and my oh my, isn't she a\ncase now.\nSo, that's our list of 7 types of people you meet on public transport. Let us know your favourite kinds of bus people in the comments.\nPlease take off your backpacks when in the bus, unlike Shifani's reused Bitstrip characters. It gets super annoying for everyone else if you don't.\n",
  "url": "https://www.yamu.lk/blog/7-types-of-people-you-get-in-sri-lankan-buses"
}