{
  "title": "7 Ways To Not Be Repulsive On A First Date",
  "abstract": "Pro tips on how to be less yucky on a first date.",
  "author": "",
  "date_published": "10:26am",
  "content": "Sure, you're not exactly a supermodel. Not even an Instagram model. Maybe not even a House of Fashion model. But being sexy is so much more than chiselled jawlines and luscious avurudu kumaraya hair. Frankly, we can't really help you with being more sexy - but we can help you with not being totally gross. Here are some tips to not turn off people around you (or your object of desire) when you're on your first date.\nThis is a tropical country. We're all a bunch of sweaty beasts at the best of times. No matter how much of a rose you think you are, chances are you're more of a rafflesia. Do the right thing for your date (and anyone/anything in a 5 km radius), and roll on some deodorant. It's like 200 bucks these days, you've got no excuse.\nSpraying on 3 and a half bottles does not mean you can skimp out on having that daily shower. Everyone can still smell you underneath the toxic fumes of mass-produced pheromones. Also, showers keep you healthy! You know what isn't sexy? A rash.\nThe mouth is the doorway to the soul. And also one of the key features of your face. If your teeth are hosting some gotukula or your breath smells like garbage the CMC has refused to pick up for a couple of weeks, you might want to consider keeping some mouthwash handy.\nThere's no point being a cutie to your date and then snapping/being nasty or condescending to your waiter, driver, or anyone who isn't in a position to snap back at you. It's a horrible indicator of your personality and chances are your plus one isn't going to think very highly of you. And your waiter will probs spit in your food.\nOr your Snapchat, or Facebook, or even Tinder I guess (but if you're Tindering while on a date, you don't deserve a second date). If you're with someone, it's just rude to be checking your phone constantly as though you'd rather be anywhere else, with anybody else.\nYou may love your mum dearly, and maybe even your ex, but waxing eloquent on the virtues, cooking, or booty of either of them isn't exactly appealing.\nWhether you've met the girl/boy/other of your dreams or you're just really keen on that big white wedding or whether you've already got a deposit down at the Cinnamon Grand, try and keep these deets to yourself for a few months. Jumping in with \"OMG this is my wedding song\" through your appetiser course is bound to be a bit unnerving for your partner.\n",
  "url": "https://www.yamu.lk/blog/7-ways-to-not-be-repulsive-on-first-date"
}