{
  "title": "8 Awesome Businesses by Women (Women's Day Special) ",
  "abstract": "This Women's Day we pay tribute to the awesome Sri Lankan women entrepreneurs behind some of our favourite restaurants…",
  "author": "Shifani",
  "date_published": "3:25pm",
  "content": "Women's Day is coming up this weekend so as a tribute, we've rounded up a couple of our favourite restaurants and businesses, run by some very special ladies. We sat down for a little chat with each of them, asked them about their stories, and for tips they would give to other young people who dream of being successful entrepreneurs.\nDunilsha Hewage is the youngest on our list - at just 21, she is the owner of Colombo's only big waffle house (there's also Wafflery but they're just so-so in comparison). Dunilsha kick-started her restaurant in 2014 and ever since, has enjoyed praise for her Belgian waffles, which are pretty authentic and made right in front of you at the counter (the waffles with whipped cream, strawberries and chocolate sauce are to die for).\nShe's expanded into cake orders too, and may soon be doing lunch orders as well. She cites her 'self-made' parents as inspiration for her work, and says being an entrepreneur is a lot of work and stress, but that there is nothing is more satisfying than working for yourself.\n\n: \"It's all about your personality - you have to know if you're the type of person who can handle the pressure and have the right attitude in the face of obstacles.\nBath Kade is one of our favourites, mostly because of the story behind this wonderful family-run business. It's literally somebody's house, inside a little by-lane in Bambalapitiya, and they have been serving people rice and curry since 1942. Chandana runs the kade now, it's a one-woman show when you walk in at 11AM at its busiest hour, and her mother, fondly referred to by regulars as 'Soma Akka' helps out.\nBefore Chandana, and before Soma, it was D. Adi Nona who ran the shop, and in fact founded it. Although Chandana's Aachi is no more, her bath kade has been kept alive by her daughter, her granddaughter and soon, probably Chandana's daughter too.\n\n: \"When I took over, this shop had only one table and just food in kitchen pots - I've now set up a glass casing, added more furniture, and tiled the floors... You need to keep at it and build on it.\"\nSaskia Fernando Hammoud is the owner and art curator of one of Colombo's most prestigious art galleries. Growing up in the family who owns Paradise Road Gallery, her love of art comes as no surprise. The concept behind the Saskia Fernando Gallery, she says, is to professionally represent and support artists, and to increase the professionalism of the Sri Lankan art scene. Having started in 2009, the gallery has hosted the works of artists like Chandragupta Thenuwara, Yohan Medhanka and T. Shanaathanan.\nThe gallery is a lovely platform for expression, be it paintings, sculptures or new media, and she hopes to see it expand into one that is more inviting to a wider range of artists. She envisions a future where, with the support of creative industries, artists are able to survive purely on the fruits of their work.\n\n: \"Confidence is very important - you need to be very sure of what you're doing. When it comes to the work space, it's important that women aren't too conscious of their gender, gender neutrality keeps things professional.\"\nI can honestly say I've never had anything that wasn't delicious, at Yumi Cake. The woman behind the recipes is Kiru Thavayogan Nelson. With a Business background, although she'd been cooking and baking for the love it for some time, she only mustered up the courage to quit her job and start-up her own business after joining the Good Market in 2013. Now at her shop in 2014, her brand taps into the void in our local market for special needs foods, like gluten-free and fat-free. She hopes to convey to her customers: that desserts can be tasty and still healthy.\nShe fondly recalls her grandmother in Jaffna grinding hibiscus into a recipe for hair-conditioner, and says natural and healthier substitutes like hibiscus and kurakkan have been in local use for centuries, and are just in need of revival in the commercial scene. Her menu has now expanded from just desserts to salads, savouries and recently even Jaffna crab curry, and she has collaborated with Chocoluv, Barista and Kapruka.\n\n: \"Know everything there is to know about your business - from how to sweep the floors to how to run the accounts. Remember, there is no shortcut. And for women entrepreneurs, I think it's important to learn to balance your different roles - you don't have to choose family or career, you can find a balance.\nSandra Wanduragala is our list's veteran entrepreneur and her business has had a phenomenal social impact. We couldn't meet her since she's in Kurunagala, but we talked to her on the phone about her experiences as a lawyer and the head of Selyn Fair Trade. She kicked it off all the way back in 1991, starting with just 15 women in a village - today the business is made of about 1000 members, and continuously creates sustainable jobs for weavers, mostly women, all over the country. She told us, \"I don't think there is gender preference in business - a business is a business, whether a man or a woman owns it,\" so it's kind of an equalizer.\nShe feels it's very important that we build forums, where women can discuss their problems and come up with solutions on a policy level. She also believes women don't have enough representation in Parliament, and that we need a grassroots support system for women who want to start-up from nothing.\n\n: \"Proper education is empowerment too. Women must be aware that it is a male dominated society we live in. They need to believe in their strengths, stay focused, and balance their different roles.\"\nNatalie Raymond took advantage of everybody's favourite local snack - achcharu - when she started selling her own recipes at the Achcharu Kade at the Good Market. At the end of 2014 she started up her own shop in Kollupitiya, where they do a classic achcharu, a very tasty healthy rice and curry, and a killer bombai muttai ice cream.\nWhat a lot of customers may not know about Achcharu Kade Cafe is that it creates jobs. Natalie, who has enjoyed cooking since she was 14, has had a passion for moving street-side fruit vendors off the streets and into more sustainable employment. So Achcharu Kade has collection centers in Gampaha and Dambulla where fruit, vegetable and spice vendors can sell their goods (used for AK recipes) for a steady, monthly income. They've provided incomes to 42 families so far, all women-led.\n\n: \"You need determination. You'll have to sacrifice your personal life a lot - but it is so worth it. Financially, for a start-up, have a backup plan, and also a backup plan for the backup plan.\"\nSome of the ladies on our list have got a good push in the right direction by the Good Market. So naturally, we talked to some of the do-gooders behind the Good Market too - Amanda Kiessel, Achala Samaradiwakara and Melanie Gunathilaka. The Good Market is great because it's completely non-profit, and dedicates itself to supporting a range of start-ups, from the Colombo 7 bakers to the rural craftsmen, as long as they make a positive social impact.\nBesides creating a great foodie space (Saffron, Achcharu Kade, Jeewa's etc.), and supporting entrepreneurs (most of whom seem to be women), the Good Market is also a platform for social enterprises. Groups like Elisa Gospel Handicraft and Happy Crafts use their profit as funds for those in need. The GM has also become an info hub for networking, where people meet up for causes like reducing waste, home-gardening, and raising awareness about people disabilities. Amanda puts it in a nutshell: \"The Good Market's core concept is to make it easier for people to make good choices.\"\n\n: \"Partnership and collaboration is important, as opposed to looking at other groups as competition. You don't always have to start big and flashy - start small and build on it quietly.\"\nOur last awesome business is run by 52 year old mother, grandmother, wife and tuk tuk driver Indani Gunasinghe. She's been driving a tuk tuk for the past twenty years and we think this is very cool, since as we all know, the tuk tuk world is mostly men. Besides her green tuk, there are also a few other daring woman drivers in Dehiwala and Moratuwa. Indani says we need more female tuk drivers and that there's a market for it - for women and children who want to feel safe when they travel.\nIndani also runs a textiles business in Ratmalana, ran a cab service of tuk tuks a while ago, and currently does food orders for special occasions as well. She smiles and says she has never had a problem while driving her tuk, that the male tuk tuk drivers in her neighborhood have been supportive and friendly. She lives in Attidiya, though she works from home so you won't find her tuk-tuk parked at a stand - you can call her for a lift on 0716 890 215. Shesays a woman driver can even park in the tuk-tuk stands, as long as she is conscious that she is a woman and is sure of herself.\n\n: \"There are lots of career and business opportunities available, don't be limited. An important quality to have is honesty and consideration, which as a woman tuk driver I try to practice when I'm transporting the elderly or children.\"\nThank you, to Sepali the Dehiwala tuk driver for helping us find Indani... who wanted us to mention he has three kids and that he studies martial arts.\nSo that's our tribute to a few of the many awesome Sri Lankan women out there who are doing something big in their lives. If there's a great story about a woman you know, share it with us in the comments.\n",
  "url": "https://www.yamu.lk/blog/womens-day-special"
}