{
  "title": "8 Ways To Reduce Traffic In Colombo",
  "abstract": "Traffic is one of the few major drawbacks to everyday life in Colombo. We look at how to reduce it short term, long term,…",
  "author": "Kinita",
  "date_published": "5:44pm",
  "content": "Colombo's got three big bads -\nWe can't help you with the blood-sucking pests or the mosquitoes, but we've brainstormed some great ways to get our abysmal traffic rates down. In the short term, you can:\n- Despite what you'd think, cabs actually do help reduce traffic even if you're taking them alone because they're a shared resource, usually hailed closest to you, and don't require parking. Also you can chill out and outsource the road rage. Try\nor\n.\n- Car pooling is great, but it can be logistically annoying unless your co-worker is your neighbour and is also super responsible. You also have to question whether you want to spend your off time chatting to colleagues. There's a reason Colombars are notorious for sporting SUVs with just one person inside.\n- We just heard that Ceylinco is launching a luxury shuttle from Colombo to/from Panadura, Kaduwela, Negombo, Kadawatha, and Homagama. It's apparently quite cheap, but you need to be a Ceylinco VIP policy holder. This is honestly a great idea and we're not sure why it's not more common. Alternately, if you work at a large company you can ask them what their transport policy is.\nYou'll notice we didn't mention taking buses or trains because in all honesty, people who currently take cars aren't going to suddenly switch to buses in the name of civic responsibility. Public transport needs to improve a lot to get people to switch away from cars. Also\ncan be pretty fascinatingly odd.\nLong term prospects are more interesting, and also harder for us to control as individuals. As we know all too well, copious whining makes for good bothal conversation, but bad policy change. Cities like Delhi use an \"\n\" system (predominantly used to battle pollution rather than congestion) which is meant to cut down traffic by half, but wouldn't quite work in Colombo where many families have more than one car anyway. Here's what could potentially help:\nThis will almost definitely never happen. Most of the country's posh schools are in the heart of the city, and part of the prestige comes with the Colombo 3/7 location. Most local schools used to have a zonal requisition, but that system, like our spirits, broke yonks ago.\n- Probably the most feasible and easily implemented of our long-term options, it would really just require a bit of public-private cooperation and effective scheduling.\nSome dissidents think this is the\n, a large-scale urban development project, but we know better. It's actually the implementation of a massive police force that will replace all traffic lights and miraculously ease traffic. Everyone knows how smooth traffic runs when policemen take over. All we need is more.\nMore likely than schools moving out of Colombo, a zombie apocalypse would streamline our population, reduce the number of people allowed to operate vehicles, and also cut down on office traffic because being dead gives you a good excuse to not go into work. If you need more information, refer to our incredibly detailed and researched\n.\nEfficient Public Transport - A proper, integrated system that interlinks amped up public buses, clear routes, train systems and light rail would take years to implement and a hefty amount of money. This would, however, lead to long-term productivity, better quality of life, and attract people to the country. Sri Lanka's current average personal expenditure on transport as a percentage of income is roughly 23% (\n), which is double that of other South Asian cities like Mumbai at 10.2% (\n).\nThe 23% figure is an average of lower, middle, and upper income brackets, which is terrible for economic growth. In simple terms, it means that on average, people in the greater Colombo area are spending about a quarter of their income purely on transport. The economic repercussions of an efficient and safe public transport system are clear - more disposable income, more free time, more incentive for employment.\nAs a\nsuggests, the four most important factors for good public transportation are affordability, accessibility, availability, and acceptability. Until we genuinely commit to the transportation infrastructure revamp despite the short-term ramifications (expense, construction disruptions etc), it looks like Colombo's problems aren't going anywhere. Just like your car at 6 PM in Welawatta.\n",
  "url": "https://www.yamu.lk/blog/5-ways-to-reduce-traffic-in-colombo"
}