{
  "title": "9 Places To Have High Tea In Colombo",
  "abstract": "If you're in the mood to spend an afternoon unwinding we've got a round up of the most well established high teas in…",
  "author": "Sandesh",
  "date_published": "12:54pm",
  "content": "Considering Sri Lanka’s colonial charm it is strange that high tea is a fairly new trend here. If you’re a part of English aristocracy or just someone looking to relax with your friends and spend an afternoon we’ve rounded up some of Colombo’s most well established places for high tea. Some are reasonable and well worth it, while others will leave you brewing at around Rs.1500++.\nThe English Cake Company is perhaps our favourite High Tea. We love it. End of story. Make sure you call them a day before to make your reservation though! For Rs. 990 per head (you need a minimum of two people) you’re open to a delicious, customizable assortment that comes in the form of stacks. Your first step is to choose your selection of four grilled mini-sandwiches. Next up you’ve got to choose your cakes, your selection of tart and finally your drinks. The ECC wins in most departments, and at Rs. 990 this deal is downright brilliant. They even let you take away what you can’t finish!\n\nTea at Uga Residence’s Rare is one of the newer entries into the Colombo High Tea showdown. The scones are the simplest but nicest part of the meal – the ideal delivery system for gobbling vast amounts of jam and clotted cream. We’d recommend their selection of teas especially the cinnamon and vanilla, which we quite enjoyed. The spread comes in three tiers of intense options such as lamb stew, oysters and even an interesting Jack Daniel’s ice cream which will not leave you hungry (they do offer refills of some items which we found unnecessary). At Rs.1500++ it’s one of the better high teas around Colombo at the moment.\nThe Kingsbury serves up a buffet high tea which still stays true to the elements you'd expect from the classic, tiered version. The bonus here is that you can just have snacks if you want (sandwiches, scones), or a full meal (there's chafing dishes full of meats, nachos and basically a full lunch). Also of note, they have quality tea and some nice cool drinks.\nThe location near the ocean is beautiful and the last Wednesday of each month they have the Sparkle fashion show (Rs. 1,950 on that day).\nThe Mt. Lavinia Hotel does an excellent take on classic high tea. The price is very reasonable, the terrace setting is beautiful and we found every element delicious. It’s available everyday from 3:00PM to 6:00PM at Rs. 1100 per head , and while it isn’t a buffet it is pretty reasonable. Their savouries were good and their sweets were excellent. Special mention must be made about their scone which was soft and rich with the sweetened cream and tartness of the berry compote coming together to make for a perfect marriage of flavours and textures. There may be an issue regarding consistency however since we’ve heard others complain about their high tea.\nThe Galadari is a sort of everyman's high tea. The food is nothing to run home and talk about, most of it is average, and none of it is bad. If you're just really hungry, there's the option of skipping lunch and just heading for this (we assume this is what most of the people here were doing, judging by the hordes), because essentially for Rs. 1300ish you get to eat a lot of food. While the meats can be tasty they can be disappointingly cold whereas sandwiches and sweets can leave you feeling on the heavy side with lots of unadulterated heavy carbs and sugar.\nCinnamon Lakeside isn't big on high tea. For Rs. 1760, you get three rows of snacks for two people, plus tea or coffee. It isn't much honestly, compared to other impressive high tea spreads in the city, but still, the savouries and sweets included are top quality. The mini chicken burgers, pastries and tuna sandwiches were all very well put together and tasty, and the strawberry tarts and red velvet cream-cheese cake stood out from the desserts. It's tasty, and it's Rs. 880 per head when you split it. Would not go all the way just to have the high tea here, but if you're in the neighborhood and looking for a happy midday snack at the chilled Cinnamon lobby, this is not too bad an option.\nThe Cinnamon Grand offers a decent spread at best, but given that it’s a buffet has a bit of value. The Grand’s high tea happens on weekends from 3:00PM to 5:30PM at Rs.1250 per head. While it doesn’t have the best spread The Grand will allow you to stuff yourself with unexciting, but decent cutlets, quiches, and creamy pastries. Their sweets leave a lot to be desired with everything apart from the scones bordering on the ordinary. Since the Tea Lounge is a small place we highly recommend making a reservation before you drop in. The atmosphere is pleasant enough with a live piano performance inviting you to relax.\nHigh tea at the Hilton is an okay affair altogether, though we recommend avoiding it on Thursdays during their fashion show. Their buffet spread offers some tasty options although some options like the savouries leave something to be desired. While their sandwiches have tasty fillings, the sheer thickness of the bread leaves any flavour lost in a mushy paste in your mouth. Sweet options appear to be the Hilton’s forte with their cakes, especially their chocolate options hitting all the right spots. While we didn’t find the tea particularly amazing, their coffee was certainly good. It can be a noisy and chaotic debacle since there are frequent fashion shows and the waiters themselves can be downright terrible in terms of service.\nTaj does a lot of things right, but high tea apparently isn't one of them. We had high hopes going in but what we got in the end was three tiers of disappointment. They offer three types of high tea menus priced between Rs. 750 and Rs. 1500 with more variety in the higher priced options. The spread itself isn't massive but we would have been fine with that had the stuff been good, but most of it was unimaginative and none of it really impressed us. The savouries were particularly bad with most of it being sandwiches with stale, dry bread. The service was also quite slow taking up to 20 minutes for the high tea to be prepared although what we got would have required very little prep time.\n",
  "url": "https://www.yamu.lk/blog/high-tea-in-colombo"
}