{
  "title": "A Backpacker's Guide to 3 Days in Jaffna",
  "abstract": "We plan out 3 glorious days in Jaffna on the cheap",
  "author": "Aisha",
  "date_published": "4:19pm",
  "content": "If you, like most of us, are generally broke but infected with the urge to travel as far and wide as possible, this blog could help you out. (If you're not on a low budget, congratulations!)\nHaving never been to the Jaffna peninsula, a couple of friends and I made a hasty decision to just up and go, and explore the place as much as we could. This wasn't a nice, relaxing vacation we were looking at — it was more of a hundred bus rides, low-budget rooms, bargaining with tuk tuks, and jumping onto free navy ferry rides (which is a nightmare), but more on that later.\nWhilst this is a low budget travel piece, we caved into booking a coach instead of taking a regular CTB. (T\n. We also checked for rooms on\n, and went for the lowest rates we could find (breakdown: split among us, it came to approx 2,500 bucks per person for three days, which is pretty sweet).\nNot a detailed post, but here's a rough itinerary of what you can do with a long weekend.\nWe recommend hopping into your bus/ train the night before and getting some shut eye, so you have a full three days ahead of you.\nYou'll arrive at J-town at around 5:00 - 5:30 AM. The bus drops you off close to the central bus depot. You can either trudge or hail a tuk to your rooms, or do what we did and walk along the Jaffna Fort and watch the sun rise.\nCheck in to the rooms you've booked, and grab a bit of breakfast. We checked Aakshathai out, which is a slightly pricey saiva option. Freshen up and then head out again. We decided to do out-of-town explorations in the morning, and reserve the evenings for walking around town so we'd make the best of whatever time we had.\nThis is the northernmost tip of Sri Lanka — it's kinda pointless making your way all the way to Jaffna if you don't stop by here. About 30 kilometres away from the Jaffna Town, you can hop into a bus (route number  750) and have a lovely hour long rumbly ride to PP. There's no way you'd miss the halt because it's like literally the last stop. The town is quiet, with a 'shopping mall' at the centre, and one large-ish eatery called\nwhere you can grab some drinks to cool down, and kottu to pump up (there may have been more but we didn't see those). Ask for directions (or just walk straight ahead on the mainroad) and you get to the beach, with this interesting signboard telling you how far it is to other countries and islands should anyone think of hopping a boat there.\nUnfortunately, we didn't get to visit the lighthouse... but we DID amble across some interesting ruins, and plenty of goats.\nRoughly about two kilometres from Jtown, this is easily accessible by a tuk (about 200ish rupees, they're kinda expensive at that end of the world). Drop into Lingam's ice cream parlour for some saccharine sweet drinkables, including their Nelli Crush. Despite its name, this doesn't contain any local gooseberries, and is more of the green-spiked syrupy liquid you get in Bombay Sweet Shops in Colombo.\nWalking around, you'll find interesting old ruins which are barely preserved — an archway to one of the entrances of the King Sangili's (the last king of Jaffna's) palace; the bathing pool/ dam used by his wife, and a crumbly but beautiful old building with Portuguese-ish architechture but no inscription or anything.\nAlso, the Nallur Kovil.\nA lesser scenic route than what you get on your way to Point Pedro is the route from Jaffna to Karainagar, which is where the Casuarina Beach strip is. About 22 kilometres away, this is also about a 1hr bus ride from the central depot (hop into the 782). The beach is interspersed with soft, willowy trees — the casuarinas, which is its namesake. We got a tuk from the bus stop to the beach, and negotiated with him to drop us back to J-town later than evening because the bus service stops at around 6.30 or 7.00 and we planned to be there for a few hours at least. Fortunately for us, we got a nice tuk guy and a good deal, who said he'd drop us off for Rs 1000.\nAn absolutely lovely strip of sparkling blue sea, what's even better is that you can rent out a boat (speak to the ferrymen there) and motor a few kilometres into the blue, where they give you goggles so you can wade among corals and then they take you out a bit more to a sandbank, where you're standing waist deep in water with no land in sight.\nTry this on a poya day, so you get the full moon on one end of the sea, and a blazing sun setting on the other. Price-wise, it costs Rs. 3000 an hour (for the whole boat) so we thought it was a brilliant deal especially when you split it among a group of friends.\nThis is a bit tricky, because there's just one Navy ferry which transports people to and from the Punkudutivu to Delft, and you need to be at Puns (a little island just past Kayts) by at least 7:30 if you're to have half a chance of getting it. Set your alarms up for like 5 AM, and make sure to be at the depot by 6:10 latest so that you can get the 776 bus which leaves for the Jetty at 6:20AM. The ride to Punkuditivu is breathtaking, especially as you get the sunrise when the bus bumps along the causeway. We tried doing this on Day Two, but the ferry was full so we had to turn back.\nHalf argue, half butter your way through the Navy officials to let you in, else they'll allow others who arrived after you to skip in line and then kick you out. Someone will also approach you discreetly, insinuating that they can let you in if you're willing to fork out a bit of cash, but don't let them extort you (also, don't bribe).\nYou get an hour's ride on the ferry. It should take less, but an engine was broken when we went so it was a slow and ardously crowded boat ride. You'll then land at Delft, a little island filled with coral fences, malnourished livestock, and a few wrecks left over from days of former glory.\nAn almost-around-the-island tour by one of the tuk uncles near the jetty is Rs. 1,500. Again, split among three or four people (they're not too strict about four people piling into one tuk), it's a decent deal because you get to see the landmarks with a guide. There's a mesmerizing beach there as well, which we weren't able to dip into because we had to turn back to get the 2 PM ferry back to land . We'd suggest you go straight to the beach if you're a water baby.\nWalking through, you'll find street food stalls which sells fried goodies — who'd have thought that deepfried garlic dipped in chilli and salt\nwould taste so good?\nTry exploring this throughout your stay whenever you pass through for the buses, because you're not going to get much time otherwise. By the time you get back to Jaffna Town from Delft (the Ferry reaches Keyts at around 3:30, then the bus from there to the town takes an hour plus if it decides to go slow), it'll be nearly five in the evening, which means you need to run back to your lodgings, wash, pack, and get ready for your journey back home. Strap on your backpacks and walk through the market to the depot, picking up what you'd like to get as you walk by.\nThis generally involves dried palmyrah produce (guys at work likes to call it edible wood), nun's wine, jaggery wrapped in woven palm leaves, and grapes. It could also include dried and salted prawns. PS: this won't create a stink, because it's packed quite well.\nAnd thus, we wrap up three days in Jaffna. You'd doubtless be able to visit more places if you have a vehicle sorted so you can get around sooner, but managing mostly on foot and public transport, this is as good as it gets.\nWe missed a few places (the library, lighthouse et all), but we're quite satisfied with the expedition overall. It cost each of us around Rs. 7,500 roughly, for three days and two nights. Not bad at all. (More pictures in the gallery, which is accessible if you click the camera icon on the top right part of this page).\n",
  "url": "https://www.yamu.lk/blog/a-backpackers-guide-to-jaffna"
}