{
  "title": "A Brief History of #InstameetSL",
  "abstract": "Almost everything you'd like to know about SL's Instagram meets.",
  "author": "",
  "date_published": "10:41am",
  "content": "Once upon a time, many years ago, a young man named Abdul-Halik Azeez sent out a tweet.\n\n\n\n\nplaying with the idea of doing an\nin\nwould you guys be interested?\nAnd that, ladies and gentlemen, was how #InstameetSL was born.\nThe Instameetups turned out to be an annual event, with smaller, unofficial gatherings happening every so often. It started off with exploring small pockets of Colombo (like the first one in 2013 was of the Maradana Railway Station) and by last year, had evolved into the regular biannual event  that everyone looks forward to, including a themed photo walk.\nAs one of the island's\nsaid, '\nThe idea caught quickly and was quite successful, except for the part where the Instagrammers were politely kicked off the railway premises because you need to pay for 'photoshoots.' Undeterred, they continued the walk in Pettah, wrapping up at dusk.\nInstameet Part Deux was, to quote on the historic streets of Kotahena\nFeaturing homeless kittens, churches, and candy coloured tuk-tuks, this saw about 20ish people at the beginning, with more joining and leaving as hours slipped by.\nA post shared by F I R I R A H M A N (@ifiri) on\nMutwal saw the group move a bit further away from central Colombo and into the periphery bordering the sea. The crowd gathered at the Whist Bungalow, walked along the weedy beaches, discovered mountains of garbage, and thanks to the blustery weather, got to capture an amazing double rainbow.\n\nA post shared by Thyagi Ruwanpathirana (@thyagir) on\nMore organized now, the Slave Island leg featured an informal panel discussion of sorts, with Menika van der Poorten, Amalini de Sayrah, and Malaka Pathmalal addressing the crowd who had gathered at the now non-existent Castle Hotel (the dodgiest of dodgy bars). The group was the largest yet, so they split into two main factions and explored the area before splitting at sundown, again. There were also ice creams and treats courtesy of Instagram, a boxful of which were hijacked by the neighbourhood kids.\n#WWIM13SriLanka coincided with a sufi poetry reading and a Good Market taking place at the Galle Fort. The first outstation meet, it had to be somewhere that was within a day's travel up and down from Colombo. Not many people made it for this though, and the resulting photos were way fewer than what we're normally used to expecting from a photo walk.\nWhile the Instameets are all about photo walks, Amalini and Firi played around with Instagram's 'food' theme assigned for the event and organized a food tour of sorts: starting off from the Colpetty Market and traipsing across to Galle Face for\nand wrapping it up with some brilliant street food fresh off Hulftsdorp.\nFollowing last year's successful food tour,\nand\nare cobbling together the next Instameet, this time in Negombo.\nAmalini pointed out that \"every day you spend on the app, hitting the Explore button or searching a hashtag, you come across another Sri Lankan doing something amazing with travel, food or social documentary photography, in their hometowns across the island and on amazing journeys. That's what it is about, at the end of the day —  self-expression, creativity and story-telling; and the Sri Lankan Instagram sphere is pulsing with all of that and more.\"\nDeets of the next Instameet will be up soon. For now, the only things we know is that it'll be in Negombo, on 26 March. Mark your calendars and hit it up!\n",
  "url": "https://www.yamu.lk/blog/a-brief-history-of-instameetsl"
}