{
  "title": "A Hitchhiker's Guide to Using a Bus in Sri Lanka",
  "abstract": "A 100% factual guide on how to use a bus in Sri Lanka.",
  "author": "",
  "date_published": "10:20pm",
  "content": "It's a truth locally acknowledged that any broke (or regular) person must be in need of a bus, that harbinger of earsplitting music, claustrophobia and anxiety, but which is conversely very good for your wallet and possibly the environment, so no complaints.\nI've been using it for a decade (or more), now. I was surprised when I took someone along on his first long-distance bus journey, recently. He was utterly confused by how our buses operate — or lack of any proper operational system thereof. It was an epiphanic moment, struck a second time: commuting successfully in a bus in Sri Lanka is a combination of skill and practice gained through years of experience until it becomes second nature.\nWith that in mind, here are a few helpful tips.\nWe don't use cards here (regularly, at least), nor do we deposit our fares with the driver as soon as we step into the bus. Keep small change in hand, and hand it over to the conductor when he walks over and stretches his hand out to you. If you know how much your trip will cost (like, for instance, Fort to Bambalapitiya is Rs. 20) there's no need for verbal communication at all — you just pass the exact amount of cash on and turn the other way. If you have\ndue back, continue to stare directly at the conductor's face and he'll give you the change.\n\nThis is a tough one. Like sea legs, you need be bouncy on your feet and develop bus legs; that ability to magically poise yourself and maintain perfect balance, regardless of the ground heaving and trembling under you. You\nget thrown around, even when you're sitting, so hang on tight for a very turbulent ride.\n... or in, for that matter. Buses stop at bus stops. This sounds obvious. But, given that we're in Sri Lanka where road rules are applicable only when it suits your mood, or when there's a cop in the picture, buses might also stop in the middle of the road when you're out-station and wave at it to slow down.\nIf you want to get out but don't know where your destination is, you can ask the conductor to inform you of the halt. If you know your exact destination, just walk over to one of the doors (preferably the front door right next to the driver so he'd know there's someone waiting to disembark) and stand there. Look around for a rope running across the length of the bus and pull at it, violently. Or, press the little buzzer on the ceiling to signal the driver and he'll pull to a halt (or slow down). Neither of these contraptions work, at times, so your safest bet is to just walk to the front and say\n.\nThis is thankfully simple. If you see a vacant seat and get there before anyone else, it's yours. If a pregnant lady, elderly person, or disabled person gets in, it's widely accepted common courtesy to offer them your seat. If you have the misfortune to be sitting directly behind the driver when a monk gets in, you're obliged to surrender your seat. Regardless of you being elderly, disabled, or pregnant, you are obliged unless someone else vacates their place first.\nBuses in SL are pretty cheap. By the rule of thumb, an intercity bus (an air-conditioned one) roughly costs about twice as much as a regular one, and has a fixed sum. You can travel over 10kms for 20 rupees, and to the hill capital with Rs. 150 — so, if anything within the vicinity of Colombo costs you over Rs. 20, just double check.\nOne of the great strange things about our country is that you'll know exactly where you are in a city or village. Almost all commercial buildings have their address on it and you won't need to keep your eyes glued to Google Maps. If you're traveling long distance, and are unfamiliar with the countryside, just look out of the window to know exactly which town or village you're passing through.\nMost buses in Colombo don't run on time — they just run throughout the day every few minutes, and lessen noticeably after 8PM. You're bound to get a bus every 5 minutes, at least, and, if you're out of town and in some remote part of the country, every 15 minutes or half an hour. There are as many buses in Colombo as there are fishes in the sea, except during Poya days and Sundays (and any Public, Bank, and Mercantile holiday) during which it's a bit scarce.\nWe have more bus-related content, from the\n, to\nto bus travel, and this\n. Also, keep an ear out for the\n(or save yourself the torture and plug in your earphones).\n",
  "url": "https://www.yamu.lk/blog/a-hitchhikers-guide-to-using-a-bus-in-sri-lanka"
}