{
  "title": "A Not So Short History Of Bambalapitiya",
  "abstract": "We take a look around the burgeoning bourgeois hodgepodge that is Bambalapitiya.",
  "author": "",
  "date_published": "10:43am",
  "content": "Fun fact: I was born at the\nin Bambalapitiya.\nWhile Indi galavants across the Colombos on his walks, the next being Colombo 4, I thought I'd take a look around the burgeoning bourgeois hodgepodge that is Bambalapitiya. If you read the map, you’ll probably notice a lot of English names among the Amarasekaras and Vajiras, but what’s the deal with all the Muslim road names?\nTake\n. A Minister and once High Commissioner in Pakistan,\n's mansion with its orchid gardens was sprawled across the end of the street.\n, his grandfather, was responsible for building the General Post Office (where Colomboscope was held) and the Colombo Museum. That’s what’s up.\nOh, and Muslim Ladies College was basically built on land and buildings donated by Fareed. Even his sister,\n, has a road named after her, i.e. Razeendale Gardens. It's a private road that leads up a garden path and can be used as a shortcut to college. Why was she important? Well, she was the first female Muslim Justice of the Peace in Sri Lanka (Ceylon at the time), having been appointed by the British Government before Independence.\n\nBut it’s not just your regular mainstream Muslim, Bambalapitiya is also home to a much smaller Muslim community, i.e. the Borahs, a people from Gujarat and Punjab, India, who migrated to Ceylon to do well in trade, industry and business. You can notice their influence with road names like\n. The community built\non Marine Drive. During Muharram, you can see Borah women in colourful purdahs walking along Galle Road en route to the mosque.\n\nBambalapitiya is actually very multi-cultural, with quite a few churches in its midst. The Portuguese built a church to Nossa Senhora Dos Milagros (Lady of Miracles) on Galle Road. The Dutch tore it down and raised a “Reformed” church, naturally. The British converted the church to a Presbyter, christening it \"\n\".\nIn 1903, the Bambalapitiya parish felt the need for a girls' English school. Archbishop Melizan invited the Sisters of the Holy Family to do just that. What started as a small school at “Clock House” on Lauries Road, would, in five years, find permanent residence at the “Retreat Bungalow”, extending over the years to become the sprawling space that it is today. It is now known as\n.\nOn April 1, 1970, three Bamba boys from De Fonseka Place, all three old Royalists, played\n. “Mother Superior expired. No school today\" a board on the main gate read, that morning. Mother Superior would have to call up the girls who stayed back and angry teachers, letting them know she was still alive and would see to it that the culprits were punished. Alas, she still had to close the school that day.\nUp until the noughties, and before Colombo’s barista boom, you’d find a lot of HFC girls flocked around a bus halt that, to this day, reeks of coffee. With age old equipment and hardly any business,\nonly exists because it’s one of the main producers of local coffee. The shop is a product of the socialist import substitution and it hasn't changed (or improved) since those days. They still serve a sweetened iced coffee for Rs 30.\nBut where are the Hindus at?\nWell, apart from being entertained by\nand\nat the\nand\n, you’ll find them at the “Saras” or\n.\n, rebellious schoolboys would gather here to smoke cigarettes and sip plain tea before heading off to Majestic or Savoy for the matinee.\nSaras used to serve food on banana leaves. Sadly, today, it's stainless steel.\nOf course, there a Sinhalese-Buddhist presence in Bambalapitiya, with the age old\nand the prestigious centenary\n(originally named Buddhist Girls' School).\nWhere you’d probably find a multicultural achcharu is the Bambalapitiya Flats where residents would meet at the bus stop, every morning, as they headed off to school or work.\nI don't know how well that sense of community has carried on, over the years, but this place was home to quite a few noteworthy characters in its time. It will soon be demolished to make way for a 70+ story building of some sorts. Sigh, talk about an upgrade.\nYou can still see the same shops that opened up with the flats, like\n,\nand a co-op run by people from the area. These will probably disappear along with the flats, but there is a cultural contribution that stems from the flats that will survive - a rather peculiar art form.\n'Tie and dye” was pioneered by a young mother of three in her home at the Bambalapitiya Flats. Inspired by blue seas and orange skies,\nwould expand upon Ena de Silva's work with pebbles tied in fabric and coloured. She would later innovate a technique known as \"Explosion\" batik that incorporated both batik and tie and dye methods to create quite a psychedelic look.\nOne of the lesser known gems of Bambalapitiya is the\n's Bar. They're open during the usual 10AM - 2PM, 5PM - 10PM timings, and serve arrack, beer, gin and the usual. It's not as cheap as a\nbut very affordable by Colombo city standards.\nIt's very quiet and attracts a much more mature crowd, mostly those taking up lodging upstairs.\nMore of a recent development is the famously accomplished\n. Its popularity has led to it being expanded by upcycling containers that would otherwise be used for shipping! Tuition classes are still all the rage, with parents sending their children here, and some seem quite happy to be in the co-ed environment. Quite naturally.\nJust next door to the flats is an old studio that is still operational. Once a cottage, the\nwas, at the time, equipped with modern technology, manned by a photographer who lived with his family at the back of the studio. The lawn and foliage used to be well maintained, but film isn’t making a comeback and neither is their gardener.\nHistory aside, here are two of my favourite places in Bamba. Commonly known as “The Zippo Shop”,\nis where serious smokers get their supply of paraphernalia, but it’s also got a great library of music and you can get CD copies.\nIt’s even got a funky mural on its shutters by\nthat comes out at night.\nOnce sufficiently lit, you might find amusement in the home of the infamous\n,\n, a world unto itself. Pretty much the closest thing to a mall in Sri Lanka, this is where boys go to loiter about, flirting away the hours between classes, or the hours skived from classes. It’s got dodgem cars, magic corn, a mediocre food court and a cineplex. What’s not to love?\n",
  "url": "https://www.yamu.lk/blog/a-not-so-short-history-of-bambalapitiya"
}