{
  "title": "A Quick Guide To Arugam Bay",
  "abstract": "Arugam Bay is a magical place on the East Coast of Sri Lanka. It's a bit of a trek, but it's worth it, whether you're…",
  "author": "indi",
  "date_published": "11:00am",
  "content": "Arugam Bay is a magical place on the East Coast of Sri Lanka. It's a bit of a trek, but it's worth it, whether you're a surfer or not. As it's hosting the\ncompetition now, we thought we'd do a quick guide.\nBesides that there's a lot of accommodation, though note that most of it is pretty basic. There is nothing five star here and it's not the sort of town where people hole up in their rooms. For more options check out\nor\n.\nAs a tip, you need to book early. There is limited room capacity and people book these places sometimes a year in advance. If you show up without booking anything you usually can find a place by asking around, but it'll end up being a super basic room with a hopefully functional bathroom.\nArugam Bay is a great place to surf, internationally great in fact. Red Bull is having the Ride My Wave competition there now. Even if you don't surf, the water is quite fun to swim in, but you definitely need to be able to swim. There are relatively still areas, but waves here can get quite big. It's not deep water and there aren't strong currents that pull you out, but the waves are definitely strong.\nArugam Bay has interesting nature stuff all around.\nGecko's also used to be good, but service has been a bit spotty as of late. The new Zephyr (a branch of the popular Mirissa spot) is also quite good.\nThis is a town where you can generally get good coffee and international surfer bites (potato wedges, shakshuka, schnitzel) all around.\nThe place to seriously party is Mambo's on Main Point. Basically every weekend they'll have something here. Something loud which goes all night. If you just want a beer, Siam House brews their own tasty varieties. If you want a more chill spot, Hideaway has a nice garden bar with a one-for-one happy hour.\nArugam Bay is a magical place. It's a bit far, but that's also part of its charm. It's best enjoyed for about a week at a time, swimming, eating and exploring the nature stuff around.\n",
  "url": "https://www.yamu.lk/blog/a-quick-guide-to-arugam-bay"
}