{
  "title": "A Walk Through Jaffna Market",
  "abstract": "Take a walk through Jaffna's main market for a taste of the city's unique flavour.",
  "author": "vidya",
  "date_published": "1:24pm",
  "content": "In my book, the nicest way to immerse yourself in a new town is by strolling through the local market. Not a supermarket, but an actual one, with vendors selling fresh produce and locally-manufactured goods, and customers coming for the timeless pleasure of buying them. You can learn more about the flavour of a place from being a bystander here than a guide book would ever be able to tell you.\nIt's no surprise, then, that on a recent trip to Jaffna, I began my exploration in the quaint, colourful and chaotic local market that is smack dab in the centre of town. I found a whole treasure trove of products that you'd be hard pressed to find in a cookie-cutter supermarket.\nThe latest food movement to take the world by storm is eating local — turns out, the Jaffna market is an education in doing just that. From palmyrah flour to peanut candy, most of everything you can buy is hyper-local, made in small quantities using locally available ingredients.\nIn nearly every store, for instance, you will find sacks of\n(literally, buttermilk chillies), pictured below. The sharp aroma of these dried chillies marinated in spiced buttermilk assails the nose when you walk in.\nIn a city that's notorious for its affection for saccharine sweetness, it's no surprise that you'll find sweetmeats of many persuasions. We were intrigued by these\n-like mini-globes made of\nor sweet, roasted gram flour, scented with cardamom. One chatty vendor informed us that these are especially nutritious.\nConsidered a symbol of the arid Northern Province, every part of the\nor palmyrah tree finds use in the region. The pulp is sweetened and dried to make\n, a uniquely Jaffna snack that is sticky, stretchy and bitter-sweet. You will also find\nflour (the base for Jaffna\n),\nchips and even colourful utensils and bags made of palmyrah fibre.\nAlthough they are available all over town, the market is the best place to stock up on Jaffna's luridly coloured and exuberantly sweet fruit cordials. One vendor who also turned out to be a persuasive salesman also sold us a bottle of Rosetto, a wine that is made by nuns of the Rosarian convent in Atchuvely, about 20 km from Jaffna. We went on a\nwild goose chase to find the source of the wine, but that's a story we'll save for an upcoming post.\nWe rounded up our walk with a pit stop (and unforeseen shopping spree) at one of the many dried fish shops that line the road that leads to the market. With large, dried fish hanging from hooks in the ceiling and stacks of smaller fish heaped into cartons, it's impossible to miss the sight — or stench — of this line of shops. Most of the dried fish is meant for export, we were informed by a vendor. Apart from paraw, sprats and other names we couldn't quite catch, you can also buy beautifully orange dried prawns (pictured below).\nIf you're the sort of person who obsessively checks to-dos off a list when visiting a new city, this may not be the outing for you. But if, like me, you'd rather soak in its flavours slowly, it's just the ticket.\n",
  "url": "https://www.yamu.lk/blog/a-walk-through-jaffna-market"
}