{
  "title": "A-Z Of Coffee In Colombo 2015",
  "abstract": "There are nearly as many coffee styles in Colombo as letters in the alphabet. Here's our coffee dictionary.",
  "author": "",
  "date_published": "5:08pm",
  "content": "\n\n\n\n\n\n\n\n\n\nIn a country that has had a centuries-long romance with tea, coffee is a recent upstart. There wasn’t really much of a coffee culture in Colombo even until a few years ago. But with a slew of home-grown and international chains opening up, caffeine-seekers suddenly have it better than ever before.\nWhat’s even more exciting? The coffee dictionary has expanded beyond the usual iced coffee and cappuccino, to niche styles such as\n(or Vietnamese-style coffee), the\n, the\n, and more.\nNow that there are nearly as many coffee styles as letters in the alphabet—okay, maybe that’s an exaggeration—we decided to put together a dictionary of sorts. Here’s our A-Z guide to all the coffee that’s available in the capital.\n\n\n\n\n\n\n\n\n\n\nQuite simply an espresso diluted with hot water, the Americano is the culturally confused cousin of the Italian espresso. (It is believed to have been created by American soldiers in Italy during World War II, making it neither entirely Italian nor totally American.) Lighter-bodied and less intense, it is perfectly suited for those who can’t quite handle the in-your-face kick of espresso.\n\n\n\n\n\n\n\n\n\n\nOne of the lingering legacies of France’s six-decade-long colonial rule of Vietnam,\nor Vietnamese-style iced coffee brings together high-quality Vietnamese coffee and sweetened condensed milk in one curious package. A small, drip filter is usually affixed over a cup containing a chunky layer of condensed milk. You wait for the hot brew to percolate completely, mix it up with the viscous condensed milk and add several ice cubes before you slurp up the strong, cold, bitter-sweet brew. You can also leave out the ice cubes and drink it hot, but it’s not as fun.\n\n\n\n\n\n\n\n\n\n\nA drink that inspires serious fanfare, cappuccino is also one of the most technical Italian coffee styles to perfect. (That’s probably why a good one is so hard to find!) It’s made of a single shot of espresso topped with an equal quantity of hot milk, and crowned with a thick layer of milk foam. Those who worship at the altar of coffee nerd-dom would tell you that for a cappuccino to be perfect, everything from the thickness of the foam to the size of the bubbles matters.\n\n\nBut here’s our rule of thumb: if the foam is thick enough to support a teaspoon on the surface for a couple moments, you know you’re drinking a good one.\n\n\n\n\n\n\n\n\n\n\nHailed as a\n, the cold drip is actually a centuries-old technique that has gained currency in the recent past. It involves dripping room temperature water (as opposed to the hot water that is generally used for most coffee styles) over coffee grounds at a very slow pace (between 12-24 hours), to create a intense and full-bodied concentrate. Usually served over ice cubes, this smooth and heady brew is a revelation that’s fully deserving of its cult status.\n\n\n\n\n\n\n\n\n\n\nA hangover cure par excellence and the basic building block of most coffee styles, the espresso is a highly precise creation that involves a delicate dance between fine coffee grounds and boiling water or steam that is forced through under pressure. Said to mean ‘pressed out’ in\n, serving an espresso as soon as it is brewed is crucial to its flavour. But that doesn’t mean you should call it an expresso — that’s just wrong.\n\n\n\n\n\n\n\n\n\n\nWidely credited as being an Australian innovation, the flat white has a similar composition as the cappuccino. The all-important difference is that the espresso is topped with a thin layer of foam, which means you get a stronger coffee flavour.\n\n\n\n\n\n\n\n\n\n\nLong welcomed into the fold of Sri Lankan classics, iced coffee is one of those styles that enjoys crossover popularity both among coffee snobs and the rest of us plebs. A decadent combination of brewed instant coffee and (oodles of) condensed milk, it is even occasionally jazzed up with a shot of brandy. The fact that it is inauthentic seems irrelevant to its mass appeal.\n\n\n\n\n\n\n\n\n\n\nUsing the universal principle of a drip filter, this style involves pouring hot water slowly over coffee grounds to extract a thick concentrate, which is then mixed with hot milk and sugar. Typically served in small steel tumblers at south Indian restaurants, Indian filter coffee is known for its theatrics – servers often pour it from one vessel held high above their heads to another one held lower, creating what is locally known as ‘metre coffee’. The perfect mix of coffee, foam and sugar, it’s no surprise that I am openly partial to this one.\n\n\n\n\n\n\n\n\n\n\nLike a cappuccino but minus the foam, latte means ‘milk coffee’ in Italian. Traditionally a larger cup than a cappuccino, the latte also includes a higher milk to espresso ratio. The milk is steamed to give the latte its characteristic appearance, also making the drink a canvas for\n.\n\n\n\n\n\n\n\n\n\n\n‘Macchiato’ means spotted in Italian, so this beverage is composed of an espresso shot with a spot of frothed milk on top. The milk dulls the blunt edge of the espresso, but only just — this is still an intense and full-bodied drink that punches above its (tiny) size.\n\n\n\n\n\n\n\n\n\n\nUsing the fairly basic principle of pouring hot water over coffee grounds and filtering it to get a smooth brew, the pour over has become something between an art and a science. (This entire\nis a paean to the pour over.) Balancing the coarseness of the coffee grounds, the temperature of the water and the quality of the filter might seem like too much work for a cuppa coffee, but if the purists are to be believed, it’s well worth the effort.\n",
  "url": "https://www.yamu.lk/blog/a-z-of-coffee-in-colombo"
}