{
  "title": "Achcharu Kade Cafe Closing (But Cooking Goes On)",
  "abstract": "Achcharu Kade Cafe graduated from the Good Market to their own shop in Colpetty, but now they're shutting it down.…",
  "author": "",
  "date_published": "5:49pm",
  "content": "Achcharu Kade Cafe graduated from the Good Market to\n, but now they're shutting it down. But don't worry, they're still doing\nand lunch and dinner delivery and take-away. So you can still eat the food, there just won't be a permanent shop.\nTheir reasons for downsizing are interesting and, in our opinion, commendable. We're publishing their whole press release here because we think it's an interesting read. Go on:\nIn November of 2013, The Achcharu Kadé was established in Colombo with the core mission of providing a sustainable income to women-led, single-income families living below the poverty line throughout Sri Lanka.\nTo this end, we established collection centres, and commenced operations with the purchase of home-grown fruit and vegetables in small quantities from 4 such women.\nAs the news of this small but significant initiative spread, we had inquiries for supply from more women, and now, eighteen months later we are proud and honoured to say that we provide a sustainable income to over 30 such women, enabling them to provide a respectable lifestyle for their families, and continuous schooling for their children.\nThe Achcharu Kadé is honoured to have been recognised for this social initiative with the award of 'The Upcoming Entrepreneur' for 2013/2014 by Women In Management.\nIn November of 2014, The Achcharu Kadé Café was opened in Colombo to rave reviews, and was named one of 'Colombo's Top Ten New Restaurants' by YAMU.lk, and even featured in the Wall Street Journal - no small feat considering we are merely home cooks, with a home kitchen!\nThe past 8 months has been an amazing journey, and we are honoured to have been recognised as being at the forefront of innovative Sri Lankan cuisine.\nHowever, our retail journey, must come to an end.\nWhilst we are honoured and humbled by the stupendous support and love from all our customers and our over 65,000 fans on Facebook, this unanticipatedly enormous demand, has made it necessary for us to re-think our brand values, and we have come to realise that in order to stay true to to the core vision and mission upon which we commenced this journey, it is necessary for us to downsize.\nThe current retail demand has exceeded our supply capacity, necessitating purchase of fruit and vegetables from commercial sources, thus depriving our supply chain of its income. This also poses a problem of maintaining our product integrity, as the required quantity of Organic produce is not available commercially.\nTherefore in the interests of staying true to our brand values, and sustaining our Community initiative, we have made the tough decision to close our retail doors, and downsize to a demand that can be met ethically.\nThe Achcharu Kadé will continue to operate at the Good Market on Saturdays, and will be open for daily lunch and dinner deliveries and pick ups as before. We also accept standing orders for lunch (with packages including options such as Rice, Pasta, Salads and Vegan Vegetarian and Calorie counted diets) We will expand our repertoire and make available more of your Café favourites at the Good Market in the new future.\nThe Achcharu Kadé was never a profit making venture, and we are proud of the management decision to forfeit personal ambition in the interest of continuing a dream born of love and empathy for these women in need.\nWe thank you for your continued support in this journey.\"\nColombo, June, 2015.\nEnd quote. Godspeed, Achcharu Kade.\n",
  "url": "https://www.yamu.lk/blog/achcharu-kade-cafe-closing-down-but-the-cooking-goes-on"
}