{
  "title": "Angampora: The Glorious, Traditional Sri Lankan Martial Art",
  "abstract": "Angampora is an ancient martial art that originated in Sri Lanka. Its lethal techniques and harsh discipline make it out to…",
  "author": "",
  "date_published": "3:32pm",
  "content": "The origins of\nare scattered throughout history. It's believed to be older than 33,000 years along with the story of Kataragama Mahasen, the brave Angampora warrior of\ntribe. Later at the time of Maha Ravana who was born to the same tribe,\nwas vastly expanded. It became more popular as it was introduced to Buddhist civilization.\nThroughout the time of King Dutugemunu, the ten giant warriors of his army\nused\ntechniques in the battles against the Warlord Elara.\nGotaimbara was one of the ten giants, and he had a separate conflict with Ritigala Jayasena, a powerful member of\ntribe. Gotaimbara tried to flirt with Jayasena's beautiful wife which led to a huge fight. According to\nGotaimbara had decaptiated Jayasena by a single\nkick to the neck.\nThe parties who taught\nfor latter generations were called\n. They arose during the Kandyan period as the need and the importance of\nwas increased due to British imperialism in Sri Lanka. There were two main\nin the country;\nand\n.\nA new administrative system was developed and the senior members of Gurukula were given titles.\n,\n,\nare a few of them.\nThe Kings also supported the improvement of\nby offering\n(villages granted for officers in King's service to carry out work in the name of the king). While some of the\nwere located at Matale, Harispaththuwa, Siduruwana, Udunuwara and Yatinuwara, the\nbelonged to\nwere established at Hewaheta, Udapalatha, Delthota and Rathmale.\nAccording to the contemporary experts in\nhistory, there have been six subject areas related to\nEducation.\n\nThey are:\n\n(Unarmed combat),\n(Armed combat),\n(Black and white magic), the Art of Dancing and Drumming, Herbal Medicine and Astrology.\n\nOver the span of time, some of these areas have been lost but the most parts of it have been preserved well by the passionate masters.\nThe term\nrefers to physical combat, and is essentially the martial use of limbs, but no weapons. It's categorized into three types;\n(offensive and defensive techniques),\n(grips and locks) and\n(Vital point attacks).\nhas eighteen offensive strikes that can do serious damages to the opponent, and seven defensive techniques to avoid punches from the opponent.\n,\n,\nare some of the popular offensive techniques in\n.\nIn order to disarm the enemy, make him weak or to kill, the\nstrategy is used. This includes putting grips, locks on opponent’s body parts like hands, legs, and head etc.\n,\n,\n, and\nare few of the many\nmethods. A proper\nwarrior should know all these, as well as the techniques to redeem from them.\nis the most important technique in\n. It is advanced and not everyone gets the opportunity to learn it, as this subject includes the study of crucial nerve point strikes. Such strikes require a certain amount of power and speed, and a fighter who is excelled at\ncan cause great pain to the opponent, make him paralysed, incompetent, swoon or give a quick death.\n\nTherefore, a few selected people who are trustworthy can study this, and they should swear a special oath by the name of Lord Buddha and Maha Ravana to not to use these techniques against anyone, unless it’s absolutely necessary. They also can’t teach\nto anyone with low qualities.\n, the art of armed combat is consisting thirty two weapons (\n) and divided into four main categories; Curved weapons, Circular weapons, Long weapons, and Blunt weapons.\nAn\nstudent should at least practice for two years before they learn\n, as it requires a great dedication and discipline.\n\nDuring that training period trainees got to practice with wooden swords at baby coconut trees, or banana trees. The archery training is done using targets drawn on trees, and swinging coconuts.\nThe British already feared the power of\n, and once they received authority over the Kandyan Kingdom they started massacring the fierce\nfighters of that time.\n\nFew members of main two\nwere able to survive this bloodbath, and continued practicing\nwhile teaching the later generations. The descendants of such families still live in Karathota, Ritigala and Awissawella areas.\n",
  "url": "https://www.yamu.lk/blog/angampora-the-ancient-martial-art-of-sri-lanka"
}