{
  "title": "Animal Welfare in Sri Lanka : How & Where to Help",
  "abstract": "Cute, furry, and homeless? Here's who can help. ",
  "author": "Aisha",
  "date_published": "12:37pm",
  "content": "It's not uncommon to find a box of kittens or puppies dumped on the side of the road. Pathetic, but it happens nonetheless as people continue to dump pups and kittens when their pets litter. Or when they want to get rid of a canine/ feline in the neighbourhood.\nDespite all this, there are very few shelters or rescues in the country, and it's pretty hard to get in touch with help when you need it. The organizations listed here are welfare organizations and assist in neutering, vacinnating, rehoming, and feeding strays. Donations are what keeps them afloat, so do contribute when possible. Contact details are included where available.\nWe hope this list will help.\n:\nCAR aims to work at ground level and help alleviate the suffering of the starving dogs in the Colombo municipal pound by doing the following:\n1. Provide a nutritious meal at least once a day\n2. Rescue, treat and re-home the pound dogs\n3. Raise funds to pay for the food and rescue of the pound dogs\nAdopt A Dog is a 100% voluntary run organisation relying on exernal donations and funding for its operations.\nThere is a group of trustees overseeing the various areas of activity as well as the overall running of the charity.The trustees are volunteers and receive no monetary compensation for their work. They meet once a month to ensure the smooth running of the charity and coordination of volunteers, fosters, adoption and all other aspects of the charity's operations.\n​\nPet Express's job is to relocate pets, but if you're overseas and adopting a dog from Sri Lanka, they'll provide immediate veterinary attention and\nContact details:\nContact details:\nContact details:\nContact details:\nContact details:\nTransforming Animal Welfare in Sri Lanka | Spay/Neuter | Vaccinations | Veterinary Care | Education |\n\nAs always, let us know what we've missed out on, and we'll add it on asap!\n",
  "url": "https://www.yamu.lk/blog/animal-shelters-srilanka"
}