{
  "title": "Art Therapy For Children",
  "abstract": "Our emotions are hard to navigate at any age. Vocalising these feelings and finding help is even harder. ",
  "author": "",
  "date_published": "10:36am",
  "content": "Our emotions are hard to steer through or make sense at any age. Vocalising these feelings and finding the relevant help might prove even harder. Imagine this very predicament for child victims from abusive environments. Using variants in the creative field such as writing and drawing, music,  sculpting and theatre have proved to be effective methods for treating children who have been victims of trauma and abuse.\nArt therapy is one of the more effective ways used to help children to health and better wellbeing and is a proven tool in assessing and treating a variety of psychological, as well as, physical disorders.\nArt has many benefits. An educator will tell you, art encourages motor skills, neural development, and develop problem-solving abilities. Art allows children to process their world, to deal with sometimes hard and dark and scary emotions in a safe way, in the very same way art is as therapeutic for adults.\nIf you are a parent, or a caregiver, a concerned teacher, who is looking for an institution that provides art therapy to help children either going through hard times or have gone through abuse, here are a few doors you can knock on to get the help you need:\nthe aim of Art Therapy Sri Lanka is to raise awareness in the field of art psychotherapy to be used as a tool to bring therapeutic healing through the use of creative expression. Telephone: 777681 838\nhelps kids with special needs through art therapy. Chitra Lane is specifically set up to cater for the needs of special children.  Telephone\n112 503 906,  112 582 758\nprovides art therapy for kids with special needs. This organisation is located in Galle. Telephone: 912 248 475,  773489222\nIs a not for profit organisation that teaches art to less fortunate and marginalised children in Sri lanka. Telephone:  779 946 450\nSamuttana which means renewal is an organization that works with capacity building in mental health around Sri Lanka. Telephone: 112 883 847\nEncourages creativity and freedom of expression of both children and adults. Shyamala is a certified art therapist. Telephone: 112 582 544.\nis an art education, art therapy & creativity development institution for children and adults. Materials and artist tools provided for regular classes. Telephone: 773017796\nIf you know of other institutions, do add them in the comment section.\n",
  "url": "https://www.yamu.lk/blog/art-therapy-for-children"
}