{
  "title": "Arugam Bay - How To Get There (Bus, Train, Car)",
  "abstract": "Arugam Bay is a magical place, when it's in season (roughly June to September). It offers perhaps the best surfing in Sri Lanka…",
  "author": "",
  "date_published": "3:51pm",
  "content": "Arugam Bay is a magical place, when it's in season (roughly June to September). It offers perhaps the best surfing in Sri Lanka but is also a great place for hanging out, dining, biking, etc. The only catch is that it's mega-far - at least 6 hours, but probably closer to 7 or 8. If you're going there, it's good (and easy) to stay for a while.\nIf you're going straight, there's one main route. As a note,\n. They take you down some terrible B roads. Always stick to A roads wherever possible.\nYou can also either go up and over (through Kandy) or down and around (through Matara). We've heard that you can also take the Expressway all the way to Matara then take the A2 to Tissamaharama and then take the Kataramaga Road thru to Buttala. This may be more pleasant driving, but would take an hour or two longer. Haven't tried it. Would not recommend driving through Kandy, but if you want to make a tour out of it that's a nice set of contrasts.\nIf you're have a car or motorbike that's best. You can rent cars for a pretty good day rate from places like\n. You can get a Maruti for Rs. 1,500 a day.\nIf you're staying at someplace in Arugam Bay, they often have vans running from the Airport or Colombo, call them and ask.\nThe Pottuvil bus takes 10-12 hours (!). It leaves from Colombo at 5 AM and 8 PM (we think, you need to check), from Colombo Fort. Costs around Rs. 500. Pottuvil effectively is Arugam Bay, it's the nearest town.\nThe train ride to Ella is incredibly beautiful... and incredibly slow. From there you need to hire a van (around Rs. 10,000, not sure) or take a bus (a few hundred rupees but slow). Again to Pottuvil.\nSo that's a rough guide to getting to Arugam Bay. Once you're there you can rent bicycles but most people take trishaws. If possible get a trishaw recommendation from the place you're staying. When it comes time to getting out, again try to go with recommendations if you're taking a van out.\nArugam Bay remains a trek to get to, but that's part of what makes it so great. It used to be even harder and, during wartime, actually dangerous but people still went. There's something magical about the waves and the climate and the whole vibe there that makes a day on the road worthwhile.\n",
  "url": "https://www.yamu.lk/blog/arugam-bay-directions-map"
}