{
  "title": "Baking Tips For Dummies",
  "abstract": " Here's a list of kitchen tips to help you out, you n00b!",
  "author": "",
  "date_published": "12:34pm",
  "content": "On certain days, cooking at the YAMU office doesn't go too well and the outcome looks something like this:\nIf you're lacking in culinary expertise and somehow end up with a congealed mess, then here are a few little tricks you could employ to (hopefully) help you out.\nIf you've never really understood the difference between the two, then just keep this in mind. Baking soda spreads a cake out and baking powder puffs it out.\nJust pop the cake in for 1 hour on Gas 4 (177 C). Check on it after an hour and if the top is a golden brown, it's done. Otherwise, just leave it for another 10-15 minutes and check on it periodically until baked.\nThen always remember this: when the time comes to start incorporating the oil into the batter, do it slowly and from a raised height; sort of like how tea is cooled off at a roadside stall. Indi calls this the 'kadé pour'.\nThe reason for this is because since oil is very dense it's best to drizzle it into the batter so it gets completely incorporated without having hunks of flour clump up here and there.\nYou'd be surprised at the number of people who don't actually do this. Try it and you'll probably never skip the cream again.\nA lot of the time people tend to use oil because it's a lot more accessible than good butter. However when you DO have butter to spare, go right ahead and use it for frying anything and everything. The taste will be amplified and the texture turns out perfectly every single time.\nMix the yeast and warm water required along with a little sugar and leave aside for 10 minutes. This activates the yeast and gives it a boost so it'll get your dough nice and fluffy. DO NOT mix yeast with salt, you'll murder the good bacteria found in yeast if you do.\nDo NOT knead too hard. Your hands must remain soft at all times and you'll know if the dough is right when the texture feels like your earlobe. Strange, I know but foolproof. Also do NOT punch in dough that has risen, this only kills all the hard work you've done and you'll end up with rock hard bread. It's best if you simply fold the dough in on itself.\nWhen making a cake ALWAYS powder your sugar (using a blender). This makes it easier for the butter and sugar to cream adequately. Don't fall prey to marketing tactics and spend money on castor sugar when it literally takes half a minute to make your own.\nI hope these tips are of some help to you. If not, then it's okay because not everyone is well-versed in the art of wielding the spoon.\nHere is a painting of what the kitchen looks like when a recipe goes wrong at YAMU:\nKeep in mind that what works for some people might not work for everyone so if your buns turn out wonky then please don't come after me with pitchforks and cricket bats.\nComment below with your own tips if you like and happy baking!\n",
  "url": "https://www.yamu.lk/blog/cooking-tips-for-dummies"
}