{
  "title": "Bathrooms in Colombo : The Good, The Bad, the Kakki",
  "abstract": "Bathrooms in the big papol : The best, the worst, and the very special.",
  "author": "Kinita",
  "date_published": "11:32am",
  "content": "Why are bathrooms so unappreciated? You spend almost\n(if you have a life span of 80 odd years) in the bathroom, doing everything from pooping, to showering, to shaving, to your make up. That's a large portion of your waking life.\nIt's how you start your mornings, it's your refuge when you want to cry, it's where you bond with other girls (this is only if you're a girl, otherwise that's a bit dodgy), it's where you regroup when your date kind of sucks, or simply when you need some assurance that people are laughing at your jokes and not the karapincha stuck in your teeth. Furthermore, basic bathroom facilities are globally often the fulcrum between\n,\n,\n.\nSanitation is important, but nobody ever wants to talk about it, and you're seen as crass if you do. What happens to the folks who have to reconsider their employment, leisure, or duties because they need the bathroom lots (pregnancy, incontinence, UTIs, are no jokes)? In the interest of not being colossally misguided prudes, we tried to find out: What are the best spots to hit the pot in Colombo?\nThe women's bathrooms are SO well equipped it's like your mum's Mary Poppin-esque handbag. Seriously, apart from being meticulously clean, the bathroom features everything from sanitary napkins to toothpicks to mouthwash. It also has super loud piped music so no one can hear your unladylike emissions.\nThe CG bathroom (the one in the lobby, near\n) is generally very clean, but it's also got lovely lighting, elegant mirrors, and a lilting cinnamon scent wafting through it at all times. Plus, it has a nappy changing station!\nWith fancy handwash, terry cloth hand towels, loads of space, and pretty ambience, this is a posh spot for your bathroom activities.\nThe hotel's new revamp has also sexed up their bathrooms. Rows of clean stalls, shiny mirrors, and flattering lighting, this bathroom is a treat for sore eyes (literally, because the lighting is so diffused).\nAt Rs. 20 a pop, these bathrooms are generally quite new, clean, well-located, and safe. However, the city definitely needs MORE.\nWe're not including the obvious ones at low-cost or dodgy establishments. You know what you're paying for then. *cough* Cleopatra\nFrom what we've heard, the men's bathrooms are an absolute mess, featuring flooded floors, cramped spaces, and a seated toilet space with a glass door that's only half frosted. Yikes!\nAggro Commie bathroom art, serial poopers, and wads of TP stuck in unlikely places. Do not recommend.\nNothing brews pseudo-patriotic jingoism and hatred like offending\n, who knew? Turns out we were right all along, because the authorities shut down and renovated the bathrooms a month after we released this video.\nWe really like Sugar Bistro. With friendly service, generous happy hours, and chill ambience, it's a favourite for a post work drink. HOWEVER they don't have a bathroom, so you have to traverse the labyrinth of Crescat and go down an escalator to get to their bathroom. Inevitably, if you're a solo woman, you'll be hissed at by one or two young desperate sorts, which dampens your chill drink sesh.\nThe department store's expansion means they've got heaps and heaps of dining, drinking, and leisure options. However, there's only one set of bathrooms around the back, one stall for men and one for women. Inevitably, there's a line, overusage, and annoyance. That being said, the bathrooms themselves are nice and there are always attendants in there trying to keep things clean.\nPurely on the fact that the bathrooms are \"only for foreigners\". Because less melanin = more right to basic sanitation\nFor such a massive area, there are no individual bathrooms in restaurants or salons, which means you need to walk all the way downstairs and to another area to access the constantly wet, constantly out-of-order bathrooms. There's always a gaggle of uninterested attendants hanging out though, so there's really no reason for the toilets to be in constant disrepair.\nFor a bar that holds a pretty legit number of people, just one bathroom for everyone is absolutely insufficient. Plus, it's a large room painted black, with fake orchids, spicy incense, and very very dim lighting (imagine a sexy opium den). Plus it's constantly occupied with people using it as a ...powder room.\nAs pretty as Jetwing's resorts are, their room designs lean heavily toward the exhibitionist side. It's alright if you're with your significant other, but not if you're with a friend or business partner. Bath tubs in bedrooms, glass walled toilets, open plan showers. It's all so very saucy.\nCASA's bathrooms are undeniably pretty (and they have Mentos!). However, operating the sink is an enigma. A beautiful wet enigma.\n",
  "url": "https://www.yamu.lk/blog/best-bathrooms-in-colombo"
}