{
  "title": "Battle Of The Bakeries (16 Bakeries In Colombo) ",
  "abstract": "Colombo is pretty big on baking shorteats and quick bites - here's our roundup of places to get some. ",
  "author": "",
  "date_published": "1:12pm",
  "content": "Colombo is big on bakeries - we really love our short-eats and cakes. Almost \nevery junction seems to have a Perera & Sons around the corner, and people are constantly\nlooking for new places for affordable baked goodies for their parties and\nbirthday gigs. Here's our round-up, from the institutions which have been around for a\nhundred years, to some of the newer contenders who've upped the game.\nThey've been around for a very long time -\nwe fondly remember stopping here in the '90s for an apple cake or an eclair.\nHowever, they have become rather lazy over the years - the short-eats are not\nbad, and the cakes have that distinct Sumanadisi smell of hardened,\nkind-of-oily icing, so the others on our list have effortlessly pushed it to\nthe bottom of our list. Regardless, it still remains on its feet, doling out\nbreads and short-eats to a loyal customer base. They also do hoppers at night.\nRoyal Bakery has been around for literally a hundred years. Sumanadisi's\nmuch more popular counterpart, it's trying a little harder, its short-eats and\ncakes are definitely better. Nothing outstanding but I personally enjoy their\ncupcakes and think this is one of the best places to get a big chocolate chip\ncupcake off the counter. They've also got a good, cheap biscuit corner offering\ngnanakatha and the lot, and they whip up fried rice and what not on the top\nfloor.\nThe Chariot is another bakery that seems to be popular for pastries over the\ncounter, though we've heard since their management changed their fare hasn't\nbeen anything to run home and talk about. Still, they've got plenty of branches so they\nare easily accessible - in Bamba, Dehiwala and the WTC, so if you're around and\njust hungry, they do some okay short-eats and rice and curry for lunch.\nSen Saal is more upmarket than the\nP&S/Sumanadisi type bakeries. They've got a wider range of short-eats, plus\nother things like waffles and salads, and also rice and curry. You don't get as\nmany pastries here as at the other bakeries, mostly buns, and they're not bad.\nThe rice and curry and nasi goreng are not bad either. Some things like the\nwaffles for Rs. 300 feel like a rip off, and the brightly coloured desserts are\nbound to disappoint. Sen Saal is not one of our favourites, but they're not\nbad, so their branches in the city are an option if you're in the mood for a\nquick bite.\nPerera & Sons is probably Sri Lanka's biggest bakery franchise. It's got \na warm place in most of our hearts for\nbeing a very reliable stopover for mostly short-eats. Though far from the likes\nof Tasty Caterers or Sponge, the fare here is still good, and consistently so,\nand now is easily accessible all over the city (and outstation too).\nBreadTalk made quite a splash when\nthey broke into the local bakery scene a few years back. They've got some great\nlocations and some of the best looking interiors of any bakery in Colombo, but\nultimately, never impressed us with what matters the most- the food. We've heard \nthat they've been regrouping, and some of their suburban outlets (like the one in \nNugegoda) seem to serve good snacks.\nThis is one of the oldies once again, and especially their\non Chatham Street is a place to be revered for its age and resilience\n(yes I take my short-eats very seriously). They do a very good rice and curry,\nand while their lamprais at the Bambalapitiya branch didn't impress us, the one\nat\nwas wonderful and worth going for. They do some decent\nshort-eats, but they're better known now for their lunch time buffet and hoppers.\nKlassy is another one of Colombo's handful bakeries that have consistently\nreliable fare. The shorteats are not amazing, but they're always good, and\nwe've heard great things about their home made garlic sauce, chocolate cake and \nbacon and egg pastry.\nLittle Star falls a bit short of its\nLavinian counterpart (the next entry), but is still a good alternative. While they don't have\nmany outlets, they do offer a good selection. One thing we particularly\nappreciate is the fact that they serve pork based products and the ones we\ntried were quite good. Their sweets weren't excellent, but LS is one of the few\nplaces that serve up local sweets like mung kavum and naarang kavum throughout\nthe year.\nThis was described by Bhagya as arguably the best mainstream bakery in \nMount Lavinia. The pastry pies here are particularly yummy, generous \nand authentic when it comes to the stuffings,\nwhile their white sauce rolls and kimbula bunis are excellent\ntoo.\nNow we reach the superior spectrum of our list. The Fab \nhas been around for a very long time, since the\nearly '80s, and to date is still a reliable bet for people in Colombo in search\nof good short-eats and cakes. They also have expanded into doing bigger meals\nlike burgers and pizzas, we haven't given them a shot though - they are better\nknown for their generously iced cakes, well-filled pastries and\n.\nSponge is definitely one of my personal favourites. Again, from the '80s,\nthis bakery is top notch and also the only one on the list that I think you can\nrelax at on comfortable cotton sofas or have a private meal upstairs. They do a\ngood maalu paan, Chinese roll and chicken pie, they've got plenty of veg\noptions too, they make custom cakes, and also a variety of bigger meals - we\ntried the chicken burger, and it's actually tender and creamy and quite good\nfor a bakery burger.\nTasty Caterers (who also run\n) is the reigning king of mainstream bakeries and I pray they\nwill continue to keep it up. I've never been disappointed by a single pastry,\nbun or eclair here in my life. Yes, it's as dramatic as it sounds. They also do\nsome very good hoppers, lasagna and a delicious rice and curry. This is an all-round \ngood bakery and the most reliable for quick bites and tasty lunches, all still\nsuper affordable. The chicken pies and Chinese rolls are very creamy and\ngenerously filled, and the eclairs are the best in town.\nThese are the big leagues, restaurants really, set apart from the small\nlocal pastry shops, but we though they needed to be on the list because they do\nsome very good bready bites. We're big fans of their\n, \nwhich are the best show of their skills at baking up short-eats, profiteroles,\net al. While Tasty still has my heart, I have to admit that Paan Paan is quite\ngood at what it does. They do delivery, and if you don't want the short-eats,\nyou can also get their signature sandwiches or subs in the Rs. 250 - 500 range,\nwhich generally feature airy soft bread, and toothsome cheesy generous fillings.\nDolce Italia was an unexpected surprise to crop up the corner of Havelock Road and \nVajira Road. It is a rare find: an affordable, but authentic Italian\nplace to have a snack at, or even a casual dinner. Your food is usually in the\nhands of the Italian chef, Manuella, so the stuff is bound to be good. Besides\nthe very cheesy, carefully cooked up Italian pastas and lasagne, this is a\ngreat place for a cool drink and pastries. The Danish pastries are soft, warm\nand buttery, you can get little frollinis (little gnanakatha-like sugary\nbiscuits), and very skillfully baked croissant-ish chocolate panzerottis,\nhowever these are going to be in the Rs. 200-300 range. They've also got a host\nof breads and croissants on the shelves available for purchasing.\nThe Bread Company is at the top spot on our list and remains\nthe best place in town to grab bread-based meals or choose from a wide variety of\nhigh quality, speciality breads. They offer a variety of different baked goods from fresh\nbaked bread (rye, nutty, multi-seed, etc.), burgers, some awesome sandwiches\n(chicken, egg, cold cut pork) and some really yummy cinnamon rolls for those\nlooking for something sweet.\n",
  "url": "https://www.yamu.lk/blog/battle-of-the-bakeries"
}