{
  "title": "Beat The Heat (4 Cool Foods & Where To Get Them) ",
  "abstract": "Here's a round up of places to get food that beats the bad Colombo heat, from ice cream to fruit shakes. ",
  "author": "",
  "date_published": "5:08pm",
  "content": "This April heatwave is official, says the Met Department. While there's a bit of relieving rain some evenings, the days are the worst - couple that with bad traffic and you've got yourself a stressful day. I tried to convince the people in this office that aluminium foil hats would work or that we should just invest in\n, but nobody is on my team.\nSo instead we've rounded up some places for food that can beat the heat.\nNothing like ice cream on a scorching day. If you're out and you want a scoop, here are all the good ones that do the job.\nCarnival, like Galle Face Green nearby, is almost always full. It is one of Colombo's oldest institutions and has its own constant flow - the ice cream isn't anything great but it's still cheap, and it's a fun place to hang out at.\nRio is another very popular ice cream stop in Colombo, cheaper than Carnival with a wider range, hailing from Jaffna. Again the ice cream is nothing fancy, but these guys do some fun combos with jelly and smarties so it's all good. For Rs. 250 you can get massive sundaes that you'll find difficult to finish by yourself.\nCremalato ice cream can be picked up at A&M, and we've also seen \ntheir tiny tubs at the Good Market shop. This is very high quality \ngelato and one of our favourites of the lot. They aren't available in \nscoops however, but they're on the list because they do delivery, so \nthey're just as easily accessible. Their brownie, coconut and cookie \nflavours are very good.\nFrozen at Arpico has got some ordinary, affordable ice cream. The location itself is a good choice on a hot day, it's a nice place to chill out, with Urban Kitchen's pizzas and Skrumptious' brownies nearby. There are fun, generous sundaes on the menu, for Rs. 300, making use of beloved sweet tooth favourites like marshmallow, smarties, Milo and peanut butter.\nWonderland is a little known ice cream shop all the way on the Malabe side of town. If you happen to be there, you'll notice it usually thronging with school kids who flock there for the cheap but wide selection of ice cream. Taste-wise, it's pretty average like Carnival, but they have a few fun flavours like Blue Moon which tasted like bubblegum, and the Faluda Dream that included a mad mix of vermicelli, jelly, sprinkles and kasa kasa.\nIl Gelato isn't just ice cream - it's gelato. This is the real stuff and the gelato been consistently great, with lovely flavours like pistachio and Oreo, however it's also unfortunately expensive. I might risk it in this terrible heat though. They've also got overwhelmingly icy slushies if you feel like a nice brain freeze. They're more widespread than the other ice cream places, with branches in Bamba, Kollupitiya, ODEL and Cotton Collection.\nCarino is another wonderful place for authentic Italian gelato, keeping with the same price as Il Gelato and about the same quality. You can read more about Colombo's two Italian ice cream dons on\nthat features the added bonus of Savan making incessant references to The Godfather. Besides Rajagiriya, you can get Carino tubs at Hyde Park Arpico, The Good Market Shop, Heladiv Tea Club and VOC Cafe.\nIf you're in Galle Fort, drop by\nand test out their wide range of wonderful, strong, quality flavours (Rs. 300 per cone), or get a tiny cup of affordable ice cream and a brownie to go with it at\n(Rs. 250 per cup). Frozen yoghurt is kind of like ice cream's twice removed distance cousin, so we'll mention that too - not a lot of places do FroYo, but\nat Crescat (Rs. 80) and\nat World Trade Center (Rs. 100) do a good one.\nFruits and fruit smoothies are great for battling the heat, and the healthier alternative to gelato.\nJagro is the only place in Colombo that specializes in cooling cups of fresh luscious strawberries, with plenty of cream and sugar, in everything from sandwiches to waffles to tarts. Can't think of a better fruity way to cool off.\nPaan Paan is known mainly for their breads and sandwiches, but they also stock cooling drinks like Cherine's Quench (try the narang) and new yoghurt drinks from Frutty Yo Yo.\nThe meals we've had at Health Factor involve plenty of cool, raw fruits and veggies. Our favourite was the Thai chicken with cool vermicelli and salad. It's nothing fancy but along with a nice icy glass of freshly blended juice, this place makes a healthy, cooling meal. Fruits and vegetables are generally relieving in the summer so for more options in this department check out\n.\nJuiceez is probably your most reliable bet when it comes to fresh fruit juices. There are a bunch of different branches all over (Colombo 5, Colombo 7, Rajagiriya etc), they've got a nice wide range of fruits available, and the drinks are generally thick and high quality. They also do a relaxing lassi made from their own CIC curd.\nJeorgie's isn't your typical place to go to for fruity drinks - it's basically a burger joint. But they make some of the best fruit smoothies we've had. We've had the avocado and mango smoothies and they were the perfect balm for a hot day.\nIce cream, fruits... and then Japanese food. Sounds random, but I was having some nice fresh raw fish at\nthe other day (great but expensive) and realized how relieving the stuff is on a hot day.\nA stellar preparation of Japanese food is not easy to find since the fish has to be really, really fresh (some kitchens even go so far as to kill the fish moments before serving). It's filling but still very light and cool and pretty much the antithesis of the Indian food and rice and curry that weighs us down on sweltering days. Here are our favourite places for good sashimi.\nTsukiji Uoichi is a somewhat unpronounceable Japanese restaurant that's set up in the new Independence Arcade. They have a great location and a very wide selection of sushi (and sashimi).\nNihonbashi Honten is the Godfather of Japanese cuisine. Their nicely air conditioned flagship restaurant serves up reliably tasty Japanese food and there's a sushi bar where you can sit and watch them make it.\nZEN is a newer Japanese restaurant located in the Zylan hotel on Rosmead Place. They have an experienced chef and the food is good. Note that while it isn't air-conditioned, it's an open space and there's good airflow.\nIf you want to stay home, Naniyori (part of Steamboat Nawala) does excellent sushi/sashim delivery (try their bento boxes). We don't necessarily recommend dining in, but getting sushi delivered is fun.\nSet in the well air-conditioned Kingsbury Hotel, the Ocean does a generous plate of sashimi.\nA chilled glass of beer can help wave off the evening humidity. You can read a more detailed review of beer prices and ranges in Colombo on\n, but these are our favourite places to relax and kick back with a brew.\nCheers, in the basement of the Cinnamon Grand, is thoroughly AC'd and their beer is frosty too. In normal times the temperature here is actually too cold, but around Avurudu season it's just right.\nIf you're detecting a pattern here, hotels tend to have good air-conditioning. 7 Degrees has a freezing interior and a naturally cool lakeside patio. It's also generally a happening place.\nMintage is a small, affordable and enclosed bar on Kysney Road (near Horton Place). You can drink and eat Chinese food quite cheaply here, and it's a good escape from the heat.\nSo that's our random list of cooling foods. If you've got your own tips for beating this heat wave of doom, share it with us in the comments.\n",
  "url": "https://www.yamu.lk/blog/beat-the-heat"
}