{
  "title": "Best Places To Shop This Avurudu",
  "abstract": "It's almost Avurudu so we're looking at some of best shops around offering deals and discounts.",
  "author": "",
  "date_published": "1:51pm",
  "content": "It may feel like 2018 just started a couple of weeks ago, but we're almost four months in. Kinda' scary, we know. You know what's not scary, though? Avurudu deals!\nYup, we're just about two weeks away from the Sinhala and Tamil New Year, so we're looking at some of the best shops that'll have credit card deals on offer!\nEnvoy Mansion and Hameedia are easily one of the best places for men’s shopping. They’ve got pretty much everything you’ll want from formal to casual clothing and an excellent selection of shoes. Their prices are on the higher end, but discounts between 10% - 25% make it quite reasonable\nWhile Dilly & Carlo cater to both men and women, Carlo usually has some excellent contemporary designs for men. They’re one of the few spots that has high quality tunic collar (Mandarin collar) shirts and we also recommend checking out their linen range.\nJump has been around for a while now but they've flown under the radar. They recently caught our eye with some very good looking contemporary men's casual clothing so we're adding them to the list. Be sure to check out their range of trousers.\nGalleria has a whole range of brands under one roof and they’ve always got some significant discounts during the season. While they offer some high quality brands, they also tend to be quite expensive. That is, unless they’ve got a discount on offer, making this the best time of the year to have a look. For gents we’re looking at\nand\nin particular.\nCotton Collection has been around for a while but they’ve managed to stay relevant by constantly updating their designs. They’re also one of the few spots around town that offers great variety for all ages, making it an excellent choice for Avurudu shopping in general\nFinding stylish ladies formalwear can be a task, but Mondy is one of the few that’s been leading the field for a while now. That being said, they’ve also got a more than respectable range of casualwear as well and their stores are well distributed so it’s pretty convenient.\nTo say that Mango falls in the higher end of the price spectrum would be a bit of an undertstatement. That being said, you know you're getting excellent quality with an internationally reputed brand. While it may not be an everyday shopping spot for most, it's definitely worth a look at when you can get up to 25% off.\nWe first featured Mimosa last year and they were a hit during the season, so we're bringing them back! Being a smaller brand their prices are also quite reasonable, so Avurudu discounts are just an additional incentive here.\nAs far as ladies undergarments are concerned, Triumph is as good as it gets. They’ve got an excellent selection whether it be for day-to-day or activewear, and an Avurudu deal is the perfect excuse.\nParfurmerie has both men's and women's perfumes, but let's be honest, the ladies appreciate it a lot more and they just make better use of it (don't quote us on that!). Perfumes aren't cheap so something along the lines of a 20% discount is actually a huge savings.\nSo we're putting down watches as a separate category since they're honestly one of the best investments you can make. We've got Fossil for folks who looking for modern designs that won't break the bank, Wimaladharma & Sons for those looking for solid Japanese brands like Seiko and Orient (which they get at insanely good rates) and finally International Watches for those more interested in the fashion brands like Emporio Armani, Michael Kors and DKNY.\nBranded sportswear can be quite expensive here in Colombo, but with the discounts around Avurudu it comes down to about what you’d end up spending in other countries. All the big brands like Adidas, Nike, Reebok and Puma will have deals going on and it really come down to personal preference between them.\n&\nThis feature is sponsored by\n. These are some of the offers that we really liked, but they've got tons more. Be sure to have a look\n.\n",
  "url": "https://www.yamu.lk/blog/best-places-to-shop-this-avurudu-2"
}