{
  "title": "Best Places To Dine This Season",
  "abstract": "Trying to decide where to dine during the season can be harder than you'd think. ",
  "author": "",
  "date_published": "11:21am",
  "content": "One thing we constantly get asked during the Christmas season is where to dine. This is actually harder to answer than you’d think because there’s a lot of deals and offers floating around. So, we put together a curated list of spots for different dining occasions, whether it be for a family sit down, dinner date, or even for larger groups.\nSince first opening up two years ago, Rare at the Uga Residence has been one of our top picks for fine dining in Colombo. They’ve got a sophisticated menu that they consistently execute well, making them a great choice this season for couples looking to celebrate something special, as well as for anyone looking to entertain family and friends visiting during the holidays to something a bit special.\nOneUp is a top contender for our ‘favourite new restaurant of the year’ title. So their addition to this list is no surprise. They’ve been excellent on each of our visits with impeccable service to boot. If you’re looking for a casual spot to meet some friends, grab a cup of coffee, or just have a really good brunch, OneUp is a must-try. They’re also sure to introduce some Christmas inspired dishes and drinks in December for those looking for something festive.\nA lot has changed since the time we first reviewed Asylum three years ago. They’ve really stepped their game up over the last year, introducing a bunch of new dishes along with breakfast and brunch. Their seasonal card deals combined with their daily happy hour from 5 pm - 8 pm make for some significant savings for those looking to grab a drink. Asylum has also become quite popular for their weekly salsa/bailando night and regular themed events, making them one to keep an eye during Christmas and NYE.\nChristmas is one of the best times of the year to check out hotel restaurants since most of them will either have their seasonal buffets, deals or both. OZO’s rooftop bar\nstill offers one of the best views in the city and they’re sure to have a seasonal buffet at\n. If you’re more of a brunch person, they recently began serving\nas well and the best part is that you can order à la carte (unlike most other hotels) and you get pool access, which is usually only for guests.\nFriday’s hasn’t tried to change too much since their launch four years ago, and it’s a decision we support. That’s not to say they haven’t changed at all. Over the years they’ve made progressive improvements to their dishes and added a few welcomed budget options as well. One of our favourite new additions is the bacon topped ribs which is a pork lover’s dream. It’s also got this really cozy vibe which would make it perfect for a family dinner during Christmas.\nUnlike the larger hotels in the city, Colombo Courtyard generally takes a more low-key approach to most of their seasonal offerings. So you’re not going to find a massive buffet here. However, if you’re more on the lookout for something a bit more private, CC is just the place for you. Whether it be lunch at\n, dinner at\nor drinks at\n, Courtyard has something for anyone looking to avoid a large crowd.\nFew hotels in Colombo do F&B as well as Kingsbury does. Although it’s not the biggest property, Kingsbury has managed to cater to pretty much every palette between\n,\n,\n,\n,\nand\n. They usually have their seasonal menus out around early December so it’s definitely worth dropping in, especially if you have nothing too specific in mind, since you’ll likely find something that fits.\nWith their most recent cafe opening up on Marine Drive, Tea Avenue has been slowly expanding both their reach and offerings. While they still have their signature drinks like the Ferrero Lavish, what we’re excited about are their seasonal tea blends which should be available soon. Their Barnes Place cafe is also just a really great place to chill and enjoy a cup of tea.\nPSM is what really put Park Street on the map for most people. Now with four other contemporaries just a stone’s throw away, Park Street in itself is a great option for a seasonal dinner or drink meet-up. What we really love about Park Street Mews Restaurant is just how consistent they’ve been over the years. The space looks great after dark and it’s one of the few places we’ve been able to recommend every year without fear.\n",
  "url": "https://www.yamu.lk/blog/best-places-to-dine-this-season"
}