{
  "title": "Best Value Dishes in Colombo",
  "abstract": "Here are some of our favourite bang for buck dishes in Colombo.",
  "author": "Bhagya",
  "date_published": "10:41am",
  "content": "We Colombars are all about value for money, exemplified by our beloved rice and curry. I mean that much food for like Rs. 150 is insane. Besides the multitude of awesome buth kades, there are others who offer some great bang for buck dishes and that's what this round-up is all about. The criteria is simple; great flavour and generous portions at a reasonable price.\nThis is a complilation of some of our favourite value dishes, but we're sure there are others that we haven't mentioned, so be sure to share your picks in the comments section.\nThe full rotisserie chicken is arguably one of the best roast chicken dishes that you'll get anywhere in the city. Hell, even streetside kade's  sell full chickens for Rs. 900 and those are tiny. Hazari's cooks theirs in their wood fired clay oven and the best part is that the meat was cooked perfectly, each of the four times I tried it, both at the restaurant and when delivered. This is easily enough for four to five. Get a few extra khubz to go with this and you're sorted.\nIf you're a fan of Japanese food but you don't want to spend upwards of Rs. 2000 for lunch, Naniyori's got you covered with their special bento. This is without a doubt the best value for money bento in Colombo. For just under Rs. 1000 you get 12 maki sushi (6 tuna, 6 cucumber), 5 nigiri sushi (3 salmon, 2 tuna), a small portion of kaisen don (think mini sashimi with rice), pickled veges and even a tiny portion of sago to cleanse palate. Is it the best sushi in Colombo? Definitely not, but at the price it's certainly good enough.\nGiovanni's was one of the best additions to Colombo's pizza scene back in 2014. They're most popular dish is the bacon and cheese pizza. At Rs. 1400 it isn't super cheap but it's one of the larger pizzas around, and it's packed full of bacon. Two slices of this one has more topping than an entire Domino's or Pizza Hut pizza. This is quite simple- unadulterated bacony goodness with warm, stringy mozzarella enough for two to three.\nChe Che's was one our best finds of 2015 and they are the definition of value for money. Not only are their dumplings outstanding they only cost Rs. 400 (for 10 jiaozi / 5 baozi). While jiaozi are generally available at most Chinese restaurants, a good\nis nearly impossible to find in Colombo, so needless to say, these blow the competition straight out of the water. They nail that perfect contrast of textures with spicy, well seasoned fillings (pork, beef, chicken or veg).\nIf you find yourself at The Good Market, Jeewa's and Kumar's is a must-visit. They offer a range of local staples, most popular for their polos and roti. These are a lot better than the run of the mill roti & lunu miris combos you find around the city. They're also one of the few who responsibly source their ingredients. At just Rs. 50 this is brillant. The roti comes thin so that it's got that crunchy texture with coconuty-ness still coming through and the lunumiris is absolute dynamite - a simple but superb lunch if you're a fan of this combo (and a fan of not spending much money).\nThe Dodol House is an awesome venture in Kelaniya - they not only make great dodol but they also deliver it to your house. The Dodol House makes their dodol at home (duh!) and it tastes amazing. It's very, very chewy and sticky though, so you need to go at it a bit with a knife, and it's quite packed and concentrated so you get a strong lovely fragrance of the coconut milk with the jaggery, and as you sink your teeth into it the little sugary cashew bits break the flavour up. Extremely oily and sticky, yet immensely satisfying. Oh and yay for free delivery.\nFor such small spot Indian Chaat Corner actually offers a pretty impressive selection of Indian street food. However, as the name suggests they're speciality is the chaat. Two in particular- the sev puri (Rs. 200) and the samosa chaat (Rs.200), are our favourites. It's pretty close to our office so we just look for any excuse to step out and grab these cheap delicacies. The sev puri packs so much flavour between the tomato, onion, cucumber, pineapple, coriander, potato and killer tamarind sauce, it's kind of amazing.\nMayura Hotel is as ghetto as it gets but they sure know how to cook up a mean crab curry. It arrives bright red and looking spicy as ever with a side of dynamite crab curry (my favourite part). Now usually crabs piss me off because they're so delicious but you need to pick at them incessantly and I personally don't feel like there's ever enough meat in there to compensate for all the manual labour it took to retrieve it. This crab, though not jumbo or anything, an ordinary size, was loaded with extremely soft and spicy flesh, and as authentic as Jaffna crab curry gets.\nArabian Knights' shawarma platter kind of caught us by surprise when we just ordered it to the office for funsies. For Rs. 2200 you get five shawarmas each with a different flavour. The good thing here is that each shawarma is pretty large and the fillings are very distinct with two variants each of chicken and beef, and one falafel. The wrap itself is not too thick with a light crunch, so you're not stuffing yourself full of carbs, and the flavour of those fillings are highlighted.\n",
  "url": "https://www.yamu.lk/blog/best-value-dishes-in-colombo"
}