{
  "title": "Best Places To Get Steak In Colombo",
  "abstract": "A good steak is hard to find in Sri Lanka, but not impossible. Here are a few of our recommendations on where to get…",
  "author": "",
  "date_published": "11:49pm",
  "content": "A good steak is hard to find in Sri Lanka, but not impossible. Here are a few of our recommendations on where to get steak in Colombo.\nSteak is what they do here. The London Grill restaurant at the lower level of the Cinnamon Grand has never let us down. The steaks are soft, the sauces and sides are pro and they cook everything perfectly. A sirloin is about Rs. 3,500 (seems to be the average price around town) and they have a full selection of cuts.\nNow, we haven't tried the steaks here recently, but these places come highly recommended. Basically, all of the hotels will take a good shot at steak, at about the same price point.\nSoveriegn German is a hidden gem on the Nawala Road in Nugegoda. This somewhat kitschy restaurant is run by Germans and does meat well - pork, chicken and beef. Their steaks are quite good, and affordable.\nEcho is the Cinnamon Grand's excellent Italian restaurant, and we've heard they do a mean steak.\nEverything at Sizzle sizzles - the food, the drinks, the desserts. This is a fun night out and beloved by a lot of people. They do a good sizzling steak.\nBavarian - the German restaurant near Galle Face - is a carnivorous carnival. This place is known for their pork, but they do a decent steak as well - with hefty servings of sauce and potatoes.\nWe've actually had mixed experiences with the steak here, but Friday's the chain is known to do a good one. We'd say the Sri Lankan rendition is about average.\nBijou, in Negombo, is obviously not in Colombo, but with the expressway it's quite close. This Swiss run place does an excellent, generous and quite affordable steak, along with other meaty European delights. The owner Dolly is charming and we highly recommend this place if you're in town, or just want a weekend jaunt.\nIn Sri Lanka the definition of a good steak is somewhat different than perhaps abroad. We define more but what it's not. A good steak, to us, is not chewy, can by cut in less than four strokes, and basically isn't difficult to eat. A lot of local beef is tough, but not necessarily. Depending on the cut and how you prepare it even local beef steaks can be good. Similarly, imported meat doesn't guarantee a tender steak.\nNote that in other countries they look for a lot more than tenderness, indeed, different cuts are less tender but have more fat. We don't go into that detail here. We're basically looking for whether you can chew it and if it tastes good. At the excellent level, we're looking at Matrix level good, something you might betray the human race for.\nIf you really like steak, you may be surprised at how much cheaper it is to make at home. Most supermarkets sell imported beef, but if you want to get it where the restaurants do, try\n. They supply excellent steaks, among other things, though perhaps not one at a time. You can always freeze steaks, and they're actually supposed to\n(by frying in oil and then putting in the oven).\nSo that's our impressions of the steak scene in Colombo. It's limited, but you can still get a great one if you look. If we missed anything, please let us know (Food Terroirist, that's your cue). If you're more interested in places to get\n, we've got a list for that too.\n",
  "url": "https://www.yamu.lk/blog/best-places-to-get-steak-in-colombo"
}