{
  "title": "Best Places To Shop This Season",
  "abstract": "It's not Christmas yet, but  the seasonal deals actually start mid November! Here's a look at some of the best deals…",
  "author": "",
  "date_published": "1:34pm",
  "content": "It’s a bit too early for Christmas, we know. The great part though, is that a whole bunch of shops have some solid deals coming up. So we thought we’d give you guys a heads up on what to we feel are some of the best spots to keep an eye out for throughout November and December.\nEnvoy Mansion is easily one of the best places for men’s shopping. They’ve got pretty much everything you’ll want from formal to casual clothing and an excellent selection of shoes. Their prices are fine as it is, but discounts between 15% - 25% just make this an absolute steal.\nIf you’re a bit old school with style choices Crocodile is an excellent option. They’ve got one of the most recognizable range of polos along with an excellent selection of formalwear and leather shoes. They’re generally a bit pricey, but the seasonal deals make it quite reasonable\nWhile Dilly & Carlo cater to both men and women, the carlo usually has some excellent contemporary designs. They’re one of the few spots that has high quality tunic collar (Mandarin collar) shirts and we also recommend checking out their linen range.\nGalleria has a whole range of brands under one roof and they’ve always got some significant discounts during the season. While they offer some high quality brands, they also tend to be quite expensive. That is, unless they’ve got a discount on offer, making this the best time of the year to have a look.  For the gents we’re looking at Levi’s and Tommy Hilfiger in particular.\nThis one is specifically for guys looking to update their footwear. They’ve got probably the widest range of shoes on this list and their quality is on point. Their stuff ranges from Rs. 12,000 - Rs. 20,000 so seasonal deals actually get you some pretty great savings.\nCotton Collection has been around for a while but they’ve managed to stay relevant by constantly updating their designs. They’re also one of the few spots around town that offers great variety for all ages, making it an excellent choice if you’re looking to buy some Christmas clothing for friends and family.\nFinding stylish ladies formalwear can be a task, but Mondy is one of the few that’s been leading the field for a while now. That being said, they’ve also got a more than respectable range of casualwear as well and their stores are well distributed so it’s pretty convenient.\nKelly Felder has been one of the most popular ladies clothing brands in Colombo over the past two years, and for good reason. They’ve got some great contemporary designs and a broad range of sizes which means you’ll almost definitely find something that you’ll love.\nMimosa is a newbie compared to the rest of the list, but we actually love their chic and modern designs. Being a smaller brand their prices are also quite reasonable, so seasonal discounts are just an additional incentive here.\nAs far as ladies undergarments are concerned, Triumph is as good as it gets. They’ve got an excellent selection whether it be for day-to-day or activewear.\nBranded sportswear can be quite expensive here in Colombo, but with the discounts around the season it comes down to about what you’d end up spending in other countries. All the big brands like\n,\n,\nand\nwill have deals going on and it really come down to personal preference between them.\n&\n\n\n",
  "url": "https://www.yamu.lk/blog/best-places-to-shop-this-season"
}