{
  "title": "Best Restaurant Instagrams (A \"Marxist\" Analysis)",
  "abstract": "A couple of things popped out after we did a survey on restaurant instagrams in Sri Lanka",
  "author": "Halik",
  "date_published": "8:17pm",
  "content": "The 'survey' only got 25-30 responses so excuse us if this whole thing smacks of being less than empirically robust, but you use what you can get right? The following will actually be less of a heirarchical breakdown, and more of an analysis on what our preferences for restaurant Instagrams could actually say about our lifestyle aspirations.\nA post shared by\n(@saltyswamis) on\nOverwhelming enthusiasm was shown for accounts that exhibited what you would term a new agey vibe. This aesthetic brings to mind things like yoga, surfing, pastel shades, film-like/lo-fi filters, vintage furniture, antique facades, stylish decaying things, purposefully drab fashion and a wan approach to life in which everything is so chilled out that it feels like living in a continuous haze of marijuana smoke.\nA post shared by\n(@ceylonsliders) on\nA lot of these accounts also incorporate a fair amount of exoticization, they will inundate you with visions of ‘paradise’. Sri Lanka is a paradise, they insist, and not just for the foreigner, it is a paradise for the local as well because guess what? Said local also views Sri Lanka through the eyes of the foreigner.\nWhite people feature prominently in these accounts, a lot of them are, in fact, run by them. Sri Lanka becomes a space that brings to mind the earliest thirsts for something new, something to escape to, even for those seemingly trapped within it; ‘if not into white skin, then at least into white spaces’ seems to be the idea.\nThe hipster fad is only alive because nothing else has come to take over. So like a doddering monarch on an unstable throne, it awaits the next invasion, the post-hipster, unaware that it is doing so. Maybe the future is heralded by the stylishly kitsch, self-deprecating 80s-esque aesthetic which announces to the world that people eating here are so cool they don’t even have to worry about making fun of themselves.\nA post shared by\n(@tacocat_lk) on\nAnother big category was also a type of exoticization and a representation of deep seated desire. But this time more along traditional lines of class and wealth. The focus strays away from the people that occupy these spaces, and even from the spaces themselves. Décor, clothing and the aesthetics thereof are backgrounded and the food itself is brought to prominence. Whereas the earlier category glorifies an adaptation of Sri Lankan food in which pol sambol is cool and kadey paan is in, these accounts focus on food that is more traditionally aspirational, i.e. non-local food.\nA post shared by\n(@cafenoir.srilanka) on\nA look at one of these profiles will bombard you with colorful images of food, food, and more food. Eyes will bleed a little. Crisp, professionally executed close ups of penne pasta, colorfully dripping cheesecakes, fantastically decorated coffee, increasingly juicy burgers etc. assault the eyes, meant to transfer into rumbles in hungry stomachs and ambitions.\nA post shared by\n(@cocoveranda) on\nAs Zizek likes to say, borrowing from Marx and Freud, commodities consist of labor but represent dreams. In the representation of the commodities (i.e. food/restaurants) discussed here, the labor, i.e. the underbelly, seedy or otherwise of ‘real life’ is completely subsumed by a dream state. What is on sale is a dream, and what is liked as a result becomes the most desired dream in the market today. I.e. the ‘best’ accounts don’t necessarily sell food, they sell lifestyle. They sell an escape route to what is most desired, not out of food, but out of life itself.\nWhat are some of your favorite restaurant Instagrams in Sri Lanka and why? Comment below.\n",
  "url": "https://www.yamu.lk/blog/best-restaurant-instagrams"
}