{
  "title": "Best 6 wooden cottages for a weekend adventure",
  "abstract": "We have compiled a list of cottages around Sri Lanka that costs less than Rs. 10k per night.",
  "author": "",
  "date_published": "2:29pm",
  "content": "Ever been one of those people who put off being adventurous in the name of cost-cutting? Well, we have compiled a list of cottages around Sri Lanka that costs less than Rs. 10k per night. You can check these places out on the next upcoming long weekend.\nLocated at the end of the Pahabia Road on Dickwella, Sea View is a small, cozy cottage near the beach. As the name suggests, it has a great view of the beach. It's the ideal place for a beach party at night after a long day of surfing and diving, and the staff is very accommodating. Their food seems to be quite good because we have never seen any complaints from the guests. It will cost about Rs. 7000 per day. Not too shabby.\nThis cottage is right in the middle of the jungle. Unfortunately, it only accommodates two people but it is the ideal spot to rest up and spend the night. Be mindful of the wild elephants but on the flip side (no pun intended), you can explore the birds and the less harmful animals while you wait for the crack of dawn.\nIt's built completely of wood and the food and service are pretty decent. It costs about Rs. 4000 per night which is great considering it's not the worst place for a bonfire.\nThese great wooden cabanas are ideal to spend a night in Kalpitiya. They have got some fun activities like dolphin watching, kite surfing, and bird watching. Not to mention a romantic night out at the beach with your partner or a family walk along the shore with your kids. Of course, we all know how good the seafood is in Kalpitiya and we heard that their rice isn't half bad either. It would probably cost around Rs. 7000 for the whole day.\nThese wooden cottages are located at the edge of Yala National Park, near Goyagala lake. The cottages itself are comfy and the location is very convenient as well with an arm's length to a safari. The food here is excellent as well. You can enjoy some delicious authentic Sri Lankan rice and curry with natural tank fish (වැව් මාළු). It's a bit on the pricier side, about Rs. 9000 for one night.\nThis is another great place located in Deniyaya, Meediripitiya. They've got wooden cabanas as well as luxury tents to spend a great night in the wild. You can spend about Rs. 8000 per night and enjoy bird watching, snap a few pictures, sit around a fire and have a beer party. Their hospitality has been appreciated by many so we suggest you head on over.\nSo there you have it. Some great options to choose from to spend the coming weekend out of town and in the wild. Have fun!\n",
  "url": "https://www.yamu.lk/blog/best-resorts-in-sri-lanka-under-rs-10000"
}