{
  "title": "Best Places To Travel This Season",
  "abstract": "Here’s a look at some of our recommendations on who should travel where this season.",
  "author": "Staff",
  "date_published": "2:46pm",
  "content": "We’re almost done with 2017, which means most of us are thinking about where we want to go with all that leave we’ve saved up. The season is also generally a great time to travel in Sri Lanka since the weather is pretty tame and there are a bunch of great hotel deals floating around. Here’s a look at some of our recommendations on who should travel where this season.\nThis is a no-brainer in December. The Southern coast really comes alive during the season and the weather is generally quite decent as well. With the recent surge of new properties opening up all the way down to around Hiriketiya, the tourist crowds are also spread out in a way that it isn’t over-saturated.\nIt’s really hard to go wrong here since there’s something for everyone. We'd actually recommend a\nsince there's so much to do, whether it be shopping, eating or just sight seeing. Hikka, Unawatuna and Mirissa are perfect to catch some waves and beachside parties, while Weligama, Hiriketiya and Talalla are there for those looking for a quieter stay.\nWe can’t really talk about travelling in SL and not mention the cultural triangle. Needless to say, these are travel hotspots during the season, making it perfect for tourists and expats. If you’re not too concerned about the historical sites, Kandy and Sigirya also offer plenty of other excursions and activities like the Temple of the Tooth, Udawatte forest, Hantane mountain range and the new Pinnawala Open Zoo.\nIf you're looking for activities off the beaten path, the areas around Sigirya offer some\n!\nTourists love coming to Sri Lanka during December because of the warm of weather. Us locals, on the other hand, wouldn’t mind escaping the heat for a change. Since snow isn’t really a thing here, the hills are where you’ll find the closest thing to Christmas weather.\nmakes for an ideal chilly getaway with it's Colonial atmosphere, incredibly hospitable people and great food. You might experience a few showers but that'll just add to that festive feeling, perfect for a family vacation and hot chocolate!\nNegombo get’s a section of it’s own here, and for good reason. It’s accessible, has plenty of hotels to choose from, a ton of restaurants and bars along with plenty of beach and some\n.\nIt’s also perfect for locals who aren’t getting many days off at the end of the year since it’s literally an hour from Colombo. If you’re a tourist or an expat, Negombo is a great an ideal location to wrap up the last few days of your stay since it’s just a few minutes away from the airport.\nDecember is technically the “off-season” for the Eastern Coast because the tides aren’t great for surfing. The thing about the off-season, however, is that it’s also the time of the year where areas from Arugam Bay up to Passekudah really settle down.\nIt’s definitely not for everyone, but if you’d like to experience a quieter vacation, the East Coast might be an interesting niche pick.\n",
  "url": "https://www.yamu.lk/blog/best-places-to-travel-this-season"
}