{
  "title": "Beyoncé, Slavery, and Sri Lanka : What?",
  "abstract": "We try and decipher what the international drama is over Bey's leggings and Lankan factories.",
  "author": "",
  "date_published": "12:04pm",
  "content": "There's been some furore in the news about Beyoncé's new line of active wear,\n, being produced in \"Sri Lankan sweatshops\" under \"slavery conditions\". It all started with a\n(the Sun, not the Daily Mail at least).\nSince the Sun, a bunch of media outlets have jumped on the bandwagon from afar. Perhaps worse than the long-term ramifications of this campaign is the condescension of being discussed in the media as a victim with no say in the matter.\nAs of today, no local papers have actually covered the issue, barring our favourite online publication and most accurate news source,\n. While we hardly think that MAS (the company contracted to produce Ivy Park), one of the country's biggest and most celebrated companies, are a bunch of slave owners, we're breaking down the facts we do know.\nmakes the following claims :\nSo what's the actual problem with this exposé? We definitely agree that national wages need to be raised. Especially in the case of women like this who most likely support their families with their wages, or at the very least send a large portion of it home. We've personally seen the great conditions at these factories though, and MAS adheres to ILO and Garments Without Guilt mandates. However, Sri Lankan wages are notoriously low on the whole, with even highly qualified professionals (such as auditors or IT professionals) often getting paid as low as about Rs. 12,000 a month. It's cause for systemic policy change, but not cause for an international fuss and\nwith gleeful abandon.\nTo put things in perspective, however, the average MAS-Ivy Park factory worker makes some $185 a month to Beyoncé's $4,500,000 a month. So while we're justifiably riled up at the onslaught of this unresearched manifestation of the white-saviour complex, we certainly think Mrs Z's ethics aren't\n. These factory workers (and all Sri Lankan labourers for that matter) deserve to get paid a lot more, but the Sun wailing that they cannot afford $150 leggings or $50 sneakers is taking things ridiculously out of context.\nWhat we'd really like is some ethical and responsible reporting. That being said, we still advocate higher wages. A girls got\n, Bey.\n",
  "url": "https://www.yamu.lk/blog/beyonce-slavery-and-sri-lanka-what"
}