{
  "title": "Biscuit Kudu to RingIn Sindu: The Saga of Sri Lankan Bus Songs",
  "abstract": "Why bus music is called biscuit kudu will be an eternal mystery to me, but that's what it is.",
  "author": "Aisha",
  "date_published": "11:26am",
  "content": "Love it or hate it, most bus commuters are familiar with bus songs and bus TV. What started off as biscuit kudu songs have now evolved rather sadly into what Chandana calls Ring-In songs: sung in first person, intensely melodramatic, always tragic. More often than not having convoluted storylines to boot.\nThat said, the biscuit kudu ones weren't too easy on the ears either. Ajith Muthukumara, Damith Asanka, Kingsley Pieris...\nMoving on from\n, these are what we were able to split the themes of the RingIn tone ones into.\nThis beats the whole point of classification and categorization, because most bus songs are\ndramatic love stories. However, these do have sub-categories.\nThis goes down in the hall of fame as having almost everything required for a dramatic love story — boy caught in a triangle where one girl is overly possessive and the other has as much personality as a helium balloon. Shots alternate between unbelievably melodramatic dialogue, sobbing young adults, and walking in the rain.\nA recurring theme, the role of the cheating wife is never complete without her being a terrible mother to boot. Terrible, because she forgets to pick her kid up from montessori because she's too busy making out in public spaces with her lover. Through methods we do not understand, she somehow ends up with custody of the child and the father, poor man, is left alone and destitute.\nIn this episode, you get a proper thug, guns, bad-guy-turns good, tries to do good, and\ngets the blame. I'd tell you what else he gets, but that'd be a spoiler. With epic cinematography and enough drama to beat competition from Bollywood right off the charts, this biscuit kudu masterpiece is just that... a masterpiece.\nThese music videos are compelling not because of the weepy lyrics that makes you want to stuff your ears up, but because of these elaborate, confusing, utterly mindblowing storylines. Why were gloves necessary? Wasn't that a butter knife? Do people die instantly like that? If she's not dead, why is her stomach still heaving and why is no one taking her to a hospital? These are the questions that keeps bored commuters entertained.\nCovers of all songs, and I mean ALL — be it the\nor anything else really. It comes with dancing girls in ludicrous costumes that won't be seen elsewhere in the country, and close-ups of waists, hips, and druncles.\nJust going to leave this nonstop piece here. Sometimes, those epileptic lightshows and loud drums are\nalright.\nEntertaining, mindblowing, and sometimes just plain torturous, the music industry really needs to ask itself why nearly all their songs are so darn\nand, in some cases, suicidal. The worst part? Over time, you start enjoying it.\n",
  "url": "https://www.yamu.lk/blog/biscuit-kudu-the-saga-of-sri-lankan-bus-songs"
}