{
  "title": "Breakfast at TGI Fridays",
  "abstract": "TGI Fridays does a decent breakfast depending on what you order.",
  "author": "",
  "date_published": "11:23am",
  "content": "Wandering into TGI I was greeted by a resounding \"Welcome To TGI Fridays\". In a moment I found a cosy looking seat and had the breakfast menu spread out in front of me. Rather unpleasantly in the background the head-chef was going all Gordon Ramsay on his staff. It was ugly. I don't think they were aware their first customer for the day had arrived, but still, while I understand keeping your kitchen in check, you've also got to keep the peace, man. Apart from that there's loud techno and what-not blaring over the audio system. I'm more of a Sting and Michael Jackson type guy myself, so I didn't much care for the music, but I assume my contemporaries will.\nEssentially you get an option of ordering one of the six breakfast dishes available with a cup of tea. This was certainly disappointing when at Ceylon Tea Moment's you got a customisable three course breakfast with an entire pot of whatever tea you desired for Rs. 850++. Here you're stuck between the option of ginger, green and ordinary english tea. I opted for the rather unorthodox Tuscan Chicken Melt with a cup of ginger tea.\nThe tea is all right considering it's only a packeted Dilmah option which you brew yourself lacking the bits of sweet fresh ginger I had the other day. However this was, still at the very least, a decent cup of tea. Boy, it finishes fast. On the other hand, t\nWith a bill at Rs.550 I was ready to call it a review and end it, until I decided to try it out a second day.\nMaybe I just ordered incorrectly on Day One because all in all the other options I tried the second day weren't bad at all. For roughly Rs. 1500 I stuffed myself with a BLT Sandwich, and a Friday's Egg Breakfast and an additional latte.  If you're a man of your meat these guys do offer real bacon. The BLT has a fair portion, but the Friday's Egg Breakfast comes with a rather small serving of it since there's other proteins tossed into the mix. The latte is a quite good, with a nice creaminess about it. While it isn't the best in town it makes for a good espresso kick.\nThe ciabatta bread goes well with both options; lightly toasted with a bit of oil on one side they have a decent crunch factor. Both come with baked potato wedges, that are full soft yam goodness. Try smearing your bread with a bit of the stuff and the accompanying bell peppers.\nApart from bacon sizes the main differences between the two boil down to the fact that the Friday's Egg is better armed with more breakfasty options - you've got two bullseyes, two (rather cheap) sausages, and strawberry jam for all that left over ciabatta.  On the other hand, The BLT comes with an omelette. This is good, but really can't hold a candle to the one at Ceylon Tea Moments. It's flat and thin, and tastes okay, but compels the BLT to rely on its portion of bacon for taste.\nMy query with the Friday's Egg is the quality of the sausages. The sausages here are quite obviously Keels chicken and cheese sausages. Even the jam, you can quite clearly tell is a dollop from a Kist jar. But it's got those nice strawberry chunks so what am I complaining about?\n*burp*\n",
  "url": "https://www.yamu.lk/blog/breakfast-at-tgi-fridays"
}