{
  "title": "Breakfast at Ceylon Tea Moments",
  "abstract": "Breakfast at Ceylon Tea Moments is absolutely spiffing.",
  "author": "",
  "date_published": "12:25pm",
  "content": "Health enthusiasts have probably heard the\nold adage \"breakfast like a prince and dinner like a pauper.\" Well at\nthey tweak it a bit and let you indulge in breakfast fit for a\nking.\nTo make a long story short, you really\nhaven't eaten breakfast till you've had breakfast at Ceylon Tea Moments. For\njust Rs. 850++ for the Big Western Breakfast you get a customisable three course breakfast along with a pot of great tea. There's a variety of\nother breakfast options to choose from including roast paan curry sandwiches in\nthe Sri Lankan section.\nWhile I was in school I remember being given\na lecture that one should drink tea with the little finger sticking out while\nyour thumb and other fingers delicately hold the teacup handle. Apparently not\ndoing so is considered ungentlemanly and the height of unsophistication. Yep. I\nhave Bachelors in Tea Parties. Don't worry, these were quite macho tea\nparties.\nThat being said, I was almost compelled to drink my choice of Ginger Tea,\naptly named the Ginger Twist, with my pinky sticking out. Essentially a cup of\nginger tea with pleasant bits of the ginger root inside, the Ginger Twist\ncommands respect. The pot has enough tea for four to five cups, and\nI...um...finished it. My desired level of sweetness was with one and a half\nteaspoons of sugar. There's a pleasant sting of sweetness already rendered from\nthe ginger. This was an absolute treat.\nTo start off the course you're given cereal with a choice of warm or cold\nmilk. I opted for the latter. I'm not going to rave about what is essentially\ncorn flakes and milk, but it's a healthy option which doesn't stuff you in time\nfor the main course which is the star of the show.\nI'm a rather big dude, so usually sizeable portions are my bread and butter.\nI am embarrassed to admit I was defeated by a tea shop. A TEA SHOP.\nThe second course puts the 'Big' in the Big Western Breakfast. This\nbreakfast includes (Deep Breath) two slices of toast, butter, jam, a massive\nomelette with tomatoes and onions tossed in, two grilled sausages, a grilled\ntomato, baked beans, a golden hash brown, and a large roll of succulent chicken chorizo. *drop mic*\n\n\nI don't know where to begin. I couldn't finish the whole thing. The two\ngrilled sausages were full of tender succulent sausage meat. It's quite moist\nand juicy and will easily put a smile on your face. I usually don't like\nomelettes...mostly because my surname rhymes with omelette and my buddies at\nschool used to have a song that went a bit like \"Bartlett the cutlet, eating an\nomelette\". Don't get me wrong, I quite like cutlets, but usually omelettes are\nalways idk - blech.\nCeylon Tea Moments seems to have converted me. The omelette with tossed up\ntomatoes and onions is persuasively delicious. Mixing it with grilled tomato\ncreates an excellent experience for the tongue; the juiciness of the tomato\nmixing well with the egg. The hash brown was crumbed to golden perfection.\nCrispy and large it is downright tasty. My favourite however has to be the of chicken chorizo. Cooked well, with a pinch of salt the chorizo was an excellent\naddition to whatever grand mess I'd made of the omelette.\nI'm ashamed to say I was too full to try everything else.\nRound 2 was like pitting a little child against a Mexican wrestler by the\nname of Libre Gonzales. Battered and bruised I didn't have time to flinch when\nthe fruit platter arrived. I'm not big on fruits because I'm not a hippie. But\nyou really can't help but appreciate the presentation. I guiltily snuck a few\npieces of papaw, watermelon and apples. The pieces are legit fresh and a good\nend to an excellent meal.\nCeylon Tea Moments is heavily underrated, which is pretty good in one way\n'cos at most times it's nearly empty. They have a cosy, although dark looking\nupstair lounge and an excellent lounge at the bottom. It isn't crowded, there\nare a few quiet Colombo aunties\nin a corner. It's pretty quiet, save the kitchen where you\nhear your food sizzling and sputtering over the grill. They even had Michael\nJackson playing softly over the audio system which is an insta-win.\nThe staff are pretty efficient and pleasant. My order was out in under five\nminutes and things were pretty snappy.\nBreakfast at Ceylon Tea Moments is so good US Presidential candidate Trump\nhad this to say-\nOh...well shaddup Trump. No one likes you.\nBreakfast and Tea at Ceylon Tea Moments is absolutely spiffing. I give them\na pinky and two thumbs up.\nPs. If you're not into sausages and chorizo you can opt for other things for the exact same price. If you're not into western food, for about the same price you can grab yourself the Sri Lankan breakfast which has roast paan sandwiches I hear. Around 10AM is the final call for breakfast.\n",
  "url": "https://www.yamu.lk/blog/breakfast-at-ceylon-tea-moments"
}