{
  "title": "Breakfast at Cioconat Lounge",
  "abstract": "The breakfast at Cioconat Lounge was so so, with both hits and misses.  At around Rs. 650 - Rs. 1000, it isn't…",
  "author": "",
  "date_published": "11:59am",
  "content": "does an early and decent breakfast. You'll likely find yourself paying around Rs. 650 - Rs. 1000, which isn't exactly cheap, but their stuff does have its merits.\nCioconat Lounge finds itself in a bit of an odd position in Colombo's cafe scene. It's not one of the best, but it's also not the opposite. There are certain elements they do quite well, but they also try to do too much and end up falling short. They offer a lunch buffet, a brunch buffet on Saturdays, seasonal buffets and a special breakfast menu served from\n, which is what we dropped in to try out.\nThe prices aren’t too steep, but at around Rs. 620 per item it’s not exactly cheap either. All the breakfast items comes with a large cup of coffee, which was fine but not really exceptional. The option of choosing tea would have been nice for those who prefer it over coffee though.\nDon’t get me wrong, I’m all for a morning cup of coffee, but I found that a glass of their papaya juice (Rs. 350) really hit the spot on a warm morning and generally worked better with their breakfast offerings.\nOur smoked salmon and cheese bagel (Rs. 620) came packed with plenty of smoked salmon which was nice to see. We liked the texture of the bagel which wasn’t too hard or chewy but the egg was all but flavourless.\nThe smoked salmon tasted decent but it wasn't really fresh. There were quite a few slices with brown edges which either meant the salmon had begun to oxidize or this was the cheaper non-Norwegian smoked salmon. Either way not really helping the cause.\nThe breakfast at Cioconat Lounge was so so, with both hits and misses. What we do appreciate though is the fact that they're open as early as 7 AM so you can get grab something before work hours. We'd give this one 3 out of 5 stars.\n",
  "url": "https://www.yamu.lk/blog/breakfast-at-cioconut-lounge"
}