{
  "title": "Breakfast At Sugar Bistro",
  "abstract": "If you've got the morning blues, a spoonful of Sugar helps the medicine go down.",
  "author": "",
  "date_published": "11:41am",
  "content": "If you've got the morning blues, a spoonful of Sugar helps the medicine go down. With reasonably priced breakfast options* and efficient service, Sugar has quite possibly one of the best breakfasts this side of Colombo.\n*excluding VAT\nRight at the front of Crescat Boulevard, Sugar commands your typical cafe atmosphere. The best spot to relax and catch a few pages of a good book in my opinion is right outside on the terrace. If you're more of an extrovert with a knack for chinwag inside is the place to be. Clean, spacious and relaxing, there are a very few cafes that have as sweet a spot to hang out as Sugar's. However, there's a spot at the back covered with quite a bit of guano which should have been cleaned.\nThe breakfast menu features a good variety of options from open sandwiches to smoked salmon so you really aren't limited. You're probably wondering to yourself -\nWell, you really can't go wrong. Sugar usually does good food. Even for a famished YAMU recruit there's only so much one can eat, so I settled with the reasonably priced Open Bacon Sandwich (you can settle for *blech* beef bacon - heresy), and the Poached Eggs. I topped it off with an order of Cappuccino and Orange Juice.\nService is pretty snappy. Our orders were out in about 10 minutes.\nThe orange juice was pretty good. Not overly sweet, and with a good volume of the stuff the juice is a good option to freshen up your day. What I do miss is the pulp. They coulda put in a bit of pulp for a more memorable experience in the mouth. There's a lack of the nice texture of beaded pulp bursting in the mouth which you'll find elsewhere, even (heaven forbid) Minute Maid.\nI quite liked the Cappuccino. It was creamy, frothy, and had the right strength to bust away the morning blues. You can put in a bit of (no pun intended) sugar to sweeten up things. But all in all this makes for a very robust start for the day.\nI've never been a big fan of egg based food (except for scrambled egg which complements a Sri Lankanized bacon and eggs nicely). This seems to have changed after trying the omelette at\n, and now the poached eggs at Sugar. Poaching, from what I've read requires a rather tricky process of coddling the eggs so there's a lot to appreciate when you try out a place that does them well. Soft and scrumptious the poached eggs atop their throne like buns, are meals fit for a Lannister. The accompanying spinach, hollandaise and baked beans complement the meal nicely though I really wish they could have put in more hollandaise.\nMy favourite however has to be the open bacon sandwich. The crusty bread topped with a bullseye and generous portion of bacon makes for an exceptional meal. The bacon has little to no fat and is crisped well, while the egg adds a nice softness to an otherwise crispy dish. It would have been nice to have it on less refined bread like a nice seedy slice. But I guess you can't get what you want *sniff*\nWhile both mains scream quality, they will disappoint for those who value being stuffed over being satisfied.\nThe Catch - When VAT kicks in things get slightly steep. The bill came to total of Rs. 2200. While still a great breakfast, if you're looking to be stuffed with food of a similar level try the customisable three course breakfast and tea at Ceylon Tea Moments which is Rs. 850++.\nIf anyone asks if you'd like breakfast at Sugar, repeat after me -\n",
  "url": "https://www.yamu.lk/blog/breakfast-at-sugar-bistro"
}