{
  "title": "Breakfast at Sen Saal",
  "abstract": "We braved the election mayhem to try out the Breakfast at Sen Saal.",
  "author": "Sandesh",
  "date_published": "11:33am",
  "content": "My journey to Sen Saal wasn't a pleasant one. What was usual bustling Colombo traffic seemed to have swollen with bus-loads upon bus-loads of fanatics of a particular political party pouring into Pedris Park. Caps were being dished out to children too young to understand the motive behind all of this \"free\" stuff. Vehicles too large to be an average middle-income earner's were armed to the teeth with posters full of grinning faces with seditious slogans. Mobs like this usually attract a handful of old strays. I didn't see any, but no doubt you'll hear their barking over the news tonight.\ncouldn't\nexpats than locals which should give you an idea on how popular and reliable Sen Saal is.\nmenufestos, the over promising menu underperforms and instead gives you a few trinkets to try and satisfy yourself with.\nthat there were no such options available for breakfast and that I'd have to settle with the rather mundane, vegetarian (I suppose this will boil down to personal preference) Red rice and dhal or fried egg noodles.\nFor those of us at YAMU this is pretty easy. The perks of being a Yamurai involve putting a small jilmart and \"voting\" for as many dishes we see fit. In this case I settled for noodles, red rice, and a milkshake. Waist size options range from marxist to centre right to the WFF (Waistline Freedom Farty). Considering my order , I clearly opted for the latter.\nThe fried egg noodles came nice and hot, like a steaming marxist. There's a bit of egg tossed into the mix as well as a bullseye. The amount of vegetables tossed in might trick you into thinking you're eating healthy but remember this is fried stuff, with oil and butter. Apart from the veggies adding a good crunch to the noodles there's a nice dollop of chilli paste to start a revolution of heat on the plate. However (I assume since they cater to a few foreigners) the heat is still a bit lacking in this one. The bullseye is the only protein on the plate. While it certainly hits the spot it wouldn't hurt to add an optional chicken curry on the breakfast menu.\nThe red rice is a bit like Sri Lanka's very own centre right party. Deep down inside you know it's good for you. But it lacks appeal. Everything from the dhal, to the red rice will benefit your body, but there's far too little excitement. As is expected from red rice, the textures of this one are coarse (which is a good thing). They have a bit of flair with the pol sambol, but as I said it before it isn't hot enough. If there weren't already enough carbs on the plate they've got potatoes. This just dilutes any flavour into a paste in the mouth. But like I said, it's probably the only thing that's not trying to kill you.\nThe Chocolate Milkshake is a stalwart of the WFF. Deceitful and cunning it tells you the sugary-sweet things you want to hear. Whispering, it rouses hate against other drinks on a diverse drinks menu -\nIgnoring the irony I gave in and walloped the thing. Despite its initial appeal it tasted like your ordinary milkshake. Nothing special, but with plenty of volume to cool your blues.\nWhile the brekpast oftions (okay, I'll stop) at Sen Saal aren't the tastiest, they certainly are filling. My entire bill came to Rs.650, which given the amount I ate, is actually not bad. However I wish they would add an optional chicken curry add on. The menu relies too heavily on carbs, veggies and eggs. This isn't a subsistence economy, they could toss in some meat.\n",
  "url": "https://www.yamu.lk/blog/breakfast-at-sen-saal"
}