{
  "title": "Breakfast In Colombo",
  "abstract": "Not a lot of places in Colombo are open for breakfast - here's our list of favourites from the the city's handful of…",
  "author": "",
  "date_published": "3:21pm",
  "content": "While a lot of bakeries and small kades may be open early morning, some of\nwhich we've mentioned here, most restaurants in Colombo tend to open their\ndoors at about 10AM, so it's an issue if you're looking for a place for a good\nbreakfast. Here's a roundup of places we like that open at around 7AM and do a\ngood morning meal.\nCalorie Counter is one of the most recent additions to Colombo's breakfast\nscene and they do quite brilliantly. What sets them apart from the rest of the\nlist is that they're sticking to their health food theme, so you'll see classic\nbreakfast dishes with healthy twists like their eggs benedict (Rs. 650) in\nwhich they've substituted multi seed bread instead of bagels, smoked salmon\nover ham, and a creamy avocado dressing instead of the traditional hollandaise.\nBesides this they've got a bunch of other breakfast specials like granola\nparfaits and healthy sandwiches.\nCeylon Tea Moments at the Racecourse is the building's popular stop for teas\nand bready treats. What you likely didn't know was that they also offer an\nabsolutely spiffing three-course breakfast offer for Rs. 1000. While that may\nseem like a lot, this is the kind of breakfast that makes you skip lunch. The\nmeal includes cereal, a massive English breakfast (which includes toast, a\nmassive omelette, two grilled sausages, baked beans, a golden hash brown, and a\nlarge roll of succulent chicken chorizo) and a fruit platter. If that wasn't\nenough, they also give you a pot of tea.\nTry: Strawberry frappuccino\nDolce Italia is one of our favourite places to eat. The Italian dishes are\ndelicious and authentic, and most importantly affordable, and they have a\nquality range of savoury snacks to nibble on. Since they're also a bakery they\nopen up at around 7.00 AM. Their chocolate croissant (pictured above) was\nparticularly delicious and properly filled with chocolate.\nTry: Panzerotti\nSugar Bistro is a new classic - simple, modern food with just the right\namount of traditional ingredients. They're definitely one of the more expensive\nplaces on this list but everything we tried was very tasty. Our favourite was\nthe open bacon sandwich. The crusty bread topped with a bullseye and generous\nportion of bacon makes for an exceptional meal. The bacon has little to no fat\nand is crisped well, while the egg adds a nice softness to an otherwise crispy\ndish.\nTry: The Eggs Benedict.\nTea Avenue is a very nice place to relax at for breakfast. Plenty of room,\nplenty of quiet, and I imagine especially their outdoor space next to curling\ntrees would be particularly enjoyable very early in the morning. They also do\nyour standard tea lounge waffles, teas and sandwiches, which are all-in-all\nalright and not too pricey.\nTry: Cookies & Cream milkshake\nWhight & Co is an old favourite of ours who keeps recurring on our lists.\nThey've got good food, excellent coffee and a wonderful quiet coffee shop\nambience by the sea on Marine Drive. It isn't the cheapest place in town, but\ntheir stuff is ideal for breakfast. Also if you're a coffee purist, this is\nlikely the one you should go for.\nTry: Cold drip coffee\nThe Bread Company has great food overall and breakfast available all day.\nThis includes delicious granola, cinnamon buns, baked goods, bread, and\nwhatever else they come up with on a given day. They also have excellent bread,\nsausages and condiments if you want to make breakfast at home.\nTry: The granola. Healthy but really tasty as well\nTasty Caterers is one of Colombo's best bakeries that do excellent\nshorteats, and they're actually kind of all-rounders since they do a super rice\nand curry too. They've got an ordinary long space of tables and chairs as you\nwalk in where you can sit and have a meal, provided they aren't taken up by the\nhordes of loyal customers.\nTry: Eclairs\nSponge is our other favourite bakery. It goes all the way back to 1985 and\nhas only improved since. All the shorteats are high quality, from the Chinese\nrolls to the chicken pies.\nTry: Maalu paan\nPalmyrah at Hotel Renuka has been around for ages and has been known for\ntheir good Sri Lankan food and Jaffna dishes. They recently renovated the place\nand it looks really good now. If you're fan of Sri Lankan style breakfast,\nPalmyrah's hopper's will likely make you happy.\nTry: The dhose\nCafe On The 5th does classic Sri Lankan takes on everything from Mongolian\nBBQ to pasta and rice. For breakfast they have a good range of short eats, iced\ncoffee, etc.\nCurry Much does a great lunch and rice and curry, but they also do nice\nbreakfast sandwiches with roast paan, pol sambol, seeni sambol, etc. They also\nsometimes do kiribath and stuff you can eat there.\nTry: The pol sambol and egg sandwich.\nSaraswathie Lodge is one of the many kades luckily open early morning. If\nyou're into South Indian food, especially vegetarian, these guys do a wonderful\njob in great, affordable portions, in a very clean and efficient\nenvironment.\nTry: The Madras Meal thali\nTaste of Asia serves up classic small-shop stuff like hoppers and string\nhoppers but in a nicer, bigger atmosphere, so it attracts a whole variety of\ncustomers. While their aromatic crab curry is available only after 5PM, in the\nmornings, you get kiribath, parata, egg rottis and shorteats, all tasty and\nsuper affordable.\nTry: Kiribath\ndoes an early and decent breakfast. You'll likely find yourself\npaying around Rs. 650 - Rs. 1000, which isn't exactly cheap, but their stuff\ndoes have its merits. We were skeptical when we heard their eggs benedict (Rs.\n620) comes with beef bacon, but all in all in it turned out to be pretty\ntasty.\nSo that's our quick round-up of places to get breakfast in Colombo. Do note\nthat roadside kades usually do a good parata and purippu style breakfast, Galle\nRoad or Fort or Slave Island are a good bet for a wander, but there's kades\neverywhere. As always, let us know what we missed.\n",
  "url": "https://www.yamu.lk/blog/breakfast-in-colombo"
}