{
  "title": "Breakfast at Black Cat Cafe",
  "abstract": "Breakfast reviews are back!",
  "author": "",
  "date_published": "10:54am",
  "content": "has expanded their menu to include dinners and breakfasts as well now. They're open from 8AM onwards and have pretty decent food and drinks. Prices are a bit on the steep side, but you get great value for money; especially when you think of quality, service and ambience as well. They've lost the cats they had along the way, but thankfully maintained the standards they initially set out when they started over an year ago.\nYou've got a wide range of choices, ranging from pancakes, muesli, burritos and such. They offer vegan options as well as meat-heavy platters, so you and your friends are covered.\nI picked Mission (Rs. 1200), which was near identical to a traditional English breakfast sans the bacon.\nIt looks pretty simple soon as you see it: a couple of sausages and bulls-eye, sauteed spinach with button mushrooms, a little bowl of baked beans and a two crispy hash browns. A tomato garnishes the plate off, accompanied by two slices of toast.\nThe eggs were well, eggs, there's nothing much to say about perfectly executed bulls-eyes. The sausages (chicken) were incredibly juicy with a nice crisp and lightly crackled skin holding it together. It was\n, and by Sri Lankan standards, quite large to boot.\nWe loved the hash browns, which were crispy, warm and comforting pockets of chopped/mashed potatoes. How this passes for a healthy breakfast is beyond me, but totally not complaining.\nI asked for more toast and got a stack more, no charge, which is really nice. The food was too much to finish on my own so Dili helped clean the plate up.\nWe'd recommend their Flat White or Butterscotch, Milk and Cinnamon Tea to wash your meal down. Both of those cost Rs. 400 each.\nTake someone along with you or build up a massive appetite before heading over. Bon appetit!\n",
  "url": "https://www.yamu.lk/blog/breakfast-at-black-cat-cafe"
}