{
  "title": "Breakfast at Coco Veranda",
  "abstract": "Coco has a decent albeit slightly overpriced breakfast menu. They also offer coffee and/ or tea with it.",
  "author": "",
  "date_published": "2:02pm",
  "content": "If you want a hearty breakfast to kick-start your day, one with mountains of bread, a couple of eggs and sausages to boot, Coco Veranda offers a decent spread to sate your appetite. Their breakfast menu is available from 8 AM to noon.\nWe went for Coco's Big Breakfast (Rs. 720) and The Works (Rs. 760), both of which were generous in terms of portion size. Coco's Big Breakfast includes French toast, a grilled\ntomato, a couple sausages, and a portion of scrambled eggs.\nWhere taste was concerned, opinions were mixed because the platter was both flavoursome and bland, although that may seem like a contradiction in terms. Coco V has got the art of grilling their beef sausages down to perfection. All three sausages that accompanied both the dishes we ordered were consistent in doneness — they were well-seasoned and juicy on the inside, with a crisp skin tightly wrapped around. The tanginess of the tomato acted almost like a garnish, especially when you dipped the French toast or the sausage into its juices. The French toast wasn't very sweet but fluffy and milky instead, and its flavour contrasted well with the acidity of the tomato. On the down-side, the scrambled egg was\n— it was very bland and soggy, with a lot of tasteless and watery liquid at the bottom of the dish. IMHO, the dish would have been a lot better if they had added some seasoning to the egg in addition to the salt and pepper sachets they provided alongside.\nThe Works lived up to its name.\nIt came with a few sides of toast, two juicy sausages, two beef patties, and two perfect bull's eyes. (You can choose between chicken or beef patties.) The portion might be a bit overwhelming to finish off on one's own, but it's not impossible to get through. (Confession: we actually weren't able to do it. A bit of bread and an egg survived our morning gluttony). These eggs were well done — you can't really go wrong with bull's-eyes, yeah? Wait, you can? Oh. Well, these guys had gotten it right, with the underside of the egg a nice, toasty golden, and the whites not overcooked or dry. We knew the eggs had been cooked just enough, because the yolks oozed when we struck our fork into them. The chicken patties were tiny, about the size of flattened meatballs, but they were soft and flavoursome as well. They were sufficiently seasoned and crumbled easily with little bursts of flavour as you bit into them. These were quite, quite good. Given the sheer quantity of stuff on offer, I'd say The Works offers more bang for your buck than Coco's Big Breakfast. If you're a voracious eater without budgetary restraints (or if you just want to treat yourself to something fancy for a day) this meal is for you.\nAs far as breakfast goes, Coco V offers a pretty decent deal. They also have banana-glazed waffles and waffles with butter and jam. Despite the menu being tacked up on the wall, though, neither option was available when we went there. So be warned that you could be in for disappointment if you suddenly develop a craving for waffles. The service and ambience is great in the mornings – it's quiet, there's really good music, and the staff are alert, attentive, friendly and helpful. Our food arrived within 15 minutes, so we weren't kept waiting for too long. It was fresh and hot, and accompanied with tea and coffee (either one, depending on your choice), with a side of milk.\n",
  "url": "https://www.yamu.lk/blog/coco-veranda-breakfast"
}