{
  "title": "British Colonial Prisons in Sri Lanka",
  "abstract": "Did you know that Sri Lanka has three  British Colonial Prisons? Read on to find out.",
  "author": "",
  "date_published": "2:11pm",
  "content": "Good and bad are two significant parts of our lives. There are people who tend to resent the wrong and try to do good things, and there are those who do wrong and can’t rectify their wrongdoings.\nA prison is somewhat like a university to morally corrupt people, and guides them to change for the better, to learn from their mistakes and ultimately to move on with a fresh start in their lives.\nCurrently, there are 23 prisons in Sri Lanka which are governed by the Department of Prisons. While most of them were established during the 70th decade, there are 3 prisons that were built during the British Colonial period. Each of these prisons has an interesting piece of history behind it, which is all the more reason for us to talk about it.\nThe name Bogambara brings us the memory of Ehelepola family execution, one of the worst tragedies in our history.\nEhelepola\nwas the first Adigar under the reign of King Sri Vikrama Rajasinha and a father of three; two boys and a girl. His wife, Ehelepola\nwas a beautiful woman, and it didn’t take long for the King to notice that. King Sri Vikrama Rajasinha wanted her for himself, but being a loyal wife, Ehelepola\ndidn’t have any interest in him.\nEhelepola\ngrew tired of how naively King Sri Vikrama Rajasingha served the British monarchy. Harbouring an immense love towards his country, Ehelepola\nstarted aiding the flames of the rebellion against British rule. Once the King heard this news, he became angrier than ever.\nThe conflict between Ehelepola and the King ended with the King’s order to execute the whole Ehelepola family. The history states that the King ordered to behead the children, put their heads into a giant mortar and made Ehelepola\nto pound them with a pestle. Afterwards, the whole Ehelepola family were drowned in Bogambara lake.\nBogambara prison now stands on the grounds where all these catastrophic incidents went down. According to the instructions of N. R. Saunders, the first Police and Prison Commissioner in Sri Lanka, the Bogambara prison was established in 1876.\nBogambara prison is known to have the longest foundation in all Asia. Also, it is the second largest prison in Sri Lanka, after Welikada prison in Colombo. Some say that it resembles the shape of the Bastille fortress in France.\nUtuwankande Sura Saradiel, Maru Sira, Colvin R. de Silva, Philip Gunawardena, and William de Silva are few of the many notable people who were imprisoned here.\nBefore Bogambara, the British used Hangman’s Hill, a small mountain in Kandy to implement the death penalty. Once the Bogambara prison was initiated, they shifted the gallows from there to here and improved that setting. During the period of 1876 - 1975, 534 prisoners were sentenced to death at Bogambara. The grounds of Hangman’s Hill are now used as the Central market of Kandy.\nThere are few interesting stories about the\ntree in front of the Bogambara gallow. Some people believe that the branches of the\ntree don’t grow to the side where the gallows are located, because it’s a cursed place.\nAnyway, Bogambara doesn’t exist as a prison anymore, but an exhibit. It was open to the public for a while, but apparently it has been shut down again. All the prisoners who were imprisoned here were moved to Pallekele prison in 2013.\nBy the 1870s, the old prison at Slave Islands was getting crowded and the British government were running out of space to accommodate new prisoners. The initiation of the Mahara prison happened due to this reason. By the year of 1875, the work at Mahara prison building was finished, and a bunch of inmates were moved to Mahara, which helped ease the crowded situation at Slave Islands prison.\nMany\nwere imprisoned at Mahara. Maradankadawala Yakadaya, Nawariyan, Cutex Piyadasa, Karagala Sirisena (A.K.A Cheena), Watareka Jayasundara, and Gampaha Piyadasa are few of them.\nMahara prison had a quarry next to it, and some of the inmates who were imprisoned due to major crimes were employed here as labourers. In 1900, there was a massive fight between those prisoners and the jailors. The inmates assaulted the Prison guard officers and the riot leader seized the revolver of the Deputy Jailor of the prison.\nAs a result of this fight, 79 inmates were able to escape the prison. It's known as the first and the biggest ever prison break in the history of Sri Lankan prisons. But the army team who came to control the situation managed to bring 40 of the escapees back to the prison on the very same day.\nDid you know that Sri Lanka had the biggest vapour laundry in Asia? Believe it or not, this big laundry was located in one of the British colonial prisons in Sri Lanka. Not just the biggest laundry, this prison has its own hospital too.\nThe Welikada prison is the largest prison in Sri Lanka. Established in 1840 by the British government, this prison currently possesses 13 sites where inmates are occupied.\n(Carpenters),\n(Food Suppliers),\n(Laundry),\n(Smiths), and\n(Printing services) are some of them. In 1920s, all the laundry related work of state companies and hospitals were done by the Welikada\n.\nThe architecture of the Welikada prison somewhat looks similar to the ancient prisons in Pennsylvania. This also has a temple, a church and a separate space for Muslim inmates to maintain their religious affairs.\nBack then, the British Prison Commissioner used to visit the prison on a horseback. The pole he used to tether horse can still be seen near the front gate. D.S. Senanayake, F.R. Senanayake, Henri Pedris, Anagarika Dharmapala, Douglas Devananda and Sepala Ekanayake are some of the many notable prisoners who were held behind the iron bars of Welikada prison.\n1983 was the year of Black July and it shook the Sinhala inmates at Welikada prison. A riot started on July 25th, leaving 35 Tamil prisoners dead, and again on 27th which killed another 18 Tamil inmates. There was another clash between the prison inmates and the officers in 2012. It started out during a search for illegal weapons. This resulted in 27 inmates being killed and 40 injured. It's considered the worst prison riot since the one that occured in 1983.\nIt doesn’t matter how many prisons we have or how many people have been rehabilitated by them, to the prisoners that have truly turned over a new leaf, it's impossible to be accepted by the public eye until we decide to do so.\nAll their wrongdoings aside, as human beings every one of us deserves a second chance. But will this happen in the future?\n",
  "url": "https://www.yamu.lk/blog/british-colonial-prisons-in-sri-lanka"
}