{
  "title": "Budget Hostels In Colombo ",
  "abstract": "If you're a tourist in the big city and want to stay at a comfy place that's not going to eat into your budget - here's…",
  "author": "Shifani",
  "date_published": "12:44pm",
  "content": "If you've just landed in Sri Lanka and want a cheap but comfy, efficient place to stay at while you tour the city - here's a roundup of a few of Colombo's good hostels. While you can get a private double room at these places for about USD 45 (LKR 6000), it's the dorm rooms that make more sense when you're backpacking on a budget.\nBunking in a dorm room generally costs about 10-12 dollars (LKR 1200-1500), they all usually have the option of A/C, a library and bicycle rental. Most of these places are accessible through\n.\nDrift is one of the better looking, minimal and modern hostels on our list, if\nare anything to go by. It's a little fancier than the rest, with some rooms facing the garden or the sea, and even the dorm rooms feature Drift's signature quirky art pieces. They've got free WiFi, and the dorm room is A/Ced, with 6 bunk beds, a view of the sea and a shared bathroom. Breakfast will cost about USD 3 (LKR 500) extra, and nearby restaurants include Acropol, Cricket Club Cafe and The Gallery Cafe.\nBunking here costs USD 13 (LKR 1871) |\nBED advertises itself as a 'party hostel', so if you want to party during breaks between backpacking, this is the place. They've got a very chilled out crowd-friendly atmosphere, with a private garden and a central lounge with bean bags and the lot. They've also got free bike rental for guests which is super convenient when you want to set off touring the city.\nBunking here costs USD 10 (LKR 1342) |\nSituated in Fort, City Beds at The Regent is a small and functional hostel. It's clean, simple, comfortable and doesn't try too hard - as a TripAdvisor comment on the place suggests, it does the job. They've got free WiFi, free parking, and only four hotel rooms so it can get booked fast. If bunking in a dorm room is not you thing, this is a good option since they only have double and triple bed rooms, but this also makes your stay pricier than at other hostels.\nIt's in a great location for travelers, caught between Galle Face Green, Dutch Hospital (where you can sample some Ministry of Crab or have tea at Heladiv) and the Pettah marketplace.\nBunking here costs USD 20 (LKR 2685) |\nColombo City Hostel is another very crowd-friendly hostel, with an outdoor pool, barbecue parties, a garden and a terrace. It looks pretty old school from the outside, it's very simply put together, and has dorm rooms featuring 8 beds. It is not in a central location though, all the way in the Dehiwala side of town, but on the plus side it's quite cheap.\nBunking here costs USD 11 (LKR 1600) |\nClock Inn, like Drift, is big and has a pleasant, arty character of its own. It sticks out among the other buildings on Galle Road, with its panel of blue-white themed windows. I love\nwhich is easy to use and features very inviting little glimpses into the place, especially the lounging area with its quaint, colourful decor. The dorm rooms here have 4 beds, and each bed has a personal locker. Clock Inn is right smack in the middle of Kollupitiya, a very central location which makes it easier to look around the city.\nBunking here costs USD 16 (LKR 2138) |\nBackpack Lanka is another more interactive place to stay at - the tagline on their website is 'meet, bond, explore'. Aesthetically it seems to be a bare-minimum kind of place, but still clean, efficient and helpful in making your stay entertaining and travel-conducive. They offer free WiFi and free use of the Pool table. Located in Duplication Road, Kollupitiya, it's not far from Colombo's big restaurants and bars. A bunk room has 4 beds.\nBunking here costs USD 15 (LKR 2013) |\n",
  "url": "https://www.yamu.lk/blog/budget-hostels-in-colombo"
}