{
  "title": "Buffets in Colombo (2018)",
  "abstract": "Here's a round-up of Colombo's buffets with what they do best.",
  "author": "",
  "date_published": "12:37pm",
  "content": "Colombars love buffets. Well, we love anyone that will give us as much food as we can eat.\nBuffets are generally associated with hotels and that's mostly the case here in Colombo. While that may seem quite mainstream, the good news is that each of these places have something they do particularly well, with most of them priced between Rs. 2000 - Rs. 4000. So here's a quick round-up of some of Colombo's buffets and what they do best.\nAYU at Mövenpick Colombo is easily one of our favourite new additions to Colombo's buffet scene. At just under Rs. 3000 for their lunch buffet, AYU manages to strike a balance between variety and quality. We'd go so far as to say that they offer the best Sri Lankan spread on this entire list, with their desserts, cheese and action stations right up there among the best as well. The interior is also tasteful with a blend between contemporary and classical design elements which make it perfect for both casual and businesss meals.\nWe've only been to Table One once, but our experience at the newly opened Shangri-La's buffet was excellent. While it does leave a dent on the wallet, what you get is well worth the price of admission with some of the best meats we've had at a Colombo buffet. While some of the locally inspired desserts leave something to be desired, pretty much everything else was on point. The one oddity here was that the buffet doesn't include any beverages, so drinks are a separate cost which we feel should be included at this price point. While we wouldn't exactly recommend the space for a business meal, the funky interior decor with the wooden motifs and swiveling chairs make it ideal for casual meetups and larger groups.\nWhile this list is in no particular order, we feel that Taprobane's buffet is one of the best deals around. Their variety of salads and cold meats alone make this an excellent buffet, so don't be too surprised if you find yourself stuffed after just the starters. The mains also cover a number of cuisines and meats while managing to maintain a good level of consistency. Their desserts could use more variety but that's a very minor gripe.\nFlow tends to fly under the radar when it comes to Colombo buffets but nearly all of our experiences there have been great. It's not the biggest spread out there but they tend to do justice most of their offerings. They're very much a jack of all trades but our favourite aspect of the buffet has to be their Indian and Chinese spreads. It's also centrally located and a really elegant space so we can easily recommend for a business meeting.\nHilton Colombo's recent facelift also saw the introduction of their new restaurant: Graze Kitchen, which was a much needed change-up from it's predecessor. At nearly Rs. 3400 for the lunch, this is the priciest buffet on the list. That being said, you do get your money's-worth with an impressive selection and some high value items. Graze offers a top notch selection of roasted meats along with the one of the most refined Japanese selections around serving up restaurant quality sushi and nigiri. The new look also changes the entire experience with the sleek open-plan area and rough stone walls really showing a lot of character.\nThe buffet at Governor's Restaurant is another one of our favourites, and probably the best choice for those with a sweet tooth. They've also got a great selection of salads, but the best part about their buffet is the desserts, which remains unmatched both in terms of variety and straight up tastiness. While we would have appreciated a few more mains, the ones we tried were all pretty good. At Rs. 1900, this is great value for money.\nCompared to the other buffets on this list EAT at OZO offers a limited selection, since it is more of a business hotel. While they only serve a dinner buffet, their meat dishes are excellent and they're not afriad to experiment with unorthodox ingredients. We tried their pork roulade, beef kofta as well as the roast chicken during our visit, and each of the dishes were well seasoned, not overcooked and flavoursome.\nThe Harbour Court's lunch buffet finds itself in the higher tiers in terms of price, but thankfully it offers a varied spread and arguably the best seafood selection of the places we've tried. The rest of their stuff is also generally very good, so this is a solid option all around, though their central focus is towards seafood, which we're totally fine with.\n\nWhile It doesn’t particularly specialise in a particular area, Latitude offers a well balanced spread. This one was a bit of a mixed bag with certain dishes really standing out and others not quite at the same standard. Their roasted pork loin was excellent with the meat cooked to perfection and the fat rendered beautifully. Conversely, they were clearly lacking variety in the carbs department.\nEcho at Cinnamon Grand is well known for it's Italian cuisine. They also offer a unique antipasti buffet for Rs. 1850, which is basically salads, cold meats and starters. This is different from everything else since it mainly focuses on Italian cuisine. So if you're a fan of Italian or just want to try out a variety of Italian antipasti without filling up on carbs, this is a good bet.\nEach of these buffets has an element which they tend to do better than the others, so hopefully this list will make the decision a bit easier. As always, if we've missed anything please do let us know in the comments section.\n",
  "url": "https://www.yamu.lk/blog/buffets-in-colombo"
}