{
  "title": "Burgers In Colombo And Beyond",
  "abstract": "Here's a round up of all the places you can get a good burger. ",
  "author": "",
  "date_published": "12:15pm",
  "content": "Personally, burgers are the best kind of fast food there is. Although the hamburger hailed from the US, it's very popular here in Sri Lanka and a lot of places do it amazingly well. We've already done a list of\n, but here's a round up of all the places you can get a good burger.\nThese are the burgers you pick up late at night, on-the-go in your car. They are usually the best kind.\nBurger's King needs no introduction. It's now a known landmark in the heart of Slave Island, at Vellons Passage, flooded by throngs of loyal customers in the evenings. They make big, sloppy burgers, loaded with classic combos dominated by mayo and cheese. The chicken cordon bleu remains one of our favourites, where the meat is wrapped around cheese, then sandwiched and pan fried.\nBurger's Hut is pretty much an extension of Burger's King as far as taste and efficiency is concerned. Warm soft bread, plenty of meat, mayo, cheese, can't go wrong with this one. If you're on the Dehiwala side of the city though this is more convenient than going to Slave Island for takeaway.\nThe elusive Sugar Burger Cart is less elusive since we tracked down their phone number, hurrah (check our review for it). The cart appears on Friday and Saturday nights between 9PM and 3AM, for all those who are out late at night. We've tried the burger sober too and it's legitimately awesome, and distinct: the meat is fat, tasty and battling for space with cheese and caramelized onion.\nThese are burgers that are very good but are more expensive than your average burger. They are prepared with care and sometimes some fanciness (bonus pickle and toothpick), like they're trying very hard to be more than fast food, and they usually have fries that are worth mentioning.\nWhight & Co is one of our favourite coffee shops in the big city. The coffee is excellent, but they also do a good burger. The burger slider costs Rs. 750 and comes with three little burgers - creatively put together, hefty, delicious and comes with a side of fat fries.\nThe Commons is another popular coffee place. The food and drinks are alright, but they make some interesting, meaty, tasty burgers like the bacon burger and the crab burger.\nThe Sandwich Factory has gotten mixed reviews from us. While their\nseems to have disappointed, the burgers at their\nhave been deemed good. Their classic jalapeno burger is a good choice, flavourful and moist.\nParadise Road Cafe is a super place to chill out - the decor is very pleasant, and the food and coffee are consistently well done. They make a good beef burger, with a very thick patty, soft, crumbly bread and tasty fat fries. It's the type of burger you don't want feel like sharing. It's one of the priciest burgers here however, which is how it made it onto the fancy list. If you just happen to be dining here anyway, the burger is a good way to go.\nThese burgers are from the international franchises that have cropped up all over the island. The burgers are what they are: usually just average and good enough if you're very hungry and in a hurry for a quick snack. The drive-through's and the fact that they're open till late obviously add to their popularity.\nBurger King was the most recent franchise to come to Colombo of the three here, and like Subway there was plenty of hype over it which seems to have lasted. The burgers are good although a very expensive deal for a fast food burger, especially in meal packs (Rs. 800+).\nMcDonalds seems to enjoy the most popularity of our fast food burger franchises. This is because they haven't changed in ages, and they are the most consistent franchise no matter what country you're in, efficient in serving good, affordable burger meals. Also McBurger induced cholesterol levels are easier to reach now thanks to\nKentucky Fried Chicken has long since dwindled from its glory days and is not what it used to be. But still, they make that fried chicken slathered in mayo, which is apparently irresistible regardless, judging by the throngs of visitors it continues to have.\nThese burgers are in that place between street burgers and fancy burgers, you get to sit comfortably indoors for your meal, but the burger is still cheap.\nAcropol makes a great burger - it was one of the more memorable contestants from our\n. The patty is thick but still light and complemented with a nice mix of onions, mayo and melting cheese.\nDinemore burgers, like their submarines, have that overwhelming flavour of mayo in them, which is something their loyal customer base goes for. These is just simple no-nonsense fast food, the burger comes with a slice of Happy Cow cheese and a predictable, average bread to beef ratio.\nQueen's Cafe, like Dinemore, caters to a steady base of customers in Bambalapitiya. It's a good, fast snack, and the slightly tastier, meatier alternative to franchise burgers.\nWe haven't sampled a whole lot of burgers outside Colombo, but these are some of the ones we have which have blown our minds. If you've had a super burger outside the city, let us know in the comments.\nZephyr is a recent addition to the quiet, beautiful stretch of beach in Mirissa. Right now it's the most happening restaurant there, with a bar, live music, fairy lights, like an interesting cross between classy dining and a beach-side party. They make a very distinct burger: it's very tall, and carefully assembled - a fat beef patty which was surprisingly light and crumbly on the inside, a crispy layer of bacon (optional) and egg, all coming together nicely.\nThe Original Rocket Burger in Galle Fort is another amazing out of town burger. It's easy to find on Pedlars Street, and the last time we checked had a Cuban chef behind the burgers' special recipes. The burgers come absolutely loaded with stuffing, with an entire plateful of thick potato wedges. The Gringo burger comes with fat individual chunks of chicken,fried tomato, caramelized onions, green chilli mayo, ketchup, mustard, BBQ sauce and of course, cheese. They also do a good Korean kimchi burger.\n",
  "url": "https://www.yamu.lk/blog/the-burger-round-up"
}