{
  "title": "Business Lunches in Colombo",
  "abstract": "Here's a roundup of slick and accessible places in Colombo ideal for business lunches. ",
  "author": "",
  "date_published": "9:55am",
  "content": "A successful business lunch is an excellent way to make a memorable impression. There's actually a bunch of things to consider before you pick a location, depending on the type of meeting and message you're trying to send across. At the end of the day though it comes down to whom you're trying to court, so knowing their preferences could go a long way. So here's a list of restaurants in Colombo that strike a good balance between food, ambience and service.\nResidence is one of the newest and best additions to the restaurant scene in Colombo and they're innovating more than most. For business lunches they actually have really affordable options. Starting light, you can get a soup and appetizer for Rs. 1000, or a soup and a sandwich for Rs. 1,400. The soups and sandwiches are creative excellent. One of our favorites is the mutton or quail soup and the squid appetizer, or the pulled pork sandwich.\nUga also has a sexy lunch bento box for Rs. 1,500. It's a three layered stack of appetizer, main and dessert, chosen from a rotating menu.\nWe've had business lunch here and can recommend it. It's light, you won't be gorging on rice here, but the place is conducive for conversation and you feel energized rather than sleepy afterwards. Besides the delicious and innovative food, they've got a great location at the old Park Street Hotel and beautiful interior ambience, which would make for an excellent fancy business lunch.\nIf your client is a fan of Japanese cuisine, YUMI fits the bill perfectly for a business lunch. Its one of the best Japanese restuarants in Colombo and offers probably the best overall ambience. The modern set up with a black and orange theme, which works brilliantly without being too over the top. Plus the service is also top notch.\nGovernor's Restaurant at Mt. Lavinia Hotel is probably the best spot if you're looking for a place by the sea with a view. Unlike most places you can choose either to sit inside the restaurant which has a colonial vibe, poolside, or on the terrace which directly overlooks the ocean. They offer both an à la carte menu and a lunch buffet, but we recommend the latter since its great value for money with an incredible variety of desserts.\nIf Mount Lavinia beach is too far, the Habour Court at Kingsbury also offers a good view of the ocean, with some excellent seafood to boot. If you don't mind the somewhat steep price, their Sunday oyster brunch is one of the best in the city.\nAlthough it's located at Dutch Hospital, Ikoi Tei is actually run by folks at Hilton and it's a great successor to WIP. They do a contemporary take on Japanese cuisine while retaining the classic elements, combining in it with pleasing ambience and effecient fast service. All of it adding up to a hassle free experience which is what you'd want when it comes to a business lunch. Alternatively, if you find dutch hospital a bit too crowded,\nat Hilton makes for a more private setting with quality Italian cuisine.\nTaprobane at Cinnamon Grand rounds up our trio of Hotel restaurants. Like it's counterparts, Taprobane offers an excellent selection overall with an emphasis on variety. Taprobane is our pick for best salad and cured meat selection. Its simple yet sophisticated ambience also makes this ideal for business lunch.\nVerandah is a poolside restaurant in the Hilton Residences (JAIC). It's a bit hidden three stories up but they do a good take on hotel food with an interesting view. JAIC isn't really one of the more crowded hotels in Colombo so Verandah is a solid choice for those looking for restaurant that doesn't get too crowded.\nIf you want to be a bit adventurous, HVN at Casa Colombo offers a unique if a bit over the top dining experience that's sure to be memorable. With the all the bells and whistles at CASA it's easy to overlook the food, but HVN offers a range of continental fusion dishes and they do it quite well.\nFrench cuisine is a rarity in Colombo, but thankfully we've got Cafe Francais now. The food is really, really good. This is an international quality fine dining restaurant and the obscene quality of the food is worth every rupee. The setting is also very chic and classy, without seeming too formal.\nThe Park Street Mews restaurant does some of the best plating we've seen in Colombo and it's surprisingly affordable. The location on Park Street is also quite central. They offer a popular 3 course business lunch for Rs. 1,200.\nSemondu isn't cheap, but it also isn't as expensive as the ambience suggests, with a menu that offers dishes from a whole range of price points. So if you're in town looking for a (semi) fine dining experience that won't empty your wallet, give these guys a shot.\nFlag And Whistle is a German restaurant overlooking the Colombo Port. It has a beautiful, spacious locations and some hearty if expensive food. The only thing is that its location is actually pretty far for people living in Colombo South.\nThe Gallery Cafe is one of those perpetually hip spots in Colombo. The ambience is one of a kind and the  food is consistently good, but it does tend to get very crowded. While Gallery Cafe is pretty expensive the ambience is one of a kind with Geoffrey Bawa's artistic influence. So if you don't mind the crowds, this is great choice for a casual meeting.\nSugar actually lies somewhere in between casual and fancy with aspects from both ends. As the name suggests they know their wines and complement it well with some tasty food. They've got a very accessible location at The Crescat Boulevard as well as very tasteful interior decor.\nThis is Sri Lanka, we love cricket. Should you find yourself with a client that is a fan of the sport, Cricket Club Cafe will most likely make them very happy. Cricket Club Cafe is a cricket lover's paradise with cricket memorabilia adorning every wall and corner of the club. Their food is also consistently good and come in hearty portions.\nIf your client is a coffee lover Whight & Co is probably the best spot in Colombo. Besides the obviously excellent coffee, W & C does a great take on cafe style food, with a good location that on Marine Drive just meters from the ocean.\nWe like Java Lounge, and we find ourselves having casual meetings there quite often. The coffee itself isn't the best in town, but they manage to strike a healthy balance between coffee, food and ambience.\nTea Avenue on Barnes Place is one of the newer coffee/tea spots that opened up late last year. While Barnes Place offers a whole bunch of cafes, we like Tea Avenue particularly because of the really classy interior decor with a mix of modern and classical elements to go along with their hardwood floors.\nThat, of course, isn't all there is. As people have said in the comments, 1864 and\nare good for lunch, as is\n, for a more bohemian vibe. Also\n, the\nand - under coffee-shops -\nand\n.\n",
  "url": "https://www.yamu.lk/blog/business-lunches-in-colombo"
}