{
  "title": "Celebrating Chinese New Year In Colombo",
  "abstract": "Happy Chinese New Year to everyone from all of us here at YAMU. If you'd like to join in, Colombo's…",
  "author": "",
  "date_published": "9:18am",
  "content": "Happy Chinese New Year to everyone from all of us here at YAMU. New Year's Eve on Feb 18th is the big event, followed by lesser celebrations till March 5th. If you'd like to join in, Colombo's many Chinese restaurants (and hotels) will be hosting dinners starting on New Year's Eve and proceeding throughout.\nWe also recommend checking out the\non Dialog TV or at a Chinese restaurant. It's probably the most watched TV program ever (read more in the\nsection).\n\nChinese restaurants are obviously a good place to celebrate the Chinese New Year (they're usually full of Chinese people), but the five star hotels also go all-out and sometimes offer you a bit more guidance via set menus.\nThis cheap but tasty spot on Deanstone Place has a barebones ambience (and prices) but their dumplings and food are delicious and they'll definitely be showing the CCTV Gala on satellite. (112576533)\n998 should be buzzing on the New Year. They have room for 200 people, a TV definitely tuned to the gala and authentic Chinese food (and endless green tea). (772585455)\nFortune Boat is a beautiful location with authentic, tasty food. We don't think they'll have a TV though. (114368866)\nWe've honestly had middling experiences with Moon River food but it's definitely popular with Chinese people (especially tour groups) and they definitely have Chinese TV. (112596882)\nSunlight Garden does really tasty and authentic Chinese food, and we've especially enjoyed their dumplings. Think there's a TV in there, but not sure.(114342666)\nTang Dynasty on Dickman's Rd is a higher end Chinese place. What sets Tang apart is that it’s new and they’ve spent on ambience. They have private rooms upstairs and it’s a good place for entertaining. (113288800)\nTsing Tao does excellent Chinese food in a beautiful location at the Racecourse. It's expensive, but we generally haven't been disappointed there. (112698989)\nBeing on the beach, Loon Tao is one of the few places that will probably have fireworks. Loon Tao does reliable beachside Chinese on the Mount Lavinia beach. (112722723)\nMost of the five-star hotels have Chinese chefs and pay a lot of attention to holidays like this. The food is good and they hopefully will make an experience out of it. Don't think they're showing the gala, though.\nYue Chuan is the Kingsbury's Chinese restaurant, well appointed and run by a Chinese chef. They'll definitely pull out the stops - so look out for tasty dumplings, maybe even Chinese New Year cake. It's also a nice ambience to dine in. (771087720)\nThis Taj property is completely redone, and quite well. They have three Chinese chefs one that does just dim/sum, dumplings, so that side should be good. It's also a beautiful space and auspicious in terms of color and decorations (gold, dragons). (115446622)\nLong Feng Chef Yang is offering set menus for lunch (Rs. 3,400) and dinner (Rs. 3,750) covering a range of styles and preparations (Sichuan fried prawn, tofu dumplings, fried lamb, etc). Lakeside is also playing traditional music and will be decorated for the occasion. (112491949)\nChef Zhiquang Qui is preparing a special Chinese buffet for the New Year for Rs. 2,900 per person. There's a beautiful view and he's quite an experienced chef. (112711711, ext 430)\nChinese New Year is a lot like the Sinhala/Tamil New Year in that it runs over a long time (two weeks) and involves cleaning up all the mess of the past year and starting over. Chinese traditions, however, are very different.\nFor example, according to their traditional calendar,\nhas a 'birthday' on the seventh day of the New Year (Feb 25). Even dogs have a shared birthday, on the 2nd day (Feb 20). Beyond that, Chinese people celebrations involve a lot of food, like everyone really.\nOne awesome tradition we don't have is the\n. This TV program is watched be an estimated 700 million people across the world. This year it includes singing, dancing martial arts, Chinese traditional fashion shows and much more.\nSo those are a few suggestions on how to celebrate the Chinese New Year in Colombo this year. Sri Lankans have been friends with Chinese people for thousands of years and in recent years we've seen more cultural, commercial and tourist exchange than ever before. The New Year is a nice chance to learn more about China and, of course, to eat tasty Chinese food. We hope you enjoy it.\n",
  "url": "https://www.yamu.lk/blog/chinese-new-year-in-colombo"
}