{
  "title": "Charities To Give To & Places To Visit This Christmas",
  "abstract": "Christmas is just around the corner and apart from the merrymaking the season is known for, it is also known…",
  "author": "",
  "date_published": "11:14am",
  "content": "Christmas is just around the corner and apart from the merrymaking the season is known for, it is also known as a month of giving. Interestingly the word charity is derived from the Latin word Caritas which translates to preciousness, dearness, high price.and an unconditional love for others. So we have put down a list of charities you can connect to, either to volunteer or donate to.\nDecember 12 -13\nIf you are in Galle, there is ECSAT, who do wonderful work with differently abled children. They are having a Christmas sale at Zylan Luxury Villa on December 12 -13. Zylan Luxury Villa 115 Rosmead Place Colombo 07. Contact\non 912 248 475 or 773489222.\nDecember 13\nIf you are a runner, there's this charity 5 KM run organised by Rotaract Club of Colombo Uptown (RCCU). They are running in aid of the National Cancer Institute of Maharagama, to raise funds towards the purchase of medicine and equipment for the National Cancer Institute, Maharagama. For more information contact 77 676 0730, 77 370 2677 and 776 070 444.\nDecember 10 - 19\nThe STITCH MOVEMENT is thinking of dropping in at the a whole lot of children's and elders homes to spread some good cheer. Christmas With Love will be sharing their good tidings by reaching out to more than 600 children and elders. If you want to join in spreading the love this holiday season or want to donate gifts, here's their schedule or connect with them on 776 975 553, 777 512 416 for more details.\nDecember 13\nSALL is an annual event, and their efforts help 160-175 children and 800 adults at the CCC Foundation, Maharagama. SALL plans to have a magic-show and magic balloons in the play room for the kids, a time for giving gifts, with goody bags and cash for carers in the kids' wards. They will also be providing goody bags to all adult patients. There will also be a time of entertainment with two Calypso bands who will take turns to visit each ward. To donate call or text 777 675 708 or send your donation to the account they maintain for this project at HNB. Savings Account no.: 009020622580. Account Holder MKE Perera. Swift code HBLILKLX, Bank code 7083, Bank branch code: 009 - Wellawatta\nDecember 15\nThe Soup Bowl is heading out to the streets this Christmas with Christmas gift packs for street people. The aim is to make 100 gift packs. These gift packs include, a toothbrush, a tube of toothpaste, a cake of soap, a comb, a bedsheet and an umbrella. Right now they are only short of umbrellas and bedsheets. A bed sheet is Rs. 800 and an umbrella is Rs. 440. If you would like to either donate or sponsor contact 772 838 939, 714 233 614, 774 841 134. Collections stop on December 15.\nthe Drizzling Foundation has started collecting 100 school bags and stationery for underprivileged children for the new schooling year. If you would like to donate, each bag costs Rs. 375, and stationery costs Rs. 1000 per child which is inclusive of water bottle and lunch box, a pair of shoes costs Rs.1300. To contribute contact 773 753 743 or 722 215 730.\nDecember 11\nSalvage Sri Lanka is holding a yummy bake sale from 11 AM to 6 PM. All proceeds from the sale will go to various charities they support. To find out more visit them\nor contact them on 777 428 777.\nDecember 1 - 31\nSocialService, a charity that engages in social work all year through has a host of projects till the end of the year. Check their schedule if you would like to volunteer and/or donate towards any one of their events. To find out more information contact them on 772 381 981.\nHome located near the Gangaramaya is home to about 50 elderly males. You can call them to find out what they require. 112 682 397, Email: colomboymba@sltnet.lk\nis home to 18 - 20 elderly gents. The Home is located in Wellawatte. They would love some company. Most of the gentlemen have family and some don't have anyone. You could either take a meal or something for tea. Your time alone would be a blessing to them. Call the Matron for more information 077 4170 029.\nlocated in Makola, is home to about 20 elderly aunties and uncles. You can make their lives more pleasant by spending some time with them. For more information contact 11266800 or email ifham@maliban.com\nThere are 240 differently abled children at\nand they would be very excited to have a visit from Santas and the whole works. Call them on 112 930 635, 112 945 247\nThe\nhas a jolly bunch of elders who would absolutely love your company. You can call them on 772 449 380.\nThe little infants at\nwould definitely benefit with gift hampers of baby items and milk powder. You can call them on 112 655 255.\nlocated in Moratuwa is home to 26 odd elderly ladies and gents. They love the company more than anything but the home always has basic needs. Some Christmas cheer would also do them plenty good. Call the matron on 114 871 349 to find out more.\nis home to 40 children who are mostly orphans. You can contact the home to find out more on how to give on 112 634 875 or drop them an email to info@islamiahome.org\nThe\nis a home has 60 young boys. Sri Jinananda Children's Home Sri Sugatha Viharaya, No1, Dharmarama Road, Wellawatte. Call them on 772 388 713 or 112 587 534\nThe\nhoused 25 boys and the home is located at Colombo 6. For more information contact 112 587 175\nIf we have missed out on any charities or projects, do add them on the comments section to help out those who would like to connect.\n",
  "url": "https://www.yamu.lk/blog/charities-to-give-to"
}