{
  "title": "Charities & Projects To Give To This Season",
  "abstract": "Want to give back to others this season? Here are some suggestions.",
  "author": "Rishani",
  "date_published": "11:51am",
  "content": "We’ve come up with a list of events and initiatives that benefit the less privileged during the season. They need all the support they can get in terms of donations and time. So do lend a helping hand with those who have very little by digging deep into your hearts and pockets.\nwill head to the Apeksha Hospital once again on the 10th of December to spread a lot of good cheer and tidings. They are currently in the process of collecting and finalising gift hampers for inhouse patients and need as much help as possible. Inbox them on Facebook for more information on how you can be part of the initiative.\nis collecting reusable sarees to make new clothing for less privileged kiddies. You can drop off your old sarees at 34 Ward Place, Colombo 7 (next to Coco Veranda) or give them a call on 776 800 000 or 759 321 132 to arrange a collection.\nis working on their 12 Days To Christmas projects. Their actions include the City Cleaners Appreciation Day, Appreciation Lunch For Police Officers, School Pack Donation to 1500 Children, Support Towards 100 Widows In Eravur, Secret Santa Project and many more. To support their various Christmas projects, you can direct your donations to:\nAccount No: 101000432815\nAccount Name: The Voice Foundation\nBank/Branch: NDB (National Development Bank) Battaramulla, Sri Lanka\nSwift: NDBSLKLX | Bank code: 7214 | Branch code: 8090\nis hosting their annual\nthis Christmas again. For the third consecutive year, the project aims to give useful presents to 150 adults and 50 kids from poor families or living on the streets. To donate to this project, contact 774 841 134, 769 123 488 or 714 233 614.\nFor the 10th time,\nis making sure no one goes through the festive season feeling alone or forgotten with their\ncampaign. You can help STICH by donating gifts or money, volunteering to sing or play music during their visits to Children's and Elders' Homes or by simply joining in the visits and having a chat with people. If you're motivated, don't hesitate to contact 776 975 553 or 777 512 416 or to email christmaswithlove2017@gmail.com\nThe Kandy District President Scouts and President Guides are organising\n, a kite and sky lantern event, in order to raise funds for the Kandy Cancer Home where more than 100 patients are undergoing treatment. Join them on the 16\nof December 2017 on Galle Face Terrace.\nand Women in Management (WIM) are organizing Village In the City on the 2nd of December at Bayleaf Restaurant, a sale to promote the sustainability of the local handicraft industry and to empower rural women entrepreneurship in Sri Lanka. You can help them fundraise for their cause by attending\n.\nInaugurated in 2010,\nis a 5 km charity run organised by Rotaract Club of Colombo Uptown (RCCU), a proud member of Rotaract District. This year, it will take place on the 10th of December at the Racecourse in Colombo. The aim of the event is to raise fund for the National Cancer Institute in Maharagama. So start training now.\nPrithipura Communities is raising funds for their school in Cotagala. You can  donate to the Cotagala School via Global Giving. The Cotagala School provides education and vocational training to 80 children and young people with disabilities, many of whom have no family support. To give\nThe\nof are visiting the Lady Ridgeway Hospital to share some hope, and good tidings and are in need of finances to purchase their hamper packs. The following are the requirements. To give, contact the relevant numbers provided.\n\n\n\n",
  "url": "https://www.yamu.lk/blog/charities-projects-to-give-to-this-season"
}