{
  "title": "Children's Parks and Playpens in Colombo",
  "abstract": "A list of children's parks and play pens in and around Colombo.",
  "author": "ShaliniIR",
  "date_published": "8:30am",
  "content": "Children are small and their daily needs are limited to food, playtime and attention. It's your duty to feed and pay attention to your kid, but we at YAMU can help you out with play time with this list of children's parks and playpens in Colombo.\nThis probably one of the best known parks around Colombo. It has a cycling track and a vast expanse of green lawns for kids to play in, and is also surrounded by many ice cream trucks to shield you from the Colombo heat.\nThis name more or less translates to \"happy land\", so I suppose it will bring a lot of joy to your children. This park is located on Dharmapala Mawatha, near Town Hall, and is also a part of Viharamahadevi Park.\nBack in its hay day in the 80s and 90s, this used to be *the* spot to take your kids in Colombo. They've downscaled and made it more child-friendly though, now there are a few play areas with rubber matting and other safety precaution the age demands, and none of the rusty yet thrilling carousel rides in fighter jets of the past.\nIt's not exactly a park, but there's plenty of room to run around, fly kites and buy those really colourful light thingies.\nOfficially named\n, this park is quite small but it's got massive figurines that are very colourful, which may appeal to children (adults, I'm not so sure), but there's free Wi-Fi there so that gives you a reason to go there, However, there's a bridge under construction nearby so there may be a lot of dust around, not to mention blaring horns because of the busy junction.\nThis park, on the corner of Havelock Road and Park Road, is named after Sri Lankan Independence fighter and hero Henry Pedris, but Nabeela calls it Jurassic Park because they have a dinosaur statue there!\nExcel World has been around 5ever. They have many facilities including bowling alleys and gaming zones. They also have Park called \"Adventura and Naughty Castle\", which is home to one of, if not the biggest bouncy castle in Colombo.\nThis place is for children below the age of 12, they've got a \"jungle gym\", which in all honesty is as rad as it sounds. They also can be rented for private parties, hence potentially making your kid the coolest on the block. You can visit\nand find out all the cool things they have to offer.\nMajestic City (or as we like to call it, MC) is like every Sri Lankan's go to spot. Be it for movies, last minute birthday presents and also just a super fun place to let your kids play in. They've got everything from bumper cars to bowling.\nJawatte and Kotte have some nice play areas.\nThe\n, Nugegoda and Rajagiriya branches in particular,\nThe one on Union Place has a nice set up. You can book private rooms for children's parties, although it comes with a VERY SCARY looking Mickey Mouse.\nThere's a small little play area here to keep your kid entertained while you eat cake.\n",
  "url": "https://www.yamu.lk/blog/childrens-parks-and-playpens-in-colombo"
}