{
  "title": "Chinese Restaurants in Colombo",
  "abstract": "Here's a list of Colombo's repertoire of Chinese restaurants.",
  "author": "",
  "date_published": "12:15pm",
  "content": "Chinese is arguably the most popular cuisine here in Colombo, which is ironic since Chinese restaurants actually outnumber proper Sri Lankan eateries. Anyway here's a (pretty long) list of the options, some old, some new and a few of our favourites.\nMin Han takes the unanimous top spot among Chinese restaurants in Colombo. It's not much in terms of ambience but the food is consistently excellent and they manage to strike a great balance between Sri Lankanized and authentic.\nTsing Tao is pretty much the only non-hotel fine dining Chinese restaurant in Colombo. Their prices are a bit higher than some of the more mainstreams spots, but the food is good, the service is professional and the setting is elegant.\nWhile The Station isn't really a dedicated Chinese restaurant, we think they offer some of the best Sri Lankanized Chinese in town, with a great view of the ocean to boot. Their hot butter cuttlefish in particular is brilliant.\nTong Ni BBQ is one of the few places that can be considered unique. Their approach is somewhat similar to Korean\ncuisine where you cook the food at the table using the built in barbecue. The hands on style may not be for everyone but it makes for an interesting experience.\nGolden Dragon is the Taj's completely redone Chinese restaurant. The ambience and decor is one the best in the city and the food is quite good. It makes for a great Chinese dining experience.\nYue Chuan at The Kingsbury does a mostly authentic take on Chinese cuisine at a surprisingly affordable price point considering the setting.\nEmperor's Wok at Hilton is one of the more expensive Chinese restaurants in Colombo, but we didn't really feel that it was good enough to justify that price point. One thing we can suggest is their all-you-can-eat dim sum offer which happens on Sundays.\n\nLong Feng is Cinnamon Lakeside's Chinese restaurant. Their food is generally decent but they lack a wow factor to set themselves apart from the rest of the pack and like most hotel based restaurants the prices are pretty high.\nAnzu's is a small family run Chinese eating house on Marine Drive. It's run by a Chinese family and its one of the few places where you can actually experience authentic home cooked Chinese, although it may not be to everyone's liking.\n\nWe've noticed one thing to be true about Tang Dynasty, which is that you either love it or hate it, and that's mostly due to the fact that their food is very authentic and they don't compromise on that.\n998 on Alexandra Place is yet another new Chinese restaurant to open up in Colombo. Their stuff is quite authentic and pretty good. Their customer feedback, however, hasn't been all that great.\nGrand Beijing also falls in the same boat as 998. They had a strong start but haven't seem to have maintained that momentum.\nPeach Valley is one of the Chinese oldies that still seems to be getting a steady stream of customers on a regular basis. They recently had a refurbishment (December, last year), which has definitely helped the overall look and feel of the place. The food is very Sri Lankanized but it's still quite tasty.\nSunlight Garden is actually one of the older Chinese restaurants in Colombo but it manages to fly under the redar. The good thing though is that the food is actually very tasty and the setting is pretty nice as well.\n88 Chinese Seafood Restaurant is a long time player in the local Chinese food scene. It's incredibly popular among both locals and Chinese expats. They offer both authentic and modified dishes, but we feel that they need to step up their game with all the new entrants.\n168 is actually quite similar to 88 both in terms of food and ambience, perhaps with a bit more emphasis on the seafood. Just like it's numerical rival 168 too boasts an avid customer-base, but they too are in need of a bit of a facelift.\nFor a cuisine with so many restaurants it's actually pretty disappointing that no one does really great Chinese food delivery. However, if you do like Sri Lankan Chinese, Suki's Wok does a pretty efficient and affordable delivery with ample portions.\nChinese Dragon is the oldest Chinese restaurant chain in Sri Lanka dating all the way back to 1942. They pride themselves on their Sri Lankanized take on the cuisine. Their delivery was efficient but the food ultimately disappointed. That being said, their restaurant is up for re-review.\nMoon River is one of those spots in Colombo that seems to be always full. While large crowds usually means good food, that wasn't the case for us. The food here was mediocre at best and the service towards locals is borderline rude.\nThere's actually a bunch of more places like\n,\nand\nwhich we haven't gone into detail here ('cause it's getting hella long) . You can find all the full reviews in our\n.\n",
  "url": "https://www.yamu.lk/blog/chinese-restaurants-in-colombo"
}