{
  "title": "Chinese New Year At Mainland China",
  "abstract": "Celebrate the Chinese New Year at Mainland China.",
  "author": "",
  "date_published": "3:34pm",
  "content": "If you didn't know, today (16th) is the Chinese New Year, also known as The Spring Festival. It was originally a ceremonial day to pray to gods for a good harvest season because as an agrarian society, their harvest was everything. People also prayed to their ancestors, whom they revered (watch Mulan for reference).\nOne of the most interesting things about this celebration is that you're supposed to eat dumplings for every meal, every day for 15 days (which is how long the festival lasts). Not many people do that anymore because you can have too much of even the most delicious foods, instead, they either have it on New Year's Eve dinner or breakfast the morning after.\nhas successfully earned a lot of popularity for the past couple of months, and rightly so. Their Chinese cuisine is quite good, though relatively expensive and lacking pork.\nThey have a special menu for the Chinese New Year from 15th - 25th of February. So if you're planning to celebrate this joyous festival or simply just want to try their new items, head down there. The menu is also vegetarian-friendly.\nAs soon as we arrived we were served a welcome drink which is called a Malaya Spice Melon. While it had the familiar watermelon taste, there was a strong tang to it that was very refreshing.\nAlong with the drink, we were served a Shangsi Crab Meat soup. It was indeed very tasteful, the egg whites and the crab stock giving out strong flavors.\nThen came the Fragrant Prawn and Tomato Dumplings. The prawns were soft and chewy, left us wanting more. They also served a Chicken Bao which is best shared between at least two people. It fills you right up so we would not recommend that as a starter.\nLet's talk about the Crispy Lotus Stems with Curry Leaves and Black Pepper. If you ever visit Mainland, do not leave without trying this. It's a party in your mouth. The stems were crispy and crunchy with strong sweet and chili flavors that you just cannot get enough of. It was an inventive dish, considering how often we lotus stems as a curry but never thought to do something more with it.\nThe Taipei Chicken was nothing special. While the chicken was well cooked and seasoned, the sweet and sour flavors were just mediocre.\nWe were also served a Fire Baked Fish with Red Peppers. It's a great starter for any meal, and quite frankly, could be served as a main dish as well. It was one of our favorites as the fish was baked to a perfectly crispy coating with a tender inside. The red peppers gave it a spicy twist which many of us always appreciates.\nThe Eggplant in Yuxiang Sauce was a crowd favorite. There were a lot of oohs and ahhs all around. I'm not the biggest fan of eggplant but this I would have devoured in seconds had I been alone. The Yuxiang Sauce is the star of this dish. Consisting of pickled chili, white scallion, ginger and garlic, it is a traditional sauce in which meat or vegetables are cooked.\nThe Wok Tossed Chili Garlic Prawns with Egg Whites was another great dish. Believe it or not, the prawns were just as soft and tender as the egg whites. They have managed to elevate the flavors of these dishes with their sauces.\nThe Wok Tossed Fish with Honey Mustard Sauce was served with the fish done well and soaked in a generous sweet mustard sauce.\nThe Cantonese Style Mint Chicken was a little bland for our taste. That being said, the Manager told us that he specifically included it in the menu for a variety since most of the dishes were either fried or baked, hence quite heavy. It makes sense but the chicken could have had a little more flavor to it.\nWe're Sri Lankans, so whatever rice it is, we know how to do it right. The Black Pepper Chicken Fried Rice was delicious and filling with a slightly sticky texture to it (yup, chopsticks!). It could not have been any better. There was a generous amount of chicken bits as well.\nThe Braised Shanghai Vegetable Noodles was our least favorite dish of the night. The flavors were nonexistent and the noodles itself was insipid. We would not recommend this. If you're looking for a vegetarian option, their fragrant pot rice is much better.\nThe Chocolate Rolls are similar to spring rolls but of course, made with chocolate. They were crispy, chocolatey and small enough that you can gobble it down in one bite.\nThe Coconut Caramel Custard was our Vishvi's favorite. Her face lit up like Christmas, and rightly so; because this was one of the creamiest custards I have had. The sweetness of the caramel did not overpower the coconut and custard flavor. It was so good.\nSo there you have it. It was truly a great dinner and almost all the dishes were delicious and filling. The special menu will be served until the 25th of February. Happy Chinese New Year!\n",
  "url": "https://www.yamu.lk/blog/mainland-chinas-menu-for-chinese-new-year-2018"
}