{
  "title": "Chocolate Biscuit Pudding Taste-Off",
  "abstract": "Pudding paradise... or pudding pandemonium?",
  "author": "Yaseen",
  "date_published": "4:26pm",
  "content": "Chocolate Biscuit Pudding is the holy grail of Sri Lankan desserts. Chocolate Biscuit Pudding is what dreams are made of. It is love. It is life. It's everything.\nBut sometimes, evil mortals decide to murder the beauty of this simple dessert. So, instead of entering Pudding Paradise you land on a hot mess of a Pudding Pandemonium.\nWe decided to do a quick Colombo inspection to address this serious matter and find out where this Pudding Paradise lies.\nAll the above spots are residents of Colombo and are those that have Chocolate Biscuit Pudding ready for takeaway. We tried to get our hands on the Green Cabin and Kittypak CBPs, but unfortunately for us, they had none in stock.\nSoft, squashy and mushy, this biscuit pudding had overdosed on some fatty spread (probably Astra margarine). The chocolate icing tasted a lot like the filling used in their eclairs.While eclairs are their obvious forte, they do a satisfying biscuit pudding.\nNothing celestial though.\nLet's get real. Which part of this lazily constructed short tower looks like a pudding? The levels of sugar almost gave me diabetes and the biscuit tasted like their name - spongey. And rubbery.\nNot a fan of this even though it had some sparse bits of chopped cashew.\n\nThis is available at Keells (and probably other supermarkets too).\nThe only thing special about this was its appearance. For a pudding that has soggy biscuits with basic icing, a lazy dribble of chocolate sauce coupled with chopped nuts worked to elevate the look but sadly, not the taste.\nDivine proves that inexpensive CBP does not have to be substandard. Topped with chocolate fudge, this plastic cup was layered with biscuits dunked in chocolate cream that tasted a lot like a mousse.\nNice and divine.\nNot so classy, Klassy.\nWhile even in its partially destroyed state the CBP looked promising, the icing didn't have a strong chocolatey taste coming through. The texture was that of a pudding's and it looked like a classic Chocolate Biscuit Pudding, but the icing weirdly didn't taste chocolatey enough.\nThis is why I have trust issues.\nAvailable at Keells (and probably other supermarkets too). Disny didn't really wow us. There was a weird aftertaste which\n, our dope videographer, described as the taste of Mortein, but don't trust him. He wouldn't be alive if he had tasted Mortein.\nThere really was an odd aftertaste which is a little indescribable. If you're feeling like Sherlock and less broke, you could consider busting Rs 115 at Keells to find out.\nLooked like a classic Chocolate Biscuit Pudding. Tasted nothing like what a classic CBP should taste like. The ingredients stated brandy. So, I am blaming it on the alcohol like any sane minded person would.\nThis CBP was horrifyingly bad. Once scooped out, it looked extremely oily and tasted like a nightmare come alive. I really hope that was just one bad, unfortunate batch because it would be an utter waste of biscuits, chocolate and brandy to make the CBP we had on a daily basis.\nCurry Pot's CBP had a very creamy, mushy consistency. The cream weirdly had a slight coffee taste coming through. The C in CBP is for chocolate, not coffee, Curry Pot.\nDespite the coffee taste, I quite liked it. For 90 bucks, it was quite satisfactory.\nThis CBP could not look any more Sri Lankan with that piercingly bright, typical Lankan bakery-style rose iced on top!\nTasting strongly of peanuts, this well-layered square of Chocolate Biscuit Pudding did not taste good. Not worth buying unless you love anything with a peanut taste to it.\nMitsi's is a chocolate dessert pro. So the hopes were higher than your stoned friend.\nAesthetically pleasing, this CBP was not your conventional CBP. While the chocolate layering was as decadent as expected, you could taste the crunch of the biscuits and it wasn't soft like a pudding.\nThis is one that's highly recommended if you're into crunchy CBPs.\nThank you, Kandos, for taking some time in decorating the mass produced CBP.\nIf I recall well, their CBP was a lot better years ago. You could actually taste the chocolate instead of the margarine. Layered with super creamy (and margarinefied) chocolate, the biscuits tasted a little rubbery.\nFor Rs 400, there was a lot to dig into. Hence, it's perfect to be served to guests you dislike and don't want to make a tasty homemade CBP for.\nSkrumptious, AKA Colombo's Brownie Lord, was slightly disappointing. Too much softness, zero sweetness.\n, we really liked their CBP. This time, not so much. It may have been an unlucky batch, but still a disappointment.\nP.S:  shout out to the very friendly staff behind the counter. I had three people coming together to get me one CBP.\nThe Fab takes a small u-turn from your traditional Chocolate Biscuit Pudding by adding in a complimentary layer of whipped cream.\nThe chocolate fudge that topped the pudding was really good, but the cream and the fudge really compromised on the quantity!\nTastewise, it was good, despite the miniscule amount of Marie biscuits.\nThe Cake Factory's CBP is your ultimate CBP. Tasting of rich chocolate, this CBP had a slight mousse-y feel to it, but it didn't drown the biscuit texture of a classic Chocolate Biscuit Pudding. On the sweetness meter, this pudding landed right at optimum. Ticking all the boxes, The Cake Factory is your go-to spot for good old CBP.\nIt's also noteworthy mentioning that this little dessert spot topped our\n!\na) Trying fourteen Chocolate Biscuit Puddings of which 10 weren't upto par can get stomach-churning\nb) I realized Sri Lanka has evil mortals who like to dish up CBP that puts the country to shame\nc) Don't judge a Chocolate Biscuit Pudding by its icing\nd) I need to learn to make my own damn CBP by\nWatch the YAMU crew make their way through 14 CBPs here -\nHappy Chocolate Biscuit Pudding-ing!\n",
  "url": "https://www.yamu.lk/blog/chocolate-biscuit-pudding-taste-off"
}