{
  "title": "Christmas Hampers 2015",
  "abstract": "Find out where to pick up Christmas hampers this season!",
  "author": "Kinita",
  "date_published": "10:12am",
  "content": "Christmas in Colombo is a time of gifts and decadent seasonal treats. Lean into it, and impress your friends and corporate cronies with some charming hampers. There are lots more, but here’s our list of popular and easy options when you want to pamper with a hamper!\nThese sites all offer pre-packaged hampers that can be delivered both locally and internationally. They’re smaller and more personal, so are good options if you live abroad and want to send something for family or loved ones.\nThe delivery website’s hampers are mostly practical seasonal collections of dry rations and groceries like sauces, cookies etc, and the range is pretty limited. It’s a little bit pricey given the stuff that’s actually inside, but if you live abroad and want to send something useful to people in Sri Lanka over the season, it’s handy. They also have normal grocery hampers around the year.\nAnother option that allows you to send gifts to Sri Lanka or within Sri Lanka, lankagifts.com has prices in both USD and LKR. Their hampers are a little more varied than Kapruka’s, with a range of chocolates and imported edibles. They’ve also done a wide range of hampers, that focus on different themes like chocolate or wine or even pasta.\nSendit.lk is a relatively smaller company (or so we assume, as we haven’t heard too much about them), but their hampers look reasonable and have plenty of options to choose from. Again, these heavily feature groceries and such.\nThis site has an entire section devoted to Christmas Gifts that can be sent to and within Sri Lanka, from hampers and chocolates to cards and flowers. Lanka Food’s variety is good, but their site is archaic and kind of difficult to use. We couldn’t actually open the detailed sections of hampers, so that’s a huge minus.\nPretty much all of the island’s top supermarkets do a neat selection of Christmas hampers.\nArpico’s got a sleek new tab on their FB page dedicated to this year’s hampers. They’re also offering a lot of card discounts and quantity discounts, along with free delivery within 5km of outlets. With their variety, reliability, and discounts, it’s looking like one of the best options this season. Their hampers are obviously stuff that you’d find at their supermarkets, and the more expensive ones include a fair bit of premium alcohol. We think Arpico’s hampers are probably one of your best options this season.\nWith a massive variety of 16 different hampers, all named after Christmas carols, Keells has cornered the market in reasonable hampers again. The basic hamper includes stuff like a packaged Christmas cake, jams, and other nibbles. The more expensive hampers include stuff like imported cheese and pasta along with a set of 6-10 bottles of imported liquor. Visit any of their branches or check out their site to buy them directly on keellssuper.com\n\nCargills and Laugfs are yet to launch their hampers, but we will update this list when they do!\nPretty much all of Colombo’s upscale and 5 star hotels do posh, boozy, and expensive hampers for people out to impress. This year, very few are doing ready-made ones, leaving it to you to choose your own components.\nTo get a Hilton hamper, you’ll have to go to Fine Things (the dessert place near their lobby), and have a look through their existing list of options. They will wrap and deliver the hampers for you, with delivery within 20km of the hotel charging anything from Rs. 700 to Rs. 1,500. Goodies cakes and cookies are generally stellar and pricey, and there’s also plenty of upmarket alcohol you can add on.\nThe Kingsbury has 3 categories of ready-made hampers, at Rs. 20,000, Rs. 25,000, and Rs. 30,000. It’s not cheap, but neither are the well-curated edibles inside the hamper. They all have Christmas cakes and puddings, along with wine, cheese, and other delectables. They’re also offering a bunch of goodies at their Gingerbread House, with the a whole selection of cakes and desserts. For a comprehensive list and to place an order, give them a visit or call on 0771087720.\nThe Cinnamon Grand isn’t doing any readymade hampers this year, but the Goodie Hut is offering personalised hamper baskets. Again, you’ll have to go over there and order according to their existing Christmas menu. They have the usuals like cake, pudding, and cookies, but they don’t do delivery, and will charge Rs. 1,500 for packing and wrapping. Probably not the best deal going, but Goodies’ desserts are usually great so it might be worth a shot.\nThe Taj is doing two lovely and superbly expensive ready made hampers this year. One is Rs. 38,000 and the other is Rs. 48,000. They both include decadent components like a bottle of Moët\nThis list should get you started if you're in a hurry to kick off the season, but we'll update it with more that we hear about, try, or enjoy soon!\n",
  "url": "https://www.yamu.lk/blog/christmas-hampers-2015"
}