{
  "title": "Christmas in Sri Lanka: How To  Celebrate Without Snow.",
  "abstract": "It's Christmas Time!",
  "author": "",
  "date_published": "12:12am",
  "content": "Tinkling bells, high boots, warm coats and shawls wrapped snugly around you as you walk crisply through snow-peppered streets decorated with firs and mistletoe: that's the image that's conjured up whenever you think of Christmas, thanks to all the lovely Christmassy movies we grew up with.\nDecember automatically comes with festive cheer, and Colombo gets decked up. It's one of the few festivals in the country which everyone partakes in, be they Sinhalese, Hindu, or Muslim: you just can't help being swept in!\nAll the pine trees and colourful explosions of light. The smell of fresh pine needles when the trees are real, or just the deep plasticky green when it's not. Nothing says Christmas as loud as the tree, and no home, office, or public space is complete without it. Nearly every window will compensate for snow with fluffy balls of cotton glued onto their glass display walls, and fairy lights twinkle across stores and streets.\nAccompanying the trees, cotton snowballs and twinkling lights, there are all the goodies and amazing deals. It's like the larders from an Enid Blyton book comes alive, what with everything that gets cooking. Wine in all forms flows freely, and Negombo's milk wine is revived with enthusiasm. Also, Christmas cake: boozy, fruity, and rich, you can make them at home,\nColombo decks itself out and\nthe hotels are dressed up in wintery deco; from\nto The Galadari,\nwith the upcoming carnival at the\n, Galle Road is a stretch to keep an eye out for this time around. If you're into dressing up and enjoying nice dinners, here's a list of all the\n.\nWhile cheeriness wafts in the air, you sometimes need a little nudge to get involved: and this is where Secret Santas and candy comes into play! Plus the sales, all the amazing sales that\n. For some reason, people are a\nmore friendlier and giving during this season, so there's plenty of opportunity to get involved and help someone out, be it financially or merely by spending a bit of time with the elderly.\nNot everyone gets all happy and ecstatic when Christmas arrives. That's okay though, and if you're unsure of what to get people like most grinches, we've got this\nto help you out.\nThe opportunities are endless — if you don't know of any personally, just take a peek at your FB event page or our\nMerry Christmas!\n",
  "url": "https://www.yamu.lk/blog/christmas-in-sri-lanka-how-we-still-celebrate-without-snow"
}