{
  "title": "Christmas Day Lunches 2015",
  "abstract": "It's the season to be merry. What better way to celebrate than with some great food?",
  "author": "",
  "date_published": "4:07pm",
  "content": "As YAMU tradition dictates, we're forever committed to the quest of helping people satisfy their inner foodie - be it lists, reviews, or seasonal offers. Living up to that commitment, we've got a list of places which are having special Christmas Day lunches should you wish to indulge yourself. 'Tis the holiday season, so loosen up and get ready to immerse yourself in some international buffets. Please keep in mind that these menus are liable to change, so do call and check up before you head over.\nMeanwhile, if you want to go for a dinner instead, check out our article on your\noptions.\nrare does some great dishes, especially with local products. Meals there have basically never disappointed us. A rare find indeed. For this Christmas, they've planned out a five course meal, accompanied by a live band and a dash of wine.\nCasa's gotten an elaborate six-course meal planned out.\nThe Sovereign German's got some meaty dishes lined up this year, with roasted lamb, roasted turkey, lamb shoulder, honey roast pork, and English gammon steak on the menu. There are two different menus, so the price would differ based on your selection.\nThere are a couple of buffets up over here, an international one, and a seafood one.\nThis is where you get to choose if you want your meal on land or on water. Cinnamon Lakeside offers midday meals both at their famed Dining Room, and on the boat.\nThe Bubbly Brunch is on the boat, whilst their international buffet, should you prefer that instead, is indoors.\nWe recommend the Grand because they've got pretty dope buffets. Check them out and let us know how their Christmas Specials are.\nThe view at this iconic hotel is something worth seeing. They've got an international buffet set up for the season.\nThe Bayleaf has a three course meal planned out, with some mains which sounds absolutely heavenly. Prices depend on what you order.\nThe Hilton's got their buffet up at Spices. That's all they told us, and that it's from 12 - 3PM.\nWe've covered a restaurant, a couple of boutique hotels, and a bunch of hotels. If we've missed anything, let us know. There'll be a couple more posts on X'mas dinners and NYE parties soon as well.\nIn the meantime, if there's anything we've missed or anything more you'd like to see, hit us up in the comments section and do let us know.\n",
  "url": "https://www.yamu.lk/blog/christmas-lunches-2015"
}