{
  "title": "City Hotels in Colombo",
  "abstract": "Some of the best luxury, boutique, and business hotels in Colombo city.",
  "author": "",
  "date_published": "5:39pm",
  "content": "Colombo's city hotels are in for a smorgasbord of competition in the next couple of years as the glitzy big wigs like Shangri-La and the Sheraton open shop. Until then, here are some of the tried and tested hotels in the city centre, now\n. Whether you're in town for leisure, family time, romance, or business, this list should cover you.\nThese hotels are all in the heart of Colombo's business and leisure districts. With varied waitstaff, a variety of restaurants, swimming pools, business centres, and shopping, they cover every need.\nThe former Intercontinental Hotel is totally refurbished, and perched on the growing Colombo Port City stretch overlooking the Indian Ocean. It plays host to both busy businessmen and well-off families on holiday. Their dining is great, as is their rooftop bar, the\n.\nA go-to hub for bars, restaurants, and coffee, the Grand is one of the city's busiest hotels. They're generally packed full of conferences, weddings, and revellers, so you're bound to find a friend or two. We recommend their\nfor Friday evening happy hour cocktails, the\nfor beer and a cricket match,\nfor excellent seafood, and\nfor cheap and chic Asian dining.\nPart of the Cinnamon group, the Lakeside is a little further away from the bustling action of Colombo 3. However, it's a sprawling property famous for its lake view,\n, and excellent selection of pastries and cakes.\nThe once dated Hilton is now re-imagined into a slick, sleek city hotel. With excellent buffet dining via the\n, a beautiful new lobby, and fresh rooms, it's now a top choice in the city.\nOne of the city's oldest (and probably biggest) properties, the sprawling Taj overlooks the Galle Face Green and Indian Ocean. The hotel boasts a clientele as glittering as its lobby, with heaps of fine dining options, event venues, and event space. We highly recommend\n.\nThis 1864 grand dame has played host to some of the island's most illustrious (and royal) visitors. With recently re-shuffled dining areas, the hotel has some of the city's most beautiful views and romantic event spaces. Their sea-facing terrace is a must for sundowners.\nThe Galadari's standards have slipped quite a lot of late, but they're still pretty popular with Middle Eastern and Indian tourists.\nColombo's boutique hotel scene is small but stellar. Each of our featured hotels is a labour of love, carefully curated and with personalised service.\nFunky, big on design, and with a beautiful al fresco pool and bar, CASA is one of our favourite spots to linger over a cocktail or prawn kottu.\nSituated on the busy Duplication Road, Colombo Courtyard features quirky scrap metal sculptures, a couple of cosy bars, and well-appointed rooms. Their rooftop bar is also a favourite with locals during the sunset happy hour.\nA relatively new addition to the scene, this is the only hotel on our list we haven't visited ourselves. Still, given photos, rave reviews, and personal recommendations, we felt that it deserved a mention.\nSet in a leafy little part of Colombo 5, the HPB hosts lovely cocktail sessions, and has charming colonial rooms and an al fresco restaurant that lends itself to romantic dining and drinks.\nAnother Colombo 5 gem, Ceilao is an undiscovered boutique hotel with a pool, a heap of beautiful rooms, and some of the nicest service we've come across.\nFormerly both home and assasination venue to Sri Lanka's political royalty, the converted property is now a stately and private bungalow in the heart of Colombo's upscale residential neighbourhood, Colombo 7. You'll find elegant fine dining at the restaurant, as well as great design throughout.\nThese hotels are great for short, busy stays. You may not find a lot of art, design, or a variety of restaurants, but you will find all your needs met quickly and efficiently.\nAnother recently refurbished full-service hotel, the Ramada is right next to the Taj and Galle Face Hotel. We've found the rooms to be very comfortable and fully-equipped, and their lobby a good spot for a quick chat or\n.\n\nOne of the city's taller and newer hotels, OZO is on Marine Drive and so commands a beautiful view of the sea and horizon. With well-appointed rooms suited to long business stays, lots of funky lobby decor, and quick service, they're a strong choice at reasonable prices. We'd also recommend you check out\nfor a drink with a view.\nThe newest kid on the block, ZMAX is right behind the tourist hub of Dutch Hospital. They've got a\n, a\n, and rooms we haven't checked out yet.\nPart of the massive Cinnamon hospitality structure, Cinnamon Red is a tall Colombo 3 tower very close to Liberty Arcade, Liberty Plaza, and the Colpetty Market. It's reasonable in comparison to Lakeside and Grand, and features\n.\nColombo's hotel scene is constantly expanding, with plenty of cheaper and more obscure options. Most of these are situated on either Galle Road or Marine Drive, which should connect you to most destinations post-haste. If you're on a budget and\ndon't work for you, try :\n\n",
  "url": "https://www.yamu.lk/blog/hotels-in-colombo"
}