{
  "title": "Classes at High Octane Fitness",
  "abstract": "A review of just a few of the classes offered at High Octane Fitness.",
  "author": "Iman",
  "date_published": "1:26pm",
  "content": "High Octane Fitness, located in Nugegoda, has been around for roughy 4 years now, and offers some of the most high-end gym facilities in Colombo. They also offer a pretty extensive range of classes - from circuits to spin to classes training specific muscle groups - so I decided to test some out, for the greater good of the public and also for the greater good of my thighs. All classes are priced between Rs. 800 and Rs. 900 for non-members, which turned out to be well worth it.\nHigh Octane's Circuit Training was at 9 AM on a Thursday and, unsurprisingly, only three people (myself included) showed up. The room where the class is conducted is above the gym and made mostly of glass, so everyone can watch you fall off a Bosu ball (twice). The structure of the class is pretty straightforward: it's a full body workout, and two moves are paired together - you do the two consecutively for a certain amount of time, take a short break, and repeat them again three more times, after which you get a slightly longer break and then two more exercises. There's also a warm up and a cool down, both of which are quite quick, but do their job.\nThe exercises are mostly compound moves - squats, deadlifts, flys, etc - but there's also a bit of cardio thrown in, like skipping and burpees. The instructor, Alberto, was super friendly and quick to help or advise, so I immediately felt very comfortable. The focus in this class was very much on form and technique, rather than speed, which would be great for someone just getting into fitness, but was intense enough to be challenging to someone quite experienced as well. The huge range of equipment High Octane has is also super impressive - from tires to ropes to ladders, they've got it all.\nThe Spin class was a lot more popular, possibly because it was at 7:30 PM, which is when I'm usually on hour 3 of a Netflix binge and not on a stationary bike with zero feeling in my butt. Anyway, make sure you get here a good 10-15 minutes in advance to secure yourself a bike. Adjusting the height of the seat, its proximity to the handles and the height of the handles takes a while, so the actual spinning started 10 minutes late, but our instructor (Alberto again) made sure to check all of our bikes before we started.\nThe class is conducted in a fairly small room which, while it's got a pretty effective AC, does make you sweat because of the number of bodies inside and their proximity to one another - so make sure you take a towel. The spinning starts out at a relatively easy pace - it gives you time to figure out the resistance, and to test out what's too little and how much makes your legs cry.\nAn hour feels like forever to spend on a stationary bike, but the class went by really fast. Mixed in were a bunch of drills - uphill, standing, seated, sprinting - that made things a lot more interesting and forced you to keep up. The pace always coincides with the music, which is loud and pumping, but may not be to everyone's taste (I work out exclusively to early 2000s R&B and Hip Hop, so all that techno was hard for me). The class is great if you like a challenge, and the endorphins really kick in around half an hour in, even though you'll leave with jelly legs.\nThe core class was at 10:10 AM on a Wednesday, but started about 10 minutes late as the same instructor was teaching the spin class immediately prior. I only had a general idea of what a core class involved because I myself don't tend to train just my core, and will usually add some ab work at the end of some cardio or as a finisher to a weights session. There were about 5 people at the class, which is too few to avoid Alberto's all-seeing gaze, but just enough so you can slack off a tiny bit when he's not looking.\nThe class follows a circuit format - one circuit is usually 3 sets of 4 exercises, with 30/40 seconds of work and ten seconds of rest in between (30 seconds between sets). This may sound pretty easy on paper, but this class is PAINFUL. Focusing on just your core for an hour means that your abs get barely enough time to recover before the next onslaught. The moves are well-balanced, though - they cover your abs, lower stomach and obliques, as well as a little bit of your back plus some cardio.\nThis particular class would work great paired with some intense cardio before or after, but it really does its damn job. My midsection was on fire throughout and super sore the next day. Alberto, as usual, was always on hand to help you with your form and force you to keep going.\nThe classes at High Octane are well worth it - the value for money is good, the facilities are top notch and the instructors are great at what they do. We haven't checked out Dancefit with Tarja yet, but hear it's great. The timings appear to vary, so\nfor updates. My favourite was definitely the spin class, as it was the most challenging and a really great time. I highly recommend you try it out, but have warned you in advance of the butt-numbing, so go at your own risk.\n",
  "url": "https://www.yamu.lk/blog/classes-at-high-octane-fitness"
}