{
  "title": "Classes at Fitness 360º",
  "abstract": "Fitness classes that'll make sure you never do the same thing twice.",
  "author": "",
  "date_published": "3:48pm",
  "content": "is a fitness centre run by Sampath Lasantha, a certified aerobics instructor and personal trainer, as well as a karate black belt. Their headquarters are in Pagoda Road in Pita Kotte, but he does classes at Lion's Club in Rajagiriya on Mondays, Wednesdays and Fridays from 10:30-11:30 AM. The centre has been around since 2005 and the classes seem to have a pretty dedicated group of attendees - there's usually roughly 8 to 15 people per class. They're held in a carpeted room that's relatively small, but pretty well-ventilated.\nMonday's class was literally non-stop. It involved multiple stations, with 4 slots per station, each slot placed a couple feet apart. At each station you'd do one rep of a given combination (a burpee with 2 push-ups, for example) at one slot, run to the next slot, do the same, and so on for a minute.\nI loved how intense the class was, and how resourcefully the relatively small room was utilized. The combinations were killer - they were a nice change to the usual basic movements, and also required a lot of coordination, so it's pretty much impossible to bullshit your way through the class.\nWednesday's class started off with each person gathering a bunch of equipment - a cone, a stick, weights and a mat - and picking a spot and setting them all down. We'd do 3 sets of 4 exercises - a minute each for the first round, 45 seconds for the second and 30 seconds for the last. There was no rest between exercises, but a minute of rest between sets. And let me tell you, four consecutive minutes of work is TOUGH. It was essentially a full-body workout - the exercises involved variations of compound moves (jump squats, plank punches) and some cardio (burpees, star jumps), and it tells you a lot about a workout when you look forward to the cardio.\nThis class was the most challenging for me because of the pace, so I'd recommend it for someone who's a bit more experienced so they'd be able to keep up. At the same time, the moves are easy to pick up, and Sampath walks around making sure your form and technique are right. Completing a class like this also makes you feel super accomplished because of the stamina required. Also an hour goes by really fast when you spend most of it trying to figure out whether the liquid on your face is sweat or tears.\nFriday's class was really a tutorial on how many different ways one piece of equipment can be used. It involved 5 two-person stations, each with a pair of the same equipment (bands, weights, ladders, tires), and we'd perform 4 moves consecutively for a minute each before moving on to the next station. The end of the class also involved a short abs circuit before the cool down.\nEvery single exercise used the one piece of equipment at that station, and I really liked how creative the class was. Again, this was also a full-body workout, and the pace was really quick, so if you can't keep up, you're going to miss out. It also means that the endorphins really kick in, though, and you feel great once the class is over.\nFitness 360º is great if you've got some experience - the classes move really fast, so if you can't keep up you probably won't get your money's worth. The classes are also priced at Rs. 1000 per person, which is steep, but every single workout is totally different, so the creativity and thought that goes into the classes are worth it. The downside to these classes is that the focus is often more on speed than it is on technique, which I find limits the effectiveness of the moves. One thing in particular that I can really see this class improving is your stamina, so I'd highly recommend this if you're quite experienced and like both challenges and variety. If you'd like to check out their other classes on a regular basis or the gym,\n!\n",
  "url": "https://www.yamu.lk/blog/classes-at-fitness-360o"
}