{
  "title": "Classic Long Weekend Holidays (Sri Lanka)",
  "abstract": "Here are some of our favourite out-of-town getaways for the long weekend. ",
  "author": "",
  "date_published": "4:15pm",
  "content": "Since there's a long weekend coming up (well, if you take Monday off), what with Poya and Independence Day - some of you might be considering trips out of town. Here are our favourite places to head off to for some down time for 2-4 days.\nNegombo is an awesome place for watching sunsets. You can check out our Negombo sunset pictures\nand\n.\nLewis Place is ripe with eateries and hotels, for sight-seeing you have the gorgeous painted ceilings of\n, the mossy library of the\nand the\n, and if you just want to unwind Negombo has got clear large shores and boat rides on the beach, or at the\n. We recommend you stop by the very quirky\nfor their chocolate cake and wacky interior decor. If you want to really live it up this weekend, you can stay at\n(Rs. 17,000 per suite, which is actually not bad at all by suite standards), they've got\nfor a great rooftop bar, and if you're on a budget there's the very charming and colourful Jetwing's\n(Rs. 6000 per double-room).\n\nTake the Expressway bus to Negombo from the Gunasinghapura bus station in Pettah - you'll be at the central Negombo bus station about 45 minutes later, Rs. 120 for a ticket.\n\nThe main attraction at Galle is the\n. Shopping is generally expensive here, but the little kades down Pedlar's Street are ripe for bargaining if you want to buy some chilled out beach wear or printed pants, and if you've got the cash then\nis the ideal gift shop.\nis quite pricey, but if you haven't seen it yet, it's worth browsing through for its posh architecture, antique shops and its hammock-themed cafe. For food, we recommend\n's juicy giant Bulgogi burgers (but eat them hot-hot, they get soggy when you takeaway),\n, and for desserts,\n, the\nand the eclairs at\n.\nFor sight-seeing there's the Dutch architecture of\n, the garden tombs of the\n, and the iconic\n. There are plenty of great places in Galle to stay at - among them\n(Rs. 18K per room) and\n(double room for Rs. 12K), and Mango House sounds like a lot of fun, though we're yet to visit it ourselves.\nWatch the sunset by\n, or alternatively take a tuk tuk to Unawatuna (for about Rs. 500) to Sunset Point at the temple by the beach. There's also restaurants all along same shore, and the private shores of\nin Unawatuna.\n\nTake the Expressway bus to Galle from the Maharagama bus station, 1 hour journey, Rs. 420 for a ticket.\n\nMirissa is known for its sprawling, beautiful beaches, and good beginner-level surfing. It's easy to find surfing instructors at the beach-side restaurants if you're in the mood. Also,\n. Technically it's still whale watching season now, so if you're interested in the ride you should call the hotel you're staying at and ask if they can arrange it.\nis a wonderful place to stay (double room for Rs. 7500), where they've got\nand a giant climbable rock. If you're craving a solid rice and curry during your stay,\nis the place. Zepyhr is also a really cool spot to chill.\n\nEverything in Mirissa is basically on one walking strip, so you can take the Expressway bus to Galle at the Maharagama bus station (1 hour, Rs. 420), catch a regular bus down the coast and spend the rest of the time with your toes in the sand.\n\nHikkaduwa is another beach favourite for holiday-goers. Again like Negombo and Mirissa, there are plenty of beach-side restaurants to choose from, but\nis one of the awesome ones - the food is good and not as costly as other joints here, and they get full points for their funky decor and seating. If you're going with friends, the very private\nis idyllic (though they only accept bookings for 2-days minimum), and the quaint, kind-of-expensive boutique hotel\nis worth considering.\n, Hikka's classic Italian restaurant is a must-visit (only open in the evenings), and\nis good for drinks and\n. They've also got a pretty neat\nin Hikka that takes donations, and where you get to pet the turtles.\n\nTake the train to Hikkaduwa from the Pettah railway station (a 3-hour journey), or take the Expressway bus to Galle (1 hour, Rs. 420) and then a normal bus to Hikkaduwa from there.\n\n",
  "url": "https://www.yamu.lk/blog/long-weekend-holidays"
}