{
  "title": "Colombo Gourmet Week 2017 : A Sneak Peek!",
  "abstract": "A preview of the food, wine, and glam events planned for Colombo Gourmet Week 2017!",
  "author": "Kinita",
  "date_published": "10:59am",
  "content": "The Colombo Gourmet Week is back! As you probably know, we loved\n. With impeccable dining, flights of lovely wine, carefully curated events all showcased at the historic Galle Face Hotel, it was one of the best culinary festivals the city has seen.\non\nThis year's festival is going to feature everything from local arrack to international chefs, a variety of cuisines, and a whole lot of wine. While the events all revolve around Old World classics like French and Spanish cuisine, there's also a selection of local heritage with arrack cocktails and cuisine! Here's a quick look at some of the menus, and a break down of what you can expect at each event.\nThe Galle Face Hotel's very own Chef Adam Gaunt-Evans will be preparing a delectable 5 course meal at the 1864 restaurant. The dinner will take you through the fascinating (and sometimes hilarious) journey of arrack distillation in Sri Lanka, from the inception of Rockland Arrack back in 1924 to the sleek international Ceylon Arrack of today.\nWe had a little chat with Chef Adam as he took us through the menu for the evening, from the courses to the heady cocktails that accompanied each of them.\nThe hors d'oeuvres open the session with a delicate arrack cured salmon paired with one of the best arrack sours I've had on the island. I'm not sure if the secret is the sprig of fresh mint or the sneaky addition of passionfruit, but this is excellent.\nThe second course is a stunning Rockland lobster, locally-sourced seafood flamed in Ceylon Arrack and a light glaze of proper Sri Lankan ingredients like coconut, green chilli, and curry leaf. You'll see this followed by a palate-cleansing pineapple carpaccio, and finally the piece de resistance - a Mellvile Pork & Arrack Curry teamed with turmeric fondant potato, brinjal pickle, coconut cream, crispy shallots and curry leaves.\nWhat I love about this course is that it pays homage to one of the island's favourite dishes with simplicity and enthusiasm - and it pairs beautifully with a Lankanized negroni!\nThe meal wraps up with a sweet milk rice pudding, infused with a bit of Ceylon Arrack and a crystalline bit of pistachio, orange and pumpkin marmalade. We'd highly recommend you try and make it for the dinner this Tuesday, or at the very least start getting creative with your own bottles of Ceylon Arrack at home!\nUnlike most French food available in Colombo, this evening of French dining is going to be hale and hearty family-style fare. Courtesy of Jetwing's Chef Indika Bandara and the sleek Jetwing Colombo Seven rooftop, the French dinner is going to be a warm meal of heavy stews, robust red wines, and cosy conversation.\nCelebrated Catalan chef Joan Gomez will be preparing a stunning meal inspired by the Basque country. The entire menu is paired with Torres wines (from Spain, where else?), and features uniquely fascinating concoctions like liquorice lamb. I honestly can't tell you what that tastes like because I've never attempted anything of the sort. If you do experience this dinner, drop us a comment with your experience unless the Torres makes it all a bit hazy!\nThese two events are like oenophiles' Chateau Margaux-ridden wet dreams. In fact, it was one of my favourite aspects of last year's festival (there's proof - just\n). Whether you're looking forward to an elegant selection of wines and nibbles at sunset with 20 labels, or simply want to make your way through the market to taste, sip, and eventually build your own collection, you should definitely wiggle your way into the Saturday sessions.\nThis is the big, fun, boozy end to the week! If you're a fan of buffets, eating well, and the seaside, you're sorted. Expect the Galle Face Hotel's usual big Sunday brunch buffet complete with a massive multi-cuisine spread, breakfast classics like eggs benedict and waffles, and also a host of seasonal tapas featuring fresh, locally-sourced ingredients courtesy Chef Joan Gomez. You can also opt for the free-flowing brunch option which is going to ensure you're not leaving the GFH for a couple of hours! The free-flowing option gives you the option of a couple of wines, a fresh Toresella Prosecco, and arrack punch.\nIf that isn't enough enticing for you, flaring bartender Jan Marc Menicable from Monin will be around to provide some boozy entertainment while live jazz swings on so you can have yourself a little boogie to help digest all those courses.\nWe'll probably be flitting through an event or two, but if you're a fan of good food and drink, whether it's locally imagined or internationally sourced, all these events fit the bill! Drop a comment below or contact the friendly chaps at Wine World if you want more details. Bon appetit!\n",
  "url": "https://www.yamu.lk/blog/colombo-gourmet-week-2017-a-sneak-peek"
}