{
  "title": "Colombo Rides: 5 Tuk Tuk Stories",
  "abstract": "From Slave Island to Borella, we encountered trishaw drivers hailing from Vanathamulla to Katunayaka, including one of Colombo's…",
  "author": "Imaad",
  "date_published": "4:09pm",
  "content": "We all love tuk tuk quotes ('Che Guevara Want You To Rebel'), but what do they mean? More importantly, who decides to put up all the Titanic quotes and baby photos and sweet stereo systems? What does this bit of street culture mean to them? We took a few rides around the city to find out.\nStarting in Slave Island, we came across a pretty loud, red tuk tuk parked in front of an eatery and decided to ask the driver where he's from and what's up with the messages blaring out of his vehicle.\nWe learned that most three-wheel drivers don't own their vehicles, and most of them don't have a say as to what stickers are on them. Those who do own vehicles don't always run hires but rent them out instead. From Slave Island to Borella, we met trishaw drivers hailing from Vanathamulla to Katunayaka, including one of Colombo's fanciest rides. We've included their phone numbers, so you can meet them on your next outing.\nBorn to a Sinhalese father and a Tamil mother, Shiva works as a trishaw driver for a Dialog office at Town Hall, though he's from Slave Island.\nThe vehicle he drives is not his own and the stickers weren't picked out by him, but he likes that they attract customers.\n\"People like to travel in three-wheelers that look brand new with eye-catching stickers,\" he says.\nThe only addition he made is a religious sticker featuring both Hindu and Buddhist deities, blessing the vehicle.\nIf you're looking for a bilingual trishaw driver around the Slave Island to Town Hall area, give him a call on 729 778 810.\nSamantha Silva, aka Sam, hails from Kelaniya. He runs hires from Borella on his own tuk that he bought a year and a half ago.\nHe's got babies on the seats because everyone loves children. He also has children of his own. The seats are padded with plastic sheets so that they don't get damaged, with soft fabric mats underneath.\n\"Only little children don't get jealous or angry,\" reads the saying on the back of his tuk. Sam says he chose this because these emotions grow on us as we grow older and face the realities of a life decided by money and success.\nOn the inside, he's got a picture of Bob Marley that he's doodled on with tipex.\nIf you'd like to ride with Sam, call him up on 724 406 115.\nFrancis is a devout Catholic who drives a pristine trishaw with next to no stickers. He's from Katunayaka and his two daughters work in Borella. He drops them off at work every morning and then runs hires until they're ready to get back home.\nThe only adornments on his vehicle are two little Virgin Mary statuettes on either side of the windscreen and a rosary around the handlebars.\nThe only, literal message on his tuk reads \"Save Your Money\". Those happened to be the only plastic rain guards that were available at the time. He likes it because customers feel that riding on his tuk is the most economical option.\nIf you need a ride from anywhere around Borella, between 10 AM to 4 PM, call him up on 719 930 243.\nManuka (on the right) claims that Vanathamulla has the best modified tuk tuks. He works in Borella and only runs hires in the evenings, if he feels like it.\nThough Che Guevara is drawn across the seat of his tuk, Manuka says he doesn't know of him. He just got it because it's trendy, not because he wants to rebel.\nWhen we ask about the intense saying on the back of his tuk, he tells us about a girlfriend who broke his heart. The saying speaks of an infinite loneliness. Basically, he misses her so much because he's not there with her. He's got a funky poodle soft-toy and an orange monkey, he says, to attract a new girlfriend.\nIf you'd like to ride with Manuka, hit him up on 757 315 436.\nSuman has quite possibly the best ride in Colombo, when it comes to tuks. Hailing from Borella, Suman runs hires from Bauddhaloka Mawatha right through the day.\nIf you're constantly worried about tuk tuk safety, he's got you covered. With a rear-view camera and Full HD display just above the windscreen, Suman makes sure he maintains a safe stopping distance, even if the guy behind him doesn't. Oh, and he's also a teetoller.\nAt night time, you can manually adjust six LED lights at the back, for just the right ambient lighting.\nHe's a huge fan of\nbut he's also really tuned into the latest tunes from the Sinhala mainstream. His vehicle is kitted out with three massive speakers, one of which is a JBL. Both tweeters have a little notch if you want to get those highs up by 3db. Suman doesn't play music out loud, unless you want it, and he's very considerate. So don't worry about your ear drums.\nIf you want to roll around Colombo like a boss, call Suman on 776 372 508.\nWhat started out as a quest for the deepest tuk quotes soon turned into a fateful meeting with some of Colombo's most charming tuk tuk drivers and their vehicles.\nThe best quote, we thought, was the one on Suman's rear window, reading \"Still Waters Run Deep\". It's the only sticker on his tuk, and we feel like Suman and his tuk stay true to the implied modesty.\nIf you've got a favourite of your own, do let us know in the comments.\n",
  "url": "https://www.yamu.lk/blog/colombo-rides-5-tuk-tuk-stories"
}