{
  "title": "Colombo Gourmet Week : A Sneak Preview!",
  "abstract": "A super secret preview of the curated meals at the Colombo Gourmet Wine Week!",
  "author": "",
  "date_published": "6:26pm",
  "content": "The upcoming Colombo Gourmet Week is a chic blend of two delicious factors : top imported wines from some of the world's top terroirs, and intricately curated course meals and tapas.\n.\nWe headed to the Galle Face Hotel for a special sneak peek at the South African Bellingham Estate Wine Dinner, curated and prepared by the hotel's Executive Chef Adam Gaunt-Evans. This particular fine dining experience is on the 24th of August at the elegant 1864.\nWhat Sri Lanka unfortunately lacks in wine-growing capacity, it makes up for with sheer quality of fresh local produce. There are some delightful commonalities between South African veges, fruits and spices (a possible attribution to the spice trail), and Sri Lankan ones. This means that Chef Adam was able to source virtually all of his ingredients fresh, and locally, which I thought was superb.\nWhile South African meals do of course have a strong reliance on red meat, a lot of other strong and decisive flavours are at play here, like vanilla and cinnamon. The menu opens with a light sweet corn veloute, with toasted fennel seed, salt beef crumble (much like bilton, an everyday snack of the region), and a corn fritter, paired with a Bellingham Sauvignon Blanc. The amuse bouche is followed by a rock lobster ravioli that sounded amazing and we wished we'd tried, and a light pineapple sorbet palate cleanser.\nThe star of the show was the braised shoulder and roast rack of lamb, with spiced tomato and white bean\n. The\nas exotic as its name sounds, is really just a traditional homely South African dish that serves as a zesty condiment to meats.\nOur favourite element of the dish was definitely the braised shoulder - soft, succulent, and impeccably spiced, it was gently dripped in a lamb\nreduction gravy. Delicious. The course is paired with a deep ruby Bellingham Estate Pinotage (a blend unique to South Africa), which holds its own given the richness of the lamb.\nThe meal draws to a dairy-based conclusion with a vanilla \"melktert\", topped wih caramelized banana and cinnamon-caramel ice cream. You'll notice the wines grow heavier as the meal progresses - the amuse bouche is paired with a light crisp Sauvignon Blanc and the dessert with a heavy Merlot.\nChef Adam spent around a year in Australia cooking along with TV's celeb chef Peter Kuruvita, so he was pretty well equipped to handle Aussie cuisine. His piece de resistance for the meal? Shrimp on the barbie, obviously. A very upscale version of it, atleast. Join in for some delicious lamb and seafood on the 23rd of August.\nA slightly more informal setting, the Chilean dinner on the 26th of Aug will feature a spread created and curated by top Chef Maricella H. Hernandez. She's planning a very traditional, relatively casual meal, showcasing some beautiful Chilean wines and a lot of high quality beef. The meal will commence with a\n, a citrusy seafood appetizer.\nMichelin starred Chef Luca de Berardinis hails from the charming seaside region of Abruzzo (Trebbiano d'Abbruzo anyone?). He's brought down a selection of luxury Italian ingredients, from truffles to morelles, and is laying out a sleek, modern fine dining experience for the 25th evening.\nOther events include wine tasting workshops (separate events for Old World and New World labels), a couple of free-flowing events like \"20 Labels\" on the 27th August Saturday evening and the Big Brunch on Sunday. There's also an ongoing \"Wines of the World\" 11 AM onwards on both the 27th and 28th. Guest chefs and sommeliers will be milling about during the events to give you hands on pairing advice and suggestions.\nAs for us, you can catch us sipping on some vino and smooth jams courtesy Jerome Speldewinde at Sunday's Big Brunch. See you there!\n",
  "url": "https://www.yamu.lk/blog/colombo-gourmet-week-a-sneak-preview"
}