{
  "title": "Colombo's Restaurant Graveyard 2016-2017",
  "abstract": "All restaurants must die.",
  "author": "Kinita",
  "date_published": "11:44am",
  "content": "Nothing lasts forever, not cold November rain and definitely not a hip Colombo restaurant. Here are some of the notable deaths we've encountered in the last couple of years.\nAfter a couple of teething issues, Chef Vichalya and Coi ended up winning us over with good food, good service, and a lot of culinary innovation that featured Lankan food and ingredients. Unfortunately, they're no longer in existence, but we hear the owners are plotting a new bistro come September. We'll keep you posted.\nClique was also part of the Cantaloupe empire, and despite my general derision towards clubs, it was actually pretty good. Two dancefloors, generally fun music, and a crowd not as gropey as other clubs in Colombo. Unfortunately, it's also no more as they can't rent out that space.\nIf you look back on our old reviews of CASA Colombo as a hotel, they're pretty dang gushing, especially about the beautiful location and design. Shru even wrote\nto them. The food was never amazing, but we still lament the loss of the lovely\n,\n, and HVN.\nI've never actually been to Tenderfresh so I'm not sure what to tell you except that it's closed and you'll have to get your meaty fries and fried chicken somewhere else.\nLa Rambla used to do yum Italian food out in Mount Lavinia and\n. They've retained the location and the name despite the cuisine change, which is a little confusing. Eitherway, if you love Thai food and live in the 'burbs, head here because it's the same ownership as the Boulevard, so you know it's good albeit pricey.\nFew places in Colombo had the character, architecture, and feel that Castle did. A bar popular with both the city's workers and its moneyed hipsters looking for a respite from shiny glass and stilettos, it was a melting pot of social stratas, cheap gal arrack, and delicious fried fish. It got demolished thanks to the overwhelming power of conglomerate greed, and all that remains is a gaping hole on the street reminiscent of a gory tooth extraction. Slave Island (especially its residential populace) has been one of the hardest-hit segments in the aggressive gentrification via foreign investment, and it's only getting worse.\nQbaa was one of the few places to boogie if you were over 16 and didn't want to look like a decrepit old cretin at a nightclub. It's now dead, which is sad for the classier society mums and dads. Also Sanath.\nWIP isn't a work in progress anymore. The place was alright, and their food seemed a bit German-themed but didn't have much personality beyond that. Its replacement\n, however has a clear theme, a great chef, and Japanese food that doesn't break the bank if you order carefully.\nI used to secretly love FDO's. Tucked away behind the BRC cricket/rugger/whatever grounds, it was a little live music and jazz bar filled with a nice older crowd, some lovely old tunes, and brick walls. Anyway, it's gone now and I'm sad and have nowhere to have a quiet drink and romantic wiggle to Eric Clapton.\n,\n, and\nare all gone, and have now been replaced by the far slicker\nand L.A.B. In many ways, these are all moves for the better, but old-timers still strangely miss the good old Hilton restos with their high prices, even higher A/C and unenthusiastic service.\nFor the Rajagiriya folks, Prima Taste was a god send with well-executed, mid-range Singaporean fusion fare featuring some of the best chicken satays in the city along with a bunch of other Pan-Asian cuisine. I still dream about those satays on rainy days. Hopefully they'll be\n!\nThere are probably some sinister ministers and the like saddened by the loss of KAMA Colombo but the rest of Colombo think it's karma this place closed down. We hope something less seedy and dangerous opens up, but that's doubtful. We can't link you to a YAMU review because none of our staff agreed to go check it out.\nWe usually don't mention home bakers on our graveyard lists because they generally have the lifespans of weakly fireflies. However, Gourmet CBP made its way onto our Chocolate Biscuit Pudding Taste Off and emerged victorious. With a bunch of innovative flavours, excellent quality, friendly delivery and service, this was our fave CBP spot in town. Unfortunately, the owner has shut it down for the time being, but we hope they'll be able to come back later at which point we'll all be waiting with open arms and a tear in our eye.\nWaffeley opened and closed in what appeared to be a 3 or 4 month period. We're not sure what happened but there are now around 5 more spots to get your waffle fix in the city so we're not lamenting as much as we would have, but we do miss their low prices.\nBars plodded on for a while, with reasonable fare, lots of variety, slightly bad service, and chill ambience. They're now replaced by Shay Int. and a Perera & Sons outlet downstairs, but we hear their lovely rooftop pool area is still functioning for private parties.\nBoth of these wonderful establishments, the former dishing out authentic Napoletano pizzas at Liberty Arcade and the latter full English breakfasts and cakes at Rosmead Place, had to shut down over the last year. Both were also due to issues with their location, like rental problems and even pesky neighbours. Luckily for us, you can now catch both of them in smaller, quieter, incarnations at\n. It's not quite the same, but it's better than losing them entirely.\nWhile the loss of some of these have been keenly lamented by Colombo's hungry, some may just fade into collective forgetfulness. A high restaurant turnover is sometimes a sign of a thriving culinary scene, so hopefully the demise of the spots on this list will provide the space and capital for new, more exciting options! Until then, RIP sweetlings.\n",
  "url": "https://www.yamu.lk/blog/colombos-restaurant-graveyard-2016-2017"
}