{
  "title": "Colombo's Late-Night Burger Kings (2013)",
  "abstract": "The greasiest, tastiest, late night burgers in town.",
  "author": "",
  "date_published": "4:55pm",
  "content": "\n\n\nStreet-side burgers. We're not talking gourmet grains or diamond-priced cuts of Wagyu beef, we mean those juicy, straight off the grill snacks you pick up when in need of some serious mayo in your system. After an arrack-soaked night, many a Colombar can be found prowling the city's alleys in search of oily refreshment - note the many Pajeros and Monteros stalking the midnight streets, the tummies growling with hungry anticipation and the eyes eagerly seeking out a steaming stand of hot kottu or fried chicken. While Burger's King was once the sole saviour of the city's starving post-party souls - in search of something that wasn't cheese kottu - we now have a whole variety of palm-juice seasoned, greasy, feel-good-until-after dinner options.\n\nRight now, Colombo's starlight eating scene is ruled by a solid triumvirate of three streetside kings: Sugar, Burgers' King and newcomer, Al-Jazeera. But of our ruling kings, whose is the alpha burger? You decide.\nThe canonical Sugar burger - this was once the highlight of a heavy night out. After jostling past hostile bouncers and emerging from a sweaty pit of overenthusiastic men, there was always a fresh-off-the-fire, juicy Sugar burger to look forward to - a beacon of savory promise shining brightly through the grimy, alcohol-sodden club scene.\n\nThe early days of the Sugar burger have long been thought of as its best. Those were the days when a little cart with a steaming hot plate stood outside H20, serving what was then known as Colombo's best burger. But as the years waned and the stirrings of nostalgia set in, Sugar's crown fell into question: was the Sugar burger really that good - or were we all just drunk?'\n\n\nOnce a little cart serving some of the island's best burgers, Burger's King is now a pretty legit establishment. Complete with address, printed menu and website - yes, website - the island insider's secret now stands brightly amidst the alley ways, quite literally overflowing with customers at night.\n\nThe name - either a gentle pun or copycat mistake - says it all. This thriving eatery sells pretty much just burgers - about fifteen varieties. They aren't elaborate with toppings like at Sugar or Sandwich Factory, but each burger packs a good punch, bursting with flavour and juices. And after chowing down four of the King's finest, we've decided they're still pretty good - but perhaps lacking a touch of the early day greatness.\n\n\nAl-Jazeera's chicken and cheese burger is quite literally the stuff of salivating, mayo-filled dreams; broad, generous cakes of soft bread. A thick, crispy cut of fried chicken - the flesh soft and deeply infused with spicy flavour. A molten mess of cheese. Rich, creamy layers of mayo oozing across the sides and crunchy rings of fresh red onion. This is as good as Burger's King at its prime - and it might just grab the monarch's crown. And at only Rs. 260, Al-Jazeera's delectable, massive burger is practically a steal.\n\n\n.\nSo who's the burger king? Right now we're partial to the new contender, Al Jazeera but, honestly, the best late night burger is the one that's closest at hand. The Sugar Burger cart is usually outside Silk and Floor By O!, Burgers King is in Slave Island and Al Jazeera is on Dean's Road, near Maradana. Happy munching.\n",
  "url": "https://www.yamu.lk/blog/colombos-late-night-burger-kings"
}