{
  "title": "Colombo's Restaurant Graveyard (Sept 2015)",
  "abstract": "This time, the big losses are Chesa Swiss, Summer Garden and Shiraz.",
  "author": "",
  "date_published": "11:47am",
  "content": "We are sad to say that some established and beloved restaurants have shut down\n. This time, the big losses are Chesa Swiss, Summer Garden and Shiraz. The first two had been around seemingly forever and the last one had just started. They'll all be missed.\nOpen since 1991, Chesa Swiss was a veritable institution. It was Sri Lanka's first independent fine dining establishment and was consistently one of the best places to get a steak in Colombo. They offered a range of Swiss and European delights and imported excellent meat and cheese. For a long time, it was also one of the few places with an international quality chef.\nChesa, however, was also quite expensive for Sri Lanka (easily above Rs. 3,000 per person, pushing Rs. 5,000 with wine) and as the restaurant scene grew, its location seemed more outdated. Whereas new places did extensive renovations before re-opening, Chesa was sort of stuck within the re-purposed house they'd occupied for years. Dear Chesa, thanks for the meats. We wish you well.\nSummer Garden has been the place to have a good mixed grill, drinks, and talk politics since time immemorial. It's really a shock that it's gone — it seemed almost like a government institution. Built under a huge Nuga tree on Green Path, this shady (both literally and figuratively) bar/restaurant was known for its ever-flowing food and drink. They had cheap beer, lots of grilled meats, fried rice, the works.\nIt was also a spot without pretences. People of all classes hung out there, wearing whatever they wanted, discussing matters quite freely. Their salty, deeply-seasoned food wasn't doing much for our lifespan, but it's still sad to see them go. Summer Garden, you will be missed.\nShiraz is the newest restaurant we'll discuss here. Opened about three years ago, this family-run restaurant did authentic, fun Iranian (Persian) cuisine. They had a beautiful location atop the Gandhara shop on Stratford Avenue and put a lot of love into what they were doing. It's sad to see them go but we've heard they may re-open something in Galle sometime. We hope they do.\nSome other places we didn't mention that closed in the past few years:\n\nGood-bye and farewell, you restaurants. Though you join other establishments in the Colombo Restaurants Graveyard\nand\n, you are not forgotten.\n",
  "url": "https://www.yamu.lk/blog/restaurant-rips-september-2015"
}