{
  "title": "Colombo Then & Now (6 Photos)",
  "abstract": "Here are 6 photos of Colombo - then & now - to show you the insane make-over that Colombo has undergone. ",
  "author": "",
  "date_published": "4:10pm",
  "content": "Colombo has undergone a total make-over in the past decade alone, let alone in the past century.\nWe thought we'd put together some of the best photographs taken around the capital city  - then and now - just to show you how much things have changed. \n  \n  The 'Then' photographs here are from\nand\n, while I took the 'Now' ones. Put them together and - mind blown.\n\n\n\n\n\n\nThis is one of my personal favourites from our list. I had to make my way into the new Eye Hospital and hang around for permission to enter doctors' quarters just to get the same angle as in the old photograph. A recurring theme in all our Now pictures is how crowded everything seems and the clutter of vehicles and new buildings. The old massive green park smack in the middle of the roundabout is gone now, though to be fair there still seem to be plenty of trees around. Colombo is obviously more populated than it was sixty years ago, so it's not surprising that things are more crowded and parks made way for roads - still, it's kind of sad.\n\n\n\n\nThis picture was taken from the rooftop of the Kingsbury, while the old version must have been taken from the same spot from when it was the Intercontinental Hotel. We've\n, and the change is pretty gross, the highlight of it being the construction zone at the center. We're glad that at least the Old Parliament building and the shores have survived, and the dramatic skyscraper-skyline that's grown out at the back is pretty cool.\n\n\n\n\nGalle Face was and still is a favourite spot for picnic-ers and lazy strolls on the rampart. It's much less greener than it used to be though, and it seems part of it has had to give way to new road and pavements. The old picture looks idyllic, but then again, that's from a time when people used \n                    \n                    karaththas\n                    \n                    in Colombo for transport.\n\n\n\n\nI think Pettah is probably the least-transformed part of Colombo. Sure, most of the hand-painted signs are gone (check out our\nfor photographs of what remains), and there's a little less green and more street stalls. But it's still crowded, chaotic and has loads of its older buildings intact - like\nbuilding. There's a roundabout in front of it now though, to help direct all the traffic.\n\n\n\n\nThis undated old photograph shows a time when the street to the Fort Clock Tower was flanked by trees all the way. Most of that is now replaced by tall office buildings. The good news at least is that this important part of the city's history is officially re-opened to the public - you can read more about it\n.\n\n\n\n\nThis photograph of St. Andrew's Scots Kirk Church from the Galle Road in Kollupitiya - probably sums up Colombo's transformation the best. While this beautiful English-castle-esque structure was an obvious highlight in Old Ceylon - you can barely see it now, peeking out awkwardly between the giant high rise buildings that now dominate central Colombo.\nColombo is not what it used to be. Whether that's a good or a bad thing is debatable. On the one hand, yes, the city looks greener, quieter and more aesthetic in old photographs, on the other hand Colombo is slowly reaching towards becoming a developed capital, with a new restaurant, bar or boutique hotel cropping up every month.\n",
  "url": "https://www.yamu.lk/blog/colombo-then-now"
}