{
  "title": "Colombo Day And Night: An Interactive Photo-Story.",
  "abstract": "Slide the photos to see how stark the contrast is between sun-up and sundown in Colombo. Have fun!",
  "author": "Aisha",
  "date_published": "10:21pm",
  "content": "Colombo is a constantly evolving urban jungle that gets better or worse depending on your mood and the traffic situation, in which the latter is generally on the '\n' side of the spectrum. It's loud, it's noisy, pulsating, and boisterous: from the honking, clanking traffic, the hustle and bustle of commuters and to trishaws and buses running neck to neck, our cantankerous city is the epitome of chaos.\nHowever, it's a completely different story at night. Soon as the rush hour traffic's over and business dies down, the is eerily quiet and deserted. We've got a little photostory here, and the photos are interactive. Just slide the arrows left and right!\nWalking down Pettah by-lanes isn't for the weak of heart. It's almost what you can call a microcosm of industrial Colombo: everything you need can be found down its annals, be it camera equipment, stationary, yards of cloth, or cutlery and electronics. You also get cheap Chinese ripoffs of things lining the streets, so if you want phone chargers or fairy lights that would last you perhaps a couple of weeks, head here. It's loud and bustling and crazy — which is why it's extra eerie at night.\nThat elevated, granite structure you pass in Independence Square is the memorial hall: built solely for the purpose of commemorating our independence from the British way back in 1948. From freedom from the Colonialists, the hall's main function now is to serve as a place for wedding shoots and pre-shoots, and the occasional presidential signing in. It also saw young people fight for their rights to hold hands in public — mostly because the security guards around the area forbade 'couples' from sitting or walking around.\nAlso known as the\nand the samman kottu palli, the Red Mosque is an iconic structure that shines line a candy cane among the humdrum gray and bill-board covered buildings that populate the streets in the neighbourhood. It's seven stories high, and there's usually a signboard in the lobby which tells you that you can secure a place in heaven by sponsoring construction / donating to the mosque.\nThe square is full of people determined to be healthy in the evenings — it feels like you'd find most of Colombo's fitness freaks (and want-to-be-fit-freaks) there at any given evening. Including half of the YAMU office. This leafy avenue leads to\n(formerly Walker's Cafe), which is one of the very few places in the neighbourhood where you can get food and drinks at\nIt's also surprisingly beautifully maintained.\nHome to the now dead\nand the ever-growing\nand other street food especially if you're keen on Malay cuisine (\nanyone?) Slave Island is peppered with dodge little eateries,\ngraffiti, and crumbly old buildings. One of our governments tried to give it a face-lift by painting this stretch in lovely pastel shades, and it looks pretty nice during sun-down.\nThis was recently (recent as in an year or two ago) given a face lift, so we now have a few massive rock/ cement lions placed strategically at the Colombo end of the Galle Road. The high vantage point afforded by\nis also one of the best places to get a view of the City and the sea from.\nImmensely popular during Vesak for the lights and lanterns, the Beira Lake and its surroundings still maintain a quiet sort of beauty even after that.\nis strung up with fairy lights and the water mirrors the city lights beyond.\nA hotspot for a gathering of friends and family, the Galle Face Green used to be really nice and pretty but is now mostly arid and unappealing during the day. Come sundown, a bit of its old charms return as its flaws are hidden in a veil of darkness. Melancholia aside, it's actually a whole lot livelier towards sundown and night time.\nDating back all the way to 1829,\nstands a stone's throw away from where the\nbefore he was deported to India.\nFun Fact: It's also Kilometre Zero (or is almost km 0, which is the spot where you start measuring distances around the country).\nFormerly (and originally) the residence of a Dutch Military Commander, the Cargills department store was completed in 1906 and was then known as 'the finest of its kind in the East of Suez.'\n, the candy-cane coloured building's roots made it the oldest department store in the country. It's also one of the more popular landmarks at Fort.\nChanging Colombo's landscape, literally. The port city is a gargantuan extension to Sri Lanka, making it seem a bit like a T-rex's arm jutting out of Colombo.\nOnce a lunatic asylum, then a series of other things ranging from a College House to the Auditor General's Department, this building now homes high end department stores and several fine dining restaurants. It's a popular destination for cliched wedding and pre-wedding shoots to boot.\n\nThat's about all we've got for our Day and Night series! We had a lot of fun (and a\nbit of frustration) making this: from hopping almost all across Colombo within the same day, and pinning down literally the exact same location and angle to get the night photos despite the gloomy weather that prevailed throughout and threatened to ruin our lenses.\nAll hail\n, our immensely talented in-house videographer for getting the perfect shots we've used in the interactive photos, and Indi for juxtaposing them for me. If you enjoyed this post, check out our old\npiece as well!\n",
  "url": "https://www.yamu.lk/blog/an-interactive-photo-story-colombo-day-and-night"
}