{
  "title": "Colombo's Cosiest Reading Spots",
  "abstract": "Here's where you can head over to for some peace and quiet with your trusty tome.",
  "author": "Aisha",
  "date_published": "11:17am",
  "content": "As Shifani once said when she was working on a piece on book nooks,\nThis has been changing slowly but surely until we suddenly looked around and realized that dang, there are quite a lot of nice,\nspots to curl up and read in now! Newer cafes are creating lovely reading spots, while there are a few public places that are quite comfortable if you want an outdoorsy area.\nJust over a year old now, Black Cat's managed to maintain its chilled out and welcoming atmosphere paired with great food and coffee; but have lost the cats along the way. They've got a whole room for reading, filled with a tall bookshelf piled with classic books and comics, and a couple of incredibly cushy couches.\nWith great service and pretty decent coffee, the LHoC has settees spaced out and a few books lying around. It's quite strongly air-conditioned, at times, so it's perfect for that hot-drink-and-blanket atmosphere if you want to get in the mood with your favourite book.\nC&C is rather new and tucked in a really quiet neighbourhood. It's a bit difficult to find because it's down a by-lane on Pedris Road, so it's uncrowded and (again) quiet. In an old mansion furnished with wickerwork furniture and a couple of large couches topped with cushions, it's also accessorized with plants and books.\nPros: Plenty of\ncouches and chairs. There's a power-outlet next to each seating area, if you want to stay plugged in and get a bit of work done as well.\nCons? The background music is really quite loud. As in, noticeably loud. While this is completely alright when you're with a group of friends, it's not okay if you prefer white noise or complete silence when you're buried in a book.\nBasically, a room packed with a miscellaneous selection of chairs and a large, shocking pink settee, Hansa Coffee has a loyal little customer base that returns for their chocolate and coffee. It gets crowded with anything more than like 8 people, but you don't need to worry about that as there's usually just around 4 hanging around. They also host Poetry P'lau, every first Saturday of the month, so you may want to avoid those days as you'll be surprised as to how many people fill up the place! There's definitely a literary hipster atmosphere around. The prices here are comparatively cheaper as well.\nHere are a few places removed from the hustle and bustle of crowds and vehicles. They are open to the elements, so pick a good time where you won't slowly bake in the afternoon sun or get washed away in the monsoon rains (unless you're at the memorial hall at Independence Square and seek shelter in there).\nYou'll be sure to see a host of ultra-fit (or attempting to get fit) people exercising, jogging, meditating, doing yoga, or just lounging around here at any time of the evening. There's an occasional group of children playing around, sometimes. Overall, it's a great place to read.\nFormerly known as Victoria Park, VMD was renovated several years ago and is a whole new (albeit flatter) landscape now. They've got ponies, ice cream carts, and Green Path running alongside it: the artsy street where painters display their work.\nBordering Independence Square, the Arcade is a refurbished Colonial construction with white wicker chairs and tables spread across its pavilions.\nThe Good Market is held here every Saturday, so it's pretty much organic and hipster central during then. There are plenty of places to sit and read though, either under the trees near the little pond behind the parking lot, or at the Mc Donald's outdoor seating area.\nWhat are your favourite places? Let us know!\n",
  "url": "https://www.yamu.lk/blog/colombos-cosiest-spots-to-read-in"
}