{
  "title": "Colombo's Restaurant Graveyard (Feb, 2015)",
  "abstract": "YAMU usually covers restaurants that have opened. This is a list of places that have closed down.",
  "author": "indi",
  "date_published": "6:06pm",
  "content": "YAMU usually covers restaurants that have opened. This is a list of places that have closed down.\nThese are some new additions to Colombo's restaurant graveyard.\nWe'll start with the big one, the iconic Flower Road outlet is dead - for now. They're still zombie-kicking as a so-so takeaway joint 100 meters away, and their Battaramulla branch is still running (and delivering), but the old building is boarded up and done. They seem to be building another restaurant nearby, but the original Flower Drum is gone.\nAh Bubble Queen, we liked you, but obviously not enough. We should have had your sweet lumpy teas more when we had the chance. This place was owned and, for a while, run by Taiwanese people and did authentic bubble tea (milky tea with chewy tapioca pearls at the bottom) and nice desserts.\nWe should have known something was wrong when you started half-heartedly serving fried chicken. A few months later you were gone. We think it's a shop now.\nAl Jazeera was a nice Arabic spot near Town Hall with a great name, but it's closed now. Thankfully this new place\non Marine Drive is serving up authentic Arabic fare, but unfortunately not burgers. Al Jazeera was run by real Yemenis and we liked it, but it closed down quite fast. Sama is run by Palestinians, and they also do tasty food, so I guess we'll live.\nCrusty's was a place that made relatively healthy subs and they had plans to get into calorie-counted meals. As\nentered the market and\nstepped up, however, they just couldn't compete. They shut down a few months back. Since then\nhas come out with measured meals for the health conscious.\nSwirl was a tiny place at the start of Isipathana Mw that did, as the name implies, frozen yoghurt. They stayed open almost exactly a year. You can still get good froyo at\nor\nbut we guess the market for pure Froyo isn't that big.\n, however, is still ticking at ODEL and the WTC.\nWe sadly only discovered this place a few months before they shut down. Sea Salt was a tiny tiny place on Galle Road - maybe 100 ft square. They made fish and seafood, mostly for takeway, but it was flavorful and tasty. The location itself, however, was way too small and basically unsustainable. We think there's a shop there now. It's still hard to get a good fried fish takeway now that they're gone.\nFork was an interesting looking place along Marine Drive, but the pizzas were lackluster (and lacked pork or other traditional toppings). They have their outlet in Ja-Ela still, but in Colombo they lost out to more flavorful pizza places like\n,\nand\n.\nThis small spot at the end of Havelock Road closed down a while back, though they still make tiny donuts and sweets at a\n.\nYou can no longer drive by here and get your daily calorie allowance, you have to go to the mall.\nThis Indian chain closed down a while ago and, honestly, good riddance. They had expired food issues that tainted everyone in Colombo 7 (the papers just reported that someone in the neighborhood had problems and everyone got blamed). Besides that, their stuff never tasted very good to us. If you want a chocolate fix in Colombo 7,\nhot chocolate is a classic, and\nis good for chocolate everything.\nHow many expensive coffee shops can Colombo support? One less than Gloria Jean's. This franchise never really found a niche to set itself apart from\nor Cioconat. It was mediocre coffee, OK food and not a very easy place for people to meet and hang out. They said they were moving in November, but we have yet to see them reincarnate.\nSome other places we didn't mention that closed in the past few years:\nWe've actually done a piece on\n, but that was really a historical one, going decades back. All of the places we mentioned here have basically opened and closed in the last 5 years (with the exception of Flower Drum).\nIt goes to show you how vibrant and competitive the restaurant business has become in Colombo since the end of the war. For places that we think and hope will survive for a long time, check out our\n.\nWith that let us pay our respects and exit the Colombo Restaurant Graveyard, until next time.\n",
  "url": "https://www.yamu.lk/blog/colombos-restaurant-graveyard-feb-2015"
}