{
  "title": "Colpetty's Chocolate Cake Contest",
  "abstract": "Colpetty's chocolate cake contest for the cool kids.",
  "author": "Yaseen",
  "date_published": "10:44am",
  "content": "Diving into a classic chocolate cake is equal to taking a stroll through paradise and then being welcomed by a tsunami of calories and a volcanic eruption of pimples.\nAre your pimples worth a chocolate cake? Do you really want to add on those pounds just to devour a chocolate cake?\nBut are these baked heavenly treasures really treasures?\nWe delved in to the streets of Colpetty to find out where you should get that perfect slice of chocolate cake from if you're dying in some corner of the Colpetty junction and needed a sweet ending to your bitter life.\nThe victims of the utimate Colpetty cake-off were -\nCoffee Stop has always been the go-to spot for a cuppa coffee after a heavy dinner at one of the restaurants run by Cinnamon Grand, but it's clearly not for a chocolate cake. Failing to find a slice of chocolate cake, we settled for a chocolate cupcake because it's basically the same thing except with a lining.\nStripping the cake naked, I found the cake had been sun bathing by the pool side of Grand because it tasted very, very dry. The frosting was one 5 year olds would love because it was very, very sweet.\nStop, Coffee Stop.\nAlso, 210 for a chocolate cupcake?\nPriced at Rs 85, this cake was the least pricey of all the victims of this contest. #HappyWallets\nGreen Cabin's chocolate cakes have always delivered value for money with their not-too-moist-but-moist-enough cakes topped with buttery chocolate icing, but this slice was underwhelming.\nIt was dry, just not as dry as the cupcake from Coffee Stop. So, they probably prepare their full cakes and cakes for individual slices separately, although that would be a queer system of doing things.\nIn comparison, this tasted better than the 210 rupee cup cake, but nevertheless was dry and not anything like their usual full chocolate cakes.\nIf you are dying and you only have 85 bucks on you (or if you're just another miser who loves chocolate cake), Green Cabin has got your back!\nThis cake looked very decadent. Dark in colour, it looked like it had a lot of cocoa and did, indeed, taste pretty chocolatey, but this, too, tasted dry. Also, why was Cafe on the 5th a little (or very) stingy with its frosting is a question I would like an answer to.\nIn comparison to the first two, this was the most chocolatey chocolate cake.\nCafe on the 5th should just stick to their dope eclairs which also happen to be 10 bucks cheaper.\nIt was disappointing to not get a good old slice of chocolate cake from here though, given that their baked goods and short eats are usually top-notch.\nWe opted for a slice of their Death by Chocolate as it was the closest to a classic chocolate cake.\nIf you want to die of a chocolate overdose, head to Mitsi's. This cake was decadently ornamented with really chocolatey, ganache on top, in the middle, in the upper middle, in the lower middle, on the sides - basically everywhere in between the thin layers of cake.\nIt tasted really rich, but I doubt one person could finish an entire slice without not wanting to eat chocolate cake for another 2 weeks, or just 24 hours. It's sickeningly chocolatey. (It's the nice kind of sickening - where you keep going back for more although you know you would end up feeling sick.)\nBut the main question is, where was the cake? It was more yummy icing than cake.\nIf you're more into chocolate than cake, Mitsi's is for you.\nWe settled for Butter Boutique's Double Chocolate Fudge cake. BB has never failed to deliver really good chocolate cake, but this time, their icing seemed a little off. While their cake was moist, the icing tasted a little bitter.\nApart from the icing, their really, really soft and moist cake was an indulgement and had a generous amount of frosting.\nClose enough to a classic chocolate cake!\n3 out of 5 birthday cakes are from The Fab. Their chocolate fudge cake, to be precise. (Please note that this statistic is not accurate, but let's just assume it is to highlight the fact that The Fab is one of the go-to spots for cakes when you don't have time to order fancy cakes. Or, if you just don't care.)\nWe got their chocolate pyramid for the purpose of this contest as we couldn't find a legit slice of chocolate cake.\nThe cake was pretty soft although they were not too kind with the amount of icing which was predominantly dark chocolate.\nI cannot say much because despite being a chocolate pyramid, it had bits of vanilla cake too. Overall, it was soft while lacking icing.\nThe largest slice of cake was from Yumi's (at the highest price, too). With a nice rosette of icing atop and chocolate chips on the side, this cake had a good balance of icing to cake and was indeed chocolatey, but it just didn't hit the right buds to make me go WOWOWOWOWOW.\nIt wasn't a bad slice of cake, it was pretty good, but the chocolate was a little overpowering. You know how the aunties say, \"too much of anything is good for nothing?\" Some scene like that.\nBut if you eat, live and breathe chocolate, you wouldn't understand. #PLEASEUNDERSTANDME #ALWAYSMISUNDERSTOOD #TOOMANYHASHTAGS?\nI had never tried The Cake Factory down 5th lane before despite passing by quite a few times.\nIt looked really decadent with a ganache-y icing on top and a vanilla looking icing in the middle.\nThis was *ding ding ding* the best slice of chocolate cake.\nIt was moist.\nIt was rich.\nIt tasted pleasant.\nThe icing was on point - that is, sweet enough.\nI FOUND MY PERFECT SLICE OF CLASSIC CHOCOLATE CAKE.\nHere's a quick table for quick analysis!\n\nIf you're too lazy to read, you could also watch the YAMU crew eat cake here.\n\n",
  "url": "https://www.yamu.lk/blog/colpettys-chocolate-cake-contest"
}