{
  "title": "Cosplays from Lanka Comic Con 2016 That Blew Our Minds",
  "abstract": "Cosplayers that went above and beyond the call of duty for their craft at Lanka Comic Con 2016",
  "author": "",
  "date_published": "11:43am",
  "content": "happened over the weekend and it was an absolute blast. There were so many participants that I'm sure at some point the organisers felt that they should have booked a TARDIS instead. However the JDA Perera gallery held up admirably.\nMany notable events happened at Comic Con but what drew everyone's attention was all the cosplayers. Decked out in their very geek best, an entire pantheon of heroes, villains and beings from all kinds of canon appeared at Lanka Comic Con to delight, surprise and even horrify. The talented\ntook some beautiful photographs of some wonderful cosplays. Check 'em out.\nMister J was in all his questionably hilarious glory. Evil grin and fake lapel flower and all. Oshita Narangoda brought him by ComicCon.\n\nHarley Quinn dropped in as well, looking like she just came from the streets of Gotham.\n\nDon't they make a lovely pair?\n\nSith lords Darth Maul and Kylo Ren, who masquerade as Father and Son pair Ishan and Aric Seneviratne in \"real life\", represented the dark side of the force. We don't know if they had cake but they did win their category in the cosplay competition.\n\nApparently Sajith Kandanaarachchi was at Lanka ComicCon but they could only find Spiderman.\n\nShyamal Makalanda brought a Predator down to earth. This guy was so amazing we wish we had the Ghost operative from Call of Duty he brought to last year's Comic Con as protection.\n\nBut  John Kozak from Tom Clancy's Ghost Recon Future Soldier and Hermione Granger also attended and it's hard to beat that combo. We have Ushan Gunasekara and Ashani Fonseka to thank for these two.\n\nJeevan Sukumaran brought Wolverine by as well. While Spiderman couldn't keep his hands off him, we promise no one got clawed... that we know of.\n\nKnightmare Batman was here on Sunera Senadheera's invite. Sarongpool tried to get friendly. You'd have to ask Sohan Gunarathne on how Sarongpool fared there.\n\nHere's Sarongpool annoying Negasonic Teenage Warhead, who looks a lot like Sheshadri Kottearachchi, who doesn't seem to care at all.\n\nJon Snow may know nothing but Shalitha Senevirathne knows Jon Snow.\n\nRyan Perera brought Raiden from Metal Gear Solid. As the sign behind him says, this was one of the rare occasions he was child friendly.\n\nOn day 2 Jeevan Sukumaran came with Harambe and the fires of revolution were stoked.\n\nNightmares were certainly on the cards with Freddy Kreuger here.\n\nAgent 47 was here contracted by Sunera Senadheera. He was so good we aren't even sure if his contract was successful.\n\nOpula Fonseka and Ethan Perera invited Corpse Bride and Victor Van Dort. They made the most gruesomely gorgeous pair.\n\nArthas of Azeroth made time to make an appearance. Ishaq Deen dropped him off. His sword Frostmourne was hungry enough to get an award in the cosplay competition.\n\nChathurinda Sumithraarachchi asked Nightwing to combat some crime at Lanka Comic Con. The organisers kept things tight as a drum though, so he joined the cosplay competition instead... and won a prize.\n\nThe Dovahkiin from Skyrim was here too. In Daedric armour no less. Thanks to Sahan Perera for inviting him.\n\nThe current Kazekage, Gaara was here as the representative of the\n. He was here on Janithri Kariyawasam's request.\n\nDay 2 also had this wonderful image of two Spidermen in a Spider Tuk. Come to think this would be a faster way to get around Sri Lanka than webslinging. Sajith Kandanaarachchi and Eshantha Perera are to be thanked for this wonder.\nThank you once again to\nand his awesome pictures, and congratulations to\n. We hope to see even greater things next year. As you can see Lanka Comic Con was a lot of fun and a big success. The cosplayers really pulled out all the stops. There's a lot more great work that we just didn't have room to post. You can find the rest of Prasanna's Comic Con pics have more great cosplays to see. You can find pictures from Day 1\nand pictures from Day 2\n. If there's any favourites of yours that we didn't show and you think deserve attention, do post in the comments.\n",
  "url": "https://www.yamu.lk/blog/cosplays-from-lanka-comic-con-2016-that-blew-our-minds"
}