{
  "title": "Cows Getting Kicked Out Of Colombo",
  "abstract": "Colombo cows have to moooove.",
  "author": "",
  "date_published": "1:13pm",
  "content": "Everyone in traffic - however busy they are - must halt before the cow. Cattle have been a part of Colombo traffic since our village days, but not, it seems, for long. Cattle are now\nin Embilipitiya in the Mahaweli area.\nOn the face of it this seems a bit sad, as cows in traffic is one of the more charming features of this city. However, it gets a bit less charming when you realize over 100 accidents a year are caused by cows, killing over 100 people as well. There was no mention of how many cows were killed (in the\n).\nIf you feel that your cow has been rounded up you have a few days to claim it from the CMC in Colombo, or you need to go to Embilipitiya and pay a fine. If you are a cow, then be warned. I hope it's a nice farm.\nColombo cows, if you spend any time with them, are generally lovely animals. There was a cow that used to visit my house as part of her daily rounds and my landlord at the time would give her a bucket of vegetables. I called her Bessie and I would pet her when she dropped by. My hand was not a vegetable but she was quite accommodating about it.\nBessie had a few houses on her 'bucket list' and seemed to have a fairly regular commute. On any given day, in that neighborhood, there'd be a multitude of cows going up the road in the morning and down the road at night.\nI often wondered where these cows went and what were they doing. It really did feel like they went to work in the morning and came back at night, like everybody else.\nThe other side of this is that cows do not understand or obey traffic regulations. They will block or cross the road at will. The car in front of them will stop, but the drivers behind - quick to spot any opportunity - will go around, potentially hitting the cow and causing an accident.\nThe problem seems real and, assuming that the cows are treated humanely, the solution seems not terrible for the cows. However, it is a bit sad to think of the streets without our bovine friends. I guess they're moooving on.\n",
  "url": "https://www.yamu.lk/blog/colombos-cows-being-rounded-up"
}