{
  "title": "Deadpool Movie Review",
  "abstract": "Meet the antihero rom-com with oodles of R-rated joy. ",
  "author": "Kinita",
  "date_published": "11:17am",
  "content": "Deadpool is hyper-violent, it's self aware, it's hilarious. Tim Miller's directorial debut was commendable, rocking the snarky geek genre and killing the 4th wall. As a Scott Pilgrim fan, I was excited to see the same streak of rapid-fire hilarity teamed with holistic character development. It's also a lot less heavy on the action-revenge theme, and was more of a rom-com with carnage and profanity.\nSteering clear from the shit show that was Deadpool in X-Men Origins : Wolverine, this portrayal of Deadpool stays pretty true to the comics. He's deliciously acerbic, irreverant, and the action is slick. I was glad to notice judicious use of CGI, partially because it usually means detraction from actual acting skills or plot, and partially because i feel like it won't hold up well in the long term as graphics improve and audiences get used to sleeker visuals.\nRyan Reynolds' performance as Wade Wilson/Deadpool is stellar. His boyish charm lends itself well to the character's childishly sardonic taunts and reactions, and his body language does well in spandex (heh). In almost every other superhero movie, the star is unmasked in the lion's share of the film's run time, giving you more opportunity for empathy. Deadpool, however, is masked for most of it. The fact that the movie is still engaging and relatable can also be attributed to brilliant script-writing and character development.\nThe only issue with Reynolds' performance was that it eclipsed his co-cast. His antagonist, Ajax, is as bland and white as Greek yoghurt. He's your typical, one-dimensional, unecessarily good looking, evil-for-the-sake-of-evil villian with a British accent. Snore. (You may also remember Ed Skrein as Khaleesi's equally one-dimensional boy toy in GoT).\nWe don't really learn much about Wade's love interest Vanessa either, except that's she's also hot. However, DP's side kicks were overshadowed but great. T.J Miller's best friend/bar man character really rocked the dead pan delivery, and the cokey blind granny room mate was a sweet addition. I personally enjoyed the X Men cameos because it lent the movie a sense of belonging to the Marvel universe.\nI was deeply grateful for being able to watch Deadpool in 2D as opposed to the usual new-movie-3D schtick. If you wear glasses, or just appreciate crisp HD quality visuals, you must have realised that 3D is a pointless, cumbersome, expensive venture. I wasn't as equally grateful for the censorship. We'd apparently gotten the film copy from Malaysia, that has a strict no-sex policy even for R-rated films.\nThere wasn't any blurring or editing, they just completely snipped out the sex scenes. This means that you don't actually notice when the cut is made, but you do feel a certain lack in terms of story arc development.\nFor us watching in Sri Lanka, you don't really understand the depth of Wade and Vanessa's relationship at all. They meet in a bar, and then they're engaged. Even if you're as insanely attractive as this couple is, you're probably missing out on a couple of steps there.\nAlso, if you're watching in Lanka, get ready for an audience full of dudes. And hooting.\nIt's two popcorn-salted thumbs up from us! The movie was an exhilarating, raunchy ride I'd line up for again. Also because the jokes and Marvel references were so slippery quick that I'm sure I missed a few while I was laughing at the previous joke. In the end, despite the violence, profanity, and irreverance, the movie was genuinely emotionally engaging.\n",
  "url": "https://www.yamu.lk/blog/deadpool-review"
}