{
  "title": "Delicious Desserts in Colombo (2016)",
  "abstract": "Few things get the YAMU team as excited as desserts, so we’re always on the hunt for awesome confections. So…",
  "author": "",
  "date_published": "12:48pm",
  "content": "Few things get the YAMU team as excited as desserts, so we’re always on the hunt for awesome confections. Some of our favourite spots from\n(Charcoal,\n, Waffle Corp) unfortunately closed down. On the flip side, we’ve got some great new places that specialize in these. So here are some of our favourite desserts around Colombo.\nSchakasz’s Crème Brûlée Cheesecake (Rs. 450) is one of our best new finds in Colombo. We’ve had this many times and it has been on point each and every time. This combines the best of both dishes with a crunchy biscuit base, rich custard and cream-cheese centre, topped with burnt caramel and frozen raspberries. The reason this dish works so well is because of the perfect contrast between textures, temperatures and flavours.\nTres leches, which means “three milks” in Spanish, is a cake soaked in three kinds of milk - condensed milk, evaporated milk (what remains when 60% of the water is removed from fresh milk), and cream. The end result is a cake that's incredibly soft and moist, without being soggy, with a really wholesome, distinct flavour. Topped with a generous layer of slightly-sweet whipped cream, this cake ticks all the right boxes.\nThere are ton of great brownie choices around town, but the cookie dough brownies from Cookies & You is our pick. The crunchy crust, gooey chocolate center and chunky dough come together so perfectly here that we didn't know where the cookie flavour began and the gooey chocolatey brownie ended.\nThe August Mess is Mama Aida’s take on the Eton Mess. They change things up ever so slightly with a rosewater scented meringue, cream, strawberries and pistachios, which adds a bit of their Lebanese touch. With a great balance of acidity and sweetness from the strawberries and a contrast of textures from the pistachios and meringue, this is an excellent way to end the meal.\nLast year we had Tasty’s eclairs on the list, but Oshella takes eclair honours this time around. These are about double the size of what you'd get at a bakery and they blow the competition out of the water. Unlike most other eclairs, these come with a pastry cream filling as opposed to the generic chocolate cream filling, and it works brilliantly with the soft choux pastry and chocolate coating.\nBella’s brownies & cream jar is one of favourite jars around. Soft and chocolatey brownie cake, lodged between plenty of delicious cream, and topped off with sliced strawberries. It’s simple on paper but the execution and all the elements just comes together beautifully. It’s an awesome dessert to pick at with a spoon for all you spoon-in-the-nutella-jar people.\nCremalato recently launched their own range of fruit pops, which are downright fantastic. We tried the strawberry, passion fruit, avocado, watermelon, mango and lime-coconut, and loved each one of them. What really sets these apart is the intensity of the flavours. It makes them an incredibly refreshing indulgence on a warm day. The best part is that they taste very natural.\nCakery's passion victoria sponge is one of our go-to cakes. It's quite simple really, with two layers of sponge base topped with a layers of butter cream frosting and a passion fruit glaze. The sponge is nice and airy but what really elevates this cake is the perfect juxtaposition of the rich butter cream and the acidity of the passion fruit glaze.\nYou wouldn’t really associate desserts with Calorie Counter, but they do a great iteration of strawberry froyo. This isn’t the usual super sweet froyo you’d get at most places, but their natural take on it was refreshing and adequately sweet while still being smooth and rich.\nDolce Italia's panzerotti is a giant sugary croissant, stuffed at its center with thick, creamy chocolate. The pastry was buttery and flaky with the centre packed with thick and glazy chocolate filling.\n",
  "url": "https://www.yamu.lk/blog/desserts-2016"
}