{
  "title": "Delicious Desserts in Colombo (2015)",
  "abstract": "Sometimes you're just in the mood for a great cake or ice cream on-the-go. Here's a list of our favourite desserts in the…",
  "author": "Shifani",
  "date_published": "1:18pm",
  "content": "Great desserts in Colombo are not the easiest thing to find, that's why our home bakers are so successful. Here's a list of where to instantly get some of our favourite desserts in the big city. If you've had amazing dessert some place and it's not on our list, share it with us in the comments.\nChesa Swiss is a pretty fancy restaurant, the food is good but on average it will cost you about Rs. 3K per head. So it's not for your average drop-in-for-dessert occasion, but in case you do find yourself here on a fine evening, you've got to get their chocolate souffle. For Rs. 600, the souffle comes nice and warm, you break into this soft fluffy top layer into hot, creamy chocolate cake. It comes with a side of cool, homemade ice cream which makes for a happy contrast. Chesa also does a good Coupe Romanoff, a tall glass of vanilla ice cream and fresh strawberries.\nSkrumptious makes good brownies, we all know that. You can either sit in at\nand couple your dessert with ice cream or fruit, or grab some for cheaper at their\n. But it's their chocolate biscuit pudding that's the real knockout. I personally am yet to find great biscuit pudding that's ready over the counter (do let us know if you have), until I tried the Skrumptious cup. For Rs. 300, this is an excellent biscuit pudding, light and chocolatey, with thick biscuit of a nice crumbly texture to break up the sweetness.\nYumi Cake, catapulting from Good Market fame, now has a very popular shop on Marine Drive that does a bunch of things (cakes, healthy salad, organic drinks, crab curry etc). They make some of the best brownies in town - for just Rs. 220, this is a lovely square that couples rich, chocolatey brownie with a wonderful thin layer of cheesecake. They also do a yummy, heavy red velvet cake, and a very creamy eclair.\nJagro is heaven if you love your strawberries. From the strawberry tart to their strawberry coated waffles, the stuff tastes amazing - can't really go wrong with high quality strawberries from their own farms, coupled with sugar and cream. It's all good - the waffles with strawberries cost Rs. 450, strawberry cheesecake is Rs. 550, and drinks are for around Rs. 250. They shot to fame at\nthat's a little on the edges of Colombo, but they now also have a more convenient\n.\nThe Cricket Club Cafe is a favourite among cricket lovers and food enthusiasts alike. It'll cost you about Rs. 1000 a head, so if you're here to grab Dilhara's Drover pie or Miller's mixed grill, don't forget to get the pavlova for dessert. It costs just Rs. 295, and it's a sweet delight, with dollops of fresh fruit and whipped cream - you get to choose from a combo of pineapple, mango or papaya, with passion fruit.\nThis is a chic, beach-side restaurant in Mount Lavinia. They do some of the best tiramisu we've ever had - it costs Rs. 500, and tastes brilliant, with a heavy layer of coffee cream atop a mix of cream cheese, coffee liqueur and ladyfinger (a sweet spongey cake).\nWaffle Corp. is Colombo's reigning waffle house at the moment, and we'd recommend their waffles for breakfast, whether sweet or savoury. If you're driving around and just looking for something to satisfy your sweet tooth, their sweet Belgian waffles do it well - for Rs. 450, the marshmallows and chocolate waffles are good, and I personally really enjoyed the classic waffles with strawberries and whipped cream combo.\nCharcoal is a cosy, comfy cafe down Hotel Road in Mount Lavinia. Their meals are well put together, in the Rs. 300-600 range. If you're looking for good cheesecake - this is it. Their strawberry cheesecake, for Rs. 350, comes with a thick biscuit base, smooth and creamy cheesecake, and a lovely strawberry sauce topping, along with fresh strawberries if they're not all out already.\nThe famed\nhas become more elusive than he once was, and so for those of you who don't want to wait for his bell to toll, you can take a trip down memory lane at the Achcharu Kade Cafe. They of course couple the bombai muttai with a cup of creamy vanilla ice cream, and for Rs. 240, this is a super dessert to have after a hot day about in the city.\nBrick Lane is amazeballs for cookie cravings since cookies in Colombo are mostly a homebaker's-turf kind of thing. They've got an exciting range of flavours, but the red velvet cookie is one of our favourites. For Rs. 160, this giant red cookie perfectly imitates red velvet cake, is soft and smooth, working well the milky little white chocolate chips in the cookie. Also check out their awesome tempura fried Mars and Snickers bars (Rs. 400 for three bars).\nAfter all this time, Il Gelato still reigns supreme in terms of high quality ice cream shops in the city. Unfortunately, they are also terribly expensive, at a whopping Rs. 300 per scoop. Still, if you've got the money and you are craving after a good pick-me-up cup of tasty gelato, we recommend Il Gelato's Oreo flavour, it never fails to please.\nIf you are in or around the Battaramulla side of town, the Bakery at Waters Edge is wonderfully convenient. It's our only drive-through bakery, and they do some very good shorteats and sweets. The red velvet cake costs Rs. 180, and is a big slice, with a thick, creamy cheese topping. It's their chocolate that really impresses however - also at Rs. 180, it's nutty, creamy, and the best we've had out in a while.\nWe come to the end of our list with our most loved bakery cum rice-and-curry shop. I literally make several trips here a week just for their eclairs. One costs Rs. 80, and it is a big perfectly light choux pastry stuffed with generous amounts of delectable chocolate cream (you know, the kind that comes oozing out the sides). Absolutely satisfying and this remains my favourite eclair joint (these are the same eclair makers that provide to\n).\n",
  "url": "https://www.yamu.lk/blog/desserts"
}