{
  "title": "Dinner With Glenfiddich ",
  "abstract": "Whisky is a strange and magic thing.",
  "author": "indi",
  "date_published": "12:42pm",
  "content": "One night, as a teenager, I stood on a chair to get into my parent's liquor cabinet. I took down a bottle of whisky, tried a sip and immediately put it back again. It tasted awful. I remember thinking 'why would anyone drink this?'\nWhisky is not for children, and neither is this article.\nAnother night, as an adult, I attended a whisky dinner with Struan Grant Ralph of Glenfiddich. There we tried a range of whiskies from 12 to 21 years old, and I enjoyed them very much, perhaps because I was older than the drink this time.\nWhat Struan talked about is why I grew to like whisky as an adult. He talked about the history of Glenfiddich since 1887, and the people - like the coopers (barrel makers) and other craftsmen - that make the drink.\nThat's the thing with a good single malt. It has a story, which you can taste. There's water from the Robbie Dhu springs, there's sherry and wood coming from the casks, and there's years spent there, just mixing it up. Then, of course, there's the history, and the brand, and the experience.\nIf you taste whisky with just your tongue it's kinda awful. If you taste it with your brain, it's amazing. It can trigger a universe of different flavours, of memories, of associations all your own.\n1864 at the Galle Face Hotel was a good setting for a whisky night. It's older than Glenfiddich (as the name suggests) and has its own history oozing out of the (refurbished) walls.\nThe food was excellent, especially the courses involving whisky, like the whisky cured salmon, and the whisky coffee.\nEach course was paired with a 12, 15, 18 and a 21 year old whisky. The trouble is that after the third one I would say that my tasting ability was less... focused. Each was paired with a dish that complemented it. The 21, for example, evokes banana, vanilla and spice, so it was paired with a banana and butterscotch desert.\nPersonally, I like this sort of tasting more than a wine pairing, but I guess I just don't like wine that much.\nStruan was the MC and the host for the night and, once he oriented us towards Scotland for the initial toast, was quite charming and down to earth. I honestly expected someone more douchey as a global brand ambassador for spirits, but he was very humble and kind.\nWhisky isn't a party drink, it's about people and history, which was what he communicated. Specifically, the stories and names of people from the distillery, like the coopers (who make the barrels), and the love for the land, the water and the craft that goes into this particular product.\n...\nNow, as an adult, I understand why anyone drinks this whisky thing. After having tried a range of varieties I can say that The Balvenie (a Glenfiddich Brand) and Glenfiddich 12 are my favourites. If it's something you're into it's a fun (if expensive) hobby to get into, and one you can (and should) experience without getting intoxicated.\nWhisky is a fun trip to take your adult brain on, and Glenfiddich is a great place to start. It's grounded in the earth, water, fire and air of Speyside, Scotland, but where your palate and imagination takes you from there is entirely up to you.\nSláinte mhaith. To your good health.\n",
  "url": "https://www.yamu.lk/blog/dinner-with-the-glenfiddich-brand-ambassador"
}