{
  "title": "Don't Panic - Rumors And Realities About #FloodSL",
  "abstract": "No planned power or watercuts, and the rains seem to be receding. ",
  "author": "Aisha",
  "date_published": "12:04pm",
  "content": "There've been rumours about upcoming power cuts and water cuts as a result of the water and power plants going under water. We called up the relevant ministries and departments and found out that this isn't actually true.\nErgo, it's important to (a) not panic and (b) make sure your sources are reliable. Like, really reliable. Please double check viral FB posts or tweets before you share it, and cross check it with official statements.\n\nA couple of FB statuses and tweets claiming that the Ambatale water treatment plant was about to cease supplying water to Colombo have been making the rounds. Aforementioned rumours claimed that the purification plant was about to get flooded, which would, in turn, lead to watercuts in the city.\nThe plant operations manager\n. There's no danger to the Ambatale plant, and water supplies to the city will continue as usual.\n\nIgnore the chain emails and WhatsApp messages you're getting, because the Ceylon Electricity Board isn't planning on implementing power cuts, island-wide or otherwise. CEB's Trade Union Convener Ranjan Jayalal told us that there are smaller powercuts around flood-affected areas, especially those completely underwater, but they're working on getting those up and running.\nThe cyclonic storm causing all of this (christened\n) is moving off. However, there'll be strong winds around the country with sudden rains in the South-Western areas, the Disaster Management Centre said. They warn of heavy rainfalls (100-150mm) in some areas, but didn't actually specify which. Either way, the public are urged to be cautious and minimize danger.\nShowers and thunderstorms are expected in most areas of the country including the Western, North Western, Central, and Sabaragamuwa Provinces, and in the Galle, Matara and Mannar districts.\nSeasides will be rough, with thundershowers expected to occur erratically from Kankasanthurai to Hambanthota.\nShowers may occur elsewhere (sorry, we know that's vague but that's all the DMC has) after 2PM. So basically late noon and evening.\nWatch out for strong winds predicted to go up to 70-80kmph.\nMany areas along the Kelani River are inundated, with water levels still rising along Nagalagam Street. Hanwella was flooded too and Glencourse was alerted, but waterlevels are dropping in both areas as of now.\nAreas along the Kalu Ganga are flooded as well, especially Millakanda and Putupaula, but waterlevels are dropping.\nMahaweli is normal, and the status of Attanagalu Oya, Maha Oya, and Yan Oya (all three which were on high alert and had flooded) is that the water-levels are dropping now.\nColombo's had a massive hit, and has over\naffected families. 62 camps have popped up to facilitate the victims. Next up is Gampaha and Puttalam. Other notably affected areas are Kalutara, Ratnapura, Kegalle, Nuwaraeliya, Kandy, Anuradhapura, Kurunagala, Vavuniya, Mannar, Mulaitivu, and Kilinochchi.\nThe DMC told us that there's not been a\ndrop in water levels, but it's receding nonetheless. They're overlooking evacuations, which are happening as of the time of writing. People and officials are running around to get things under control and help as much as possible, and one of the DMC Emergency Operations officials told us rather hurriedly that there'd only be more problems — larger issues — if the rain continues on a massive scale. However, Roanu is moving away, and the Met Dept is cautiously optimistic of fairer weather.\n",
  "url": "https://www.yamu.lk/blog/dont-panic"
}