{
  "title": "E-Gift Ideas (Ft. Takas.lk)",
  "abstract": "We've teamed up with Takas.lk and come up with 10 E-gift ideas and an awesome give-away to go with it!",
  "author": "Bhagya",
  "date_published": "6:04pm",
  "content": "We wanted to change things up a bit this year when it comes to gift ideas. We've still got our\nand our\nand\n, but with this one we want to focus on e-gifts (as in online gifts with no hassle). This time around we're working with\n, so we sifted through their multitude of categories and came up with a ten e-gifts that cover a range of price points. Best part about it is that they do gift wrapped deliveries now, so you don't need to lift a finger (well kinda' but you get what we mean). Oh and did I mention we're also\nso stay tuned to find out how!\nWatches make for great gifts and it's something every guy should own. Besides the obvious functionality, they're also a unique way of showing a bit of personal style. Our pick for the gents is the Titan Octane Chronograph, which steers away from the usual leather and steel straps for an edgy matte black build and face, offset by copper and chrome hands and markers.\nLadies in Sri Lanka honestly don't wear watches often enough, but they can make for chic wrist accessories (y'know besides telling time). In contrast to our men's pick, we chose the Casio Enticer for the ladies. It's more on the dressy end of the spectrum with its silver and rose gold two-tone design, but this still makes for a versatile casual choice as well.\nFor those of you who are unfamiliar, Ewis is a local brand and the T970G is their latest tablet. We're actually testing this out as we speak, and it's quite impressive. Why are we chosing this over the rest? It just offers great price per performance. This thing is packing a vibrant near QHD display of 2048 x 1536 pixels, 2GB of RAM, 32GB of internal storage and massive 8000 mAh battery. For Rs. 35,000 this soundly beats any other Android tablet at that price range, but the best part is that this has a Dual OS feature so you can alternatively run Windows 10 as well.\nAudio-Technica is known the world over for manufacturing high quality audio products. While Takas offers an impressive range of\n, we picked out the ATH-SPORT2 because it offers great bang for your buck with the added functionality of being IPX5 Waterproof Certified*, so they can be washed after a workout or jog. These also offer a great dynamic range, impressive base and just satisfying sound quality across the board. They come in\nso it's viable for both men and women.\nWho doesn't love a good cuppa coffee right? Well if your significant other does, then you might strike gold with something like a coffee maker. We chose the HD7447 since it's the most affordable of the bunch, but you're caffein junkie Takas has plenty of\n.\nIf you're not a fan of going all out at a gym or you just don't have the time, the door gym bar (mouthful, I know) is great low cost alternative. It's multi-functional, so you can use it to target multiple muscle groups through bodyweight exercises. It also particularly useful if screwed in above a door as a pull-up bar. For just Rs. 2750 this is also cheaper than going for a set of weights.\nSlazenger's Canvas range is a nice blend of old school and modern sneakers. We chose these because we like the low key design and colour palette, which we can see working with multiple outfits and jeans. If you'd prefer something more vibrant, they've got a bunch of\n. They've also got both sizes for men and women.\nTrimmers are actually one of the fastest selling items online, and for good reason. As a guy who shaves his head, these are a godsend. Even if you aren't planning on shaving your head, the Gemei 7 in 1 Kit for Rs. 2,400 is a steal for general grooming purposes. As the name suggests, it comes with 7 interchangeable attachments which include ear / nose trimmer, dual foil shaver, precision details, beard combs and a facial grooming system.\nDid you know that you know that you can buy\non Takas? Well, we only found out when we looking through the site for this list. Now I'm no expert on guitars, but the Yamaha\nOur final suggestion is also our most expensive, and this one is mostly on this list because it's one of the best TV deals you'll find on any site. I actually own one, because after scouring pretty much all the local e-commerce sites, this Sony Bravia was the best deal I could find for a full HD 40\" Tele. At Rs. 66,000 this is great value for money, especially since Takas offers 12 month 0% installment schemes for Sampath, Commercial Bank and NTB Amex credit cards, which is actually a big deal considering the price. It's got great colour reproduction, good volume and viewing angles, with the only caveat being that it only has two USB ports but that's no biggie.\nSo I bet you're wondering how you enter that sweet give-away. It's simple really, just send us your\n, and on the 13th of February we'll choose our favourites and do a random raffle draw to pick four winners who stand to win either a pair of\nor the\n. So be sure to mention your name along with the pick-up line.\n",
  "url": "https://www.yamu.lk/blog/e-gift-ideas"
}