{
  "title": "Eating Local",
  "abstract": "Our take on local food produce and sourcing of ingredients at restaurants.",
  "author": "vidya",
  "date_published": "9:50am",
  "content": "At YAMU, every time we see a menu of a new restaurant that proudly showcases ‘imported ingredients’, including foie gras from France, Norwegian salmon or king crab flown in from Alaska, we groan a little. Don’t get me wrong — our craze for crustaceans is well-documented, and who doesn’t love a rich slab of goose liver?\nThe trouble is, simply, that using ingredients that have been flown thousands of miles across the seas to lure customers is a tactic that is past its best-by date. Over the last decade, the global culinary landscape has undergone a slow yet definite change. Even as globalisation has made it easier—and inevitable—for us to buy Granny Smith apples from California, British cheeses and Italian extra virgin olive oil at the neighbourhood supermarket, there is also a growing consciousness about the environmental and ethical costs of this luxury.\n(The biggest burden of these choices has been borne by species such as yellowfin tuna and the Patagonian toothfish, better known as Chilean sea bass, both overfished to meet global demand. While the yellowfin tuna has been deemed threatened by the World Wildlife Fund, the unflagging popularity of the Chilean sea bass has spawned a trade in illegal fishing, which the New York Times documented in this\non piracy at sea.)\nAll over the world, but especially in countries such as Britain, the United States and most notably the Scandinavian states, there has been an upsurge of interest in the ‘locavore’ movement — a philosophy that champions locally grown produce as well as eco-friendly storage and packing. By turning the spotlight on indigenous produce that is unique to the ecosystem in which it is cultivated, the locavore movement hopes to address the growing concern about ‘food miles’, or the distance that food travels between producer and consumer. It also implies the literal miles accumulated in shipping or flying ingredients from one corner of the world to another — and the resulting carbon footprint.\n\nRecognising that this is a cost we can no longer afford to ignore, most of the\nhave turned their sights to what essentially grows in their backyard. Rene Redzepi’s\n, which held on to its number 1 spot for a number of years, and has been named “arguably the world’s most influential restaurant at the moment” by the\n, is best known for promoting local and seasonal Nordic ingredients (including berries, greens and flowers gathered by Redzepi and his team, Scandinavian grains and local seafood). Similarly, Central in Lima, Peru, which has shot up to the very top of the 2015 list, serves Peruvian ingredients sourced from different altitudes across the country.\n\nTo represent both sides of the debate, it is important to note that in order to stay true to the claim of authenticity, it becomes essential for restaurateurs and chefs to use imported produce. For instance, authentic Neapolitan pizza demands the use of the strongest 00 flour and\n, both of which are often imported. Similarly, most of the restaurants serving mainland Chinese cuisine across the city import\nor preserved duck eggs from Hong Kong or China.\n\nThe inconsistent quality of the local produce is also a potential roadblock. Andrew Speldewinde, who showcases Sri Lankan ingredients and dishes in his culinary venture,\n, told me in an earlier interview that he finds the quality of locally available meat to be a particular challenge. “Every place just sells you beef cubes, which might just be off cuts mashed together,” he said, pointing to the lack of importance shown to good cuts. However, it’s still a surprise when indigenous ingredients take pride of place, especially in a fine dining context.\nWithout doubt, there are exceptions. Speldewinde’s multi-course home venture serves as an excellent showcase for indigenous ingredients such as the tart, local\n, converted into a jelly to accompany his prawn dish, and\n, which is pureed to form the base of the tuna\n, among others.\n’s  innovative range of ice creams, in combinations such as seeni sambol and sprats, passionfruit and chilli and jaggery and sesame, all play on traditional flavour combinations and commonplace ingredients.\n’s compact ice cream selection (with offerings such as jaggery and honeycomb and coffee and arrack), also merits an honourable mention.\nHowever, these are more the rarity than the norm in a restaurant landscape that seems dominated by ingredients from far-flung places, frozen or preserved to remain fresh during the long journey they take to get here. As global winds of change blow our way, we hope it won’t be too long before ingredients from this incredibly bio-diverse country find creative uses in restaurant kitchens.\n",
  "url": "https://www.yamu.lk/blog/eating-local"
}