{
  "title": "Eating Your Way Around The World (In Colombo)",
  "abstract": "Colombo can be a cosmopolitan city, if you know where to look. The city today has many tasty examples of…",
  "author": "indi",
  "date_published": "9:55am",
  "content": "Colombo can be a cosmopolitan city, if you know where to look. The city today has many tasty examples of international cuisine, many of them served by actual foreigners. Here are a few places that YAMU recommends, by region. For more, check out\n.\nLet’s start on the other side of the world - the Americas. Sri Lanka tragically has no South American food options, something that we hope will change. Until then, we’re limited to the big America, the United States.\nIf you’re looking for American comfort food, The Sandwich Factory on Wijerama Mawatha is still a favorite. They do hearty burgers, submarines and shakes in a 1950s inspired diner. They also have a range of healthy sandwiches, but they’re known for more calorie intense offerings like their chicken wings.\nThis is as close as you’ll get to an American diner in Colombo, and Hisham Cader still plays close attention to the food.\nFridays, the international chain, has a beautiful location in Colombo 1, next to the Dutch Hospital. After a bit of a rough start, they’ve established themselves as a popular place to get ribs, cocktails and generally have a good time. The experience ain’t cheap, but you’re getting a certain ambience plus reliably hearty food. This is literally an American franchise, so you get the same punchy flavors and at times excessive portions.\nOther options, franchise wise, are\n,\n,\nand\n- but there’s no news there and those American chains have become octopi, spanning the globe.\nMoving across the pond to Europe, we’ll start with England.\nThis place, run by Britisher Ellie and her husband, is our jam. It’s gone from an amazing home baker of cakes to a professional outfit serving cakes, savories and even an amazing high tea which you can have there or take home.\nWe still go here for our cakes, especially for office birthdays, and they’re pretty reliably good. Also, around holidays, they serve up classic English stuff like mince pies.\nWhile Colombo doesn’t have many purely British restaurants, we have absorbed British pub culture - beer plus food like bangers and mash, shepherds pie, etc.\nClassic purveyors of this genre include\n(in the Cinnamon Grand),\n(attached to Galle Face Hotel),\n(in the Hilton) and\n(behind Agra).\nA lot of people attempt French food via fine dining, but Colombo has never really had a proper French restaurant (excluding Delifrance), until now.\nCafe Francais, as the name implies, is a bistro style French restaurant. They’re a franchise owned by the Michelin starred Pourcel brothers and run by a Frenchman here. They serve up creative and tasty French cuisine, at a hefty price, but they do have ongoing events and a generous ladies night. The place is also generally quite buzzing.\nGermany isn’t a country especially known for its cuisine, but Colombo has a lot of it. For the most part German fare here is hearty, generous and delicious. For a special treat, a few of the hotels (notably the Hilton) go all out for Oktoberfest.\nColombo’s classic German restaurant isn’t actually German run, but that doesn’t take away from the food at all. They have good steaks, excellent schnitzel and other German delights from sauerkraut to a variety of imported beers. It’s especially known for its hefty pork knuckle. Note that the Bavarian usually requires reservations.\nRun by a delightful German family, this spot in Nawala serves up hefty German classics at relatively affordable prices. They do excellent takes on pork, chicken cordon bleu, and a whole range of breaded, roasted and generally warming foods. We actually tend to overeat here, so prepare for feeling sleepy and perhaps arrange a place to nap close by.\nThe next generation of the Sovereign German family runs this places, and we love it. They do the best hot dog in the city and you can get sausages and pickles to take home. They also bake excellent bread, make cinnamon buns, make amazing salads and on any given day are probably trying out something new and delicious.\nAnother notable mentions for Germanic fare is\nnear the north end of the Colombo Port (in Kotahena).\nSwiss food is another surprising culinary favorite in Colombo. There are good options both here and in Negombo.\nOne of Colombo’s original fine dining spots, this pricey but high value location serves up excellent steaks plus Swiss classics like fondue and rosti (a sort of hash browney eggy pancake). They have an excellent steak and are a recommended place for indulgent special occasions. They also have a wide collection of Swiss wines, which are quite good. Their desserts are also generally to die for.\nWe’re stretching a bit to Negombo, but if you’re up there, Bijou is worth a visit. The owner Dolly is charming and has been running the place for over 30 years - serving up tender steaks, schnitzel, stroganoff, cordon bleu, lobster thermidor and other hearty delights. It also ends up being quite affordable and good value for money, a good steak going for less than Rs. 1,500.\nSince a lot of Sri Lankans go to Italy, you can expect good Italian food to come back here. Sri Lanka has a lot of great localized Italian spots (we like\n, creamy duck ravioli yum; or\nat Waters Edge) but we’ll focus on places that are Italian run here.\nWe used to joke that this location at the corner of Vajira and Havelock Road was cursed, because no restaurant lasted there. Dolce Italia has broken the curse. This place has excellent home made pastas, pastries (like canoli) and assorted Italian savories and sweets. On any given day you can find the Italian owners working there or having an espresso outside. It’s a simple, intimate place to chill and they have authentic and tasty Italian fare.\nThis Napolitan pizza place is one of our favorite spots in the city. Run by a young Italian/Sri Lankan couple, the husband is usually at the oven and the wife running the front of house. It ain’t cheap, but you get simple, authentic and delicious pizzas, amazing desserts, and possibly the best espresso in the city.\non Thimbirigasyaya also makes authentic pizza, by an authentic Italian.\ndown the street is run by a Sri Lankan but those pies are super generous and we love them.\nAnother place Sri Lanka has a lot of cultural interaction with is the middle east. These are some of our favs:\nRun by an Iranian couple, this place does an excellent family style dinner in a beautiful location near Gandhara on Stratford Ave.\nGenerally the owner asks you what kind of meats you'd like (beef, minced lamb, and chicken - you can have all) before disappearing into the kitchen and re emerging with a large tray bearing snooker-cue length skewers circled with thick chunks of salty, roasted meat. It all tastes good and there's a wide selection of bottomless sides to dip into - saffron rice, dill rice, pasta, lamb and aubergine curry, etc.\nThe original Mama Aida arrived in Ceylon from Lebanon in 1942. Three generations later, her descendants are preparing traditional Middle-Eastern foods and catering from a home near the Colombo Golf Club. They deal mostly in large orders, so for events parties, etc. It's suitable (and of better value) for groups of more than six. They can also sometimes be found at the Good Market if you’d like a sampling. In our experience, Mama Aida’s food is delicious and fresh.\nAnother Good Market highlight is\n, run by a few young Iranians. For stand-alone restaurants,\non Thimbirigasyaya is highly recommended and\n(on Galle Road now, near Swarnavahini) is a classic for shawarma.\nis also quite good.\nWe’re not going to go into depth here because there are just too many options. If you want more\n. As a short list, Navaratna at the Taj is the classic for-Indians-by-Indians place. At the high end,\nnear Royal College and\nturn out good mughal fare while\nremains the best for South Indian veg.\nAt the street end, the\non Haig Road is a family run whole in the wall that does a tasty take on classic Indian street food.\nFor Chinese, also, there are just too many options to list. We have a\n. Most of the hotels retain good Chinese chefs - try\nat the Kingsbury for more Cantonese/Szechuan style or\nat the Taj.\nis a new place near Cinnamon Red that does good Szechuan (though the service is still a bit slippy) and\non Deanstone place is our go-to place on the simple but delicious end. Other new Chinese run places include\n,\n,\nand, honestly, more every day.\nFor Japanese, the hotel restaurants can actually be quite good and have well trained staff. We recommend YUMI at the Taj and Ginza at Waters Edge - both have excellent variety, though they can get a bit pricey. Here are a few standalone places which are also nice. We've also done a\n.\nDharshan Munidasa’s place remains the best in Sri Lanka and one of the best in Asia. Drawing on his mixed heritage and a lot of talent, this place never disappoints. Where else can you get a Wagyuu burger? Or diamond-priced cuts of Kobe beef? Four person portioned bowls of tsukune nabe? Darshan's Munidasa's gift to Colombo doesn't just offer slices of Japan plonked on a plate in the form of hasty sushi or donburi, it covers the range of Japanese cuisine.\nCafe Japan is a small home restaurant off Marine Drive in Colpetty that does some pretty great Japanese cuisine. It's the definition of a hidden gem since the place is ridiculously hard to find. They've been around since 2000, but those who know about the place seem to want to keep it to themselves.\nis an actual Japanese chain that’s set up in Arcade Independence and it’s quite good.\nis a relatively new place in the Zylan Hotel on Rosmead Place and is worth checking out, and\nin Nawala does satisfying sushi delivery.\nalso does a great modern take on Japanese at their supper club.\nKorean food is much fun to eat, though Colombo now has less options than it used to.\nHan Gook Gwan does a great take on Korean cuisine at an affordable price. It's not for everyone, but if you like the DIY style of food, this is one place you have to visit. You can cook your own food on a hot plate and they have a nice selections of soups and other Korean delicacies.\nKyung Bok Kung at Hotel Juliana does a pretty authentic take on Korean cuisine. The setting might be slightly dubious, and the DIY style might not be for everyone, but order the right dishes and you'll be glad you dropped in.\nFinally, we’ll round up our international tour with South-East Asia. Sri Lanka has long had Thai places like\nand\n(both excellent, at different price points). However, here we’re going to highlight places run by recent immigrants, serving Thai and Vietnamese cuisine, respectively.\nAt Tom Yum, a Thai lady and sometimes her mother serve up delicious authentic Thai food, with an emphasis on street food style dishes. The location near St. Peter’s is small and the service can be maddeningly slow and at times neglectful. Also note that portion sizes are not huge. If you can calibrate your expectations accordingly, this is a tasty treat.\nSituated in buzzing Thimbirigasyaya (near Calorie Counter and Glory Sports), this Vietnamese run place serves its signature pho and other classic Vietnamese dishes. If you’re unfamiliar with the cuisine it can come off as a bit bland, but it’s very healthy and quite fresh and clean.\nSo thus concludes our whirlwind world tour of food. It’s refreshing that Sri Lanka is becoming a place where people from all over come to share their culture, even in a small way. It’s also great that more and more Sri Lankans are importing different cuisines and adapting them here. What we’ve covered is by no means everything and if we’ve missed something terribly important please get in touch via our website. Until then, we hope you enjoy exploring the world, face first.\n",
  "url": "https://www.yamu.lk/blog/eating-your-way-around-the-world-in-colombo"
}