{
  "title": "Elderly Care Facilities in Sri Lanka",
  "abstract": "Care facilities for the elderly in Sri Lanka can be hard to find. Here are a few reputed places we've found.",
  "author": "Rishani",
  "date_published": "8:34am",
  "content": "Old age is a very sensitive and fragile period in life where elderly people need extra care and comfort. When the elderly in our care are prone to accidents would you know how to handle the situation? Are you aware of the resources available in Colombo to take care of the elderly? As our parents, or relatives or those we give care to – age; they require more and more help because they lose their natural ability to take care of themselves and most times growing old presents its own challenges.\nDiscussing assistance to aging loved ones is not always simple. Maybe you've noticed that your mother who was once meticulous about her appearance, is wearing wrinkled clothes and not doing her hair. Perhaps there are bruises or constant falls and when addressed, their instant response is, \"Everything is fine, there's no need to worry.\" Admitting they need help would mean they can no longer take care of themselves, and no one wants to lose their independence. Admitting they need help and accepting assistance is not easy for people as they age.The burden often falls on the family to recognize the signs that an aging parent might need help with daily living tasks.\nWhen is it right to offer help to your elderly loved ones? There will always be a few  telltale signs you can pick up: spoiled food that doesn't get thrown away, unexplained bruising, forgetting appointments, difficulties in mobility, difficulty getting up from a seated position, difficulty in walking and balance, forgetfulness, strong smell of urine in the house, confusion in performing familiar tasks, a notable difference in grooming habits and personal care, extreme clutter and dirty laundry and dishes piling up, poor diet or weight loss, loss of interest in hobbies and activities, changes in mood or extreme mood swings, forgetting to take medications, or taking incorrect dosages.\nIf you are living away from your elderly folks or are unable to take care of them any longer and you are considering placing your parents in care facilities and retirement homes, we have put down a list here to help you make these choices.\nlocated in Maharagama is a retirement home which provides apartments as well as packages to meet individual needs. Phone number: 11-2804040\nprovides day care facilities, short term and long term residential care, lifetime residential care. The home undertakes care for residents suffering with dementia, Alzheimer's and Parkinson's disease, patients with diabetes, high blood pressure, cancer, patients who are bed-ridden, require nasal feeding, PEG feeding or with urinary catheters. Care is also undertaken for residents who are either deaf, blind, amputees and paralysed patients.\nis a senior retirement home located in Havelock,and provides residential nursing care for residents.\nHome located in Bandaragama while providing a retirement home also provides care for residents suffering from dementia.\nis a senior caring facility that provides senior retirement living, short term living facilities, day care for senior citizens, bed-ridden person care, home nursing and home medical services. Noble Aged is located in Piliyadala.\nis a retirement home for the elderly and is located on a 3-acre property in Piliyandala and provides medical assistance as well as care for differently abled elders.\nprovides care for the elderly suffering with Alzheimer’s and Dementia.\nIf you are looking for homes that are a tad cheaper, there's:\nwhich provides basic facilities such as food, clothing, accommodation and medicine.The home is located in Colombo 2. Phone: 11-2682397 Email: colomboymba@sltnet.lk.\nprovides food, care and attention to the elderly. Phone: 112 727 580.\n, provides care and basic facilities for ladies. The home is located at Stag Place, Colombo 5. 112 598 576.\n",
  "url": "https://www.yamu.lk/blog/elderly-care-facilities-for-your-aging-parents"
}