{
  "title": "Encroachment: The Actual Issue at Wilpattu",
  "abstract": "Racial and religious issues aside, illegal settlements are causing irreparable damage to Sri Lanka's largest and oldest…",
  "author": "",
  "date_published": "12:49pm",
  "content": "Protected by the Flora and Fauna Protection Ordinance, Wilpattu is Sri Lanka's oldest National Park. It boasts of many things: being the largest park in the country, it's also home to an absolutely unique ecosystem of\nwhich contains both salt and freshwater, in addition to a plethora of wildlife ranging from elephants to leopards and sloth bears.\nIts National Park status was obtained over a number of years from 1938 to 1973 — but is unfortunately under threat (along with three of its nine adjoining forest reserves), as an unsurprising result of human-nature conflict where the former attempts to colonize the forest.\nAs things currently stand, over 3400 acres of forestland is under destruction, environmental activist Nayanaka Ranwella from the Wildlife Conservation Forum said. He added that deforestation currently occurs in three separate areas of the forest and its adjoining reserves, mostly due to illegal resettlements. The reserves that are currently under threat are Vilaththimulam, Kallaru, and Periyamurippu, despite regulations being in place to protect them.\nAccording to site reports, the clearing of forests began back in 2009. The main reason for this was to provide homes for people displaced during the war, and the area was penned off for housing schemes. Environmentalists note while there used to be settlements close to the reserve and that ruins of a mosque are to be found in the area, none of these were within the reserved lands.\nIn terms of\n(as amended) the definition of forest reserves in Sri Lanka are defined as\n(a) “a forest and every part of a forest declared to be a reserved forest under the provisions of section 3 of this Ordinance, or the corresponding provisions in any enactment repealed by Ordinance No.16 of 1907, or in any enactment to be hereafter enacted for the purpose of defining reserved forest” and\n(b) “plantation, forest depots, and chenas planted with forest trees;”\nAnd in terms of\n;\nAny person who in a Reserved Forest, inter alia;\na) trespass or causes trespass or remains therein;\nc) fells a tree or cuts or drags timber, causes damage by negligence or intentionally strips off bark or leaves from any tree or girdles, lops, taps or burns a tree or does any act to damage or destroy any tree;\nk) clears or breaks up soil or dig any land … prepares any land for building purposes … or erects a hut or any building whether permanent or temporary or occupies any building so erected\nl) constructs any road, alter or damage any road already constructed, uses any road so constructed, damages, alters, disfigures or removes any wall, ditch embankment, fence, hurdle … name board, sign board or any other boundary mark;\nshall be guilty of an offence and be liable on conviction to imprisonment or to a fine or to both such imprisonment and fine.\nIn terms of the provisions of\n(as amended);\n(1) Notwithstanding the provisions of any other written law, from and after the coming into operation of this Act, all prescribed projects that are being undertaken in Sri Lanka by any Government department, corporation, statutory board, local authority, company, firm or an individual will be required to obtain approval under this Act for the implementation of such projects” and\n\nIn terms of the provisions of\n(as amended), of prescribed activities,\nSchedule Part I; the “conversion of forests covering an area exceeding 1 hectare into non-forest uses” and\nSchedule Part III; that, inter alia, any area “within 100m from the boundaries of or within any area declared under the Forest Ordinance”;\nmust be subject to an Environmental Impact Assessment as provided for in the National Environmental Act which is the overarching applicable law for environmental protection in the country.\nSource: Environmental Foundation Limited's site report.\nApproximately 700 acres are already cleared out in the Vilathaimulam Forest Reserve.\nDespite being such a large scale issue, the government is yet to take action against the encroachers. The Environmental Foundation Limited points out that encroachment leads to the destruction of habitat, including space for wildlife to move through freely.\nEnvironmentalists recommend a detailed analysis of existing Gazette notifications in order to be clearer about specific boundaries and demarcations, and to consult relevant environmental and civil society stakeholders to mitigate damage.\n",
  "url": "https://www.yamu.lk/blog/encroachment-the-actual-issue-at-wilpattu"
}