{
  "title": "ETCA (The Agreement Formerly Known As CEPA)",
  "abstract": "A discussion of the ETCA agreement between Sri Lanka and India, including a draft full text of the document.",
  "author": "indi",
  "date_published": "6:02pm",
  "content": "Sri Lanka and India are negotiating a trade agreement which is causing a lot of controversy. Unlike other trade agreements which covers goods, this covers services - specifically IT and shipyards services. This means that people may move back and forth and - given Sri Lanka's long and sometimes contentious relationship with India - this is causing a lot of controversy.\nA lot of this is because the document itself is not (officially) public but we have an un-official copy here, and some quick FAQs. This article won't tell you whether the agreement is good or bad, but it will try to lay out roughly what it is.\nAbove: Economist Deshal De Mel talks about ETCA with Indi\nYou're not supposed to. It is only for the Illuminati ('stakeholders'). It isn't public until both parties agree.\nHowever, the GMOA (Government Medical Officer's Association) did release scanned versions of the framework document and an annex of services.\nWe're releasing the full text documents here, because, well they've already been released:\nIf you want to see some excerpts, we've selected a few at the very end of this article.\nWhat's on the table is just an agreement to make an agreement in 6 months.\nThere are two documents, a framework and the actual agreement. Only the framework document is up to be signed in the next few weeks. This basically just to open actual negotiations. So still plenty of time to freak out, and change stuff.\nSo far the sectors seem to be limited to IT-enabled services and Colombo dockyards. Within that it seems likely that the negotiations will limit those positions to highly skilled (ie, not entry level programmers). The movement would go both ways.\nThe annexure linked above actually mentions a range of services, but other statements have said that this first round would be limited to IT and shipyards.\nUnlike goods, services means that people could move across borders. India IT professionals could be working in Sri Lanka and Sri Lankan IT professionals could be working in India. This means they could be competing for jobs, which has many people worried. The secrecy and lack of transparency around the agreement doesn't help.\nYes, through the BOI, but it's a bit of a process and gives limited slots. Also, many companies are note covered by the BOI.\nOfficially no, but basically yes. If you're wondering what they acronyms mean it's Indo-Lanka Economic and Technology Agreement (ETCA) and Comprehensive Economic Partnership Agreement (CEPA).\nIf you have time, best to read up about it here -\n.  In short, countries have worked on free trade agreements for goods, and now they are working on free (or more free) trade in services. These services come in different modes, the controversial one being Mode 4, where a human moves from one country to another. Services account for nearly 60% of Sri Lanka's GDP and these sort of agreements are becoming more and more common.\nWe don't know. This could cost jobs or it could create growth for everyone - the relevant parts haven't really been negotiated yet. Read and chat around and decide for yourself.\n",
  "url": "https://www.yamu.lk/blog/ectacepa-faq"
}