{
  "title": "Exploring Maradana: A Photostory",
  "abstract": "It's a pretty happening place, bustling, busy, chaotic. Nosey around for good bargains and Pettah-esque experiences, but just be a…",
  "author": "",
  "date_published": "2:01pm",
  "content": "You wouldn't think it, but Maradana is like Colombo's second Pettah, albeit with some schools and colleges thrown in. It's just as hustling and bustling, and strikes a strange balance amongst the industrial, commercial and residential trifectas of the city.\nWhen we mean it's like a second Pettah, we mean that literally: from fresh vegetable markets to Maradana's iconic Chinese fabric stores and ancient furniture outlets and more, you can find what you need here for a fraction of the price you'd find elsewhere in the city. For convenience's sake, I'm going to just take you through the main lanes and bylanes where stores are clustered. The layout has changed a lot over the last decade with many stores simply disappearing and being replaced with more modern storefronts; but here's the gist of where you can find what.\nLet's start from the round-about and make our way towards Borella.\n\nThe most noticeable features of the junction and the roads leading to and off it are the theaters and the railway station. Second to the Fort Railway Station, the Maradana Station is also a bustling hub within Colombo.\nCriss-crossing the roads above the station is the orange and somewhat rickety-looking Maradana overhead bridge, connecting T.B Jayah Mawatha (aka Darley Road) to Panchikawatte. This is host to a number of little shops including tailors, printing\n, used shoes and watches and such knickknacks.\nI'm sure it probably sounds great and very hipster (albeit somewhat dodge) to buy used products off Maradana (even if it is just something you can clean up and wear and won't give you weird disease), but just keep in mind that it's also a hub of sorts for stolen goods. Specifically shoes and watches: the footwear which are nicked off mosques strangely find their way here, as did a pretty expensive watch my brother lost (also while at a mosque) and found there months later when it caught his eye as he was passing by. Interesting stories here.\nMoving on from anecdotes, the junction also hosts the police station, a Jummah mosque, and Zahira College: the first Muslim school to be established in the country (in 1892). Incidentally, the Jummah Mosque is within the school premises and is also one of the oldest mosques in Sri Lanka.\nIf you want to experience a bibliophile's version of Flea Bottom in Colombo, the Maradana Street Bookshops just off T.B Jayah Mawatha have a spread of dusty brown and yellow volumes piled up for you to peruse. Tucked in cramped spaces with barely enough space to walk between the stacks and stacks of books, you can find out-of-print books and other series that are tougher to find in our mainstream bookstores.\nThe prices are about as solid as the weather: not fixed. So, bargain.\nThe Chinese cloth stores have been around since time immemorial. Unfortunately I don't know when exactly despite spending nearly a day looking for articles (because I wasn't able to speak to the shopkeepers and also because when I tried to a few years ago, they just got really defensive and weren't keen on speaking to the media), but I've heard my grandparents and several other aunties and uncles say that they've been around for about 80 years now.\nLiterally known around the area as \"Chinese stores\", these shops sells fabric wholesale and retail at decent prices. And when I mean 'decent', I mean at a fraction of the cost of the selfsame yard of fabric you'd find at any of the clothing stores in the likes of Colpetty or Bambalapitiya. Whether you want regular poplin for schoolwork or tye-and-dyes, richly embroidered or rhinestone studded materials, or some elegant and hard to find buttery raw silk, you'd get them all after a bit of snooping around.\nThis used to resemble the backroads of Pettah back in the day when it was a cesspit of rotting fruit and vegetables overrun with stray canines, felines, and rodents. Things have thankfully improved over the last decade and a half and now all the vegetable vendors who used to line the streets are packed into the ground floor of a large public market building; the rest of the floors are unoccupied.\nNow, you find tons of fresh and beautifully stacked greens and veggies, all nice and bright. You also find un-bloomed lotus flowers, which I thought was nice because you wouldn't expect to find those outside of a place of worship. Or a temple, more specifically.\nKularathne Mawatha is basically the main road that connects Maradana to Borella. There used to be a line of used-bookstores back in the day, but nearly all of these have disappeared over time;\nfor Wicks' Book Depot which valiantly stands strong. Fun fact: Wicks started off in the 1800s, and the current uncle who's manning the store is the nephew of its founder, and took over the depot in the 1960s.\nIt's like stepping back in time, what with dusty old books, a yellowed portrait of the founder in one high corner, and a tame black kitten winding its way among the old tomes.\nSome of the other bookstores (like\n) have simply disappeared or been wholly converted to\nshops — stores which stocks items necessary for Buddhist monks.\nYou get a whole street of this if you walk down Hikkaduwe Sri Sumangala Himi Mawatha. Before the road names were changed into something that required a hundred deep breaths to pronounce, this lane was simply known as\n, which, I think, is much easier to both remember and pronounce.\nMeanwhile, you also get some really really old furniture stores, still tucked in some of the few remaining Colonial structures that haven't been torn down along Kularathne Mawatha. In case you're wondering, Kularathne Road is the main road that connects the Maradana Junction to Borella, and is peppered with Bombay Sweet shops,\n, and numerous optical stores.\nYes. I feel like I've barely touched the surface with this write-up, but Maradana definitely does have a lot more.\nThere's the Technical College (at the creatively named Technical Junction) which was established in 1893. Then there are a\nof large schools both boys and girls, including St. Josephs, Zahira, Ananda, Gothami, Nalanda, and more.\nThen there's the railroad warehouses where The Warehouse Project was hosted. After the Urban Development Authority gave it a facelift, it's now called Trace Expert City and serves as a tech hub.\nAnd then Forbes Road. That's where people go for their drug fixes. Don't go there, it's a path of no return (unless you get like, rehab or something).\nWhat else?\n, Nestle, temples, nursing homes, the Elphinstone and Tower Hall theatres,\nthose hella dodge cinemas to boot.\nIt's a pretty happening place, bustling, busy, chaotic. Mosey around for good bargains and Pettah-esque experiences, but just be a bit careful if you're out alone at night as well.\n",
  "url": "https://www.yamu.lk/blog/exploring-maradana-a-photostory"
}