{
  "title": "Fairway Colombo Street Food Festival 2017",
  "abstract": "The street was packed with so many people coming in to try out food from about 10 different stalls for amazing prices.",
  "author": "Dinithi",
  "date_published": "11:07am",
  "content": "The\nis on the 24th June 2017, from 6 PM to 11:30 PM.\nColombo's biggest ongoing street food festival goes down on Hospital Street (the parallel street behind Dutch Hospital).\nThe street was packed with loads of people visiting the 10 different stalls. There was\n,\n,\n,\n,\n,\n, Champs, Chips n Dips, Gills Colombo City Food Arcade (the Fairway Hotel stall), Butterlicious,\nand\n. Basically, all the restaurants on that street had stalls except for\n,\n, and\n. Sadly, the Isso Wade cart was missing too.\nWe tried a few of the many options they had to offer. There was a long queue for the Fairway Hotel food court stall serving BBQ chips and hot dogs. &Co (The Steuart) was serving arrack shots which were a huge hit as well, no surprise there.\nWe started off with Pooris's Paneer Muttar (Rs. 350). The paneer was delicious and seasoned well. The poori itself tasted good, but lacked a certain flavour. They also had a Nutella option which I highly recommend if you're a sweet tooth like me.\nSeafood Shack's Fish n Chips (Rs. 400) was a family favorite. Passing that stall, it was hard not to buy because the smell was incredible. There was a generous amount of fried fish, with ketchup and melted cheese. The chips were a bit soggy and oily so they didn't taste all that good, but the fish was tender and crispy.\n&Co (The Steuart) was serving up a unique Seafood Pancake. For Rs. 300, they gave us a big portion of 3 pancakes with lots of stuffing. If that wasn't enough, there was also a side of mashed potatoes. The pancakes were absolutely soft and the creamy seafood stuffing included cuttlefish, prawns and fish.\nWe stopped by the Bellissima stall and they were only serving these biscuit pudding jars. We didn't think much of it but we bought The Raspberry & White Chocolate Biscuit Pudding (Rs. 300) one just to try it out.\nIt was amazing! The tinge of acidity in the raspberry and the sweetness of the white chocolate were such a great combo, I licked my spoon clean after each bite. They had a variety of flavours and I now wish I had bought one of each.\nThe service was great in every stall. They were friendly and outgoing, not to mention very efficient. Meanwhile, the ambience was upbeat and entertaining with a live band providing some great music, and clowns and jugglers entertaining the kids and the crowd.\nHowever, there was very limited seating available, it was like a crowded food court, so be prepared for that. Don't forget to take enough cash cause only a few stalls had POS machines.\nIt was a great night to spend time with your family and loved ones as there's really something for everyone. Shots for the revellers, clowns for the kids, good food for everyone else!\nAttend\nif you want to get in on the action.\n",
  "url": "https://www.yamu.lk/blog/fairway-street-food-festival"
}