{
  "title": "Fantastic Beasts and Where to Find Them",
  "abstract": "Calling all you Muggles: Fantastic Beasts and Where to Find Them is finally here! With a fast paced plot, magnificent special effects…",
  "author": "",
  "date_published": "11:55am",
  "content": "Extra! Extra! After years and years of mourning the end of the Harry Potter series and waiting eagerly with as much patience as one could muster, the newest installment of the HP franchise is finally here.\nAnd it's bloody brilliant.\nSet in 1920's New York we follow Newt Scamander as he tries to set things right after a little mishap where a range of fantastic beasts have been set loose to wreak havoc in the city thanks to a loose lock in his suitcase. I won't spoil it for you by explaining that last sentence.\nplays Newton Artemis Fido (Newt) Scamander. An adorable, quirky Hufflepuff who, thanks to a bit of carelessness, has to deal with a lot of cleaning-up afterwards. Look out for his little quirks: small, awkward smiles and his clumsy running throughout the movie.\nplays Porpentina Goldstein, the rather boring, twitchy witch who was fired from her post as an Auror at the Magical Congress of the United states of America (MCUSA). Honestly it has to be said that Waterston's portrayal of Porpentina seemed quite bland but the fast-paced action conceals any bit that you might find boring.\ngraces our lives as Percival Graves, the Director of security at the MCUSA who is a somewhat stern albeit powerful wizard who just wants to get to the bottom of things. He isn't exactly a bad guy but his views and opinions could be perceived as unorthodox.\n(YAY) plays Credence Barebone. Not much is known about him and you'll have to give the movie your utmost attention if you want to know what his deal is. He's initially a bit of a wimp but I won't say anymore lest the pitchforks and flames be thrown my way.\n\nOther actors who contribute with their excellent performances are Alison Sudol, Dan Fogler and Ron Perlman.\nIn this day and age CGI and special effects make up 60% of the movie. The special effects were spectacular  thanks to some amazing character designs not to mention the beasts themselves. You're in for a real treat here especially when you get to the bit with the Thunderbird.\nWhat puzzled me is the fact that she shows weren't sold out (I assumed everyone grew up with the Harry Potter world and would be equally enthused).\nThat being said I suppose you don't have to call ahead and reserve your tickets which is a good thing.\nThe showtimes are as follows:\n\n10.00 A.M (Sat/Sun) | 1.00 PM | 4.00 PM | 7.00 PM | 10.00 PM (FRI/SAT)\n\n4.00PM | 10.15PM\n\n10.15 AM | 01.15 PM | 04.15 PM | 07.15 PM | 10.15 PM\n\nAs stated many times, the 3D shows here are quite bad with low-quality screening as well as really bad glasses but I suppose you'll just have to make do until they get better. Best place to watch it has to be at the Empire which is basically a posh theatre with roomy seats and enough comfort to enhance your cinematic experience.\n\nAlthough it gets pretty predictable at times and relies on some rather outdated comedy (chubby man tells lame jokes, gets girl) it brought back a thrill I only experienced when watching the Harry Potter movies when they first came out.\n\nThere's a mention of the American Wizarding School 'Ilvermorny' so I'm really excited to see what they do with that. Hopefully they don't Americanise the franchise too much. Hogwarts will always remain the O.G school of Witchcraft and Wizardry and they'll never take it away from the masses!\nBut yes, do get yourself sorted into your Hogwarts and Ilvermorny Houses. Take all your friends with you, make sure they bring their friends too and revel in the amazing pixel magic only our human minds and J.K Rowling's pen are capable of bringing onto the silver screen.\n",
  "url": "https://www.yamu.lk/blog/fantastic-beasts-and-where-to-find-them"
}