{
  "title": "Fast Food Rices, Which Is The Nicest?",
  "abstract": "Our take on the fast food rice options from the major franchises in Colombo.",
  "author": "Bhagya",
  "date_published": "1:30pm",
  "content": "\n\nEvery fast food franchise looks to put a local spin on their menus, and here in Sri Lanka that has manifested in the form of rice dishes. You probably won't eat these on a regular basis, but even the best of us do find ourselves having the occasional craving. So we drove around Colombo and grabbed each major fast food franchise's iteration.\n\n\n\n\n\n\nTo be on even ground we went with the chicken option in each case. The tasting bench consisted of four people (Indi, Shru, Shifani and myself), and we judged each rice based on the overall taste, flavour of the chicken, texture of the rice and any worthwhile additions like the gravy. So here's our list from\n\n\n\n\nWe aren't entirely sure what Pizza Hut was thinking when they concocted this, cause it was just cringe-worthy. It's supposed to be a spin on a biryani covered with a dough, to seal in the flavours (at least in theory). In this case the dough didn't make any sense since it was rubbery and tasteless, so we just removed it.\nI had one taste, kind of hated it, then went back again for a second just to make sure, and immediately hated myself for doing so. Out of the 4 dishes we tried, I'd say this is the only one that I wouldn't eat even if I was extremely hungry. (Shifani's note: It is just mean of them to put this in boxes and give it to unsuspecting people.) It comes with a gravy and an onion and tomato salad in ziplock bags, but the additions don't really help much.\n\n\n\n\n\n\n\n\n\n\n\n\nCompared to the rest of the contenders, the King Rice by Burger King is the newest addition, introduced a few months back. From what we tasted they still haven't really hit the mark. The positives with this one is that you get a large portion, with a sizeable piece of well seasoned, fried chicken. Conversely the major let down with this one was how overcooked and grainy the rice was. This was also the only one that didn't come with any gravy, which would really have helped mitigate the dryness.\n\n\n\n\n\n\n\n\nSo as a disclaimer, for all intents and purposes, I myself am not a fan of KFC. So going into this tasting I was skeptical, to say the least. However, trying all the dishes side by side, KFC's grilled chicken biryani actually fared very well. This is also available in the fried chicken variant, but since the option was available, we went with the grilled chicken. We're not entirely sure if this qualifies as a biryani at all, but hey, it tasted pretty good.\nThe rice was moist and cooked well, which was further improved by the somewhat sweet and spicy gravy, but the real highlight with this one was the grilled chicken which was cooked through and seasoned near perfectly. If you don't care much for the rice then this is probably the best out of the bunch for you.\n\n\n\n\n\n\nIf you were to judge these rice by looks, the McRice would probably look the least appetizing to most. The good thing here is that this isn't supposed to be a spin on anything in particular (like a biryani for instance). You get a decent portion of lightly seasoned basmathi rice, an onion and capsicum salad, a sweet and slightly spicy gravy and a somewhat spicy, well seasoned piece of fried chicken. The key to success of this one is that there weren't any hiccups. The rice was cooked well with the right texture, the chicken was flavoursome with a subtle spice hit, and the onion and capsicum salad added the needed crunch.\nSo there you have it folks, our opinions on fast food rice. These are by no means the best rice options in the city, but sometimes when you're in a rush, or just having a random craving, they can come in handy.\n",
  "url": "https://www.yamu.lk/blog/fast-food-rice"
}