{
  "title": "Father's Day Science",
  "abstract": "Some modern science behind being a better father, brought to you by UNICEF Sri Lanka.",
  "author": "indi",
  "date_published": "7:16pm",
  "content": "The first rule of being a father is don’t drop the baby on its head. That’s because that’s where the baby keeps its brain, and the brain is where we keep everything else.\nEverything your child know, feels or does comes from their brain, and 80% of that brain is wired up AFTER they’re born. Brains are built, not born. This is good news for fathers, because we can’t give birth.\nBut how on earth are we supposed to build a brain, especially if we barely understand how it works? The brain is a complex system that scientists barely understand, so what are parents supposed to do?\nLuckily, you don’t have to understand everything. You just need to get out of the way and the brain will do the rest. As parents, if we provide a healthy, loving and stimulating environment for the brain, it will grow. Automatically.\nIn simple terms, if you just feed your kids well, you’re feeding their brain giving it the energy to do what it does. If you protect them from stress, you’re protecting their brain, keeping it from getting damaged. Finally, if you play with them, you’re literally expanding their mind, enabling their brain to make healthy, happy connections. UNICEF calls these three things nutrition, protection and stimulation or EAT, LOVE and PLAY.\nLet’s start with eat.\nYour brain is a physical organ that makes up around 2% of your weight but burns up to 20% of your energy. So you have to feed the thing. The most basic thing a parent can do is make sure that their baby is getting the energy it needs, because that’s what most directly builds their growing brain.\nMothers produce milk, and for the first six months this is the best thing for baby. However, modern mothers also have to go back to work, and breastfeeding is hard, so parents use formula sometimes. Exclusive breastfeeding is, however, recommended as much as possible for the first six months. Even though fathers have nipples, they are unfortunately useless, so the best we can do is offer support.\nWhen we start feeding the baby real food, we need to introduce a balanced diet with a lot of vegetables and fruits. We also need to fight well-meaning relatives to keep salt and especially sugar out. If you go to any Sri Lankan kids birthday party you will find this nearly impossible, but you have to try.\nMother’s milk and a balanced diet gives your child’s brain the nutrients and energy it needs to make connections. But what those connections are is determined by something else.\nThe next thing a parent can do is love.\nAnother way of thinking of love is protection. Your baby can’t move, so you have to protect it, and not just from physical harm. Emotional harm and stress is just as damaging to a child.\nIn the brain, you can think of stress as a chemical called cortisol. We need cortisol, but if levels get too high, it actually becomes physically toxic and damages the brain.\nWhen a parent is violent towards an infant it releases a lot of cortisol and damages not only their body but their brains. The same thing happens if a parent yells at their child, or if the child is in an environment where people are yelling at or hitting each other.\nYou create the only world your baby knows, and if that early world is stressful the child’s brain becomes wired around stress. That means that even as adults they can feel fundamentally threatened and unsafe, and unhappy. It’s not impossible to overcome, but it makes them harder for them to love others and love themselves.\nAt the same time, there is normal stress that a child needs to learn to deal with, and children do cry. Sometimes a lot. Parents often look at these as moments to discipline a child or change their behavior, but it’s actually a chance to change their brain.\nIt’s important to remember that a child’s brain is still very much under construction. They’re not manipulating you or being naughty, they’re simply not capable. So when your toddler is refusing to share, throwing a tantrum or ‘behaving badly’ it helps to remember that they are simply unable to manage their big emotions. A child should never be punished for the immaturity of their brain. You cannot ‘spoil’ a baby, but if you’re harsh with them you can actually damage their brain.\nSo if your baby is crying, understand that this is the only way for them to communicate their needs. Don’t be afraid to pick them up and soothe them as often as they need.\nIf you physically and emotionally comfort your child when they’re stressed, then their brain releases oxytocin, which calms them down. At first we have to do this for them, basically by hugging them, but in time their brain learns the loop and they’re able to comfort themselves. So cuddle them before you try to teach them anything, because that self-soothing loop is the best thing you can teach their brain.\nThat’s love. They get it from you, and then their brain learns to manufacture it for themselves and for others.\nThe final thing is play.\nSo you’ve fed your child’s brain, loved it and protected it from harm. It still needs to grow. That’s where play comes in.\nWhen you play with your kid they don’t just giggle and feel good in the moment - they learn how to feel good in the future. Their body releases dopamine and natural opioids and they both feel and learn joy. For now that joy is rolling around with you, but as they grow they can transfer that joy to school, to work, and to their own relationships and your grandchildren.\nJust like a comforting hug makes a loop between stress to relief, physical play makes a loop between the world and joy. As adults they can use this loop to enjoy their studies, their job, the arts, and other people. And playing is simply fun for everyone to do. It makes your brain healthier as well.\nSo, this Father’s Day, I hope you’ll remember these three basic things - eat, love, and play.\nScience still can’t tell us how to make a kid sleep, or make them eat vegetables, or cry less - but we do know that what a parent does is much more than those things. As parents, we are literally building brains. The science is solid on that, and it involves fathers as much as mothers.\nWhat we’re doing isn’t teaching our kids lessons, or disciplining them, or training them. What the human species does is use parents to finish wiring our children’s brains, a process that continues into our twenties.\nAs any father knows, at some point you’ll have to deal with teenagers, and getting them to do anything is impossible. However, if you invest in creating a healthy brain early, your kids have a much better chance of making healthy decisions on their own. Because you didn’t drop them on their head. Because you nurtured and developed their brains.\nOne more thing to remember, brain development doesn’t just happen at home. Children that go to a quality preschool from ages 3-5 develop the social and cognitive skills that help them through school and life. This is important for every child, but in Sri Lanka more than half of our children miss out. If you’d like that to change, visit\nand sign a petition to call on the government to ensure access for everyone. While you’re there you can also learn more about early child development and how you can be a better father, mother or caregiver.\nHappy Father’s Day.\n",
  "url": "https://www.yamu.lk/blog/fathers-day-science"
}