{
  "title": "Father's Day 2016",
  "abstract": "Father's Day is coming up — and if you're tearing your hair out wondering what to surprise him with, here's a few…",
  "author": "Aisha",
  "date_published": "3:48pm",
  "content": "Father's Day is coming up — and if you're tearing your hair out wondering what to surprise him with, here's a few ideas.\nis having an\non the 19th. There's a deal where you can get the pater a free dinner voucher and a glass of beverage (their words not mine) at the EAT restaurant. Call 011 203 0528 for more deets.\nhas an interesting deal — the discount offered for the Father's Day Brunch is personalized to fit your dad's age. Weird as it is, the older your dad, the larger the discount percentage.\nThis Battaramulla spot has a lovely al fresco ambience that they're going to complement with some live jazz and lots of Father's Day deals.\nThis high-end hotel has got a brunch and sing-along planned. If your family's musical and you want to bond over some unforgettable music, sign up for this.\noffers a four-course meal for Rs 2000. Call and reserve now!\nCoi's also got a pretty great deal if your dad is into meat and booze.\nThe Bakery, Pranzo, and Bavarian Garden here are rolling out a whole Father's Day weekend with a bunch of special offers.\nIf you want something Singaporean, this is where you gotta hit up.\nAlternately, you can break away from the regular lunch/ dinner gig and spend some quality time with him.\nThe Kingsbury has\nfor both parents, which includes two nights on a full-board basis, foot massages, all day happy hours and more.\nFor a more quiet and sophisticated evening, head over to the Hilton Colombo Residence for\nhosted by Trekurious. Treat your father to an evening which \"will be a treat for the taste buds and food for your mind as you alternate between a tasting of single malts and a comprehensive walk through of the intricate details that comprise the art of pairing whisky with food.\"\nIf your Dad would appreciate something that gives back to the community, you could\n.\nNone of the options we have at the moment are wallet-friendly, but given the occasion, it's worth splurging on, no?\nFrom signature cologne to cufflinks and classy pens, check out our post on\n",
  "url": "https://www.yamu.lk/blog/fathers-day-2016"
}