{
  "title": "FinTech Hack 2017",
  "abstract": "Kaffeine Labs' first hackathon, FinTech Hack 2017, happened a few weeks ago. Here's a recap at what went down and which…",
  "author": "",
  "date_published": "1:17pm",
  "content": "We’ve been involved with a lot of innovation initiatives lately and 2017 has been one of the best years for new startups. We’ve seen a lot of big companies dipping their toe in the innovation space with the most recent being the FinTech Hack by Kaffeine Labs. So naturally, we dropped in to see what was up.\nIf you’re unfamiliar with Kaffeine Labs, you’re probably not alone. That’s because it’s brand new. Kaffeine Labs is the innovation arm of Nations Trust Bank which was launched just a few weeks ago. While we’ve had companies like John Keells and Hemas in the startup space over the last couple of years with their own innovation programs,  this is a first for a Sri Lankan Bank.\nThe recently concluded FinTech Hackathon was Kaffeine Labs’ first initiative since launch and they wasted no time, getting in over 150 applications from teams made up of students from both local universities and private institutions. They then shortlisted the 16 teams they felt best addressed real world problems through their solutions.\nDuring the course of the 12 hour hackathon we came across a plethora of really innovative solutions ranging from payment platforms for the visually impaired, smart shopping assistants, inter-bank blockchain and peer to peer energy trading platforms to name a few.\nWhat was really refreshing to see was how invested the guys from Kaffeine Labs and Nations Trust Bank were, with senior members mentoring the teams throughout the duration of the hackathon. Having a short chat with Dinesh Thomas (Chief Innovation Officer) we managed to get a better understanding of what their goal with this initiative was.\nHe stressed on the importance of having continued support for startups, especially in the financial sector where regulations and lack of connections tend prove detrimental. Kaffeine Labs looks to provide ongoing support in the form of partnerships and investments, while helping them overcome regulatory boundaries through the connections and relationships they have established over the years. At the same time he also emphasized the importance of allowing the teams the freedom to grow by not taking away their intellectual property.\nAfter hacking through the night, the teams finally pitched their products, going over their problem statements, revenue models and implementation plans. After listening to each of the pitches, the panel of judges lead by Fayaz Hudah (Programme Head, ICTA) picked their top three products.\nTeam Phastem came in at third place with their IoT based cabinet system which looks to ease the luggage hassle that many tourists face when moving around the island during tours. The system allows travellers store their luggage in secure cabins along their tour areas which they can check on through the app and get delivered to their next location via courier.\nSecond place was awarded to Team Linear Six with their inter-bank blockchain platform that would help financial institutions understand their customers better by sharing information (with prior consent), thereby reducing risk, speeding up time consuming processes like new customer onboarding, loan assessments and even facilitating faster payments.\nFinally, Team Tech Devs took home the ultimate honour along with a cheque of Rs. 250,000 for their smart auction app, aptly named “BIDME”. While online auction sites and systems are nothing new in the consumer space, what's really clever about Tech Devs’ solution is that it provides banks a simple and seamless platform to auction overdue pawned items, while at the same time opening up bids to many potential buyers.\nIt’s great to see a bank stepping outside of their comfort zone and committing to the innovation space through Kaffeine Labs. The FinTech Hackathon showcased some great young talent and some truly innovative and implementable ideas, so we’re excited to see what they’ve got planned ahead.\n\n",
  "url": "https://www.yamu.lk/blog/fintech-hack-2017"
}