{
  "title": "Flood Relief 2017",
  "abstract": "Flood Relief 2017. Where and how to help, donate, and volunteer.",
  "author": "",
  "date_published": "2:28pm",
  "content": "The Southwest Monsoon happens every year. And every year there's flooding, displacement, and tragedy. Yet, it is private donors and NGOs scrambling to stem the flow of casualties and hunger and the\nproviding crucial manpower due to a\n.\nAs of this morning (31/05/2017), the death toll due to floods and landslides has reached a painful\nSome 163,000 families are affected. Thunderstorms are forecasted to continue over the next few coming days so the casualties may rise.\nThis year, these are some of the wonderful organisations that are pulling together for flood relief, and how you can help them. Please email us on info@yamu.lk if you have official updates to give or have additional information on rations, volunteers, and funds needed.\nIf you or your loved ones need to be rescued from the floods, SMS the address to 0722000666 to directly reach the “Disaster Management Center”(DMC) where rescue units could be deployed to the location.\nAccording to the map owner, \"Support, requests, and access routes during #FloodSL. Contact individuals directly through the phone numbers listed on the map. In case of emergency, contact the Disaster Management Center (DMC) by calling 117 or using the Pick Me phone app. Note: This map is crowdsourced and updated by volunteers. If there are any corrections, updates, or questions, please email ganindu@gmail.com.\"\n: The organisation has trained staff, volunteers, and an actual plan for disaster relief. You can donate to them online.\n: The local org takes donations both locally and internationally and is directly involved with providing rations, cooked meals and more on location. For more information, call 0114365114 or email dmu\n.org\nThe RTSL clubs are accepting international and local online donations to provide food rations and medical supplies in the first phase and then to focus on improving the living standards of the shelters. Finally, they aim to help the victims to rebuild the houses and their livelihood.\nlets you buy specific relief packs (including, food water, sanitary items) which are distributed to affected areas.\nis now accepting online donations via a GoFundMe account.\nThe\n(A-PAD SL) is collecting relief items in partnership with PickMe. PickMe will pick up relief from the location identified on the mobile app and drop it off at the A-PAD SL Head Office (24, Kassapa Road, Colombo 05).\nThis is a collection of charities, concerned private individuals and companies that have banded together to make donating and helping efficient. You can also check the\nfor updated information. Check the image above for collection points. There's also an urgent need for medicines.\n: The Voice for the Voiceless Foundation is looking for\n. Any help would be seriously appreciated as they're running low on supplies.\n: Apart from donations, they're also in urgent requirement of the following supplies.\n: The organisation is collecting rations from Colombo to distribute in affected areas. Please contact 0776479181 and check their\nfor more.\n:\nA collaborative effort between IVolunteer and a few media companies, this initiative is collecting a variety of rations and supplies, and has collection points around the city.\n\nThe International Movement for Community Development is collecting rations. If you prefer, you can donate money\ninstead.\nThe state-run Disaster Management Centre has\nthat they've sent to NGOs and foreign aid bodies. They also updated us with this info.\nWe've got a list of places that require volunteers both in an out of Colombo.\nThis organization has a team and volunteers set up to rescue any animals trapped. They also need people to help them (usually in terms of providing temporary foster homes etc).\nFrom start ups to text alerts and emergency calling,\ncovers it all. We highly recommend you read it for clear and useful info.\nOur information is gleaned from organisations that have contacted us, as well as what we've picked up from reliable sources on social media, so we apologise if we've missed anything crucial or made mistakes. Please email or comment below with updates and information. Thank you for helping!\n",
  "url": "https://www.yamu.lk/blog/flood-relief-2017"
}