{
  "title": "Flood Relief 2016 - How To Help",
  "abstract": "Help with flood relief by making your donations to the following charities. If you find more, do include them in…",
  "author": "Rishani",
  "date_published": "2:44pm",
  "content": "Flood Relief is ongoing but not especially coordinated. The best thing to do at this point is A) give cash to reputed organizations (we list some below) or B) coordinate with people on the ground for what they actually need (see the\n). To repeat, either\nWhile a lot of goods are coming in, distribution remains a problem. This means vehicles, but also boats for affected areas. Sarvodaya has mentioned a specific need for this.\nYou can help with flood relief by making your donations to the following charities. There are many needs and different collection points. If you find more, do include them in the comment section.\nThe simplest thing to do is to donate online via\nor\n. Both are reputable and have experience in this type of relief.\nYou can also donate online through\n,\nor\n. Otherwise please go through the list and find something close to you. Whatever you're doing, please coordinate with people on the ground (\n), but also be aware that they may not have time for that much coordination. If in doubt, give cash which can go towards what's actually needed.\nis a long-established and recommended organization. They are also one of the few places where people (including those abroad) can donate online. You can\n. Locally, they are partnering with Siyatha TV, Siyatha FM, Varnam TV, Varnam FM, Kiss FM and Real Radio to support the affected people. More than 20 Sarvodaya District Centres in affected districts are ready to accept donations of clothes, dry foods, water bottles etc. For more information contact them on 112 655 255.\nThe\nare urgently in need of the following items to be distributed among many temporary camps across Sri Lanka for people who have been affected by floods and landslides. They need rations (dhal, rice, canned fish, biscuits, sugar), cereals – baby food items, baby milk powder, cooking utensils, jerrycans,  clothes (only new clothes will be accepted), blankets & mats. Please box them and drop it off at the National Headquarters located in - 104, Dharmapala Mawatha, Colombo 07. Call 112 691 095 is working in the affected areas. To find out more about what work they are doing and where and the needs. To donate, go\n\nhas joined hands with Swarnavahini aid. You can send relief through their PickMe app by selecting 'Flood Aid' button on the app and you can choose 'Book Now' or ' Book Later' to place a donation and an agent from PickMe will contact you regarding the collection procedure. They also have a Flood Aid boat option on their app though we're not exactly sure how that works.\nPickMe together with the Defence Ministry, has started Air-lifting people in critical condition (Eg: pregnant women, children, sick or wounded and the elderly), from thee flood affected zones. In order to commence, they need the GPS coordinates of the people who are in need for evacuation. You can provide the coordinates by placing the 'i man' icon in the PickMe app on the exact location and pressing on the 'Air Lift' button. If you have friends, family or knows anyone in the above condition who needs immediate attention. Please provide us the required information so we can extract them to a safer area.\noutreach for the flood effort is straightforward. Collect and pack/bag dry rations or supplies (a full list of required items is\n), and swipe to \"UberCARE\" on the normal Uber app. An Uber car will arrive at your location to pick up the supplies and drop them off at the SL Red Cross Office - for free. Furthermore, 10% of all rides on Friday the 20th will go to the CMC's Flood Relief Operations.\n‘RED RELIEF’ will be assisting those affected by floods and landslides. You can\nrations\nFor more details,  contact 115 551 078.\nis partnering with Flood Relief ‪#‎LKA‬ to allow them to accept donations online for the flood victims. To donate online go\n. Flood Relief #LKA is an initiative by a collection of Sri Lankan Volunteering Organizations, Youth Clubs and Social Service Organizations. for more information contact  771 405 814, 715 651 502, 774 311 176, 772 517 512.\nhas opened a flood relief collection point. They are collecting rice and dhal, mineral water bottles, new undergarments, clothes, sanitary napkins. Drop them off at 252, Galle Road, Colombo 3.\nis collecting the following items: Rice, grains( dhal), soap, toothpaste, tooth-brushes, sanitary pads for women and babies, canned food, noodle packets, biscuit packets, water bottles, bed sheets, new clothes, Panadol, plasters and other first-aid items. To make your donation contact 767 833 389, 777 315 521, 771 511 984, 779 641 184. Make your donations before May 20.\nThe\nis collecting bottled water, usable clothes, prepared food or cash donations to help those affected in Baddegana and Grandpass. Drop off point at 80, Manning Place, Colombo 6. Contact 112 581 787. Office is open from 7:30 AM to 4:30 PM.\nis collecting water (bottled only), packeted dry rations, clean and usable clothes and towels. Drop off your donations at No 18, Elliot Place, Borella (next to the police quarters). You can fund them online,\n. Contact them on 779 264 667, 713 244 819.\nThe\nare helping victims affected by the flood. To find out how contact 114 061 461.\nis collecting funds to distribute meals to those who are displaced by the floods. They are also looking for donations of tire tubes (900*20). You can donate cash via EzCash by sending your donation to 769 105 555 to assist the flood victims or call  770 136 068, 772 333 287, 769 105 555,  772 381 981\nis collecting mats, usable and clean children's clothes, sanitary items, bed sheets for 60 people,  milk powder and sugar,  biscuits for children, pillows, new undergarments for both girls and boys. Contact 772 512 374 If you would like to donate financially, you can send in your gifts to: Account name: Voice Foundation, Ac No: 101000432815, Bank: NDB Battaramulla.\nis collecting dry rations, drinking water (bottles), and clothes. To connect with them, call 773 753 743\nis working with flood victims and has also opened a drop-off centre at  323, Havelock Road, Colombo - 06, (landmarks: Havelock City, next to Cargills Food City at the Lanka IOC filling station). Contact them on 713 344 466, 778 842 429.\nis collecting water, dhal, rice, milk powder, sugar, tea leaves, biscuits, dried fish, salmon, infant milk powder.  Drop off the items at St Francis de Sales, Daulugama, Verbum Showroom Ragama, St Thomas International School - Seeduwa, St. Sebastian's Church Wellaveediya, Negombo and St. Mary's Church Dehiwela. For more information contact 776 060 472.\nand\n- “Reach Out” is  affecting those affected in different areas. You can donate what you think is needed by calling them on the numbers provided. Drop off locations & contact details are University of Colombo, 716 649 788, 772 454 570, 777 143 342, No. 237 / 81, Polhengoda Road, Off Siebel Avenue, Colombo 05.\nD\nRice 10kg, sugar 1kg, tea 250g, dhal 1kg, sprats 500g, soya meat 250g, green gram 500g, samaposha 3 pkts, biscuits 3 pkts. The hygiene packs require toothpaste, Tooth brush (4), face soap, face towel (4), slippers (4), sanitary packs (2). You can either donate or volunteer to help pack and distribute relief packs.\nThe community at the Ark Church are collecting donations to feed 1,000 families displaced in the Orugodawatta area. You may contribute cash (preferred as it's practical to order from a place close by) or food packets. To fund them deposit your donations to Acc Name: Reformers Community Trust, Ac no: 8117013048, bank: Commercial Bank of Ceylon, Branch: Pita Kotte, Swift Code: CCEYLKLX. Contact 777 720 247 or 777 678 221 to connect.\nYou can also contact\nby keeping an eye on their event\nor calling them on 771 405 814\nare providing relief to 365 people displaced at Dangampala (due to landslides) and are collecting relief items to take across by 6 PM today (May 18). You can donate rice, dhal, table salt, onions, potatoes, biscuits and snacks (all packeted) and the most pressing need is baby food. Collection point: No 8A, Pepiliyana Road, Gangsaba Junction, Nugegoda,\nSirasa, Shakthi and John Keells Sahana Yathra have begun their collections. You can donate rice, dhal, sugar, tea leaves, instant noodles and biscuits Main collection center: No.330,T.B.Jaya Mawatha,Colombo 10 (open 24 hours).\nTo help flood affected areas Giovanni's is donating 10% of every pizza purchased to foundations working with the affected. If you wish to help out further for the next two days (May 19 & 20) Giovanni's is also collecting dry rations Contact 770 335 366, 767 438 911 for further details.\nis donating 15% of the total bill value to those affected by the floods. For more information on this contact 770 122 222.\nis collecting cash donations so that it is easier to purchase what is required. 100% of the funds will go towards helping flood victims. Account name: Round Table Sri Lanka, account number: 106110185847, NDB, Nawam Mw Branch (mention your name in the reference). For more information contact 765 500 600\nis collecting lunch packets.Food to be dropped off at the centre by 11 AM. Centres are located at People's Church 160/3, Kirimandala Mw, Colombo 5, 771 087 177 and 255, Parakrama Mawatha, Peliyagoda, 771 087 416.\nis raising funds for both immediate and long-term support for those affected by the recent flooding. Immediate aid is already reaching most people in terms of food, clothing, medicines, clean drinking water etc. You can also\n.\nIf you are in the affected areas and need specific help, you can fill this\nand help will be sent to you. Call on 775 927 639 or email\nif you have any questions.\nDrop off dry rations including milk powder, sugar, dhal, jam bottles, biscuit packets, salmon tins, clothes (in good condition), towels, sanitary Items – toothpaste, toothbrushes, soap, baby items - milk bottles, ladies and girls undergarments (new), bed sheets, pillows and medicine. You can drop them off at Orion City call 716 366 258, - 715 162 201, WTC 772 294 698, IFS - ​715 104 647.\nThese are the\nthat have been issued by the\n: 112 674 503, 113 075 792. Other numbers include, Army: 112 434 251, Navy: 112 445 368, Air Force: 112 343 970.\n\nIf we've missed any other charities or collection points, please let us know in the comments and we'll add it to the post. Stay safe!\n",
  "url": "https://www.yamu.lk/blog/flood-relief-how-to-help"
}