{
  "title": "Food Delivery In Colombo",
  "abstract": "Here's a list of our favourite Delivery services, for those times when it's too hot outside or you're just lazying at home…",
  "author": "",
  "date_published": "10:24am",
  "content": "We're grateful for how big delivery has gotten in Colombo over the years. There are a couple of sites that make it easier,\nand\nbeing at the top of the list, but here are our favourite places to order from on a lazy day. This list is especially handy during Colombo's terrible heatwaves when you just want to stay indoors and stick your head in the freezer every few minutes.\nLong gone are the days when the only pizza delivery option was\n. If you're hanging out with friends and feel like a light snack instead of a heavy rice and curry, here are a few options.\nDomenico's is one of our more frequent pizza delivery choices. We've reviewed them twice and liked their stuff on both occasions, and both times we had it delivered. They are reliable and fast, with the pizzas coming in nice and hot.\nHarpo's Pizza does some pretty great pizzas using high quality ingredients. They're not cheap, but the pizzas are authentic and  you get more bang for your buck than most other places. Delivery is free within Colombo and Rs. 150 to suburbs, which is pretty reasonable. They also have very helpful phone operators who will explain the different ingredients and what not.\nSantore uses high quality ingredients for their authentic Italian pizzas. These pizzas are a bit more expensive than the usual at about Rs. 1400-2300 but they're completely delicious and their delivery is free, so call them if you're in the mood to spend a little for a classy lunch or dinner at home.\nPaan Paan does great bread and healthy sandwiches, and they deliver (through Quickee). Their sandwiches are about Rs. 450-650, and they also do really good value\nwith everything from kiribath to sandwiches to eclairs for around Rs. 2,500. In our experience, they deliver the platters themselves. Otherwise delivery through Quickee comes with the usual Rs. 100 charge and is pretty prompt.\nSandwich Factory does great American comfort food. It doesn't taste as great delivered as it does in-house, but it's still pretty good. You can get burgers, submarines and shakes, usually for less than Rs. 800 per person. Their delivery service is pretty good though we think it's no longer done directly by them. You wouldn't notice, the food arrives in shape and on time.\nThis is for lunch, dinner or even party orders. There are thankfully plenty of delivery options in this department, from Japanese cuisine to Jaffna cuisine.\nWhen it comes to Japanese food delivery the choices are limited. None of our favourite spots deliver, but Naniyori honestly isn't bad at all. They have a more than respectable menu, with some real value for money bento boxes. The only issue is that delivery to Colombo tends to take around an hour or so.\nHazari's has been around since 2012 and is probably the most reliable choice for Middle Eastern cuisine delivery. They usually have a special every weekend that they will inform you about through an SMS (should you sign up). I'm not a fan of SMS alerts in general, but these guys don't spam you and it's actually nice to know what's on the menu. Alternatively\nalso does delivery.\nAchcharu Kade functions through\n, and they are a popular option for tasty rice and curry that's a little healthier because the ingredients are organic. Delivery is quite fast - our last order arrived just half an hour after their shop opened. For Rs. 380 we got an executive lunch packet of saffron rice that included creamy potato, brinjal moju, fried onion, kochchi sambal and chicken, and it all came together wonderfully with a burst of spices and flavour.\nFoodie Adventure is a home cook in Nawala that does take away and delivery. We tried a bunch of her stuff and pretty much all of it was amazing. Which isn't something we say often. What's great is that she uses unconventional ingredients like quinoa and covers a range of cuisines. You'll need to call about a day or two in advance to place your orders.\nYumi Cake is one of our favourite places in Colombo - they do quality desserts (amazing brownies, red velvet cakes and eclairs), but are now expanding into all kinds of other things, like maalu paan, salads, coffees and even Jaffna style crab. The delivery system isn't as instant as some others on the list though - you need to order at 7AM and you'll get it at 4PM. The crab curry which is superb is available only on weekends at the moment and you have to place your order at least 24 hours in advance (\nis an alternative for Jaffna food delivery). Their starting point is in Nawala so delivery charges depend on the meter taxi charges (Nawala to Rajagiriya cost Rs. 250).\nThe health food movement in Colombo has picked up over the last few years, and in a way we have Healthy Living to thank for it. They offer everything from salads to rice and curry and they manage to keep it healthy without compromising on the taste. One thing to note is that orders need to be placed early - before 10AM for lunch and before 5PM for dinner.\nWhen it comes to value for money, Malay restaurant is right up there with tasty Malay cuisine and large portions at very reasonable prices. They've been delivering for years now so they know what they're doing. We're fans of their babath curry and nasi minyak.\nThis is my personal favourite section of our delivery list. Growing up in Colombo and with a penchant for shameless sugar eating, I used to dream of a time when I didn't have to go all the way to restaurants for dessert - that the cake would be brought to me instead, and now this is actually possible. These are our favourite dessert deliveries of the lot.\nUp until the latter part of 2014 ice cream delivery was a mere fantasy. That is until Cremalato came along and made it a reality. They do high quality gelato in a number of variations. The delivery is fast, and they charge for delivery but their stuff is good enough to warrant it.\nCandy Cakes delivers through Quickee and they are my personal fix for sweet-toothy jars. They do a simple range of cakes and candies (gummies, sour strips) in jars if you're suddenly in the mood for comfort food - the jar of brownies, cream and strawberries is a classic combo that works well, and you can get a small size one for about Rs. 600. It does take a while to get to you though, usually 2-3 hours.\nBella is hands-down my favourite jar maker. We were delighted to find that she also does delivery now. We haven't tried the delivery system yet, but she's reliable when it comes to high quality, whether it's the mini-cupcakes, cookies or jars. I've had the brownie-cream-strawberry combo jars at several places and the ones here remain my favourite - the portion is large and the brownies and cream are of a much denser, richer quality, although it's also costlier at about Rs. 800+.\nAmbrosia won the prize last year for best chocolate ganache cupcakes ever. Both these and their strawberry cupcakes come with a unique center of warm, gooey filling - the strawberry cupcake had a jam center and the chocolate had a melted creamy ganache one. A six-pack of cupcakes costs Rs. 600 and it arrives in 2-3 hours. Delivery charges depend on typical meter taxi charges.\nSkrumptious is a well known for their brownie boxes and chocolatey puddings. I personally call and bug them all the time for a bowl of chocolate biscuit pudding, it's a large, utterly delicious bowl for about Rs. 800, reminds me of good old classic aunty-style CBP. Their peanut butter brownies are also amazing (got a box for a friend down in the dumps and it literally cured her for the day). They cost about Rs. 1000 for eight fat pieces, and they come beautifully packaged. Delivery takes about 1-2 hours, and just on weekends the delivery seems to only function around their headquarters in Thimbirigasyaya and Hyde Park.\n",
  "url": "https://www.yamu.lk/blog/delivery-round-up"
}