{
  "title": "FriMi",
  "abstract": "Frimi is a new mobile payments app from Nations Trust Bank. They were featured on HIVE Live last week and I finally signed up…",
  "author": "",
  "date_published": "4:08pm",
  "content": "Frimi is a new mobile payments app from Nations Trust Bank. They were featured on HIVE Live last week and I finally signed up to see what all the fuss is about.\nAccording to their FAQ, FriMi doesn’t just “make you the Jedi rockstar of all your financial decisions, it really does liberate your lifestyle”.\nHigh expectations, then. Who doesn’t want to be a Jedi rockstar of financial decisions?\nWhat really got me interested in Frimi was its NFC payment support and fingerprint authentication. Since we really can’t expect Apple Pay and Samsung Pay to appear on our collective doorsteps anytime soon - this sounded like a great alternative.\nSigning up was a bit more involved than usual. Apart from your usual details like phone numbers, you have to take a selfie and upload some form of identification.\nYou can select your NIC, Passport or the Driving License. The app seems to scan the NIC to detect its number (little bitta OCR?) and it’s very strict with this. Our colleague, Chandana, wasn’t allowed to sign up because his NIC number had a space before the letter ‘V’. He only managed to make it work after trying 5-6 times.\nSince my current address was different to the one mentioned in my NIC, I had to upload billing proof too.\nNote: When you’re presented with a screen to enter an ID and a PIN number, you have enter a unique ID because the app doesn’t make this very clear.\nAfter the signup process was complete, it was time for security. Apart from using your PIN number, you can use fingerprints to authenticate.\nIt also asked if I wanted to use voice recognition or facial recognition, which I opted not to use. I did test out the voice recognition - and it worked. But I don’t see anyone using this in real life.\nJust imagine how awkward it would be to say this out loud: “\n” Plus I’m not sure how secure this is.\nThe cool thing about signing up with Frimi is that you get a full blown NTB bank account with a debit card. (If you’re already an NTB customer, it will just connect with your existing account).\n\nYou can even use NTB’s online banking interface to access this account. I even tried using the debit card details to make a payment and it went through smoothly. Of course, it’s somewhat counterintuitive since you can do all that from the Frimi app itself. But for something like Uber or PickMe, this is killer.\nThere are many ways to top up your account. You can request money from a friend, deposit via NTB cash machines, use an agent (shops) - it’s pretty flexible. I went with the Other Banks option which gave me the details I should use to initiate a transfer.\nSince I’m already using Sampath Vishwa, I transferred a small amount of money through that. The transaction was instant thanks to CEFTS and I could see it on Frimi right away.\nWe also dropped by an NTB cash deposit machine to try it out. The deposit machine had a separate option for Frimi and after entering your phone number the Frimi ID, the rest of the process was pretty painless.\nSending money to your friends works like this: The app has a contact list to which you can add your friends. If the friends are signed up with Frimi, you can send them money just as you send a text. If they don’t, they’ll receive a text or an email asking them to sign up.\nIf your friend is physically with you and he wants to send you some cash, he can scan a QR generated by your app to send money without selecting contacts. We had a lot of fun with this!\n\nThe merchant network of Frimi is still growing. There are a number of places around our office that accept Frimi, but these mostly consist of phone shops and jewellers and the like. Not places that I’d usually go to. We finally managed to find a Laugfs supermarket in Thimbirigasyaya which accepted Frimi and I dragged Kaveen and went there to check out the process.\nWe didn’t see any Frimi signage so I let Kaveen ask the cashier about Frimi. The cashier was aware of Frimi to our delight. After our bill was calculated, the cashier used a separate POS terminal and asked for Kaveen’s phone number. After he entered the phone number, an alert popped up on Kaveen’s phone, which he accepted. Just like that the payment was complete!\nAlthough it worked out fine, this wasn’t really the experience I had in mind. I was expecting a NFC enabled POS device or at least a QR code to initiate the transaction. It didn’t help that the POS device spit out a receipt, which Kaveen had to sign. It wasn’t much different to making a payment with your debit or credit card, with the added hassle of exposing your phone number.\nSince they have NFC payment support on the app, I hope they’d support a more Apple Pay-like transaction method in the future. (If they already have something like this in use, do let us know!)\nThe main navigation for the app is this six dotted button on the home screen. It took me a while to actually realize this since I was looking for most of the options on the side bar.\nAlthough everything seems to work like they’re supposed to, transitions seemed to lag sometimes and almost every action brought up a dialog box that said something like ‘hold on almost done…’ or ‘Hey, I’m fetching info…’ or ‘Getting ready… hold on…’ - We didn’t like seeing dots everywhere and we didn’t like seeing these status messages for almost every action we took.\nIf you look at the screenshot of the error thrown at the ID process, you can clearly see that they haven’t paid enough attention to small details: ‘Hmmm.., I cannot find FriMi ID’ is not a useful error message.\nTake the ‘pay’ screen for example: it just feels like they haven’t put enough effort into it - especially considering that this is a feature that people would be using frequently. I got tired of using a swiping action to select the payment method (NFC, QR, Contact, Utility).\n\nThe icons could be confusing for a first-time user and you actually do have to swipe to each one to figure out what it is. You'd think just pressing the icon directly would initate the process, but nope. You have to scroll to the appropriate option and then touch it again to make something happen! And what is up with that large margin on the right side of the virtual card?\nThe app also seemed to keep the GPS connection active even after closing the app after using a map (and crashed when you killed location access)\nAlthough the user interface leaves much to be desired, Frimi is a very cool app. Signing up was a breeze and a lot of people at work signed up and had cash on their accounts within a very short period of time. Since signing up with Frimi creates an actual bank account, you have the freedom of using it as an ordinary bank account as well.\nA little bit of polish on the app and a more modern payment process at merchants would make Frimi a geat contender in the Sri Lankan mobile payments space.\n",
  "url": "https://www.yamu.lk/blog/frimi"
}