{
  "title": "Galle Literary Fest : Cheat Codes for Non-Readers",
  "abstract": "The Galle Literary Festival is finally back, but what if you're not really much of a reader and have no idea what's going on?…",
  "author": "",
  "date_published": "3:26pm",
  "content": "The Galle Literary Festival is finally back, and Colombo's literati and hipsterdom are awash in glee.\nBut what if you're not really much of a reader and have no idea what's going on? Here are a few tips to help you fit in.\nIf you're not actually a reader, that's fine for the remaining 51 weeks of the year. This is the week for your literary façade to come alive. We'd suggest dropping quotes from the following:\nShyam Selvadurai's Funny Boy\n\"If two people love each other, the rest is unimportant.\"\nAnuradha Roy's Sleeping on Jupiter\n“Don't you wish it could happen? Your mind wiped clean like a hard drive? Start again without memories?”\nAmitav Gosh's Glass Palace\n“To use the past to justify the present is bad enough—but it’s just as bad to use the present to justify the past.”\nLook physically nauseated at the appearance of chains like Barista or ODEL inside the Fort, making sure everyone knows you are a staunch anti-conglomerate advocate. Use words like sustainable, home-grown, and cultural appropriation liberally.\nPen names are for fan boys. Refer to Ashok Ferrey as Suresh, Pulitzer Winner Gregory Pardlo as Greg, etc. Then vaguely recount some time you were all wine tasting together in Provence. Melt away if anyone persists in asking for factual details.\nGalle is going to be ripe for the picking. The GLF means a mass influx of expats, tourists, diaspora, and socialites ready to mingle and put a drink. If you're looking for love, companionship, or someone to have tandem reading sessions with, this is probably an interesting way to go about it. We'd recommend putting \"books\" and a Rumi quote in your bio.\nAre you a proto-hipster or a Yacht Collection hipster? Decisions must be made. These decisions will affect your mobility, your comfort, the number of things you'll be allowed into, and your general cobblestoned street cred. Choose wisely.\nThe trick is to time your bar hops in between key events and talks. Mill around outside the venue as though waiting to enter, then quickly switch and bait and head for a tipple or a thundering nap. Better still, head to Unilever's Lounge at the Law Court Square and get yourself some delicious nibbles and Lipton tea cocktails. Turn up in an hour or two refreshed and with a furrowed brow as though thinking deeply upon everything you just heard. No one will suspect a thing.\nAt any given opportunity, explain to anyone near you that Jaipur was \"sooo much better last year, men\". Explain in detail why you can't attend this year (e.g: supporting the natives/ cousin's wedding/ been way too many times already). Also refer to number 3 (Refer To Authors By Their Real Name) and refer to Sir Salman Rushdie as \"Salz\". Discuss fatwas and the situation in the Middle East, effectively moving the conversation away from tricky book-related topics.\nThis is all obviously, a colossal joke. We hope you have a lovely time at the fest. If not, we'll see you in Jaipur!\n",
  "url": "https://www.yamu.lk/blog/galle-literary-fest-cheat-codes"
}