{
  "title": "Galle: How To Get There",
  "abstract": "How to get to Galle via vehicle, train, or flight.",
  "author": "operationtaprobane",
  "date_published": "12:52pm",
  "content": "Galle is the capital of the Southern Province, the 4th largest city on the island and one of the most popular tourist destinations we have to offer. Galle was the main port of the country when the Portuguese arrived in the 16th century, so the city saw its fair share of trade and culture from around the world. The Dutch then invaded in the 17th century and left us with the fortified city that it is known for today. A UNESCO world Heritage Site, the Galle Fort is the city's most iconic landmark, home to world-renowned hotels and quaint stores and eateries.\nToday, Galle remains the main gateway to the southern coastline, with easy accessibility on the Southern Expressway from Colombo to popular beach towns like Hikkaduwa, Unawatuna and beyond. Galle is considered an all-year-round destination, but the sea is at its best between November and April.\nThe easiest and most hassle-free way to travel. If you can get a vehicle of your own, take it. The Southern Expressway (E01) is the fastest way to get there by road, taking a mere 1 hour from Kottawa. The toll fare for light vehicles (cars, vans, jeeps) stands at Rs. 400. Access to Kottawa is easier from the suburbs like Battaramulla or Nugegoda, so getting there from the city could take some time depending on traffic. If you're coming from Dehiwala or Mount Lavinia, you could still aim for Kottawa but the next interchange at Kahatuduwa is about 5km closer when you compare the distances.\nThere's always the option of taking the original drive down the coast on Galle Road. Although this is a longer route at 3 hours, it's by far more scenic and lively. But if you're feeling really adventurous, there's another route – even longer, but the road less travelled if you will. From Ratnapura, head towards the southern hills. This means turning onto the A17 at Madampe and travelling through Rakwana, Deniyaya and Akuressa before ending up in Galle. The whole journey takes 4-5 hours depending on the weather, but the scenery makes up for it. The route borders the Sinharaja Rainforest and also gives you a taste of the hill country on your way to the beach.\nPlenty of buses ply between Colombo and Galle every day. There’s no real schedule, but Normal and Semi-Luxury buses travelling along Galle Road run frequently with a few still running after 9 PM. The fare for a Normal bus is Rs. 147 while a Semi-Luxury costs Rs. 246 and an A/C bus would set you back Rs. 295. Don’t expect a super-comfortable ride on any one of those though. The seats are hard and buses can get pretty crowded, especially the A/C ones because they’re smaller. The Semi-Luxury buses usually come with seat covers and curtains though, if that appeals to any of you. Catch the No. 02 bus direct to Galle or Matara or the No. 32 which runs further down to Tangalle or Kataragama. The latter is usually a Semi-Luxury Express with limited stops and is constantly trying to outrun an imaginary fighter jet. Seriously, southbound buses are the beasts along Galle Road. If you’ve fought them from your car, you’d know what I mean.\nExpressway buses are a little more disciplined. Plus, you can expect a comfortable ride considering every bus is large and fitted with nice seats and air conditioning. Starting from Maharagama and Kaduwela, buses run every 20 minutes between 6 AM and 8 PM and cost Rs. 420 one way. The same goes for buses starting from Galle.\nMaharagama and Kaduwela can also be reached by local buses from the city – the 138 heads to Maharagama from Pettah via Nugegoda while the 177 heads to Kaduwela from Colpetty via Battaramulla.\nIt's not standard practice, but I suppose you could take a tuk-tuk down the coastline. It’s an experience in itself, but a costly one at that too. Considering tuk-tuk’s aren’t permitted on the E01, expect to shell out Rs. 4000 – Rs. 5000 for a ride right down Galle Road.\nIn my opinion, taking the train down the coast is the best way to travel to Galle. It’s also probably the fastest if you’re coming from the centre of Colombo. Plenty of trains run back and forth every day, but check the schedule below before you plan your journey. Some trains are faster than others and only run on certain days. Taking a train back to the city from Galle may not be in everyone’s best interests though. Considering the last train leaves at 3:30 PM (4:50 PM on weekends), you can forget about having dinner on your last night in Galle. The expressway bus is a better option if that’s what you planned. Unreserved one way fares cost Rs. 180 on second class (recommended) and Rs. 100 on third class.\nThe Rajadhani Express also runs a luxury first-class service to Galle for Rs. 990 (one-way) every day except Thursday. The luxury carriage is attached to the 6:55 AM Galle-bound train and the 3:30 PM Colombo-bound train. The Rajadhani Express offers a snack and beverage menu, power points for charging and decent washrooms. They’re also able to arrange transport from the station to your hotel if you want.\nColombo Fort\nGalle\nTravel Time\nFrequency\n6:10 AM\n7:59 AM\n1hr 49mins\nSaturday, Sunday\n6:55 AM\n9:19 AM\n2hrs 24mins\nDaily\n8:35 AM\n11:49 AM\n3hrs 14mins\nDaily\n10:20 AM\n12:42 PM\n2hrs 22mins\nDaily\n2:25 PM\n4:31 PM\n2hrs 6mins\nDaily\n3:50 PM\n5:34 PM\n2hrs 44mins\nDaily\n4:45 PM\n6:37 PM\n1hr 52mins\nMonday-Friday\n5:15 PM\n7:06 PM\n1hr 53mins\nSunday\n5:25 PM\n8:03 PM\n2hrs 38mins\nMonday-Friday\n5:30 PM\n9:08 PM\n3hrs 38mins\nMonday-Friday\n5:55 PM\n9:26 PM\n3hrs 31mins\nSaturday, Sunday\n6:05 PM\n8:23 PM\n2hrs 18mins\nMonday-Friday\n7:30 PM\n10:55 PM\n3hrs 25mins\nDaily\nGalle\nColombo Fort\nTravel Time\nFrequency\n3:40 AM\n6:51 AM\n3hrs 11mins\nDaily\n4:15 AM\n7:36 AM\n3hrs 21mins\nSaturday, Sunday\n4:15 AM\n7:30 AM\n3hrs 15mins\nMonday-Friday\n5:00 AM\n7:55 AM\n2hrs 55mins\nMonday-Saturday\n5:50 AM\n8:10 AM\n2hrs 20mins\nMonday-Friday\n6:55 AM\n8:43 AM\n1hr 48mins\nDaily\n7:25 AM\n9:32 AM\n2hrs 7mins\nDaily\n7:45 AM\n9:40 AM\n1hr 55mins\nSaturday, Sunday\n9:00 AM\n1:03 PM\n4hrs 3mins\nMonday-Saturday\n10:30 AM\n12:57 PM\n2hrs 27mins\nDaily\n1:45 PM\n4:34 PM\n2hrs 49mins\nSunday\n2:45 PM\n5:14 PM\n2hrs 29mins\nDaily\n3:30 PM\n6:05 PM\n2hrs 35mins\nDaily\n4:50 PM\n6:40 PM\n1hr 50mins\nSaturday, Sunday\nGalle by air is one of the fastest but also the most expensive way to get there, costing USD 231 for a one-way flight on Cinnamon Air. But the bird’s-eye view of the southern coastline is unbeatable and you won’t get the same experience anywhere else. Note that flights don’t operate directly to Galle and instead to the Koggala Domestic Airport 15km away. Onward flights operate via Dickwella, so expect a 15 minute layover when you fly from Colombo. Return flights on the other hand go directly from Koggala to Katunayake. Depending on your budget, you can either get your hotel to arrange transport from Koggala Airport or catch a tuk-tuk. It should cost between Rs. 500 to Rs. 700 to get you to the Galle city center in 15-20 minutes.\nDepart Colombo (Katunayake)\nArrive Dickwella\nDepart Dickwella\nArrive Koggala\nTotal Travel Time\nFrequency\n6:20 AM\n7:00 AM\n7:15 AM\n7:25 AM\n1hr 5mins\nTuesday, Wednesday, Friday, Sunday\n10:05 AM\n10:45 AM\n11:05 AM\n11:15 AM\n1hr 10mins\nDaily\n2:10 PM\n2:50 PM\n3:10 PM\n3:20 PM\n1hr 10mins\nMonday, Thursday, Saturday\nDepart Koggala\nArrive Colombo (Katunayake)\nTotal Travel Time\nFrequency\n7:40 AM\n8:15 AM\n35mins\nTuesday, Wednesday, Friday, Sunday\n11:35 AM\n12:10 PM\n40mins\nDaily\n3:40 PM\n4:15 PM\n35mins\nMonday, Thursday, Saturday\n",
  "url": "https://www.yamu.lk/blog/galle-how-to-get-there"
}