{
  "title": "Game Of Tomes (YAMU's Top Second-Hand Bookshops)",
  "abstract": "In the Game Of Tomes, you sneeze or you die. If you're into dusty second-hand bookshops, here are Yamu's top spots…",
  "author": "",
  "date_published": "2:53pm",
  "content": "What is dark and full of terrors? Clearly Colombo's old bookshops. Aisha and I discovered this the hard way when I noticed a few roaches running about while we probed one staircase bookstore near Maradana. If you're Ned Stark scouring through family histories or Piggy running errands for Maester Aemon we've got the top second-hand bookshops to grab literature that's out of print (for cheap). Students can find out where to get their SAT & IELTS second hands here too.\nPS. To cater to the reader in you we've tossed in a few literary allusions to avoid the monotony of the Twilight Saga. (*SNAP* Oh no you didn't.)\nSenanayake Bookshop is my personal favourite. They're pretty reasonable, neat and have a fairly wide range of books. Senanayake, like the Starks, seem clean and have a bit of history going for them with the current owner taking up after his father. I managed to grab ancient editions of Ulysses, Cicero, Tacitus, and Pride and Prejudice for just Rs. 500. Yep. Hardcover too. The bookshop, though cluttered with piles of books has enough walking space and room to breathe unlike its Maradana kin.\nThose of you who are students, or know students in need of books should be able to rack up on SAT, IELTS and TOEFL copies for cheap. While the editions are old, they're sort of the same thing as the current edition, like congenital Targaryans. You won't need to do much looking 'cos most books are placed in their respective categories.\n- Old literature, SAT, IELTS, TOEFL, Nat Geo Magazines, Science journals, Ceylon Legislative books.\nDeen the Bookman is a legendary figure in the Colombo Good Market scene. He's got a vast array of  titles from run-of -the-mills and boons to obscure medical titles. He's been around for three decades and used to be a part of the Maradana book stretch. According to Rishani, he knows the tastes of frequent customers and will recommend books whenever you visit his treasure trove. If you're looking for a particular book he'll do his best to find it for you!\nI've included Bibliomania near Fort for the sole purpose of informing readers of its untimely death five years ago. Like Caesar torched the Library of Alexandria it appears the spread of digital media has torched Bibliomania's pages to a fine ash. All we found of Bibliomania was a street side money changer who told us of its untimely demise.\nIf you got the Harry Potter reference you and I will be good friends. This unnamed bookshop hidden under the staircase opposite Hotel de Buhari in Maradana is pretty old. The owner, one Mr Faiz I believe has been running the place for nearly three decades! He showed us his feature in a newspaper ages ago. He's got dusty collections of old books such as old BBC how to speak English guides for non-native Sri Lankan speakers and a few old calculus and mathematics books among other heaps of late 20th century pieces. If you're more daring you could visit his dark vault where I noticed the roaches. There appear to be old English books here trapped under plumes of cobwebs and roach eggs. How he's kept his place running for so long is a mystery to me. Yer' a wizard Mr Faiz!\n- Primarily old Sinhalese literature and comics among other late 20th century pieces.\nIf you're absolutely desperate for a book that's out of print they've probs got it down DR Wijewardene Mawatha. A heads up for first-timers — Maradana is Colombo's version of Flea Bottom from Game Of Thrones. You've got the grime of city life, tossed in nicely with chaos, traffic and may be even an Oliver Twist or two so watch your pockets!\nHours - 7:00 AM වගේ as we were told by the shopkeepers, to about 5-8 PM.\nPremadasa Bookshop is one of the untidier of the lot. The shopkeepers have essentially stacked layers of books upon books, which leaves you scanning a rather unflattering wall of mixed literature. You've got a few recent looking novels and a pile of old-looking science journals, among other pieces of Sinhalese literature. You could try your luck here, but in all honesty, you'd have better luck finding the answer to life. Which is 42. (If you're getting all my allusions we're probably long lost kin like Turin and Nienor).\n\nI quite liked Warnasuriya Book Depot. It was a far cry from the mess that was Premadasa. Everything is in order with poetry in one area, science journals in another and slightly more recent books laid out on display in the front. Find something you like? Bargain. I got a massive 1901 set of Byron and a sixty-year-old Winnie The Pooh (I collect old books ok! Don't judge.) for Rs. 2,000. Aisha managed to grab an old novel for Rs. 250. While Senanayake is more reasonable, these guys have a better range. He even showed us a few bits of old South African literature from the early 20th century, but I just didn't have the space for it. We saw a few bits of Lenin, Tolstoy, Sir Walter Scott tossed into the mix.\n- Both the old and the new, with a rather impressive range of both.\nColombo's literati seems to be a population in decay. If you're looking for the last of these Mohicans they're probably here. I saw an aunty catch up on some good books, while two young ladies probed the racks for new arrivals. Already burdened with a pile of books of our own we didn't get anything here, but if you're looking for Lenin, Marx or Mein Kampf among some technological guides for old Windows computers, you'll probably find it here. There's a load of new books as well for those of you who are looking for cheap fiction and fantasy.\n- Old books, Books on history, Tech guides from the year dot, recent fiction.\nLook at the wall in the picture above and you'll find that this was probably once named \"The Book Shop\". Genius.  It's now rather wisely named \"Communication and Lending Library\", but let's go with Book Shop for old times' sake. The racks here are crammed with piles of books. It was almost intimidating. We caught glimpses of ancient law and legislative journals (lawyers take notes. No, not those notes). In all honest there's probably a wide range of stuff to pique anybody's interest. We saw old magazines too. You get a nice 70s vibe. And I wasn't even born in the 70s.\n- Law, magazines and probably more. Excellent range.\nThis is another of one the unnamed bookshops. The shopkeeper here was a nice chap who had this huge ladder that went into a second floor full of more books. There's a good deal of classical literature here. Among a few how to learn Latin books sent to Ceylon in the 1930s was an ancient copy of Mary Queen Of Scots, Tolstoy and a History of the Roman Empire. There was an uncle scouring through a pile of history books who had a small discussion with us on history books and so on. This should give you just a glimpse of the book lovers who come here.\nWe certainly hope not. With digital media overwriting print it does not bode well to be the owner of a second-hand bookshop today as seen with Bibliomania. There's a lot of character to these final few outposts of Colombo's glory days, when civil servants probably stopped by to read something over the weekend. Fingers crossed that second-hand bookshops like these are as persistent as that annoying teenaged kid who's forcing you to read The Fault In Our Stars. Pfft.\nPS. If we've missed a place do drop a word in the comments below so we can check it out.\n",
  "url": "https://www.yamu.lk/blog/a-game-of-tomes-yamus-top-second-hand-bookshops"
}