{
  "title": "George Calombaris Is Coming To Colombo",
  "abstract": "If you want to meet George from Masterchef, he'll be in Colombo from June 9-11, hosted by Cinnamon Life.",
  "author": "indi",
  "date_published": "12:35pm",
  "content": "I cannot for the life of me spell George's last name, but I feel like I know him from watching years of Masterchef Australia. If you want to meet him, he'll be in Colombo from June 9-11, hosted by\n.\nWhy would you want to meet this person? If you don't watch Masterchef Australia then there's no reason really, but if you're a fan of Masterchef I probably had you at the title.\nGeorge, Gary, Matt and sometimes Marco aren't just hosts of a TV show, they are beloved across the southern hemisphere. TV is mostly about behaving badly, but this crew is the emotional center of a show that's about food and working together and improving as human beings - completely different from your usual TV.\nMatt and Marco have already been to Sri Lanka (the latter hosting a similar event with Cinnamon), so after George there's only one person left.\nGeorge is coming here because Cinnamon Life invited him, which is interesting because Cinnamon Life doesn't exist yet. If you go through Slave Island you can see the 4.5 million square foot development already coming up, but it won't be completed for a while.\nWhen it is, Cinnamon Life will be an integrated\nresort with more than Rs. 100 billion worth of investment going into a place where people, live, work, shop, dine and basically live. Hence the Life name I guess.\nGeorge Calombaris is the level of culinary and cultural personality they want to bring to Sri Lanka in the future, so they're billing this particular event as \"a taste of what’s to come\".\nBasically, you can buy tickets and go to the events, or you can bid for a more private lunch with him.\nFor details check out the\npage and to reserve any of the below call their hotline (+94 71 711 8111).\nAn authentic Greek five-course dinner curated and prepared by George himself. There are also two bonus rounds: pre-dinner cocktails and a post-dinner single malt session added on.\n\nFor cooks, or just the curious, George will conduct a Masterclass. So you can see him in action, and hopefully learn something.\n\nIf you want a more private and personal lunch with George (and Mahela Jayawardena, if you've heard of him), you'll have to bid on it. The top five bidders get two tickets each (so you plus a plus-one), and all proceeds go towards the '\n' project.\n.\nShare a cup of tea and obviously a blistering array of bites with George.\n\nIf you love George and Masterchef, this is a great chance to see him in person. It's also a chance to see the future of Colombo that Cinnamon Life hopes to bring to, well, life. Just a taste.\n",
  "url": "https://www.yamu.lk/blog/george-calombaris-is-coming-to-colombo"
}