{
  "title": "Gift Advice for the Christmas Grinch - 2016",
  "abstract": "Bah, humbug.",
  "author": "Aisha",
  "date_published": "4:44pm",
  "content": "If you're anti-Christmas because the festival is commercialized, but you still want to make people happy because you're a nice person deep inside (\n), we've prepped this handy little guide to overcome this conundrum.\nBest thing for the parents? Food. Well, that's the best thing for anyone really, but there are all these super\n.\nIf not, you can order stock up your wine cellar. Ordering online is easy-peasy, will make your father happy, and is hassle-free via\nor ZipSip. Alternatively, get some classy and authentic pashmina directly\nYou can also display concern about the state of your home and impress your mother with some cutesy and practical homeware from\n. From towels to salt-and-pepper shakers and mason jars, it's got everything you need to make your kitchen and home unique.\nYour friends are important and it's important to keep them happy. They're basically the only people you can count on to remember your birthday (with the exception of your parents, but that doesn't count). For a personalized touch, get them something custom made.\nLove them or hate them, you're stuck with them. Best thing you can get them is a book. No really, if they're bibliophiles they'll love it, and if they aren't, well, encourage them to read. Or get something on a subject that they'd be interested in. Or just get a book of bad puns... that works too. We recommend\n.\nOkay, some of them are not really pesky, but that's what they're called in Scooby-doo.\nAnything from the\nbe it waterguns, DIY craft projects, or knick-knacks to prank people.\nIf there's anyone else you want to get things for and are overflowing with Christmassy spirit and want to help home businesses out, simply get handmade jewellry, home decor, skin care products or anything else,\nOr else, check out\nfor charities and other initiatives.\nMerry Christmas, ya' Grinch!\n",
  "url": "https://www.yamu.lk/blog/gift-advice-for-the-christmas-grinch-2016"
}