{
  "title": "Gift Ideas For Men",
  "abstract": "There's no reason your fathers/ brothers/ boyfriends/ friends shouldn't be spoilt silly this season",
  "author": "",
  "date_published": "1:10pm",
  "content": "So we've already covered some cutesy\nin your life. There's really no reason your fathers/ brothers/ boyfriends/ friends shouldn't be spoilt silly this season either. Here are some suggestions, and where you can buy them. Happy gifting!\nDudes like gadgets, and dudes have facial hair. These are the two things we can be sure of about men in general, and this present is a perfect mix of the two. You can pick up a sleek little whirring electronic razor at\n. They've got variety, cash on delivery, and a bunch of discounts. As an add-on gift, you can promise your giftee to never use their razor to shave your legs.\nEveryone should have a book they hold dear, that defines who they are. If the man in your life doesn't already, help him find it. We recommend Chinaman by Shehan Karunatilaka for the cricket lover, or honestly any of\nfor the man who likes his books relatable. For guys with a spirit of adventure and a roughshod Americana vibe, Catch 22, Into the Wild or On the Road would work a treat. Or else, just track down the memoir/ biography of his favourite public persona. We don't recommend Trump's How To Get Rich. Try any of Colombo's book stores or the\n\nOne solid, quality cologne or aftershave is a must, even for the man who isn't really into grooming. Axe is for pre-pubescent boys and killing bugs when you can't find Mortein, or right after the gym. It's pretty easy to guage what sort of cologne would suit someone if you know them well, but perhaps sticking to the classics is a safe bet.\nand the\nboth have extensive collections. Have a sniff of Chanel's Pour Monsieur, Davidoff's Cool Water, Issey Miyake's L'eu d'Issey, or Dior's Eau Sauvage.\nApart from watches (which are a little bit out of the price league of this list), cufflinks are one of the few baubles men traditionally favour. It adds the right amount of oomph to a nice suit with some understated bling. You can try monogrammed cufflinks, or else pre-made dark stones, silver, or branded ones. We'd recommend one of the nice upmarket jewellers like Chatham or Colombo Jewellery Stores, or ODEL for variety. Hameedia and Emerald do some less-expensive options too.\nThis might be the easiest option on the list. It's pretty easy to find out what Scotch your hirsute hero prefers, and generally pretty easy to source it (even in Sri Lanka). If you're not sure, you can't go wrong with a nice Glenfiddich, Talisker, or even Johnnie Walker if you're feeling uninspired. We'd recommend\nor\n.\nOkay this one is a little pricey, but it's a long-term investment. Make an appointment at a good tailor like\nand take him there to choose patterns, cloth, and get measured. It's a fun outing in itself.\nSo Colombo's only real golfcourse is the\nat Rajagiriya since the Water's Edge one closed down. The waiting list for membership is long and tedious (you need to be referred/ recommended by a club member), but it's a beautiful property and totally worth it. You're essentially gifting your special Y-chromosome bearer a lifetime of weekends hob nobbing and relaxing with other uncles or uncle aspirants.\nTrue, glassware isn't a traditional choice for a man, but a two-piece set of crystal scotch glasses or Glencairns are a classic gifting idea. It's a gift that lasts, unless you've got kids, dogs, or a particularly clumsy recipient. You can try\nor\n.\nThis one is a bit of a challenge. We spotted one at\nfor about Rs. 35,000, but you can also try\nor the Sunday newspapers for second hand sellers. This is perfect for that dad, uncle, or grandpa reliving the glory days, or the anachronistic husband or friend. It's a gift that keeps giving, as your recipient can spend some lovely thriftstore and antique record store time while abroad, stocking up on their collection.\nMost men I know carry a pen around with them, even in the age of type and text. It's a classy addition to a shirt pocket, and a useful instrument for signing cheques and autographs, and drawing doodles at boring meetings. Invest in a nice collector's item, and get it engraved if you're particularly sentimental. We'd recommend\nor\n",
  "url": "https://www.yamu.lk/blog/gift-ideas-for-men"
}