{
  "title": "Gift Ideas For Women (In Colombo)",
  "abstract": "Here's our comprehensive guide to gift-buying for girls, whether it's your book-reading girlfriend, bauble-loving wife,…",
  "author": "",
  "date_published": "12:24pm",
  "content": "Who hasn't suffered a moment of blind panic while tearing around trying to find a last-minute gift? We're here to ease your pain. Here's our comprehensive guide to gift-buying for girls, whether it's your book-reading girlfriend, bauble-loving wife, or food-crazy significant other.\n\nGifting a full-on session of pampering is sure to win you some serious brownie points.\nIn our book, a mani-pedi makes for an excellent gift, and Nail Anatomy is one of the most pleasant places in town to have one. The nail technicians are skilled and pay careful to detail; there is a huge range of OPI nail lacquers to choose from, and even cutesy nail art if the girl you're gifting is into that sort of thing. Manicures cost upwards of Rs 1,000, while pedicures are from Rs 2,500 onwards.\nAn indie equivalent of the Body Shop, Spa Ceylon has become the byword for high-quality body products and spa rituals infused with Ayurveda goodness. We can think of few nicer things to gift than a full-fledged indulgence at one of the brand's spa boutiques sprinkled across the city. Foot rituals cost upwards of Rs 3,000, while body rituals cost Rs 7,000 onwards.\nWe challenge you to find one girl who wouldn't enjoy a five-star spa experience. With an array of facial and full-body treatments offered in plush, air-conditioned comfort, Six Senses at the Kingsbury is an excellent option for when you're looking to accrue some serious brownie points. Massages start from Rs 8,300, while facials cost Rs 9,200 upwards.\nClothes are an idiot-proof option when you're looking for a gift. Here are the places in town that specialise in fancy duds, to accommodate a variety of tastes and price points.\nOdel has come a long way since it started off as Sri Lanka's first homegrown departmental store in the late nineties and early noughts. Although it is no longer quite as affordable as earlier, it is still unbeatable in terms of versatility. From basic tees and work-appropriate dresses to denims and beachwear, you are bound to find great gift ideas among its crowded aisles. Prices vary widely, with basics starting at Rs 900.\nThere are few brands in Colombo that offer a more sophisticated take on linen clothing than Dilly & Carlo. Although decidedly upmarket, with most items of clothing costing upwards of Rs 3,000, the store's sharp linen line is as perfect for work as for Sunday brunch. We especially love their batik collection, which offers a sophisticated spin on a timeless craft.\nKelly Felder is a natural choice for those who follow fashion trends fiendishly. The soundtrack keeps pace with the fast fashion at this hip store. Our money is on their high-waisted denims and printed jeggings, jersey maxi dresses and the killer heels from their line of accessories. Everything is stylish and on-point, and for the most part, costs under Rs 5,000.\nA popular destination for several years, Cotton Collection offers an eclectic but usually interesting selection of apparel, including Indian-inspired skirts and kurtas, well-cut pants and basic tees and a vast range of boho beachwear. They also stock a range of bright and blingy jewellery and a limited range of Arugam Bay accessories. You are sure to find a sizeable selection for under Rs 5,000.\nWith six floors dedicated to export surplus clothing and accessories, House of Fashions is a bargain hunter's paradise. Choose from a dizzying selection of clothing from high-street brands such as Pull & Bear, Vero Moda and Zara; wallets and bags in bold colours, shoes, fitness wear and a lot more to satiate even the most dogged shopper.\n\nA little bling never hurt any girl ever. Take your pick, from antique designs that have an ageless appeal to more contemporary designs for everyday wear.\nGlitteray is a new kind of addition to the jewellery world — an online jewellery store. That brings up the question of trust, but we can vouch for them (we've tried the service). They have rings, pendants, earrings and bangles, including some stuff for men. Of special interest are their localised pieces like the trishaw pendant or personalised pieces like name pendants and bracelets. Most items cost less than Rs 8,000.\nRidhi is a reliable bet for affordable silver jewellery. They have bangles, earrings, pendants, chains and more, none of which will break the bank, but all of which look pretty tasteful. They have a range of baubles for less than Rs 5,000 but a lot of the pieces cost more. This is a good place to get traditional designs like delicate bangles and Kandyan-style necklaces.\nYou have to dig around this antique shop, but there are some quirky gems that are a 100 years old. Pieces can go into the lakhs here, but there are also rings and necklaces that can be bought for less than Rs 10,000. This is not the place for bling, as none of the pieces are especially shiny. But if your beloved is into jewellery with history and character, this is the place.\nSay it simply with a big bunch of flowers.\nShirohana is one of our go-to flower shops, mainly because they have branches everywhere, such as Alfred House Gardens, Flower Road, Dickman's Road, Borella etc. Often, when you set out to buy flowers, it's in a panic and time is of the essence, so it's good to have a shop nearby. They do large arrangements that can push Rs 3,000 upwards, but if you tell them how much you want to spend, they'll make you a bundle for your budget.\nThe rows of shops on Dean's Road near the eye hospital sell fresh flowers for quite cheap. The only issue is that these places are generally used for funeral flowers, but they are still flowers. If your beloved is understanding and would appreciate your thrifty cunning, you can get a solid bunch here for Rs 1,000 or less.\nMake a ceremony of afternoon tea by gifting a dainty tea set, or a coffee mug for work. What's not to love?\nWith whole sections dedicated to crockery made of different materials, Paradise Road is a treasure trove for ceramic bounty hunters. The hand-painted plates, bowls and mugs in abstract patterns are perfect for gifting, as are the “crushed” cups that look an awful lot like crumpled paper cups. Hand-painted plates cost Rs 950 each, while the crushed cups are priced at Rs 1,680 for a set of four.\nSynonymous with timeless porcelain produced in Sri Lanka, Noritake is a fail-proof gifting option. The vintage prints and classic designs may cost a pretty penny, but they make for the sort of gift that keeps on giving. The 20-piece tea sets that cost in the range of Rs 20-40,000 are an aesthete's dream. The dinner sets are a lot steeper, but they are definitely worth the splurge.\nThis ceramic store supplies to Jamie Oliver's range of cookware, so listen up and pay attention. Lovers of vintage cookware pastel shades would find plenty to pique their curiosity at this store on High Level Road. The store looks deceptively simple from the outside, but on the inside, you'll find an extensive range of mugs, cake stands, bowls and ceramic jars, all pretty as a picture and not eye-wateringly expensive.\nBook-lovers make easy work of the tedious task of choosing the right gift. All you need to do is amble into a bookstore — and the rest takes care of itself.\n\nIf the giftee is a comic book or graphic novel fan, the Vijitha Yapa outpost at Crescat is the place to go. Of course you'll be spending at least Rs 2,000 on your purchases, but the comics are pretty good value. There is a small selection, but it's all imported, sealed and the range keeps changing. If you have a particular comic book in mind, call ahead to check if they have it in stock.\nMD Gunasena (like Barefoot) is a great place to check out if you're looking to buy a coffee table book as a present. I found a rare digest here called Monsters In Movies: 100 Years Of Cinematic Nightmares, featuring zombies and ghouls throughout the ages of Hollywood — a rare and thoroughly entertaining find.\nIf your giftee is into fantasy (think LOTR or Harry Patter) or mainstream autobiographies and bestsellers (of the 50 Shades variety), Chapters has a sizeable selection. They've also got a great range of illustrated books for kids, if like me, your special someone is easily amused by picture books.\nThe main Vijitha Yapa bookstore at Unity Plaza has a comprehensive collection of literature classics ranging from Dickens to Elliot. You can find them in front of the cashier's counter.\nSarasavi Bookshop is a safe bet for general novel shopping. You'll find plenty of Sidney Sheldons and Judy Blooms, but every now and then, you might also find something offbeat like our copy of He's Back, the bestselling German satire on Hitler by Eichborn Verlag.\nThe Maradana bookshop stretch down DR Wijewardena Mawatha is the best source of very old, second-hand books. For die-hard bookworms, the charm of a cloth-bound book or one with an inscription in front with a story of its own, is a priceless gift in itself. You're bound to find some interesting gems during your search, and it's an added bonus that you're not going to have to spend too much on this gift.\n\nLet's face it — fancy nosh is a sure-shot winner.\n\nRare is arguably one of the hottest additions to Colombo's restaurant scene. Their food is excellent with some unique local influences. Uga Residence (formerly The Park Street Hotel) is a beautiful old house converted to a boutique hotel, at walking distance from Park Street Mews. The reason it's on this list is because Rare makes for one of the most memorable dining experiences in Colombo, ideal for a special occasion.\nClique's Supper Club is one of the best restaurants in Colombo, full stop. Overall the prices are high but we think it's fair — the service is amazing and the food is really, really good. Quite possibly the best steak in the city, among other things. It's is what we'd call a complete dining experience. Everything is thought out — from the moment you get in the door to the menu to what you eat, right down to how the evening ends.\nHavelock Place Bungalow is a beautiful, intimate place to dine. They have a changing and creative menu, some delicious ice creams, but more than anything it's the verdant garden that keeps you coming back. That plus the dim lighting makes it a place where you can be out but still disappear, perfect for date night.\n",
  "url": "https://www.yamu.lk/blog/gift-ideas-for-girls-in-colombo"
}