{
  "title": "Gift Advice For The Christmas Grinch",
  "abstract": "Whether or not you're in the holiday mood, giving gifts at Christmas is kind of a must. Here's a list of gifts to…",
  "author": "Imaad",
  "date_published": "1:13pm",
  "content": "Not everyone gets all happy and ecstatic when Christmas arrives, and that's okay. We decided we'd help the Christmas grinch in all of us by putting together a list of gifts we'd all feel like giving. Let us know in the comments if we've missed anything!\nYou can't not be nice to your relatives, even if you don't remember their likes and dislikes.\nGift vouchers from\nfor aunties. They've got everything from manicures and pedicures to full body massages.\nBooze for uncles. There's an online store:\n. For the teetotaler, some tea from Ceylon Tea Moments.\nKids these days are getting more sophisticated, and, by the age of four, could unlock your iPad and finish up your data package. To combat this, we think it's best to gift them with stuff that'll distract them from YouTube and Angry Birds (or whatever they're on these days). We recommend a slingshot.\nAt Rs. 1000, this gift won't dent your wallet, and it offers endless hours of fun for the receiver (of the gift, not the shot). Grab one\n.\nIf you don't mind dishing out, you could an RC helicopter for Rs. 12,000\n.\nPart of the spirit of Christmas is to be kind and treat people well, so you'll have to get something for that friend you don't really like, but hang out with anyway. We think a Tamagotchi would be ideal, but for lack of availability, look out for gift vouchers.\nusually has gift certificates that you can buy from their stores.\nThere's nothing that gets you in the holiday spirit like getting lucky, so, to help the cause, here's our recommendation.\nBags from\nare both good-looking and high quality, plus they work for boys and girls. Get them something funky that they won't find anywhere else.\nTake your foodie friends out and binge on some good food.\nWe've put together lists of\n, and\n.\nNot every hipster is self-aware, so, take this opportunity to let them know.\nIf you don't want to break bank, get\nfor under Rs. 2000. If they're really a darling, bust Rs. 20,000 on\nor\n, depending on their face-cut.\nThese\nwould work, too, though mostly for women.\nAs Colombo Hipsters age, they come to need quirky things for their homes.\nWe'd recommend checking out the homeware and trinkets at\n.\nYou can't go wrong with sarongs.\nGet them anything from\n, really.\nThe\nnever disappoints when it comes to sating the appetites of the New Age folk of Colombo.\nFrom vegan food to dreamcatchers, you'd be hard-pressed not to find something that would speak to their soul.\nGet a cake. Apart from established bakeries, there's plenty\nto try out.\nAlso, we've got\nwhich work out really well, too.\nIf none of these options have you inspired, we recommend you treat yourself first, and then see how you feel about it.\nIf you're on the Light Side, get\n.\nIf you're on the Dark Side, there's always\n.\n\n\nNot into Star Wars? That's okay. Get a cat.\n",
  "url": "https://www.yamu.lk/blog/christmas-gifts"
}