{
  "title": "GLF Shortlisted: Theena Kumaragurunathan",
  "abstract": "Theena K. talks about the self publishing process, the importance of great visuals, and his book First Utterance.",
  "author": "Aisha",
  "date_published": "2:08pm",
  "content": "Author of First Utterance, the first book in The Miragian Cycles trilogy, Theena Kumaragurunathan is a multifaceted creative who is brilliant at photography, writing, and now videography as well. Having previously worked in advertising agencies, he put his language and creative wordsmith skills to good use but found the industry rather stifling: so he moved out and founded a creative agency with several other friends while publishing the first of his trilogy and simultaneously working on the second book.\nHow many drafts does it take before an author decides his manuscript is ready to be combed through by a fresh pair of eyes? For Theena, it took six months of editing and three drafts before he submitted his version of the final document to a couple of publishers and the Gratien awards (only to be turned down by all of them), before he decided that he needed a fresh pair of eyes and some strict feedback before attempting to publish once more. The rejection by the publishing houses and the awards was expected, given that local publishers aren't used to novellas of his genre — which was a combination of verse, short stories, and script as opposed to a regular novel sticking by a constant theme and style of writing throughout.\nThe people Theena approached next were contacts he claimed are extremely hard to please before commissioning\n(Shortlisted for the Gratien Awards 2001-2003) for the final edit.\nWe asked Theena how he got around to publicizing his book and getting the hype it's already gotten — barely a year old, self-published, doesn't have an agent, but is already\n, shortlisted for the Fairway Galle Literary Festival and so on. What was it that got his book this popularity when it's pretty hard for emerging authors to get noticed?\n\"Visuals, media contacts, and having a strong online presence. Most people put so much effort into the book that they neglect the visual aspect, and you have to remember that the cover and feel of it is what will make it stand out among other books when it's on a shelf. I recruited Madhri Samaranayake for the artwork and she took about 2 1/2 years perfecting it — and I'm completely satisfied with how it turned out in the end. Then I met a few guys at JWT with whom I could complete the work: the text layout, art direction and everything else into a harmonious fit. The final step was finding a good printer. We got in touch with the Aitken Spence printers and they did a fantastic job, even down to having the 1000 copies ready two whole weeks before the launch,\" he enthused, while also emphasising on how much more effort needs to be put into the paper quality, typography, and design of locally published books.\n\"I don't like the beaten path — it's boring,\" he said bluntly. \"The only books I find originally written and depicting Sri Lanka (by Sri Lankan authors) are Anil's Ghost and Chinaman. I made a conscious decision not to let any Sri Lankan influences come through.\"\nTheena's is one of the very few local books that hasn't capitulated to popularity based on war or tsunami stories. The Miragian Cycle's plot line is fantastical, set in a universe that's alien yet strangely familiar at the same time: mostly because of the references or names that ring bells in your head, but you can't quite put your finger on. Turns out that this bit of mind play is thanks to Theena using anagrams of familiar places to come up with more uncommon names.\nThe Galle Literary Festival is what's in the immediate future, along with his plans to release the second book next year. The purpose of the first book was to show the cycle (detailed in the story) in as compressed a way as possible, while introducing his readers to Mirage, the nation the story is set in. Book two, he revealed, focuses on the\nof the cycle and more on the sociopolitical and geopolitical issues within that time period.\nYou can follow the\n, and also drop into the Galle Lit Fest to meet\n",
  "url": "https://www.yamu.lk/blog/glf-shortlisted-theena-kumaragurunathan"
}