{
  "title": "Global Entrepreneurship Summit 2017",
  "abstract": "Lessons for entrepreneurs from the Global Entrepreneurship Summit 2017 in India",
  "author": "Laura",
  "date_published": "12:20pm",
  "content": "More than 1,500 investors and entrepreneurs from across the world attended the Global Entrepreneurship Summit (GES) from the 28th to the 30th of November, in Hyderabad, India.\nThis was the 8th such summit to be held. This year’s GES highlighted the theme ‘Women First, Prosperity for All’, and focused on supporting women entrepreneurs and fostering economic growth globally.\nThe event made some headlines for both the right and wrong reasons. One great reason was that this is one of the largest gatherings of investors, entrepreneurs and policy makers. And one wrong reason was the fact that Ivanka Trump headlined the United States delegation; which was hotly debated.\n“When investing, you should invest in the jokey and not the horse.” (Ray Washburne, heavy hitting investor and entrepreneur) Why? When running business things will go wrong, it’s never smooth sailing. Thus, the ability for the founder(s) to adapt to new situations and deliver is paramount.\nIt’s a long game. There are no short run profits in start-ups. The entrepreneurship journey is fraught with risk and will take some time.\nOne of the themes discussed during the summit was women empowerment.  Why? Since it makes economical sense. Having women participate in the world force will drive up the economy; this means a bigger market to sell products to, and a bigger market to prosper. Also, at leadership positions, women will bring different experiences, and viewpoints. Again, more profits. So let’s get more women involved and build amazing companies.\nIt’s a very long slog. So if you are not up for it, stay away or get prepared for it. Running a start-up is not a T-20, it’s more of a test match or a marathon. You have to keep operating it for a long time to see great results and build great companies. This is more evident in South Asian countries where the fundamentals that are needed to grow a start-up at a rapid rate are not really there (digital economy, legal frameworks, captive audience). All the success stories have had a long slog. But on the positive side it pays off big time!\nNetwork matters; help people out and get help. We stand on the shoulders of others. This is never going to be a one-woman/man game. It’s a collective game. All the super successful people I had the chance to hear or speak to, have had a great mentorship network helping them out, and due to that culture they help others out.\nIt’s a big market. Don’t worry about it since, well, it’s not going to go away. All too often we Sri Lankans worry about India and Indians coming to get us. This mentality must change. We should see India as the biggest market just next to us. We should gear to sell product (tech and otherwise to them), we should harness on their human capital (Indians love Sri Lanka) and build great companies.\n",
  "url": "https://www.yamu.lk/blog/lessons-for-entrepreneurs-from-the-global-entrepreneurship-summit-2018-in-india"
}