{
  "title": "Go \"out-of-the-box\" with FashionMarket.lk's End of Season Fashion Sale",
  "abstract": "FashionMarket.lk’s End of Season Sale is a great opportunity for you to refresh your wardrobe with the benefits…",
  "author": "Staff",
  "date_published": "12:06pm",
  "content": "FashionMarket.lk’s End of Season Sale is your chance to grab designer wear clothing at unimaginable prices with UPTO 50% OFF on several styles plus UPTO 25% OFF if you spend over Rs. 3000 on www.fashionmarket.lk!\nThe\nis one of the pieces that we were most impressed with. The material is smooth and comfy enough that you can wear it with a tank top with the sleeves rolled up even on a mildly hot day. It is crafted from a navy and yellow linen, with a sporty ribbed trims finish. It is a great addition to your wardrobe if you’re looking to sport some next level street looks.\nIf you're ready to get some heads turning, this\nis ideal. You can take a bold step out of the conventional office attire and wear this piece with confidence. This one’s a great day piece that can be instantly transformed into a look for the night with the right kind of accessories.\nThis\nis a lightweight poly-cotton jumpsuit with some cool design detail making it comfortable as well as trendy, giving you the perfect look for a girls’ night out.\nIf you're the adventurous type and want to make a lasting fashion statement, we suggest this\n. The printed skulls would be an unmistakable signature on a first date.\nYou might also want to check out the\nwith Belt which is so versatile. Wear it with heels for a casual event or party and switch to sneakers for an outdoorsy look. Laid back glam at its best!\nPut on some sneaker or sliders with this\nmade from printed cotton. The printed fish and the oversized cut makes up for the perfect outfit to wear on your relaxing holiday weekend or even for a brunch around the city.\nThis\nis a holiday essential and should be on your holiday shopping list, especially if you're planning to go for a dip in the pool or for some fun at the beach. We bet you’re planning your long weekend already!\nSarees are something we wear on many occasions and to take something traditional and conventional and throw it a stylish throw is not an easy task. FashionMarket.lk has nailed the essence of Sri Lankan style saree. This\nbatik saree with skulls and rose printed is specially catered for any woman who loves to change up their style with the trends while staying true to her roots. It also comes with a stylish jacket piece embellished with metallic eyelets.\nYou might also like the\n.\nThis\nsaree is a great fit for a special occasion at work. Play with the way you get the red batik blouse done to complement this great boho-inspired look!\nYou can also check out the\n.\nFashionMarket.lk’s End of Season Sale is a great opportunity for you to refresh your wardrobe with the benefits of getting some great designer wear at unimaginable prices. What’s better? You could shop online from the comfort of your home, office or wherever you are and get it delivered to you for free!\nInterestingly, FashionMarket.lk has decided to go beyond the digital space in the near future and open doors to a first of its kind in Sri Lanka \"concept store\" to combine the best of both worlds- the touch and feel experience of traditional retail and the convenience of weightless online shopping.\nWe personally love these looks not only because they’re so stylish but also because they’re so easy and comfortable to wear. If you love to purchase any of these items or check out for more stylish and modern takes on conventional designs, head on over to their website-\n.\nYou could also like their page on Facebook\nand follow them on Instagram\nfor more updates.\n",
  "url": "https://www.yamu.lk/blog/fashion-markets-end-of-season-sale"
}