{
  "title": "Go Pro ගන්න සල්ලි නැද්ද?; රු. 30,000ට අඩුවෙන් ලංකාවෙ ගන්න තියෙන හොඳම ඇක්ෂන් කැමරා 7ක්",
  "abstract": "එහෙමයි කියල ඉතින් ඇක්ෂන් කැමරා නොගෙන ඉන්නත් බෑනෙ.…",
  "author": "",
  "date_published": "5:09pm",
  "content": "Go Pro ගන්න සල්ලි නැද්ද?; රු. 30,000ට අඩුවෙන් ලංකාවෙ ගන්න තියෙන හොඳම ඇක්ෂන් කැමරා 7ක්\nඇක්ෂන් කැමරා උණ කියන්නෙ හැදුණොත් ලේසියෙන් හොඳ කරන්න පුළුවන් ලෙඩක් නෙවෙයි. කොටින්ම කියනව නම් එකක් ගන්නකම් නින්ද යන්නෙ නැති ගානයි. බොරු නම් අපේ යමු එකේ චින්තකයගෙන් අහන්නකො.\nපහුගිය මාසයක් විතර තිස්සෙ චින්තක කලේ උදේ වැඩට ආපු වෙලාවෙ ඉඳන් ඉන්ටර්නෙට් එක පුරාම ඇක්ෂන් කැමරා හොයන එක. එහෙම හොයල හොයල කොහොම හරි අමාරුවෙන් එකක් හොයගත්ත කියමුකො, ඒත් ඒක ලංකාවෙ ගන්න නෑ කියල දැන ගත්තාම හෙණ අප්සෙට්; මූණ එල්ලගෙන ඉඳල ගෙදර යනව. කොහොම හරි මේ විදියට මාසයක් විතර ට්‍රයි කරල තමයි චින්තක ඇක්ෂන් කැම් එකක් ගත්තෙ.\nචින්තක විතරක් නෙවෙයි, ඔය විදියට ඇක්ෂන් කැම් උණෙන් පෙළෙන අපේ යාළුවො තව සෑහෙන්න ඉන්නව කියල අපි දන්නව.\nවැඩේ කියන්නෙ, ගෝ ප්‍රෝ තිබ්බට ඒවයෙ ගාන වැඩි නිසා ගන්නත් බෑ. ඒ මදිවට චයිනීස් කෑලි වැහි වැහැලා. අතේ තියෙන්නෙ පොඩි ගානයි. ඒ ගානට තියෙන කැම් ලංකාවෙ නෑ.\nඑහෙමයි කියල ඉතින් ඇක්ෂන් කැමරා නොගෙන ඉන්නත් බෑනෙ. අන්න ඒ නිසා අපි හිතුවා ඒ ප්‍රශ්නයට විසඳුමක් දෙන්න. ඒකයි කොහොම හරි හොයල හොයල, ලංකාවෙ ගන්න තියෙන, ගාන අඩු, හොඳ ඇක්ෂන් කැමරා ටිකක් හොයා ගත්තෙ.\nඑහෙනම් කියවල බලල අරගන්නකො, උණ හොඳවෙන්නත් එක්ක ඇක්ෂන් කැම් එකක්.\nමෙගා පික්සල් 12ක සෙන්සරයක් තියෙන මේ කැම් එකට අපේ ලිස්ට් එකේ එක දෙන්න හිතුවෙ වෙන දෙයක් නිසා නෙවෙයි මේකෙ සෙන්සරය සොනි ආයතනයෙ හදන එකක් නිසා. හැරත් 4K, 30fps කොලිටියට පැය 1 ½ක් වීඩියෝ රෙකෝඩ් කරන්න, full HD, 60fps කොලිටියට පැය දෙකක් වීඩියෝ කරන්නත් පුළුවන්නෙ. අඟල් 2ක LCD ස්ක්‍රීන් එකක්, f/2 1550 ලෙන්ස් එකක්, වයිෆයි, බ්ලටූත්, මයික්‍රෆෝන් දෙකක් එහෙමත් තියෙන Xiaomi YI 2 එකේ පොඩි පොඩියට ෆොටෝ, වීඩියෝ එඩිට් කරන්නත් පුළුවන්. එතකොට පැති 6ක් හරහා වෙන සෙලවීම් එහෙමත් අඩු කරල තියෙන්නෙ. වැඩේ කියන්නෙ මේ කැම් එක තවම රිලිස් වුණ ගමන් නිසා කැම් එක විතරක්ම රු. 30,000ක් විතර වෙනව.\nපොඩ්ඩක් ඉන්න, ළඟදිම ඒවි. චීනෙ හැදුවට මොකද SJ 8000වලත් තියෙන්නෙ සොනි ආයතනයෙ හදපු මෙගා පික්සල් 16ක සෙන්සරයක්. හැබැයි මේ කැම් එකේ නම් 4K, 24fps කොලිටියට විතරයි වීඩියෝ රෙකෝඩ් කරන්න පුළුවන්. ඒකත් විනාඩි 40ක් විතර. ඔන්න full HD, 30fps නම් විනාඩි 70ක් විතර පුළුවන්ලු. මේ කැම් එකෙත් අඟල් 2ක LCD ස්ක්‍රීන් එකක්, එතකොට වයිෆයි එහෙමත් තියෙනව. ඒ හැරුණාම, විශේෂත්වයක් විදියට 1700 වයිඩ් ඈන්ගල් ලෙන්ස් එක හඳුන්වන්න පුළුවන්. කොහොම වුණත් SJ 8000 ෆුල් සෙට් එකක් නම් රු. 15,000ට විතර ගන්න පුළුවන් වෙයි.\nSJ 8000 එක්ක බලද්දි නම් Exporer Pro එක ටිකක් උඩින් තියෙන්නෙ. මොකද මේකෙ 4K, 24fps කොලිටියට විනාඩි 70කට කිට්ටු වෙන්න වීඩියෝ කරන්න පුළුවන්. එතකොට full HD, 60fps විනාඩි 90ක් විතර පුළුවන්. ඒ හැරුණාම මෙගා පික්සල් 12ක සෙන්සරයයි, අඟල් 2 LCD ස්ක්‍රීන් එකයි, 1700 වයිඩ් ඈන්ගල් ලෙන්ස් එකයි නම් එ් විදියටම තියෙනව. මේ කැම් එකේ තියෙන විශේෂත්ව තමයි 120fps ස්ලෝ මෝෂන් වීඩියෝ කරන්න පුළුවන් එකයි, වතුර යටදි අඳුර අඩු වෙලා රෙකෝඩ් වෙන විශේෂ ඔප්ෂන් එකක් තියෙන එකයි. එහෙම බැලුවොත් රු. 15,000 වගේ ගාණකට ELE Exporer Pro එකක් ගන්න එක තමයි ලාභ.\nලොකු වගකීමකින් නම් නෙවෙයි මේ කැම් එක ගැන කතා කරන්නෙ. මොකද ළඟදි ආපු කැම් එකක්නෙ. හැරත් ඒ හැටි පාවිච්චි කරපු කට්ටියත් හරිම අඩුයි. කොහොම වුණත් මොකද Yashica YAC 401 එකෙත් 4K, 24fps කොලිටියට පැයක් විතර වීඩියෝ කරන්න පුළුවන්. full HD, 30fps නම් විනාඩි 90ක් වගේ තමයි. මේකෙත් 1700 වයිඩ් ඈන්ගල් ලෙන්ස් එකක් තියෙනව. සෙන්සරය මෙගා පික්සල් 12යි. විශේෂයෙන් කියන්න තරම් වැඩ කෑලි නැති වුණාට කැම් එකේ ගාන රු. 20,000ක් විතර වෙනව.\nමේ කැම් එක ගැනත් හරිහමන් විස්තරයක් දන්න කෙනෙක් හොයා ගන්න බැරි වුණා. මොකද තාම ලංකාවට එන ගමන්නෙ. හිතන විදියට ගාන රු. 30,000ක් වගේම වෙයි. මෙගා පික්සල් 12ක සෙන්සරය, විනාඩි 40කට කිට්ටු 4K, 30fps වීඩියෝ රෙකෝඩින්ග්, විනාඩි 70කට කිට්ටු full HD වීඩියෝ රෙකෝඩින්ග් වගේ වැඩ තමයි මේ කැම් එකේ තියෙන්නෙ. ලෙන්ස් එක නම් අනිත් ගොඩක් ඇක්ෂන් කැමරාවල වගේ 1700යි. වයිෆයි එහෙමත් තියෙන නිසා හොඳ වැඩ ටිකක් ගන්න නම් බැරි වෙන එකක් නෑ.\nඩෑෂ් කැම් එකක් විදියට මාර්කට් එකට ආපු Drive Pro 520වල තියෙන්නෙ මෙගා පික්සල් 3ක සෙන්සරයක්. හැබැයි full HD, 30fps කොලිටියට වීඩියෝ රෙකෝඩ් කරන්න පුළුවන්. විශේෂයෙන් කියන්න ඕන මේ කැම් එකේ ලෙන්ස් එක පට්ට හොඳයි. මොකද ඒක f/1.8 1300 ලෙන්ස් එකක්. හැබැයි ඉතින් රු. 20,000ක් දීලා ගන්න කලින් දෙපාරක් හිතන්න වෙයි.\nසෑහෙන වැඩක් ගන්න පුළුවන් කැම් එකක්. ඇත්තම කියනව නම් Drive Pro 520 එකේ ඉස්සරහයි පිටිපස්සෙයි කැමරා දෙකක් තියෙනව. ඉස්සරහ එකේ full HD, 30fps රෙකෝඩ් කරන්න පුළුවන්. ඒත් පිටිපස්ස එකේ පුළුවන් 720, 30fps විතරයි. එතකොට ඉස්සරහ කැම් එකේ ලෙන්ස් එක f/1.8 1300. ඒත් පිටිපස්සෙ එකේ f/1.8 1100. විශේෂයෙන් කියන්න ඕන මේකෙ ඉස්සරහ කැම් එකේ තියෙන LED ලයිට් 4 නිසා රෑට වුණත් කිසිම අවුලක් නැතුව වීඩියෝ කරන්න පුළුවන්. මේ කැම් එක නම් ඇත්තටම රු. 30,000කට පාඩු නෑ කියල තමයි අපිට හිතෙන්නෙ.\nමේ 7 හැරුණාම ඉතින් තව චයිනීස්ම කෑලි සැහෙන්න තියෙනව. ඒව ගැන වගකීමෙන් කතා කරන්න බෑනෙ යාළුවනේ.\n",
  "url": "https://www.yamu.lk/blog/7-action-cameras-under-30000lkr"
}