{
  "title": "Google Knows Where You've Been. Do You?",
  "abstract": "If you use Android, Google knows where you are and where you've been. But do you know?",
  "author": "",
  "date_published": "9:07am",
  "content": "If you use Android, Google knows where you are and where you've been. But do you know?\nYou can always access your location data through\n.\n\nAs you can see, that pulls up the routes you've travelled as well as even photos, and I don't think I even took that photo. Weird.\nI also found another service that\n(once you download it through Google Takeout). Which means that instead of going day by day, you can see what places you frequent overall.\nBefore we get into it, here's how to do it yourself. Basically, you need to download your location data from Google and drop it onto this webpage.\nAll the data seems to be processed on your computer so it seems relatively safe, but I just heard about this on MetaFilter, so buyer beware.\nThe service does ask for an email and they want to sell you a pro package that lets you track data by time and stuff, but the basic version is pretty cool. Here's a bit of mine:\nSo, that red spot is the YAMU office, where I spend a lot of time. You can also see, if you're sharp, that I also frequent Java Lounge (Jawatte) and Dolce Italia (Skelton Road). Oh, and you can also guess where my local buth kade is. Hell, you can even see that I got a national dress made at Hercules on Havelock Road.\nKinda creepy actually, let's show you London instead where I was just visiting and don't care what you know.\nSo here you can see the AirBnB we stayed at in Notting Hill, and all the walking I did up and down Portobello Road. The map even showed me stuff I'd forgotten.\nNowadays it seems like the question 'where were you on the night of the murder' is pretty pointless because you (or the cops I guess) could just download the data and see. This free version doesn't let you do that, but if I ever really did have to prove my whereabouts I guess I'd just pay $50 and see.\nIf you want just a general sense, however, this simple application is pretty fun. And of course creepy. You should assume that lots of people know where you've been - Google, the phone company, the government and even other apps like Uber or anything that asks for all-the-time location access.\n",
  "url": "https://www.yamu.lk/blog/see-where-google-tracks-you"
}