{
  "title": "Grand Blonde : A New Take On Strong Beer",
  "abstract": "Grand Blonde is back on the shelves with a brand new look and taste making it probably our favourite strong beer around.",
  "author": "Bhagya",
  "date_published": "4:31pm",
  "content": "Returning from a mini Euro trip last month, I came back with a new appreciation and envy for the quality beers and just the sheer variety that they’ve got. You could drink beers everyday (which I did during my two weeks) and still not have tried a fraction of all the options. Coming back to Sri Lanka I found the familiar taste Lion quite welcoming with tinge of pride after realizing how well it squares up against foreign lagers.\nI also found that in Europe they don’t broadly classify strong beers, instead categorizing them as dubbel, tripel and quadrupel depending on the strength ranging from 6% -12%. To my surprise, despite not being a regular strong beer drinker, I found myself loving most of the dubbels and tripels.\nThis is actually where Sri Lanka has a large void to fill in terms of variety of strong beers. So, when I saw GB on the shelves, I thought it warranted a taste test. We were told by the shop owner that it had only recently returned after hiatus of nearly 4 years, this time with a completely different look and recipe, at a price of Rs. 360 for 625 ml.\nWith a bit of research, we found that the brand itself had seen a change in breweries (from Millers to Lion Brewery) which explains both the lull and the new recipe. The old GB didn’t have the highest approval ratings, so we were going into this tasting with a certain level of skepticism.\nGoing through the label, we did come across an interesting accolade - “Superior Taste Award by The International Taste & Quality Institute - Brussels”. This piqued our interest, but we wanted to see if it was actually deserving.\nUpon tasting it, we found ourselves pleasantly surprised by the overall flavour profile and drinkability. One thing we truly appreciated here was that this wasn’t just another lager with its strength amped up. The experience with GB was unique due to two reasons: the very low level of bitterness and carbonation, which makes it go down smoothly with no gas reflux.\nThe aroma was sweeter than we expected, somewhat like a mild cognac. This feeling is further accentuated by the amber hue of the GB.\nThe flavour itself is on the maltier end of the spectrum making it sweeter than most others with a caramelized undertone that doesn’t leave you with any aftertaste. We also noticed that GB gave us a longer and faster buzz which will appeal to some more than others depending on budget and time.\nHowever, we do have to mention that this isn’t for everyone, primarily due the low level of carbonation which kind of puts the texture somewhere between a lager and a spirit. The lower level of bitterness might not work for some as well but if that’s what you want there’s always Lion Strong.\nIt’s great to see successful breweries reviving an old brand and putting a new spin on it. We found GB to be something that might work as an alternative for the regular arrack connoisseur or anyone that might not like the general bitterness or carbonation of a lager. Beer in Sri Lanka has plenty of variations to adopt, and the unique flavour of the new Grand Blonde is a welcome start.\n",
  "url": "https://www.yamu.lk/blog/grand-blonde-a-new-take-on-strong-beer"
}