{
  "title": "Halloween  Parties 2017",
  "abstract": "All Hallow's Eve is around the corner. We have plenty to do during Halloween. ",
  "author": "",
  "date_published": "1:32pm",
  "content": "All Hallow's Eve is around the corner. Scare yourself silly with the best spooky events, scary attractions and parties taking place in and around Colombo this Halloween!\nBe ready for a creepy experience like no other with an all night long DJ and amazing deals this Halloween. Drinks, music and spooks await!\nDate: 28\nOctober\nVenue:\nIf you are around Negomobo, head down to the Camelot for their Halloween fanfare. Make your dinner reservations to avoid being left out!\nDate: 28\nOctober\nVenue:\nA kid friendly Halloween party to get the youngins pumped up. Open to kids aged 3-14.\nTicket price LKR 2000 - per child.\nTicket includes Party food, Music, Costume Parade, Halloween Games, Face painting and a loaded Goodie bag!\nDate: 2\nNovember\nVenue:\nThe scariest and most happening halloween party in Colombo this year. Free cocktails for the ladies from 6.00 p.m. to 9.00 p.m , brilliant halloween decorations and so much more.\n\nDate: 27\n& 28\nOctober\nVenue:\nDon your most terrifying costume, go nuts with fake blood and get ready to scream the night away with your mates. Head to the Palm Beach Hotel and have a blast!\nDate: 27\nOctober\nVenue:\nThis Halloween, Chapter One offers live entertainment by \"OHME\" band, a Halloween photobooth with props, a trophy for the Scariest Outfit and many more exciting gifts.\nDate: 28\nOctober\nVenue:\nForsaken and the Whiskey Rebellion are coming back to one of their favorite spots to celebrate this year! Performances by brilliant artists like Asvajit, LuLu and Tim Tim await!\nDate:\n28th October\nVenue:\nJoin us as some of the best DJs featuring the legendary DJ Bonnie together with DJ Thanujika, Little Kush , Minol ,Ryan & Rumesh as they kick off with a range of HIP HOP, R&B and House tunes at W lounge for that one night of the year where retro takes over spooky.\nDate: 27\n- 28\nOctober\nVenue:\nJoin us if you dare, for a Halloween scare! Calling all goblins, ghosts and creatures of the night! Come to #PLAYTRIX for some ghoulish fright and the most creative freaks!\nDate: 27\n- 28\nOctober\nVenue:\nHave yourselves a spectacular Halloween!\n\n\n",
  "url": "https://www.yamu.lk/blog/halloween-parties-2017"
}