{
  "title": "Happy Independence Day (a brief history of colonial rule)",
  "abstract": "Sri Lanka celebrates its 67th Independence Day today. It commemorates the granting of self-rule to the Dominion of Ceylon…",
  "author": "janith",
  "date_published": "5:30am",
  "content": "Sri Lanka celebrates its 67th Independence Day today. It commemorates the granting of self-rule to the Dominion of Ceylon from the British Empire on the 4th of February, 1948.\nThe European powers first made contact with the island in 1505, when\n's Portuguese fleet was caught in a storm and washed ashore at Galle. The fleet later made it to Colombo (the port nearest to the Sri Lankan capital at the time,\n) and subsequently started a trading post there, which eventually became the Colombo Fort.\n\n\nThe Portuguese meddled with the internal power struggles between Sri Lankan princes, in which the kingdom had split into three factions: the kingdoms of Kotte, Sitawaka and Raigama. Sitawaka annexed Raigama, and Kotte became a puppet state of the Portuguese. Eventually the Portuguese came to control most of the coastal areas of the island, and the lucrative trade of spices (especially cinnamon), Sri Lanka's most important export at the time. The Sitawaka kingdom engaged in a number of military confrontations with the Portuguese, the most significant being the siege of Colombo under\nin which the Portuguese were nearly defeated.\n\n\nKandy, in the central hills, was a well-defended citadel surrounded by\n,\nand\n(the triple obstacles of water, mountains and thick jungle). It came into prominence \n      during the reign of King\n(reigned 1590 - 1604), \n      who fought off the dual threat of the Portuguese and Sitawaka. He consolidated his \n      power by taking custody of the Tooth relic and enshrining it at the newly built\n, \nand reintroducing Buddhist ordination in the island by sending a mission to Burma. By the late 1590s, the Kingdom of Kandy was the last surviving local polity: Sitawaka had disintegrated after the death of Rajasingha I, and the Kingdom of Jaffna become a client state of the Portuguese.\n\n\n\nThe Kandyans maintained a hold of the Sri Lankan interior despite many attempts by the Portuguese to capture it. Impressive military victories at Randeniwela (1630) and Gannoruwa (1638) severely weakened the Portuguese hold on the island. The Dutch East India company subsequently entered into an alliance with the King of Kandy (this was an extension of the Eighty Years' War in Europe), and although the agreement faltered at times, the combined forces managed to drive the Portuguese from all coastal areas by 1658.\nfell in 1640, \nand was the centre of Dutch power in Sri Lanka for the next 18 years. Colombo fell in 1656.\nThe agreement between the two sides quickly fell apart after victory, and the Dutch ended up holding most of the land previously held by the Portuguese. There were several periods of conflict between the Kandyans and the Dutch, but Dutch rule continued until the late 1790s.\n\n\nThe last native king,\n, died in 1739 without a legitimate heir. The throne then passed to his brother-in-law,\n, a Nayakkar prince from South India. There was considerable friction between the native Kandyan aristocracy and the Nayakkars, with the latter seen as forming an elite above the powerful Kandyan Adigars.\nSerious rebellions in 1732, 1749 and 1760 had threatened to rip apart the kingdom. In the first half of the 1760s, the kingdom launched a disastrous military campaign against the Dutch that resulted in the loss of all coastal territory, and Kandy becoming a landlocked entity cut off from foreign contact.\nDuring the Napoleonic Wars in Europe, the Dutch Republic fell to France. Dutch possessions around the world, including coastal Sri Lanka, were either transferred or captured by Britain (where the Dutch leadership had fled). The British came to control coastal Sri Lanka in an era when the internal politics of the Kandyan Kingdom were in a state of crisis, due to the growing rift between the native aristocracy and the Nayakkars. The British attempted an invasion in 1803, but the party was devastated by lack of food, disease and the hit and run tactics employed by Kandyan guerilla fighters. An uneasy truce was entered to in 1805.\n\n\n\n\n\nThese events led to outright revolt among the general population, and the British invaded Kandy in 1815. The King and Queen consort were captured and exiled to Vellore Fort in India.\nstill stands. The British signed the Kandyan Convention with the Kandyan disawes (the powerful nobility in charge of running the provinces) which made Kandy a protectorate, preserving its system of government and customs.\n\n\nDiscontent with British rule (and their disregard for local religion and customs) soon boiled over into open rebellion, starting in Uva. The British response was severe, and the civilian population and the vast farmland of Uva-Wellassa was devastated.\n\n\nIt is a pity that there is no evidence left behind to show the exact situation in Uva in terms of population or agriculture development after the rebellion. The new rulers are unable to come up to any conclusion on the exact situation of Uva before the rebellion as there is no trace of evidence left behind to come to such conclusions. If thousands died in the battle they were all fearless and clever fighters. If one considers the remaining population of 4/5 after the battle to be children, women and the aged, the havoc caused is unlimited. In short the people have lost their lives and all other valuable belongings. It is doubtful whether Uva has at least now recovered from the catastrophe.\n\n, the leader of the rebellion, was beheaded in front of the Dalada Maligawa in Kandy. His skull was taken to Edinburgh, but was returned to Sri Lanka in 1954 and entombed at the Keppetipola memorial. The protectorate was abolished, and all of Sri Lanka came under direct British colonial rule.\n\n\nIn 1848, the Kandyans were again in a state of agitation. The British had taken over their land to plant coffee, and heavy direct taxation had been levied on the people.\nled the Matale Rebellion of 1848, but the British soon crushed it and executed the rebels. It was notable for being a mostly peasant-led revolt.\nA breakthrough for the path back to self-determination occurred with the appointment of British socialist Sidney Webb as the British Secretary of State for Colonial Affairs. This led to the Donoughmore Commission, which effected a new constitution for Sri Lanka in 1931. For the first time, a colony which wasn't dominated by a white populace was given universal suffrage and representative democracy. Note that Sri Lanka also thus had universal suffrage before even the United Kingdom and the United States of America.\nThe constitution aimed to address the unique multi-cultural challenges Sri Lanka faced by appointing committees representing all communities to be in charge of each subject, instead of ministers and a cabinet model of partisan democracy. Most local affairs were handled by the state council, giving Sri Lanka a remarkable amount of self-determination given the environment at the time, although colonial authorities still retained veto power on all legislation.\nNotable Independence movement leaders of this era included\nand the monk-poet from Sikkim,\n.\nIn 1944, Sir Ivor Jennings (an authority on constitutional law and the legendary first Vice Chancellor of the University of Ceylon) helped\ndraft a constitution based on the Westminster model. With some pressure from Lord Mountbatten, a commission was appointed, and by 1947 the new Soulbury Constitution was in effect. General Elections were held, and Mr. Senanayake was appointed the first Prime Minister. Sri Lanka gained independence within the British Commonwealth on the 4th of February, 1948.\n\n\n\n\nThe Kandyan flag was modified with two added stripes to represent the Tamil and Muslim communities, and became the national flag in 1950. Ananda Samarakoon's\n(originally\n) became the national anthem in 1951.\nSri Lanka became a republic in 1972, finally becoming fully independent and severing \nall constitutional links with the United Kingdom, including the shared monarch and the authority of the Privy council. For a few years,\n, \na national holiday replacing Independence Day, but the practice did not survive the change of government and constitution in the latter half of the 1970s.\nIndependence Day is a day of reflection for Sri Lankans. However troubled the post-Independence path of Sri Lanka has been, we've still managed to dig in and weather to storm. The untapped potential of the country and its people are vast, and one hopes that we go on to fulfil the lofty ambitions and the humble aspirations of the people who fought for our right to be free.\n",
  "url": "https://www.yamu.lk/blog/independence-day"
}