{
  "title": "Happy Cheesecake Day: 12 Places To Get Awesome Cheesecake",
  "abstract": "Here's a list of our favourite places in Colombo to get nom on one of our favourite desserts. ",
  "author": "",
  "date_published": "12:17pm",
  "content": "Ladies and gentlemen, it is July 30th, the Day of the Cheesecake. It is a sacred day that if you ask me, should totally be a holiday for its own sake, so we can sit at home with a slice and contemplate our gratitude for this dessert's existence.\nGood cheesecake usually has a middle layer (the best part) made of a rich mixture of soft fresh cream cheese, eggs and sugar, often a bottom biscuity layer, and sometimes a fruity top layer (often blueberry, strawberry or passion fruit). The earliest mention of the cheesecake is by the Greek physicist\nin the 5th century BC who wrote a book on the art of making cheesecake. I am not making this up.\nAnyway, get ready to tuck in because here's a mouth-watering list of our favourite cheesecakes in town.\n\nThe Cakery (alternately, the English Cake Company) has long been a favourite among us cake lovers. Their blueberry cheesecake - which we tried again recently for\n- is made exactly the way I like it: soft, creamy cake in the middle, shots of strong blueberry, and a pleasant mild biscuity layer at the bottom to balance out the richness. Note that this is a huge slice bursting with cream cheese and sugar and you're going to be full (and happy) very fast.\nColombo Fort Cafe makes their cheesecake a little different. The cheesecake itself is much lighter, unbaked, almost pudding like in texture, there's a thicker layer of soft biscuit so the dessert isn't overwhelmingly sweet, and there's tangy, sweet-sour passion fruit dripping over the top with sliced strawberry for good measure. It's a treat if you're looking for a very sweet but light way to wash down your meal.\nSchakasz is another place that specializes in quality desserts. The cheesecake here is much cleaner in terms of flavour than the rest, with an almost white creamy cheese center, a very crumbly bottom layer, and chunks of passion or strawberry layered on top.\nMitsi is no newcomer to the dessert scene so it's no surprise to find her cheesecake on this list. Her cheesecake is very classic, clean and well structured with a very smooth texture which sits perfectly on the palate. Flavourwise, it's sweet and creamy with the blueberry topping adding just a bit of sourness to balance out the sweetness.\nThe Barefoot cheesecake is a Colombo classic. On a hot day in their garden cafe, there's nothing like a sweet, cool slice of their (usually blueberry) cheesecake.\nYumi Cake has long been one of our favourites for gourmet cake. The red velvet cheesecake is something else - creamy, delectable cheesecake frosting layered between soft red velvet cake - it's very rich and good for two to share.\nThe Bakery at the Edge is one of the more affordable places on our cheesecake list. It's Colombo's only bakery drive-through, and it's at Waters Edge all day. They've got some very tasty, creamy cakes available for just about Rs. 180 a slice. We've tried just the red velvet cake - massive, creamy and very satisfying - but have heard good things about their blueberry and strawberry cheesecakes too.\nCharcoal, though only a tiny cafe, serves up a cheesecake that's comparable to the best Colombo has to offer. At Rs. 350 it's also one of the cheapest options on this list. They stick to the classic cheesecake preparation topped with strawberry sauce and a drizzle of fresh cream. What we loved was the fact that this wasn't overly sweet, with the strawberry topping and cream working great together. They also add a thicker biscuit base than most other which adds a nice bit of texture at the end.\nJagro is one of our favourite places for obvious reasons - fresh strawberries tossed in sweet, creamy desserts, what's not to love? They've got a series of absolutely delicious strawberry themed desserts from waffles to tarts, and the cheesecake is just as top quality as the rest. It arrives coupled with freshly sliced strawberries and either chocolate or strawberry topping.\nWhile The Sizzle is known mainly for their bubbling hot main, they also do an excellent Philly cheesecake, which in our case was the best part of the meal. Just don't get too excited like we did, 'cause you'll burn your tongue fo sho. That aside, the cheesecake was slightly thicker than usual, but the flavour was perfect. The fact that it's served sizzling makes it that much better, with the warm strawberry sauce and cool ice cream adding a beautiful contrast of temperatures.\nHash Deli is another one of my favourites in cheesecake world. They used to be available at the Good Market, but now you can only get them by ordering - if you've got a party though, the cheesecake for about Rs. 2800 is a perfect option, enough for about 15. The cake is very rich and very soft and creamy, with a generous heaping of blueberry and blueberry gelatin layered on top.\nCuppaCreme is last on our list but definitely not the least. These guys in my opinion make some of the best cheesecake in town, though the catch is like Hash Deli you'll probably need to order in bulk, for about Rs. 3000, but again enough for around 12. The cheesecake here has the same very creamy, rich texture that I enjoy at the Cakery, a slice is quite filling, and ours came with a gooey, sweet strawberry topping.\nSo that's our cheesecake roundup on this special day - if you've had a killer slice somewhere and you can't find the place on our list, share it with us in the comments. Happy Cheesecake Day!\n",
  "url": "https://www.yamu.lk/blog/happy-cheesecake-day"
}