{
  "title": "Healthy Living in Colombo",
  "abstract": "Trying to lead a healthy lifestyle in Colombo? Here's a round-up of restaurants,  walking spaces and gyms to check out. ",
  "author": "Bhagya",
  "date_published": "12:34pm",
  "content": "Trying to lead a healthy lifestyle in Colombo can be pretty difficult, but not impossible if you know where to eat and how to plan your week. On World Diabetes Day, we want to focus not only on cutting down on sugar but also on eating healthy, reducing stress, and getting regular exercise. Thankfully, within the last two years we've had a bunch of new healthy food alternatives as well as gyms and parks opening up in and around Colombo. With everything from free gyms to healthy rice and curry, there are options for pretty much anyone looking to get in shape, eat right, or just live a healthier lifestyle.\nSwitching to a healthier diet is the first step to really embracing a healthy lifestyle. It can be a bit tough at first, but it's totally worth it, with studies showing a 26% reduction in the risk of diabetes among the urban youth of Colombo through lifestyle modification. While there aren't as many health food options in Colombo as we would like, we're still glad that ones that do exist are all pretty great. Here's a quick snippet at what Colombo has to offer. Be sure to click the links for their full reviews.\nAlthough Calorie Counter has only been around for a year, they've already made their mark on the health food scene in Colombo. They're pretty much the only restaurant that really offers health food in the form of restaurant quality dishes. They focus on healthier alternative ingredients with a calorie count for each dish, so you know exactly how much you're actually eating. Sugar is\n, so keeping your bodyweight in check is crucial, and knowing how many calories you're consuming will certainly help the cause.\nEat Right is a cool new delivery website made for those who want to live healthy. You get to pick from a range of salads, wraps, sandwiches, rice and curry - and even healthy kottus, while you can also get health tips and calculate your BMI on the site. With studies showing\n, the ability to monitor your BMI will help tweak your diet as and when needed.\nIf you're interested in just monitoring your BMI you can use DASL's own tool\n.\nHealthy Living, in many ways, were the pioneers of Colombo's growing health food scene. They delivery healthy meals to your doorstep with an emphasis on affordablility as well as dishes like rice and curry which we Sri Lankans love so much.\nLife Food is a low key health food stall at The Good Market Shop in Lakapahana. Both their salads and drinks are excellent and they manage to keep things healthy and fresh with flavour.\nHealth Factor is a simple little restaurant on the ground floor of big High Octane Fitness gym in Kohuwala. They've got a lovely healthy menu, with food that strikes a balance between quality and cost.\nWonderbar is a great option for those who are cautious of their sugar intake but still have a sweet-tooth. They offer gluten,dairy and sugar free desserts and smoothies with some unique combinations and ingredients.\nPaan Paan's newly introduced range of salads offer great value for money as well as fresh and vibrant veggies, with delivery to boot. We think it's a great initiative on their part, so hopefully their contemporaries will follow suit.\nMilk & Honey Cafe is one of the few vegan health-food options in the city. They've got an impressive menu of healthy sandwiches, wraps and smoothies - and some amazing home-made cakes and brownies.\nSubway can be healthy if you opt for the right bread and lean meats or veggies. From the bread to the filling to the sauces - these sandwiches are as customized as they come, there's plenty to munch on, and it's not crazily priced.\nSome of us, for a bunch of different reasons, may not have the time or ability to hit the gym on a regular basis.\nhave shown that nearly 40% of urban youth in Sri Lanka are physically inactive, which is a scary stat. Thankfully, we've actually got plenty of great walking areas right here in the city. Aside from a plethora of proven health benefits ranging from improved blood pressure, cholesterol, stress, and depression, walking is also a great way to\n. It's simple, requires no equipment and doesn't cost you anything at all.\nIndependence Square is Colombo's newest public space. It's part monument, part park, part walking ground. It's main function seems to be as the place where Colombars go for their evening constitutional (walk).\nGalle Face is a great place for evening walks (just not while the Pope is there). The long strip hosts families, kites and bites but there’s still plenty of space for you to get some exercise. Just don’t get distracted by the isso wade.\nConsisting of cycling and jogging paths, fountains and benches, and even an old army tank, this water and walkway recreational space finally provides Nugegoda residents with a place where they can relax or exercise.\nThe Weras Ganga park is a cool outdoors food-court in Bellanwila, one of many affordable hangout spots popping up in Colombo recently. Around the seating space is a neat walkway that goes along the Weras Lake - pretty ideal for cycling and jogging.\nWhen it comes to conditions like diabetes, weight management is absolutely essential along with regular exercise. The gym scene in Colombo has come a long way in the last few years and now we have gyms at a range of different price points. The higher-end gyms like High Octane and Bankhill have state of the art equipment which can really come in handy for those dealing with diabetes or cardiovascular diseases. They've also got some of the most qualified trainers around that can give you advice and guidance depending what exactly you want to achieve. For more details on Colombo's gyms click\n.\nHigh Octane is one of the largest and most well maintained gyms. They fall in the higher end in terms of membership fees but they've got pretty much every type of equipment. They're also one of the few places that offers Zumba and Spin classes.\nFitness First sits on top of the HSBC bank and the Reebok showroom opposite Avirate Cafe. Located in Colombo 7, it’s a fitness spa with a gym, swimming pool, jacuzzi and sauna. Fitness First is one of the few places where you can gain access to a swimming pool and a gym for a pretty decent price in Colombo. It’s good value for money and the location, just a hundred meters from Independence Square, is ideal.\nThis free place in Independence Square is beyond a doubt the most accessible. It's free. The space isn't really geared for body building but they've got most of the equipment you'd need maintain a high level of fitness.\nBankhill Wellness Centre in Battaramulla is an all round sports centre, in progress. They have a pretty great gym here, and tennis, badminton and squash courts. A 50m swimming pool is said to be on its way, but I think this might take at least another year to finish.\nIf you're looking to relieve some stress, Rev. Olanda Ananda (0722231246 ) conducts weekly meditation classes in English and Sinhala at the Pagoda Meditation Centre in Nugegoda (Sundays 4-5:30 PM) and at the Buddhist Cultural Centre at Thunmulla Junction (Mondays 6-7:30 PM).\n",
  "url": "https://www.yamu.lk/blog/healthy-living-in-colombo"
}