{
  "title": "Help For Women Who Face Violence",
  "abstract": "Violence against women  and girls is a violation of human rights.",
  "author": "Rishani",
  "date_published": "4:05pm",
  "content": "Violence against women  and girls is a violation of human rights. Violence could include physical, sexual and psychological harm. it is a form of discrimination against women. “That’s the way he is, he loses his temper sometimes.” “He just got carried away. It’s no big deal.” “You provoked me.” “You deserved that beating” “You can cover that up with some makeup.” “Women are stronger, you can take this.” “He only slapped you. Other women have gone through far worse than you.”\nEver heard these excuses your abuser makes in defense of their actions? or it could be other people who defend the actions of an abuser. Whether it is verbal, emotional blackmail of physical – it is still abuse.\nThe abuser can be of either gender, it could be a sibling, it could be a spouse, it could be a boyfriend, a girlfriend or a relative or even a friend.\nIt is estimated that 35 per cent of women worldwide have experienced either physical and/or sexual intimate partner violence or sexual violence by a non-partner at some point in their lives. However, some national studies show that up to 70 per cent of women have experienced physical and/or sexual violence from an intimate partner in their lifetime. Women who have been physically or sexually abused by their partners are more than twice as likely to have an abortion, almost twice as likely to experience depression, and in some regions, 1.5 times more likely to acquire HIV, as compared to women who have not experienced partner violence. (Excerpt courtesy :\n)\nIf you feel you have come to the end of your tether, and looking for a way out you can and you should. We have put down a few places you can get in touch with who can provide you with the help that you need.\nIf you know of any other organisations that help women who face violence, do include them in the comment section.\n",
  "url": "https://www.yamu.lk/blog/help-for-women-who-face-violence"
}