{
  "title": "High Tea at The Hilton",
  "abstract": "High tea at the Hilton is an experience best avoided. ",
  "author": "Sandesh",
  "date_published": "4:33pm",
  "content": "All my life I’ve avoided high teas like the plague. There’s something about being the only guy in a tea lounge full of ladies that makes you feel like an endangered animal. After visiting the Hilton high tea during their fashion show, I am convinced that I’ve been avoiding high teas for good reason too. At around Rs.1500 per head it can be a disappointing experience.\nFirst impressions go a long way, and Hilton did not start well in that aspect. The Hilton clearly seems to have mixed 'High Tea' with the likes of 'Haiti'. As soon as I walked in my waiter greeted me and literally flung my plate and cutlery from one end of the table to another letting it rattle at a solid 6.4 on the Richter Scale. I would have expected this sort of service at a saivar kade in Colpetty.\n\nI let it go- surely I could relax and enjoy my tea, right? Wrong! My hope for a peaceful evening was shattered by the organiser, a master of ceremonies of sorts blaring over the microphone – “WELCOME LADIES AND GENTLEMEN(man) TO THE TITTLE TATTLE FASHION SHOW!”\nGolly gee. In a moment the Thorana Lounge was filled with models clad in many a raiment parading up, down, and around the tables. “THIS IS FROM OUR FLIRTATIOUS COLLECTION!” The Master Of Ceremonies declared over the mic while loud music made ripples in my tea cup.\n– I felt like saying as a model circled my table for the second time. I tried to focus on the high tea.\nMuch to my relief, and the Hilton’s good fortune, the chefs weren’t as horrid as whoever organised the fashion show. While the Hilton certainly aspires to touch all the senses with loud music and a fashion show, it’s the taste buds that need to be tickled ultimately. All in all it was okay, but we expect more from the hotel elites. Its saving grace is that it’s a buffet, but that’s about it.\nThe savouries on offer were fairly all right. Among others they had thin pizzas, batter fried prawns, quiches, sandwiches, and rolls with a fairly tasty albeit cold mutton filling. The quiches were too crumbly for my liking, with the base coming off too sweet at times. While the fillings of the sandwiches and rolls were tasty, The bread was extremely thick, leaving the beef lost in a mushy paste of textures in the mouth. The sushi rolls were frankly unexciting. The batter fried prawns on the other hand was a tasty affair, each bite resounding with a pleasant crunch of goodness. It won't blow your mind, but as a bite, they get the job done.\nTheir iced coffee, which should rather be labelled  'mildly cold coffee' was a pleasant surprise though the temperature left something to be desired. It was creamy, not too sweet and overall a decent drink. Even the tea was all right. If plain tea is your thing it will not disappoint- you can enjoy the tea by itself – I quite liked the flavour overall.\nDesserts seem to be the Hilton’s forte. There was an array of cakes and trays full of sweet tarts – this is a sweet tooth’s paradise if you’re looking to stuff yourself. Overall the desserts were a decent experience, though not an excellent affair. One of the chocolate cakes was a pleasant surprise with a variety of layered textures ranging from the smooth to the occasional snap of the garnish – a tuile of sorts.\nOverall the Hilton high tea is an okay experience. After visiting I can now proudly proclaim that I have coined a new word –\n– (noun) the loud, gaudy marriage of flamboyance and ambiance that really shouldn’t exist.\nIf you’re looking to avoid the fashion shows\n. My experience on Thursday was a 2.5 at best. While you can run a way from the runway you really can't miss the bad service. I had a decent waiter at the end, but he couldn’t make up for the one who mistook my plate for a Frisbee. Hilton's high tea doesn't fare too badly in terms of food with some good desserts but that fashion show, really left a bad taste in the mouth.\n",
  "url": "https://www.yamu.lk/blog/high-tea-at-the-hilton"
}