{
  "title": "High Tea at The Kingsbury",
  "abstract": "Pricey yet worth your money!",
  "author": "Yaseen",
  "date_published": "12:15pm",
  "content": "Priced at 20 rupees short of a whopping Rs 2000,\n's High Tea lands on the more expensive side of the spectrum. But is this spread worth your money or will it leave you broke and hungry?\nThe spread comprised of uncompromising quality and a wide variety to stuff your face with.\nDo not let my poor plating skills fool you. Everything from the Beef Lasagna to the Tandoori Chicken tasted great! The lasagna was insanely creamy and cheesy, the tender Mutton\nand Tandoori Chicken were well spiced. The shawarma, thankfully, was not dry like at most places and the rest of the bits scooped on to the plate were palatable too.\nThe range was quite internationally inspired as it included Indian meats, deep fried Thai-style cuttlefish and prawns, Italian pizzas and lasagna, and every Lankan's favourite, spicy\n! There was also straight-out-of-the-fryer French fries, batter-fried fish, and patties.\nIn addition to savoury petit fours, sandwiches and burgers, The Kingsbury High Tea offers a grill station that allows you to be the designer of your grilled sandwiches by letting you choose your prefered bread and filling.\nThere's a salad bar, too, complete with cold cuts, meaty mixes and salad dressings. As fresh as it looked, it's mind-boggling why anyone would choose to nibble on a salad at a High Tea!\nThe spread for dessert, like the savouries, was impressive.\nPastries, cakes, tarts, waffles, scones, ice cream and pudding filled up the desserts section. Leaving aside the waffles that took five and a half decades to be prepared, everything else tasted just as good as it looked. I wasn't disappointed, although my risk of getting diabetes surely did go up by thirty five notches.\nNote: if you spot anyone holding a glass of champagne, don't get too excited, just know that they're sipping iced tea. The Kingsbury's evil yet fancy way of serving iced tea in champagne glasses is why I have trust issues.\nOverlooking a couple of trivial glitches, the food was top-notch.\nHosted by The Gourmet Station, a pastry shop next to the lobby, the atmosphere is relaxed especially with the glass panelled wall giving you a view of the pool. The seating, however, was rather odd with different coloured chairs strewn around, adding zero glamour.\nIn terms of service, the staff were happy to help, but there wasn't anything extraordinary about it.\nAt Rs 1,980, this isn't your everyday indulgence, but with a large range of great tasting food and a relaxed ambience, The Kingsbury High Tea gives value for money.\nFinancial tip: Skip meals before and after High Tea to soothe the pains of your wallet.\nBuffet tip: Get access to our comprehensive guide on preparing yourself for a buffet\n.\nGeneral tip: Call 0112421221 for reservations early as their High Tea is frequented by many and tends to be at full capacity on most days.\n",
  "url": "https://www.yamu.lk/blog/high-tea-at-the-kingsbury"
}