{
  "title": "High Tea at the English Cake Company",
  "abstract": "The English Cake Company has one of the best high teas in town - it's cheap, generous and you even get to customize…",
  "author": "Shifani",
  "date_published": "11:07am",
  "content": "The\naka The Cakery has been known for their quality baked goods,\nbut they also do what we think is one of the best value-for-money high teas in\ntown.\nFor Rs. 990 per head (you need a minimum head-count of two people though), you \nget a there's-too-much-food-here assortment. Every\nmorsel is delicious, and you also get to customize it to your own\npalette.\nUnlike at hotels, where you typically get high teas, and only on certain\ndays and times, at the ECC you can call them up a day before on 0112 501 344\nand reserve your high tea for whatever time. When you get to the counter, they\nhave the delightful option of customizing what exactly you want to\nhave.\nStep 1 was choosing your stacks, and they've got a great range of these\ngrilled sandwiches - tuna, smoked salmon, garlic prawns, cuttlefish and veg\noptions like roasted pepper, tomato, cheese, roasted vegetable, cheese, pol\nsambol and seeni sambol. There's one stack split into four mini sandwiches, and\nwe asked for two stuffings - roasted vegetable and garlic prawns. The prawns\nwere juicy and flavoursome and the veg sandwich was an interesting surprise,\nstuffed with a whole load of tasty veggies, mushroom and melting\ncheese.\nStep 2, 3 and maybe 4 - I lost track - all were cake related. You basically\nget to pick a new cake from every row of their glass display case. We got some\nchocolate cookie, baked chocolate, passion fruit and cheesecake, and everything\nwas unsurprisingly soft, gooey and made from high quality ingredients. My\npersonal favourite was the cheesecake and blueberry - very soft, creamy, with a\nyummy crumbly layer of biscuit at the bottom. Also the classic chocolate\nbrownies with cream were da bomb.\nYou also get to pick what kind of tart you want - this was another one of my\nfavourites - the smoked salmon tart. This was perfectly and freshly baked,\ncrisp at the edges, with warm, tender shredded salmon at its centre. It's the\nCake Company, but I enjoy their savouries way more than the\ncakes.\nFinally you get to pick your drinks - any of the bottled juices from the\nfridge or from the long menu of hot and cold coffees. We got a tall, cold glass\nof hazelnut and chocolate blended with coffee, and the cafe mocha which came\nrecommended. They won in this department as well - ridiculous, I know - very\nskilfully blended ratio of chocolate and coffee that very, very few coffee\nplaces in Colombo manage to pull off.\nThe ECC is a very small space, with two tables inside in the A/C - we'd\nsuggest you sit outside though, it's quiet with a nice review of the sky and\ntrees on this residential street.\nService is generally excellent here because it's such a small space, so\ninteraction is pretty much 1:1. The people behind the counter were extremely\nfriendly and helpful.\nWe left this high tea very happy and very stuffed. Unlike at your typical\nhigh teas / buffets, these guys also let you takeaway whatever you can't finish\nwhen you're there. If you just visited on a random day and individually bought\nthe goodies we had, you'd probably end up spending about Rs. 3000+. So for Rs.\n990, this is an amazing deal, and they get extra points for the range of\nselection and customization available. If you're looking to do a high quality\nhigh tea, this one should be way up on your list. We'd give it a 5 out of 5.\n",
  "url": "https://www.yamu.lk/blog/cakery-high-tea"
}