{
  "title": "High Tea at Mt. Lavinia Hotel",
  "abstract": "Mt. Lavinia Hotel does an excellent take on classic high tea. The price is very reasonable, the terrace setting…",
  "author": "Bhagya",
  "date_published": "10:12am",
  "content": "Mt. Lavinia Hotel does an excellent take on classic high tea. The price is very reasonable, the terrace setting is beautiful and pretty much every element was delicious.\nWhen it comes to food at hotels, Mt. Lavinia Hotel ranks right up there with the best of 'em, and their high tea is no exception. We loved the\n, but if you're looking for something more classic, MLH is a great choice. It's available\nand priced at\n, which is pretty reasonable.\nUnlike\n, you aren't getting a buffet here, but we feel that the overall quality of the individual elements were much higher. Properly speaking, high tea isn't supposed to be about large amounts of food, rather a well curated menu of snacks and sweets, which is exactly what this was.\nYou get around five types of savouries and seven types of sweets, along with a choice of tea, coffee or iced coffee.\nThe one thing we would have liked to see here would have been a few more savouries, since the ones we got were so good. I'm generally all about meats, but in this case I actually didn't really notice the fact that most of them were either seafood or vege based. We particularly loved the seafood vol-au-vent with its light puff pastry and creamy, well seasoned seafood filling.\nThe real draw, however, was the sweets. We were kind of expecting the sweets to be fantastic after trying out the dessert spread at their\n, and they did not disappoint. The first thing is that every element on the plate was beautifully presented with a good amount of workmanship going into each of them. There was also a good contrast of flavours with the chocolate pyramid, pistachio cake, Battenberg cake and a fresh strawberry tart.\nWe have to make a special mention for the scone, which was just perfect. It's served along with a clotted cream and a berry compote. The scone itself was soft and rich with the sweetened cream and tartness of berry compote coming together to make for a perfect marriage of flavours and textures.\nMt. Lavinia Hotel is one of the better looking hotels around Colombo with its British Colonial Architecture and oceanfront location. The high tea is held at the terrace, which directly overlooks the ocean. The sea breeze can be a bit heavy at times but in a country as warm as ours, that's actually a good thing more often than not.\nThe service at MLH has generally been professional, fast and consistently pleasing. This time the service was a bit slower than usual, but we didn't really notice it much while enjoying the view.\nThe High Tea at Mount Lavinia Hotel is probably one of the best deals around, specially since it's priced lower than most. While it wasn't a massive spread, the stuff we got tasted great. We'd give this a 4.5 out of 5.\n",
  "url": "https://www.yamu.lk/blog/high-tea-at-mtlavinia-hotel"
}