{
  "title": "High Tea at rare (Uga Residence) 2017",
  "abstract": "Rare has been a go-to for High Tea since they first opened up. Here's what our most recent experience was like.",
  "author": "Sarah",
  "date_published": "6:26pm",
  "content": "has been a go-to spot for High Tea since they first started. We heard that they've introduced a bunch of new items, so we decided to drop in and see how they're holding up since\n.\nThey've gone through the roof with their new price at Rs. 3,500++ per head since last year when they only charged Rs. 1,500++. We're not sure what justifies this massive hike.\n\nUnfortunately, the short-eats were middling at best and they've reduced their portion sizes since last year. I understand that they're incorporating a minimal aesthetic into their meals but in terms of price it's just too exorbitant.\nThe first tier is, of course, the best part: scones, clotted cream, strawberry jam and orange marmalade. Sadly, the scones didn't seem fresh and were rather spongy in terms of texture as if they were a day old. This is easy to look over once you pair it with the excellently prepared strawberry jam and orange marmalade. The strawberry performs a delicate little foxtrot across your tongue but the orange marmalade delivers a nice sharp tinge; a perfect combination of flavour!\nThe second tier consists of light, savoury snacks like cucumber and tuna mini-sandwiches, a pulled pork slider, and other little edible knick-knacks.\nWhile most of the savouries were delicious, there isn't really anything about them that bedazzles the taste buds in terms of inventiveness or variety. My chum says that the pork slider was alright but it tasted a lot like beetroot so I don't know what happened there. The rest of the short-eats were rather dull but tasty nevertheless.\nAh, the final tier. Strategically placed atop the slate coloured marble surface, were a few decadent and sugary bonbons. The best were the little snifter containing an exquisite tiramisu with notes of cream cheese and coffee prevailing through the minuscule ladyfingers, and a blueberry pannacotta that boasted a nice, tart flavour. The other pastries included were an eclair with hardened chocolate icing; an absolute no-no darling, a little strawberry custard tart, some enigmatic choux pastry and a macaron. You would expect the macaron to be the most perfect of the lot, but alas it was rather bland.\nWhat is high-tea without tea? Sacrilege. We were presented with a dear little tray containing all the different types of teas they served. You can pick and choose amongst many delicious teas like rose hibiscus. We opted for the Ceylon lemongrass and received a little pot that serves two. They also provided two little hourglasses that indicate brewing time in case you're a perfectionist.\nThe tea itself was delicious of course but there wasn't a citrusy tinge that is expected of lemongrass. Still, it was a nice refresher and certainly calms you down if you sip slowly enough.\nThe waiters are rather distant here which is fine, they don't dog you all the time and leave you to your business. However, you are only so lucky if you spot one from afar and madly wave your hand around to grab his attention. Again, I'm not complaining as we didn't really need much. They're very polite, know their way around the menu and if you're in a bit of a fix deciding what type of tea you wish to indulge in, just ask them and they'll give you a suggestion.\nI hugely suspect that such a large price is only required due to the magnificent ambience that rare provides. The vintage couches, rustic ornaments and dim lighting make the place very homely. It's like you're visiting your grandma but she decided to spend her retirement savings on posh furniture and add a lot more pomp to her surroundings. It's quiet and it's perfect if you want to get away from the Colombo bustle for a few hours.\nIt breaks my dear heart to tell you that I'd recommend this place if you're interested in luncheon or dinner but certainly not for high tea. But if you must, then do go ahead and remember to take your camera with you because this place deserves to be on your Instagram.\n",
  "url": "https://www.yamu.lk/blog/high-tea-at-rare-uga-residence-2017"
}