{
  "title": "Horoscopes And Marriage",
  "abstract": "We recently had this question on our AHAMU section: \"We had to end our relationship because of her parents objecting…",
  "author": "indi",
  "date_published": "1:25pm",
  "content": "We recently had\non our AHAMU section:\nWe had to end our relationship because of her parents objecting it due to horoscope mismatches.\nWe were very good for each other, never felt any differences, but now she has to settle with someone their parents find with a good horoscope match.\nWe are grieving in two ends when we can get together and live a happy life. Unfortunately she has no choice but to listen to her parents. Such an unfair world this is.\nI found this very sad and thought I'd write something. The big issue here isn't the horoscope. It's the parents.\nAstrology is not a science. If you go to multiple astrologers they'll give you multiple answers.\nFor one thing, the astrological charts are completely off from the actual position of the planets. The idea that planetary bodies influence human affairs in predictable ways is in itself suspect, but astrology doesn't even have their positions right.\nFor another, all readings are done by humans who read both the stars and the people they're talking to.\nVery often an astrologer will sense (or be told) what a family wants and then give them the answer they want to hear. If the family doesn't like the answer, they'll often go to another astrologer.\nThe biggest problem this young man has is that the family seems to object to the match. The horoscope is just them getting a rubber stamp on what they already feel, and that is the problem.\nIt is easy to say that a marriage is between two adults and nevermind the families, but family can put a lot of pressure on a marriage and make it miserable. That said, many many people marry over the objections of their families and they usually come around, at least once a child is born.\nAlso - and this is important to remember - no one can make you marry or not marry. It is a legal agreement between two adults, and it is a serious one. If you ever feel like you're getting forced into marriage, please contact someone and get out, because you have a right to decide.\nBeing forced\nof a marriage is, however, another thing. There's no particular legal recourse there. I mean, you can of course go and get registered and no one can stop you (you don't need parents, just witnesses). But you still need the girl to go with you.\nFundamentally, if you want to get married you can get married. Couples have overcome more obstacles than mismatched horoscopes before.\nSo, you do have a choice, and it's not that it's an unfair world (though, in general, it is). It's just that it's certainly not an\nworld, and it's not an easy decision.\nIt is actually very hard to predict a happy marriage and a horoscope is not a fundamentally worse way to pick a mate than whether you like the same music and went to the same tuition class. Marriages all get hard and they're all buffeted by forces outside of your control.\nSo, perhaps consider this a test. There is a conflict here, and as a married couple you'll have to deal with many more. So how do you as a couple deal with this issue? How do you talk, how do you negotiate, how do you fight, and how do you manage your families? Those skills are actually good predictors of a healthy marriage, and in that way this malefic horoscope is a good test for you two.\nIf you can overcome the stars (and her parents) then you can probably overcome anything. If you can't, then you may have just avoided a difficult marriage.\n",
  "url": "https://www.yamu.lk/blog/horoscopes-and-marriage"
}