{
  "title": "How To Disappoint Your Parents  in 8 Easy Steps",
  "abstract": "If you ever feel like being a disappointment or if you ARE a disappointment and wish to continue carrying the torch then fear…",
  "author": "",
  "date_published": "10:22pm",
  "content": "It doesn't matter if you're new to this zone or if you've been wallowing through these deep waters ever since you've failed your O/Ls because satisfying ammi and papa is a herculean task and not many of us make it out alive. But here are a few little tips if you feel like disrupting the parental zen every now and then and giving your parents a hard time - no matter how old you are.\nUnless your folks have connections and you have nothing better to do than apply for a few generic competitions, then making it as a writer/poet/free thinker is going to be heavily looked down upon. The reason for this is probably because since Sri Lanka is a heavily traditionally narrow-minded nation, the idea of liberals or free-thinkers stepping up and causing a stir is usually deemed an atrocity. The frustration gets worse if you fail in the creative industry as well. Doesn't matter if you've come in 2nd place out of a 100 applicants, if you haven't won then you can take your meagre certificate and gtfo.\nThis is a guaranteed way to get the family bloodline boiling with rage. It doesn't matter if the significant other in question comes from a bloodline as pure as the springs of Badulla or if he's a sweet chai wallah, if he/she ain't strictly a member of your religious community he/she's going to be excluded. End of story.\nIf you're a rainbow rider, I'm so sorry. Thanks to the official criminalisation of homosexuality/homosexual acts, life isn't going to be a smooth ride (haha). Not only will you be letting your parents down, you'll also be making them fear for your life because if you're engaging in the salacious act of being naturally attracted to a member of the same sex you'll be put behind bars. I don't know if it'll be with members of the opposite sex but yeah it's a bad thing either way.\nGod forbid you should go into say; woodwork instead of donning the stethoscope and spectacles. If you're already a doctor, then I don't know how you've managed to disappoint your parents but congratulations. The idea of a 'proper' profession is only limited to being doctors, engineers, aircraft engineers, vets and the like.\nOver 22 and making a career for yourself instead of a family? HAH what a joke. Not only are you the very epitome of a let-down you're also letting your baby devices dry up and in due time they'll stop functioning. Don't want that now do we,\n? Independence is celebrated with aplomb here but if you're still single over 21 and in some cases 16, then the only independence you'll have is the free thoughts of a 1001 relatives shaking their heads at your parents. You're making your own money, about 30 years old, and want to live on your own WHILE UNMARRIED? HAA! You get bonus DP (disappointment points, that is) if you're a woman and single.\nOne of the biggest mysteries in life is the fact that relatives demand communication and ties from you even though you want nothing to do with them. Even if your parents don't care whether you're on good terms with this awful species of human, they will still find a way to wheedle into your life like some unwanted parasitic presence and thus cause inconveniences like pressure to get married, pressure to find a 'proper' job, pressure to pop out a baby etc etc. Not only is it unhealthy, it's also completely unwarranted and unnecessary stress. I recommend bringing up homosexuality because nothing makes them shut up faster than the butterflies. Death stares and awkward silence? Absolutely worth it.\nThis is for you erudite demagogues out there. Throw all your A/Ls out by joining a band or bartending on the weekends. Throw in some freelance illustrating jobs. Don't work at a reputable insurance company. Don't go to medical college. If you're abroad at university then skip the books and hit the booze. Leave your teachers aghast and your parents confounded as you blaze down the streets of Mirissa on a Yamaha.\nAh you little rabble-rouser. Just imagine the look on\nface when you tell him you'll be going into yoga-influenced pottery when he has high hopes of you taking over his plantations. Enough to soothe your rebellious heart. A lot of people I know have fallen prey to the cold shoulder from their fathers when they've decided to deviate from the steady stream of family trade. A moment of silence for these brave warriors.\nParents will be parents. You'll always be their little\neven if you let them down. Granted it'll take some getting used to but in the end they'll come around and once they do, their support and encouragement hopefully will be unwavering. Here's to all mums and dads out there. We'd never be able to let you down if you hadn't brought us up. We love you!\n",
  "url": "https://www.yamu.lk/blog/how-to-disappoint-your-parents"
}