{
  "title": "How To Pick A Charity",
  "abstract": "To find out which charities are credible, we’ve put down some do’s and don’ts when it comes to choosing a charity…",
  "author": "Rishani",
  "date_published": "12:49pm",
  "content": "Are you one of those people who want to make some changes in the big, big world, but have limited time to get involved hands on?\nTo find out which charities are credible, we’ve put down some do’s and don’ts when it comes to choosing a charity to give to.\nFirst off you need to find out what your interests are. What causes or cause should your money to go to? You should ask yourself, \"What is important to me?\" The environment? Education? Hunger? Animal welfare? Helping sick children?\nWhere should the charity do its work—in your neighborhood, region, the nation, or internationally?\nAsk yourself if you want to support a large or small charity, a new or an old one.\nDo this before you open your checkbook. How? The best possible way to research the charity is check out their websites and if they don’t have a website, their Facebook page and if they don't have one of those - volunteer a couple of times on their projects. With big named charities and non government organisations, it's very easy to run a Google check.\n(\n)\nWith smaller charities, the easiest way to check for transparency and credibility is to check back with those who have volunteered with the charity and word of mouth and by volunteering on their projects.\nAlmost all small charities are either affiliated to a government based organisation, a corporate, a faith based organisation, or are registered as a charity (or not). Most times the reason a charity is not registered is because it requires a lot of money to register a charity as a charity (at least in this country).\nwill have clear mission statements and an idea of what they do through their programs and should be able to articulate it or share their literature with you. They will have measurable goals and know how to achieve them or are achieving them.\ncompare with similar charities who are involved in the same type of work. Some charities are very good at extending every rupee you give while others spend way too much on administrative costs.\ncharities that won't share information. Well known charities and nonprofits discuss with their potential donors and donors about finances and how they plan to utilise donor money. Charities of ill repute use pressure tactics to acquire your money, refuse to provide detailed information about its identity, mission, costs, and how the donation will be used.\nIf you still have doubts about a charity, don't contribute to it. Instead, find another nonprofit that does the same kind of work and with which you feel comfortable, then make your donation.\nNow that you know, please make your way to\n, to connect to a charity. We have also included a few places to get you started in the right direction.\nThe Off-Road Feeding Program is run by a gent fondly named Uncle Nihal by those who know him. You can find him feeding road dogs at various locations every single day. Thanks to Uncle Nihal, some of the lucky strays have a meal. It takes a lot of funding to feed over 125 dogs and funds, most times are scarce.\nADSL rescues, adopts and rehouses street pooches. if you are looking to give an orphaned doggy a forever home ADSL is your safest bet.\nWhile rehoming puppies is our main aim, it is not the only project we do. We also try to help adult stray dogs on the road too. One of the major issues we try to tackle is the ever increasing stray dog population. We conduct sterilization camps, using an expert team of vets in rural areas in the country in order to help prevent the stray dog population.\nThe AWPA is the Animal Welfare & Protection Association, and they've got two animal shelters for kitties and dogs.\nThe Cat Protection is a non profit shelter for abandoned cats. It is runs soly on volunteer help and donations by well wishers. The Cat Protection Trust's aim is to create awareness for Sri Lankans of the on-going problem of animal cruelty and neglect that souls like Indira feel responsible for and work hard eradicating.\n\nis home to both males and females. No 28, D.S.Kahawita Lane,Attidiya, Dehiwala\nis home to both uncles and aunties.  No 27, Pamunuwila Road,  Makola.\nThe Lankhadara Society is home to both elderly aunties as well as uncles. They also have seperate homes for orphaned children.\n\nis a charitable organization which helps educate visually and aurally impaired children and help to integrate them in to society.\n\nThe Sri Jinananda Home located on Dharmarama Road, is home to sixty underprivileged boys.\n, Sri Saranankara Road, Kreeda Mawatha, Kalubowila.\n\nShilpa Chirldren's Trust, 45/92, Nawala Road, Narahenpita,\n",
  "url": "https://www.yamu.lk/blog/how-to-pick-a-charity"
}