{
  "title": "How To Watch Netflix On Your TV (Sri Lanka)",
  "abstract": "Since Netflix arrived, we realized that not everyone may know how to watch Internet video on their TVs. Here are some…",
  "author": "",
  "date_published": "2:35pm",
  "content": "Since Netflix arrived, we realized that not everyone may know how to watch Internet video on their TVs. Here are some options. They apply to Netflix but also to Internet Video in general. To read about\n.\nThe easiest option, once you get it set up, is a Smart TV. The interfaces can be a bit janky, but for something like Netflix it lets you use a remote, which is still the best way to watch TV. Smart TVs are basically regular TVs that have Wi-Fi or some other way of connecting. This is the cheapest full HD one we could find on Takas (a\n) and if you want Ultra-HD, this\nis good.\nAn HDMI cable will let you connect most laptops to most TVs. You can get cables at Unity Plaza or almost any streetside phone/electronics shop. These can be as low as a few hundred rupees, but note that these connections sometimes just stop working. It may be worth getting a branded cable (pushing 2k) from Takas or the like.\nThis\ncosts Rs. 2,975 and means your laptop doesn't need to be right next to the computer. A\n. Both are from Dick Smith and are unlikely to break. If they do feel free to whip the Takas CEO with stingray tails.\nThe major problem with HDMI is that you can't control the TV without getting up. You can get around that by using an app like Remote Mouse or something similar to control your computer via your smartphone/tablet. That's also annoying in its own way.\nIf you're getting anything from abroad, a Chromecast may be a good idea. This little USB stick (basically) plugs into your TV and then lets you project whatever's playing on your laptop onto the TV. It works pretty well, especially since Netflix supports it quite well. You can even run Netflix on your tablet or phone and cast it onto the TV, so no computer required. Chromecast also works for playing other web video or whatever you've downloaded onto your computer.\nThe major downside is that the Chromecast isn't really available in Sri Lanka. You could find it on\nmaybe, or order through\n. Note that Amazon doesn't sell it anymore (because they don't like competition) but you can possibly get it down through Target or Walmart. Overall the best bet is to get someone coming down from abroad to bring it down. It officially costs $35 but you'll probably end up paying more unless a friend is carrying it down.\nAnother alternative to this seems to be the\n.\nFor about twice the price (\n) you can get an Apple TV, which will let you connect to Netflix and other services, but which doesn't come with an HDMI cable.\nIf you have a table, you can put your laptop or computer on that table, stand a reasonable distance away, and watch it like a television.\nSo those are a few ways to watch Internet video on your television. It's not a seamless experience yet (at all) but once you get into a show it should be all right. As this is a technical subject, I'm sure we've missed something, so feel free to flame-on in the comments.\n",
  "url": "https://www.yamu.lk/blog/how-to-watch-netflix-on-your-tv-sri-lanka"
}