{
  "title": "How To Recover From a Hangover",
  "abstract": "A few tips on how to become decent after a heavy night!",
  "author": "Staff",
  "date_published": "11:44am",
  "content": "Be it at a big match, a batch reunion or just a night out, it’s no secret that we Sri Lankans can handle a drink. What comes the next morning is far less fun though, especially if you’re planning on turning up for work. From how to ease the headache, to making yourself more presentable, here are a few tips on how to recover from a hangover in SL.\nAfter a heavy session, there’s good chance you just got home and passed out in bed, which means you’re gonna smell like someone doused you in alcohol by next morning. This is no secret, but a shower is the first thing you need to get you out of the daze and help you smell like a human again.\nFor an activity that requires so much drinking, a night out leaves you insanely dehydrated the next morning. Enter king coconut; god’s gift to the world. Not only does it taste amazing, thambili is an excellent way to hydrate yourself since it contains a ton of anti-oxidants, electrolytes and potassium (which is what your body really needs to recover).\nAlcohol + dehydration are recipe for disaster when it comes to your breath. Brushing your teeth as soon as you wake up is a no-brainer, but you’ll likely find that one brush won’t completely eliminate the bad breath or the residual taste of the previous night (yuck!). If you’re heading to work the next day or you’re planning on meeting other humans, you’ll want to keep some mouthwash on you. It’s far more convenient than brushing multiple times and it’ll cut through whatever residual alcohol taste or smell.\nThere’s a good chance you’ve probably heard that drinking on an empty stomach is a bad idea. There’s also good chance you still did it anyway. This can lead to some pretty nasty stomach aches, which is where the tried and tested local remedy of lime and honey saves the day. Just heat some water, squeeze in half a lime and mix in a tablespoon of bee honey. This will help neutralize the acid imbalance in your stomach.\nOnce the hangover hits you’re probably gonna be craving food and it’s easy to give in and go for some McD’s, but we’ve got access to the likes of sweet potato and manioc, both of which are excellent forms of carbs which will leave you full for a while and help balance your stomach.\nStaying hydrated throughout the day is key to getting over a hangover as fast as possible. Thambili is a great start but there’s a good chance you won’t have enough to last you throughout the day. This is where our much loved Ceylon tea comes in. It’s easily accessible and great for hangovers whether it be plain tea or milk tea.\n",
  "url": "https://www.yamu.lk/blog/how-to-recover-from-a-hangover-2"
}