{
  "title": "How To Stay Safe During The Monsoon",
  "abstract": "Sri Lanka has been experiencing monsoon rains for at least 5 million years, but they still seem to surprise us.",
  "author": "",
  "date_published": "10:42pm",
  "content": "Sri Lanka has been experiencing monsoon rains for at least 5 million years, but they still seem to surprise us. The monsoon (\n) brings heavy rain in May and June, sometimes so heavy that it snarls traffic, destroys homes and even kills. Here are a few ways to stay safe and secure this season.\nIf you can't see where you're walking, don't walk there.\nIf you've ever tried jogging in the city you'll know that the streets are full of random holes. When the streets completely flood (after as little as 20 minutes of rain) these holes become invisible, people fall into them, and in at least one case,\n. So be careful. Or better yet, just wait somewhere and don't walk down flooded streets at all.\nAlso, be aware of the fact that rubber slippers plus polished floors equals falling on your ass.\nAssume that your house will flood.\nTake some time, consider what is precious to you, and protect it. That means laminating important documents, moving or packing away books, and keeping extension cords and electrical items away from the floor.\nAlso get surge protectors for expensive TVs and computers, and turn plugs off and unplug equipment at night.\nIf you're thinking ahead, home insurance is a good idea.\nIf it rains for more than twenty minutes, Colombo traffic clenches like a fist.\nThis may mean that it's wise to leave work a bit early or late, and it may also mean that buses are packed and cabs unavailable. If you're taking cabs, you may need to try the more expensive car option on PickMe, and deal with surge pricing on Uber.\nIf you're driving be aware that the rains can mess with your car, so get it serviced, have jumper cables and a petrol can available, as well as raincoats and umbrellas.\nYou know who loves rain? Mosquitos.\nMosquitos lay eggs in standing water, of which there is plenty during and just after monsoon season. Just as we recover from the rain, mosquitos emerge, and then we get dengue, which can kill young and old alike.\nIn your own homes and offices, be extra alert as to where standing water can collect (overturned containers, clogged drains or gutters and messiness in general). Get rid of that standing water, please. If you feel like your neighborhood is out of control, call the Public Health Inspector and they will come and spray.\nInside your home, keep doors and windows closed, use those plug in insecticides or whatever you need to, and keep mosquitos out.\nIf you get rained on, everyone can see your jungies.\n",
  "url": "https://www.yamu.lk/blog/how-to-stay-safe-during-the-monsoon"
}