{
  "title": "How to Handle Heartbreak in SL",
  "abstract": "Hit a bit of a rough patch in the love department? Doesn't matter! Here's how you can get back on your feet and keep…",
  "author": "Sarah",
  "date_published": "10:22pm",
  "content": "Happy Singles Awareness Month!\nSo you got your lace and velvet ready (wink) but the s/o decided to drop the bomb on you and bid adieu. You're in boohoo central now and you hate your life. Unfortunately, you can't book it with the squad for a night out because they're busy with their dates and going to a bar alone here won't exactly be a good idea. So, what can you do to handle the grieving process? What routes can you take to avoid the sharp eyes of your older relatives and their even sharper tongues? Read on, my sweet, newly single friend and educate yourself!\nIt is highly recommended that you do not go anywhere NEAR fire in this state. Instead, you can go for a sort of mental incineration where you temporarily burn all your recent memories and moments with The Heartbreaker. Or what's a more cathartic way to deal with this is to just set maybe one or two little token objects anchoring you down on fire. It sounds a little loony yes, but it works all the same. The aim here is to not burn your house down or anything nearly as dramatic as that, but yes; set fire to the pain and arise from the ashes as a new person.\nOkay, this goes without saying, but having conversations with your relatives after a fresh breakup will lead to nothing but judgment and depression. A lot of people will agree with this, thanks to the endless and mindless questions about your future and your decisions. 'What will you do now?' 'Why did this happen?' 'Did he/she cheat on you?' 'Is this because you put on?'\nAlso, let's not forget the fact that you WILL be a topic of gossip for many brunch dates and tea parties to come. Depression is inevitable.\n\nRemember the good old days when you had your friends until you decided to block them from your phone and your life thanks to your relationship? Chances are, if you're lucky, they'll definitely forgive you and give you some excellent pal-therapy. Go to the bowling alley, go watch a movie and just bask in good company.\nThis isn't even sarcasm because we're well known for producing some heart-wrenching, dramatic music. Indulge in some biscuit-kudu beats, or a nice mellow tune to get the tears flowing. Better out than in, I always say!\nSTAY AWAY FROM TRAIN TRACKS. Rebounding off a train isn't really convenient is it now? Also give Death the day off, jeez.\nDo NOT go anywhere near the balcony. Stay away from large bodies of water. We need you. The earth needs you.\nYour future needs you.\n\nBecause we produce some quality, if not hilarious, content that'll keep you in a good mood. Find a restaurant you like and take the boys out for a nice brunch session. Or look up some of our tutorials and hold a little bake party at home. You'll be\n, of course, nothing else.\nIf you're prone to release through anger then a great way to do it is to\n. You'll be grateful you started because not only will you leave looking hot as heck, but exercise boosts serotonin in the brain and you'll be flushed with a sense of fulfilment. In a few months, you'll be in love with someone else: The New You!\nThis last one is a universal tip. Nothing can come close to mum's cooking. So whether you're heartbroken or you've failed at something, or your mum is simply mad at you for failing something; the best thing to cope with is her homemade bites. Be it rice and curry,\nor even string hoppers nobody makes it like mum does. A guaranteed way to make you feel better at any given time.\nThere's really nothing to getting over a breakup once you've set your mind to it. Our hearts are tougher than we think and all the heartbreak in the world can't stop you if you keep a clear head. I know this is difficult but it gets better with time.\n",
  "url": "https://www.yamu.lk/blog/how-to-handle-heartbreak-in-sl"
}