{
  "title": "How To Not Get Pregnant",
  "abstract": "We're here to help you avoid unwanted pregnancies.",
  "author": "Aisha",
  "date_published": "11:23am",
  "content": "The only 100% surefire way to\nbecome pregnant if you're a fertile young woman is abstinence, but I'm sure you all know that. The second option is to use contraceptives; and this is sometimes difficult in a culturally conservative country like ours, especially if you're unmarried. Luckily, there are contraceptives that you can easily get off the counter at pharmacies, or organizations who are more than willing to help you out by providing medical support and services. The\nand the\nare both unreliable.\nTl;dr, there are quite a few long term and short term methods to avoid pregnancy, even for as long as 10 years without any chemical alterations. Here they are.\nOne of the more obvious options, condoms are about 98% effective in preventing pregnancy. It's also one of the only ways to prevent Sexually Transmitted Diseases (STIs), and doesn't involve hormonal changes; basically, the condom and the IUD are the only things which doesn't have a role in controlling your hormones.\nYou can get a pack of condoms (3 a packet) for as little as\nor as much as\n, depending on the brand.\nof the price list, whilst\nYou can order these online (sites have been hyperlinked), or get them at any pharmacy.\nOne of the more popular OCPs here is Mithuri (manufactured by Bayer Schering Pharma, Germany), and is easily accessible from any pharmacy at just\nIt contains low doses of Estrogen and Progestine, which are basically female hormones. The packet lasts a month, and also helps to regulate your periods and reduce cramps and pains. There are 28 pills, of which 21 are the hormone ones and the rest are placebo pills: you get your periods as soon as you stop taking the hormones and start on the placebo. Given that you're supposed to take this\nat approximately the same time, the placebo pills are in place to help you maintain and not break the habit.  Keep in mind that there are quite a few oral contraceptives available, and you should consult a doctor to help you find the one that best suits your body.\nAs the name implies, this is for emergencies and should be taken within 72 hours of unprotected sexual intercourse - for example if the condom breaks. Gynos strongly recommend not making this a habit, and this could cause painful cramps and\nor periods. There are six brands available and recommended in Sri Lanka, including Emcom, Madonna, Pill72, Postinor 1, Postinor 2, and Pregnon.\nPostinor 1, Postinor 2 and Pill72 have been vetted and\nsuch as the World Health Organization, the US Food and Drug Administration, and European Medicines Authority.\nYou can find Postinor 1 and Postinor 2 for\nand\nrespectively, at any of your local pharmacies or at the FPA.\nRemember though, it's more effective\nas its effectiveness decreases closer to the 72 hour deadline and you can still end up becoming pregnant.\nThe Intrauterine Device (IUD) is a T-shaped copper and plastic contraption that's inserted into your uterus by a professional medical personnel. It prevents sperm from reaching the egg, and the copper also acts as spermicide.\n, and can be removed (again, by a doctor only) any time before that. It doesn't disrupt your ability to conceive, and a woman can get pregnant immediately after removal.\nWhile many doctors here say it's only inserted in women who have already given birth, the Family Planning Association (FPA) does it for anyone regardless of their marital or parental status.\nThe price of a Copper T IUD is just\nGiving you protection for upto 5 years, two tiny incisions are made in your upper arm to insert a couple of thin plastic rods under your skin. Depending on the brand you get, it either releases etonogestrel or levonorgestrel. The FPA has Jadelle (just\n. This can be removed at any desired time, and you can conceive directly after its removal as well. It boasts of over 99% effectiveness.\nTo be administered once in every three months, the injection is more than 99% effective and is great if you don't want to worry about the hassle of remembering your pills every day. On the downside,\n, so if you have any side-effects (\n) you'll have to live with it until its effects wear out. It also can take as long as one year for you to become fertile again, so this isn't your best option if you want to conceive as soon as you stop contraceptives.\nYou can get Depo-Provera for\nIf you want advice on contraceptives or family planning methods, you can visit or call up the\n(FPA), who are more than willing to offer help, support, and reproductive medical necessities for a nominal fee with no questions asked.\n— including check-ups and services — can be obtained at their head office at Buller's Lane, Colombo 07. If you have any questions, drop a comment or buzz them up for professional help at 0112 555455. They're open from 8 AM to 4:30 PM.\nThe FPA also has\nin the Batticaloa, Mankulam, Ampara, Kogalla, Nuwaraeliya and Maradana areas.\nFor more comprehensive advice on sex, sexual health, contraception, and STIs,\n",
  "url": "https://www.yamu.lk/blog/how-to-not-get-pregnant"
}