{
  "title": "Ice Cream Taste-Off (Premium Brands) 2014",
  "abstract": "The local ice cream scene has come a long way during the past decade with most brands now offering their very…",
  "author": "",
  "date_published": "5:01pm",
  "content": "The local ice cream scene has come a long way during the past decade with most brands now offering their very own \"premium\" ranges, some good and others... not so much. We visited the major local supermarkets (Arpico, Keells and Cargills) to see which\n. With the Christmas season in full swing we decided to try out the new seasonal flavours and add them to the list. If you want\n.\nWe ordered the table from best to worst in case you just want to read it quick. The new ones we added in December are in red. Some of those are seasonal varieties.\n\nWe ordered our reviews worst to best cause it's funnier that way.\n\n\nFirst off, this isn't really a premium ice cream but we wanted to try out the newly revamped Alerics. Sadly though, this one was pretty awful. Pretty much the only one of the lot that no one wanted to have another spoon of. Checking the ingredients we noted that it doesn't contain any real chocolate just cocoa powder which is probably why it tasted so cheap.\n\nYou do get a lot of it though, 1 liter for Rs. 260.\n\n\n\n\n\n\n\n\nWe had high hopes for Cargills since their normal range is pretty good, but honestly, their premium offerings were a bit of a letdown and at Rs. 475 for 500 ml they're a lot more expensive than Elephant House. The mixed berry in particular was far too sweet and syrupy. The first reaction most of us had was that it tasted like medicine.\n\n\n\n\n\n\n\n\n\nSo this is the only premium ice cream by Kotmale we could get our hands, but apparently they have a couple of other flavours as well. This one undoubtedly tastes artificial but it's the good kind of artificial. It does contain trace amounts of fruits but oddly enough they don't come up in the list of ingredients. At the end of the day, however, we expect a bit more from a premium ice cream.\n\n\n\n\n\n\n\n\nThis one was not bad but nowhere near as good as Carino's offering, but then again this is at half the price. The good part is that this had whole lot of dark chocolate chips in it. The not-so-good part was that the ice cream itself was pretty much the usual Cargills chocolate ice cream.\n\n\n\n\n\n\nWe missed the Richy Rich by Kotmale, on our first round but we finally managed to get our hands on it and it's actually quite good. Like the name suggests it is quite rich in flavour and very generous with the cashews. The only issue we had was that it was a bit watery, but overall it fared well.\n\n\nThe usual caramel and butterscotch ice creams we get are basically vanilla ice cream with a caramel topping or butter scotch pieces. This one though, screams of caramel. It's very creamy but not for everyone though, since the flavour can be quite overpowering.\n\nThis is a high quality ice cream, but it's sort of an adult ice cream as well. They also have an excellent salted caramel. It's not what you'd want for most kids or even young adults, but if you're looking for a sophisticated ice cream, Carino's is good.\n\n\n\n\n\n\n\n\n\nElephant House does a pretty good job of delivering on the promised flavour. This is more or less vanilla ice cream with crushed cookies. There's a lot of cookie in it so it does change the consistency quite a bit. If you grew up eating ice cream with Milo, chances are you'll like this very much.\n\n\n\n\n\n\n\nIf you're looking for a berry flavoured ice cream, this is our recommendation. Elephant House has really stepped up its game with their premium range. This one was easily the best of the three berry ice creams we tried, with tons of included strawberries, blueberries, raspberries and blackcurrant in it.\n\n\n\n\n\n\n\n\nSo right off the bat you'll notice that these guys are easily the most expensive of the lot, but that's because they don't use any artificial flavours. This was the best of chocolate flavours we tried. Basically high quality ice cream with high quality ingredients at a high price.\n\n\n\n\n\n\nWith Christmas around the corner, we've got the seasonal and limited edition premium flavours from both Elephant House and Cargills. We saw a few more flavours by Cargills advertised in the news papers but they were not available even at one of their main outlets.\nCargills once again find themselves at the bottom of the list with their limited edition Blueberry flavour. This one suffers from the same shortcoming as their Mixed Berry, tasting very sweet and artificial, despite the addition of actual blueberries. The colour of the ice cream being a very unappetizing gray doesn't really help the cause either.\nThe Rocky Road by EH, at Rs. 675 is priced slightly higher than their usual premium range. This one was quite fun to eat and definitely a unique entry on this list with their addition of marshmallow. It looks a little odd as soon as you open the lid but once you dig into it, it actually tastes pretty good. The marshmallow isn't the usual texture we're used to, instead it's lighter and fluffier, somewhat like a soft meringue.\n\nElephant House has brought back their popular Winter Slice this season as well, and it's pretty great. It's basically a layered loaf with vanilla, chocolate and coffee ice cream. The general consensus at YAMU HQ was that this was the best of the bunch, both in terms of presentation (though we kinda' failed at cutting a slice) and flavour.\nFor 'adult' ice creams, Carino's is excellent. Sophisticated flavours, natural ingredients. For everyone, however, Elephant House is the winner in our books.\nWe tried what we call 'premium' ice creams, the more expensive varieties that you find in supermarkets rather than kades. With the exception of Alerics, which we thought we'd give a chance, but we needn't have. For each brand we tried to get two flavours (where possible).\n",
  "url": "https://www.yamu.lk/blog/ice-cream-taste-off-premium-brands"
}