{
  "title": "If You Get Hungry At Lanka Comic Con, Here's Where To Go",
  "abstract": "After a hard days geeking out at Lanka Comic Con, you could hit these places up for some recharging",
  "author": "",
  "date_published": "9:05pm",
  "content": "Lanka Comic Con is just around the corner. I'm sure all of you are getting your groups together, putting the final touches on your cosplays and brushing up on that last bit of geek trivia.\nIf you don't know what Lanka Comic Con is we can only assume that it was very comfortable rock you were living under. Lanka Comic Con is a celebration of Sri Lanka geek culture. While usually geek culture would have you thinking of science fiction, fantasy comics etc. from the \"West\", here you can find something more, with a distinctly Sri Lankan flavour. You can find more details at\n.\nHowever we aren't about to talk about Comic Con. We're about to do you a solid and tell you where you can grab a bite to eat and a sip of a drink after a hard days cosplay and geekery near the JDA Perera gallery where Lanka Comic Con is held.\nCafe Kumbuk is pretty much the JDA Perera gallery's next door neighbor. They make delicious food and drink sourced from local ingredients and often it's in combinations you might not have expected. It's a great place to step away from the hustle and bustle. Just remember that they close at 5 PM.\nAfter a recent refurbishment the Coffee Bean looks really nice. We recommend the outside area upstairs. However they are a little pricey and the service is so non-existent they might as well call it privacy and promote it as a feature.\nGonuts is still the only exclusive donut vendor. They now have a donut inspired savoury range as well. While they aren't as good, or as cheap as they were when they were the talk of the town, they still aren't a bad deal.\nThe Barnesbury is a nice place to chill in comfort. We love the garden area out back. You can really stretch your legs out and have a nice chat with your friends on how Saga is so much better than anything mainstream from DC or Marvel. Unfortunately the food isn't really something to write home about.\nTea Avenue is lovely cafe. The food here is your typical coffee house fare but the real attraction here is the premises. The way Tea Avenue has been designed you could have the perfect nook to hang out the way you want. Whether it's to quietly sit in a corner and read your new comic book or to have a cosplay meeting with all your friends, Tea Avenue will probably have an area for you to do so.\nCoco Veranda has been a mainstay in Colombo's coffee scene for a while now. They still have pretty good fare, and it's another good place to rest your feet and even get some work done in your Doctor Who outfit.\n\nThis is also a place that's made great use of an outdoor area. With an array of multicoloured sofas, it's pretty comfy. The food isn't bad but taste wise it's a bit pricey.\n\nIf books, coffee and cats are your thing, this is the place for you. Delicious sandwiches, coffee and juices. Great space. Plus cute kittens to keep you company!\n\nStreat360 has a big garden and exposed brick walls for a nice cosy artsy feel. We found it to be a nice place to kick back with a burger, cake and a cup of tea.\nIf what you crave is a good Sri Lankan style filling rice and curry, the place to be is Upali's. The quality of their food is a great as their patronage. Which is to say it's almost always at maximum. You might even try booking a spot through YAMU if you feel like dropping by.\nSulthan Palace is right next to Upali's and is great for some cheap good Indian food. They also have Arabian and Chinese items on their menu if you feel like a little variety.\nIf Saturday is when you're heading to Comic Con the Good Market at the Race Course is an excellent place to fill up your bellies. With a wide array of stalls with a variety of foods, the only problem you'll have is being spoiled for choice.\n\nSo there's some choice picks for places you can have a good meal around Lanka Comic Con. Remember you can always check out our\nfor location specific suggestions (just turn your GPS on first). Have fun at Comic Con!\n",
  "url": "https://www.yamu.lk/blog/food-around-lanka-comic-con"
}