{
  "title": "If You Get Hungry At The Colombo International Book Fair, Here's Where To Go",
  "abstract": "When hunting for the best books get you tired, hungry and thirsty, try these places to get some life back into you",
  "author": "",
  "date_published": "11:14am",
  "content": ". Braving this is no mean feat and will require copious amounts of strength, grit and stamina. When you run out of those things, here are some choice places where you bibliophiles can take a breather, eat, drink and recharge till your next round of book shopping\n\nThe Arcade is almost across the road from the BMICH and is your best bet for some grub that’s nearby and quick. It doesn’t hurt that it’s also an excellent place to chill, but that’s really only after the sun goes down. There’s a few places here that you can check out while you read your latest literary purchase.\n\nThe Arcade is notable that unlike the other mall food courts in Colombo, this one is actually outside. While there is some seating in the form of wooden benches next to the eateries, most of it is the black and white cane furniture outside. Unfortunately right now the furniture is showing age with constantly being baked in the sun because while there is some greenery around, there really isn’t anywhere near enough shade for it to be comfortable in the daytime. It is really great after sundown though.\nFor food you have a decent selection with Paan Paan and Sen Saal for your pastry needs,\nfor vegetarians and Lemongrass for Thai food. You also have a Tropical Juice Bar for thirst quenching and an Elephant House ice cream stall for when you need to sate your sweet tooth.\nWhile not part of the food court, you also have a Burger King outlet here to satisfy your burger needs.\n\nIf you need more of a laid back vibe on some comfy chairs you can head to the Dilmah t-Lounge. While this place feels a little cramped compared to their main branch it’s still comfortable and the tea is as good as it ever was.\n\nKaema Sutra made quite a stir when it first opened with it’s gigantic hoppers. While the hype has died down it’s still a solid place for Sri Lankan cuisine albeit at a premium price.\n\nIf you feel like Japanese after searching the book fair all day for anime and manga, maybe give Tsukiji Uoichi a try. They've got one of the most impressive Japanese menus in Colombo and their execution is excellent.\n\nIt’s the end of the day and you’ve had a long hard trek walking all over the halls of the BMICH.  You need to wet your parched throat with something with a bit of a kick but you’ll go mad if you have to go far. Maybe Asylum will save your sanity. They’ve got good drinks and a classy atmosphere. The food isn’t terrible either.\n\nIf you feel like travelling a little bit more towards Jawatta Road, there’s some places close by that we think might be to your liking as well.\n\nJava Lounge is nice if you want to chill with a nice coffee. It’s great to sit down and chat about all your new book purchases.\n\nThe Cakery is that rare combination of cheap, comfortable and good. With lot’s of space and great food this is a great place to crash when you’re tired from lugging around all those books.\n\nGiovanni’s has a loyal following here at YAMU. We love their pizza. The place may be small and cramped but the pizza more than makes up for it. But you have to keep in mind that they only open after 7 PM. So this is for more of a late-night-on-the-way-home-I-can't-cook-let's-eat-out sort of situation.\n\nThe most recent addition to Colombo's sudden Bubble tea explosion. Their refreshing fruit teas will definitely get the energy back in you after a hard day's book-fair-ing.\nIf you walk in the other direction towards Independence Square you can find a few nice places too.\nAvirate is a cosy little place right next to the Colombo Cricket Grounds. They have really great froyo and a roast paan sandwich to die for.\n\nFloor is one of Colombo’s popular watering holes. The cocktails are reasonably priced and you can’t go wrong with their fish and chips.\n\nSince it’s not everyday you hit up a book fair, maybe you should try someplace that’s a little different than your usual for a drink. Try 41 Sugar. Good drinks, good food, good ambience. Definitely try the burgers.\nThe Racecourse is pretty much in the same family as the Arcade. So there’s similar fare to be found here too.\n\nIf you go on Saturday you shouldn’t miss the Good Market. This curated collective of sustainable, socially conscious entrepreneurs is a great place to chill out under the shade of a nuga tree. On the other days the Good Market has a shop across the road from the Racecourse on the Lakpahana premises.\n\nThe best thing about Tea Breeze is the place. It’s comfortable and chill. The prices aren’t the worst either. Service could be a bit better.\n\nTsing Tao is one of the few legit fine-dining Chinese restaurants in Colombo. They strike a good a balance between authentic and Sri Lankanized Chinese, in a chic and elegant setting.\n\nIf you can find the Indian restaurant Agra there's a little bar tucked away behind it called The Manchester. Don't let the dodgy entrance fool you. It's easygoing, it's chill and it's a great place to put your feet up at the end of a long book-fair day.\n\nSo there's you have some places you can have a good meal in the BMICH/Book fair vicinity. You can always check out\nfor location specific suggestions (just turn your GPS on first). Have fun and good reading!\n",
  "url": "https://www.yamu.lk/blog/if-you-get-hungry-at-colombo-international-book-fair-heres-where-to-go"
}