{
  "title": "Iftar in Colombo 2018",
  "abstract": "A list of Colombo restaurants serving up Iftar meals and buffets.",
  "author": "",
  "date_published": "11:55am",
  "content": "The month of Ramadan is here. So, if you are looking for places to break fast during this holy month, here is a list of restaurants in Colombo serving up Iftar snacks, meals and buffets.\nMovenpick's dedicated Iftar buffet offers one of the best spreads in the city. We actually tried it and made the classic mistake of filling up on just the starters. While the starters are great, you really need to save space for their mains. Offering everything from slow cooked lamb rice, some of the best kanji we've had in a while, an excellent selection of meats and even a very comeprehensive Lankan spread. The buffet is priced at Rs. 2990, starts at 6.15 pm and will be available until the 14th of June.\nArabian Knights’s iftar set menu is excellent, valued at Rs. 1350. It includes kanji, hummus, chicken tikka, beef kofta, mini chicken burger, saj bread, shawarma, Damascus chicken, fish patties, sheesh tawouk, and even their popular beef samosa, along with a drink of Faluda and a caramel pudding as the dessert.\nYou’ve got the option to choose between two set menus, each priced at Rs.600 and Rs. 1800 respectively. Category 1 comes with dates, kanji, samosa, Chinese roll, and fruit juice, while the Category 2 has dates, kanji, biriyani, samosa, fresh fruits, and lassi.\nFor more information or reservations, call 0114723333 or 0777256303.\nChana's has a special snack menu for iftar this year which includes samosa, pastol, kebab, spring roll, satay, tikka, sherbet and chicken BBQ etc. They also do Sahur over the weekend. You can call their hotline (0113288788) for inquiries and orders.\nAt Rs. 999 nett, Indian summer offers up a set menu that contains dates, kanji, sherbet, samosa, spring roll, fruit kebab, potato wedges and a glass of Faluda.\nPaan Paan's ifthar packs are just Rs. 380, and include three savories, one sweet, kanji and dates. It's recommended to call up (0117500200) and place the orders beforehand.\nVeering off from the traditional iftars, the Cakes & Bakes restaurants has introduced a special buffet during this Ramadan season. Apart from the usual kanji, dates, and samosa, they offer up a great iftar deal with starters, mains and desserts for Rs. 950 per head.\nAt Rs. 1600 nett, Tea Avenue does an iftar set menu that comes with potato wedges, soft salad, kanji, dates, bread rolls and a jar of Ceylon punch.\nThe iftar special menu at Bakes by Bella is inclusive of 6 savouries, 5 desserts and 2 drinks of your choice, which is a pretty sweet deal for the price tag of Rs.4500 for two heads.\nReservations are highly recommended, and can be made through 077445449.\nFrom Monday to Friday, Ceylon City Hotel serves up a set menu that includes dates, kanji, wrap, samosa, patties, date shake, and fruit platter; all for Rs. 800 nett. They also have special weekend iftar buffet at Rs. 930 nett per person, with free kanji.\nThe historic Galle Face Hotel prepares a variety of snacks and refreshments for iftar including a delicious Middle Eastern Dinner on Wednesday nights. Prices are at Rs. 2480 per head.\nHead over to Taprobane at Cinnamon Grand for an exquisite iftar meal. They've got an iftar special snack menu, set menu and a buffet, priced at Rs.1400, Rs.2400 and Rs.2500 respectively.\nCafe 64 at Galadari provides a convenient way to enjoy the iftar with pickup packages which includes sandwiches, samosa, shawarma and biriyani sawan.\nThe iconic MLH has a fun spread prepared for iftar for a price tag of Rs.2900 per person. Their theme night buffets feature this iftar corner which is being hosted at the\nand\n.\nCall them through 0112711711 (Ext: 430) if you want to make reservations.\nHaving a buffet priced at Rs. 2650, Cinnamon Lakeside offers a deal that covers a wide variety of Ramadan delicacies along with the continental spread.\nFor Rs. 1190, The Sandwich Factory offers a great Iftar menu with complimentary kanji and dates. The menu includes your choice of milkshake, and shwarma, spicy crispy, tandoori chicken burger and kofta hot dog. This is for dine-in only.\nThey also have a special menu on weekends (Friday- Sunday) from May 25 - June 10, which includes grilled meat, kebabs, shawarmas and more. You can check out their Ramadan Special Menu\n.\nSo, what is your favorite iftar place in Colombo? Do let us know in the comments.\n",
  "url": "https://www.yamu.lk/blog/iftar-in-colombo-2018"
}