{
  "title": "In India, A Taste Of History In Lucknow",
  "abstract": "For Sri Lankans looking to visit Varanasi and Sarnath in India, the state capital of Lucknow is bound to be…",
  "author": "vidya",
  "date_published": "1:40pm",
  "content": "Earlier this fortnight, I had the stellar opportunity to join a cast of travel writers from around the world in exploring the splendours of Lucknow, the capital of the Indian state of Uttar Pradesh, on the first-ever Travel Writers’ Conclave of its kind organised by a state government. While the words ‘food’ and ‘tour’ were plenty to convince me to sign up, I certainly wasn’t anticipating the sensory revelation that was to follow.\nSteeped in history, and home to some of the most striking architecture anywhere in India, Lucknow proved to be a city full of surprises. Just over an hour by flight from New Delhi—and six hours by train—Lucknow is often a necessary pit stop for Sri Lankans looking to make the religious trip to Varanasi and Sarnath, both of which are significant sites for Buddhism. For those who choose to stay and spend a couple of days in Lucknow, the experience is bound to be an enriching one.\nEven as it surges ahead as the crowded, chaotic and fast-growing capital of India’s fourth-largest state, it is entirely possible to walk into the Old City of Lucknow and be transported to the 18th Century, when the city served as the seat of the Mughal kingdom of Awadh. The Islamic influence of these Persian rulers permeated every sphere of life, from dance and music to food and architecture. One of the most striking examples of Mughal architecture is the Bara Imambara, a shrine and sprawling religious complex built in 1784. Said to have been built by 22,000 labourers over six years, the Bara Imambara is jaw-dropping in its sheer architectural detail.\nA mosque that has welcomed people of all faiths for centuries, the Bara Imambara has high ceilings decorated with scalloped arches and intricate motifs, which represent the confluence of Indian and Islamic styles of architecture. Famed to be the largest vaulted chamber in the world, the main hall is also the one in Asia to not be supported by pillars or girders. Within the confines of the hall, the acoustics are so impeccable that sound easily echoes from one end to the other.\nBut the most fascinating aspect of the Bara Imambara is the Bhool Bhulaiya, a masterfully designed, three-dimensional labyrinth that can fox even the most prolific puzzle-solvers.\nDimly lit passages and narrow corridors lead to more passages, interconnected by 489 identical doorways. There’s a good reason tourists are not allowed to explore the labyrinth without the assistance of an official guide: you could get hopelessly, comprehensively lost. But once you emerge on the terrace, overlooking the magnificent Asafi Mosque and the mostly flat skyline of the city, the afternoon’s labours feel well worth it.\nAlongside the ornate monuments built by the Nawabs, the Old City also offers a glimpse into the era of the British rule over India.\nAfter crushing the prosperous rulers of Awadh, the British East India Company began to establish its presence over Lucknow in the late 18th Century. Over time, they formed a self-contained British colony called the Residency, which functioned as the headquarters of the new rulers of India. Although in ruins (and restored by the Archaelogical Survey of India), it is possible to visit the skeleton of what used to be the Residency in Lucknow.\nIt’s fascinating to walk through the roofless buildings that once served as a treasury or a two-storeyed banquet hall with a fireplace for the bitter winters. I imagined the past grandeur of the banquet hall, in particular, and the parties that are sure to have brought it to life. I paused before a defunct marble fountain, still ringed by a beautiful stone perimeter — in all my years of living in India, it was the closest I had yet come to revisiting the country’s colonial past.\nWithin the gates of the Old City, Lucknow seems to be in no hurry to get anywhere. People stand around in groups drinking hard-boiled chai, even in the sweltering October heat, while horse-drawn carriages still provide tourists with the old-worldly experience of slow travel in the truest sense. I was glad that there were pockets of the city that had resisted the lure of unplanned expansion, high-rises and skyrocketing real estate.\nAfter the sun goes down, the action shifts to the busy market of Aminabad, where everything you could ever want is available in the numerous, narrow alleyways choc-a-block with pedestrians, vendors, street stalls and a few, ill-advised vehicles. We hot footed it across Aminabad, dazzled by the piles of brightly coloured kurtas and saris embellished with the city’s signature chikankari hand embroidery.\nAlongside, casually strewn on hand carts were piles of cheap nail paint, a veritable treasure trove of street food, religious paraphernalia, papads and bangles, all for a steal. Bustling with the spirit of commerce, Aminabad is the heart of a city that’s otherwise racing to catch up with its metropolis ambitions.\nMore upmarket yet every bit as interesting, Hazratgunj is the shopping heart of the city. Here, the discerning come to buy more expensive, embroidered clothing sold by several stores, along with the generic branded fare that you can easily sidestep.\nWe spent an evening at the headquarters of the Self-Employed Women’s Association or SEWA, a collective of women that has earned a well-deserved reputation for the quality of its chikankari garments. Started as a way to promote economic empowerment among underprivileged women, SEWA is a reliable, if pricey, place to buy beautifully embroidered garments such as saris, scarves, kurtas and tops that take several weeks to be completed.\nStuffed to the gills with food (which deserves a whole different post, or several), charmed by the architecture and thrilled with the shopping, I was reluctant to leave Lucknow — a reaction I had never anticipated before I visited the city. The architecture, heritage, markets and shopping contribute to making this city the sort of place where you could spend a couple of days, and not be bored even for a moment.\n",
  "url": "https://www.yamu.lk/blog/in-india-a-taste-of-history"
}