{
  "title": "In Search of Wine-Making Nuns",
  "abstract": "What happens when you go in search of a congregation of wine-making nuns in Jaffna: you are left high and dry.",
  "author": "vidya",
  "date_published": "2:56pm",
  "content": "Earlier this year, on my first-ever trip to Jaffna, there was one item on my agenda that I was particularly keen to complete. In the market, discreetly hidden among bottles of Jaffna's famous Nelli Crush (a cordial made of local gooseberries), I had also found bottles of Rosetto 'wine', an amber-coloured liquid that the label claimed was grape juice, mixed with sugar and assorted spices. Before my trip, I had read that Rosetto wine was traditionally manufactured by a convent of nuns living in Tholagatty, near Jaffna. Ever the intrepid food journalist, I immediately took to the task of tracing the origins of this unique, nun-made wine.\nBut it wouldn't be until my second trip last month that I would actually pursue the matter with the dedication it would ultimately require. This is the story of an 80 km ride in a bumpy\nthrough the dusty Jaffna countryside in search of the Rosarian sisters — and coming up empty-handed. It is the very definition of going to any length—literally—for a good story.\nThis story would be incomplete, though, if I didn't mention Thulasi, our newly-crowned Jaffna correspondent, who gamely accompanied me on this\ninteresting journey.\nOur hunt for the Rosarian sisters started at the Thoma monastery, a little outpost of the Rosarian mission on Colombothurai Road, a little way out of Jaffna. Attached to the monastery is a Rosarian shop, where customers drop by to pick up bottles of Nelli Crush and Rosetto wine. Here, we were informed that the wine was not made next door, but instead in a place called Atchuvely.\nNo sooner had we learned this than Thulasi and I were already well on our way to Atchuvely, a town nearly 20 km away from Jaffna. The fact that the road wound through picturesque fields and village homes made it easy to ignore the larger fact that this journey was turning out to be a never-ending one. A whole hour later, we finally arrived at the blue gates of the Rosarian convent in Atchuvely, a non-descript town that would aptly describe the middle of nowhere.\nBefore we had had a chance to exhale or take in the serene surroundings, however, we realised we had arrived exactly one hour after the visiting hours had ended. (There was no telephone number we could contact, to give us credit). The nuns were deep in prayer at this time, so we would have no option but to return three hours later.\nAn interminably long ride and a swift lunch later, we were back on the road to Atchuvely, still brimming with optimism at the thought of speaking to the nuns about the wine they have reportedly made for ages. Yet another hour later, we had finally arrived at the convent, just in time to meet the sisters after their prayers.\nExcept, we were told that the sister who knew about the technique of making the wine was away — in Jaffna. Perhaps wary of unannounced visitors, the media-shy nuns expressed their inability to provide us with any more information. Eager to help, they instead pointed us in the direction of a congregation of fathers, a little distance away in Atchuvely, who would perhaps be able to tell us more about the Nelli Crush.\nIn an ideal world, this is where the story should have ended. But it didn't.\nHaving come this far, we couldn't give up without trying. So we trundled on a few more kilometres, to a rustic farm in the middle of which the fathers of Atchuvely live in a simple home. Hearing of our mission, the slightly befuddled caretaker of the property roused one of the fathers from his afternoon siesta. After listening to our now somewhat tragic story, the father said that being a visitor (and not a resident), he was unaware of how the fruit cordials were made. The main person in charge had gone to—you guessed it—Jaffna.\nAfter a minute or two of taking in this lush view, we realised there was nothing more to do, except to turn back and drive 20 km down a narrow road with picturesque fields and village homes, back to square one. If there was some consolation, it was that there was a bottle of Rosetto wine at the back of the auto, which had faithfully made the journey with us.\nThus ended our travel story that meandered through a lot of places without ever arriving at a destination. In hindsight, it seems irrelevant that we never got to the bottom of what we were seeking. For our labour, we had earned a few glasses of the most saccharine wine we have ever tasted, that may not actually be wine at all. A few glasses down, you are riding not so much an alcohol high but a precarious sugar rush that usually crashes unceremoniously. It may not quite be the finest Cabernet, but Rosetto wine from Jaffna has such a ring to it. Especially when you've gone nearly a 100 km in search of it.\n",
  "url": "https://www.yamu.lk/blog/in-search-of-nun-made-wine"
}