{
  "title": "It's Nearly Eid! Sawans This Way, Folks. (2015)",
  "abstract": "Heads up! It's time for biryani and watalappam again and here's where you can get them, if you've got no one to make…",
  "author": "Aisha",
  "date_published": "4:45pm",
  "content": "'Tis the season of Hajj, which to many Muslims is a month of spirituality and sacrifice - and shared food. The classic dish Sri Lankans share is a biriyani sawan, a big plate of rice, meat and more, finished off with\n.\nNowadays, most of us opt to order in even when it's something as significant as biryani (because it takes a serious amount of time to make, and we're all just too lazy). So we're thankful for places that cater to our carnivorous desires, by whipping up silver platters of intensely flavourful rice, more oft than not accompanied by an equally flavoursome (and intensely sweet) dessert,\n.\nHere's where to order from when it's time to binge on biryani. Get your friends together, coz these huge plates can feed an average of at least six hungry people.\n42, Horton Place, Colombo 07\n\n0112662124\n\nChicken Dum Biryani- Rs. 4,440 (large) Rs. 2,774 (medium). Mutton- Rs. 6,327 (large) Rs. 3,884 (medium). Fish- Rs. 6,166 (Large) Rs. 3,329 (medium)\n122, Kalubowila Road\n\n0114200926\n\nRs. 2,950 for chicken (plus Rs. 300 for deposit) and Rs. 3,600 for mutton (plus Rs. 399 for deposit)\n21A, 1st lane, Kirulapone\n\n0777330938\n\nRs. 3,000 for chicken and Rs. 4,000 for mutton or prawn\n124/B, S De S Jayasinghe Mawatha, Kohuwela\n\n0750222777\n\nRs. 2,500 for curry chicken and Rs. 3,300 for a BBQ quarter (chicken)\n46, Initium Road, Dehiwala\n\n0766477677\n\nRs. 3,000 for chicken and Rs. 4,000 for mutton (with Rs. 250 as a refundable deposit for both)\n50, W.A. Silva Mawatha, Wellawatte\n\n0113288788\n\nRs. 4,000 (Serves 8 people, includes beef and tandoori chicken), Rs. 3,600 for vegetarian\n21, Dalada Veediya, Kandy\n\n081 2 232765/ 0771075115\n\nRs. 2,500 for chicken\n35A, Temple Road, Kalubowila\n\n0771404052\n\nRs 2,900 for chicken and Rs. 3,300 for beef\n",
  "url": "https://www.yamu.lk/blog/the-sawan-list"
}