{
  "title": "Jaffna's Ice Cream Wars",
  "abstract": "Over the years, Jaffna's two most iconic ice cream parlours—Rio and Lingam's—have acquired their own faithful following. We…",
  "author": "",
  "date_published": "4:59pm",
  "content": "The devout may throng Nallur seeking spiritual satisfaction, but there is a pilgrimage of a completely different kind on offer not too far from the historic temple. Nallur is also home to two of Jaffna’s most iconic ice cream parlours –\nand Lingam’s Ice Cream. While there are several other ice cream parlours in the area, these two enjoy the most fanfare, and have their own legions of faithful followers. We decided to try both to see how they stack up in Jaffna’s ice cream wars.\nWe checked out Lingam’s first, as it is one of the main rivals challenging Rio’s supremacy. They had a slew of ice creams, juices and snacks on offer, all of which are vegetarian. (We’re not too sure about the gelatine in the ice cream and jelly, though).\nWe ordered their sundae special and the locally ubiquitous cordial called Nelli Crush, made famous by the nuns of Thologatti, near Jaffna.\nThe green Nelli Crush cordial (Rs. 70) is supposedly made using the extract of nelli or local gooseberries. While the drink was predictably—and pleasantly—sweet, it defied the local fondness for toothache-inducing sweetness. Topped with pieces of fresh pineapple and casa casa (or basil) seeds, it was a pleasant drink.\nAt only Rs. 200, the sundae special had generous scoops of five different ice cream flavours: strawberry, chocolate, pistachio, mango and coconut. This whopper of a dish came sprinkled with chocolate chips, jelly, cashews and Smarties. Considering that Jaffna’s ice cream parlours are infamous for their indistinguishably over-sweet concoctions, we were pleasantly surprised by the flavour of this sundae. The different scoops blended well together, with the coconut and mango flavours standing out for their unsynthetic, natural taste. The scoops were also quite creamy, albeit loosely layered. We weren’t quick enough to get through it all before all the flavours melted into a smorgasbord of rainbow hues within the dish. Even so, we had no complaints about this semi-solid amalgamation interspersed with crispy, chewy bits for texture. The sweetness was not particularly pronounced, and compared favourably with that of popular brands in Colombo. It was also well worth the money we paid for it.\nFor comparison, we also tried out Rio but have to say, we were disappointed after coming in from Lingam’s.\nThey too had a wide variety of vegetarian snacks, juices and ice cream confections available but we tried only their sundae special to see how it compared with Lingam’s.\nThe menu stated that their sundae special comprised of chocolate and strawberry scoops, but I suppose they had run out of chocolate because they served it with a coconut ice cream scoop instead. The coconut flavour didn’t particularly work with the strawberry. This sundae also didn’t have as generous a sprinkling of chocolate chips and cashews as Lingam’s. At Rs. 300, it had to concede defeat to the former. But as a standalone dish, it fared quite well. Once again, we found that the syrupy and artificial taste of the ice cream had been toned down quite a bit. The scoops here were slightly bigger (but only marginally) and also denser and firmer than the ones at Lingam. Although the ice cream here was less creamy, the sweetness was just right, in our estimation. It was quite sweet, as one would expect of any ice cream, but without being over-the-top or off-putting.\nAs a native of Jaffna, I had not visited either of these local landmarks for years, fearing the artificial flavour of their ice creams. So it was a pleasant surprise to revisit them and find that their quality has drastically improved. I wasn’t expecting it to be an enjoyable experience – yet it was. We walked out riding a pleasant sugar high instead of staggering out disoriented after a sugar overdose, as we had anticipated.\n",
  "url": "https://www.yamu.lk/blog/the-war-of-jaffna-ice-cream"
}