{
  "title": "Japanese Restaurants in Colombo",
  "abstract": "Japanese cuisine is a beautiful thing. Here's a round-up of pretty much all the Japanese restaurants in Colombo, along…",
  "author": "Bhagya",
  "date_published": "11:16am",
  "content": "Here's a round-up of pretty much all the Japanese restaurants in Colombo, along with some of our favourites.\nNihonbashi is what really put chef Dharshan Munidasa in the spotlight, and for good reason. Nihonbashi has held the top spot among Japanese restaurants in Sri Lanka by providing authentic Japanese cuisine with high quality ingredients. It was ranked No.44 in Asia's top 50 restaurants, which is a testament to how good they are. We're putting the ODEL outlet here instead of the Honten, because of it's accessibility and lower price point. However, if you're looking for a bit more ambience\nis great choice.\nYUMI is Taj Samudra's Japanese restaurant. While their menu isn't quite as extensive as others, they make up for with some delicious, specialized sushi in arguably the best setting for a Japanese restaurant in Colombo. We recommend the combination spicy maki which is a magical sushi that has tuna, salmon and crab meat.\nCafe Japan is a small home restaurant off Marine Drive in Colpetty that does some pretty great Japanese cuisine. It's the definition of a hidden gem since the place is ridiculously hard to find. It's run by a Japanese family so the food is very authentic and they've been a go-to place for Japanese expats. The part is that they're actually quite affordable and great place for a private meal.\nTsukiji Uoichi is one of the newest Japanese restaurants to join the fray. As a branch of an actual restaurant from Tokyo, they don't look to change the status quo, but what they do offer is a wide range of Japanese dishes, with fresh ingredients, at decent prices. Their location at the clock tower of the Independence Arcade is also a plus.\nZEN is yet another new spot that opened up at the latter part of 2014. Its located on Rosmead Place at the Zylan Luxury Hotel and is relatively unknown. While their service wasn't quite up to scratch on our visit, the food was aunthentic and tasty.\nGinza on the Edge is the suburban successor of Hilton's old\n, which is no more. These guys make great Japanese food, and they get points for ambience at Waters Edge too - but it's very, very expensive.\nPoppy Hana, with their sushi conveyer belt, is definitely one of the more interesting Japanese eateries in Colombo. While their sushi isn't the best in town, their meat dishes like the chicken katsudon was done well. If nothing it makes for a memorable experience.\nSakura is quite possibly the oldest Japanese restaurant in Colombo. It's not the best nor the most authentic Japanese we've had, but they're affordable and it was actually better than we expected.\nJapanese food delivery in Colombo is very limited, with only a couple of places offering it. While they aren't one of our top spots for dining in, Naniyori has become our go to choice for delivery. They have a more than respectable menu, with some real value for money bento boxes. Their special bento comes with 5 nigiri, 12 maki, kaisen don and pickled veggies and is priced very reasonably at Rs. 920. The only issue is that delivery to Colombo tends to take around an hour or so.\nKami Maki is a Japanese fusion restaurants in Thimbirigasyaya. While it's not the best Japanese in town, they do offer some interesting fusion dishes. They aren't the best choice for authentic Japanese cuisine but if you're looking for something a bit different with elements like wasabi mayo, you'll probably like their stuff. They're also the only other restaurant besides Naniyori that handles their own delivery.\nJapanese cuisine is delicious and we love it, always a treat. Colombo has thankfully gone from one great sushi restaurant (Nihonbashi) and one mediocre (Sakura) to now having a whole bunch in between. This means you can get sushi at a variety of price points and even different types of experiences (conveyor belt, delivery). As always, tell us if we've missed anything, and happy dining.\n",
  "url": "https://www.yamu.lk/blog/japanese-restaurants-in-colombo"
}