{
  "title": "Jetwing Colombo Seven's Degustation Lunch",
  "abstract": "Seven courses, two wines, much yum.",
  "author": "",
  "date_published": "10:12am",
  "content": "Buffets are just not enjoyable for me. I like my food prepared with mindfulness, thought, and precision. Which is exactly what a degustation menu brings to the table.\nThe Jetwing crew invited us for the launch of their new Sunday degustation luncheon menu (the food was complimentary, unlike our usual reviews, but honestly we would have enjoyed it even if it wasn't). If you'd like a better idea of ambience or service, we reviewed Jetwing Colombo Seven's main restaurant,\nin the past too.\nA degustation menu is essentially a series of little portions that come together to create a tasting menu. In this case, it consisted of seven courses, and a couple of wines. There's a white and a red wine, both chosen from the Jetwing wine selection, but you can choose to stick with one or the other.\nChef Indika Bandara, like all Jetwing chefs, works predominantly with local produce, which ties in with the company's sustainable ethos. He's clearly picked only the freshest ingredients and a sparingly few international imports (Australian beef, burrata, balsamic) to curate the menu, and it shows. The attention to detail in the presentation is impressive too.\nThe two wines were just basic house wines, Bay of Fire from Tasmania in this case unless I'm mistaken (which is possible, I didn't manage to look at a bottle properly). I do generally prefer some proper swish pairing with each course, but at the reasonable price point of about $37, I think that may be pushing it.\nI'll just give you a quick run down of the menu (along with the vegetarian options), so you have an idea of what to expect.\nComplete with a tart mango passion dressing and a composition of herbs, shrimp, and toasted brioche, the pâté was a strong start to the meal. I don't usually like liver but this was delicious, inoffensive, and surprisingly light.\nI can't be unbiased about this course, because I have deep and gushing feelings for burrata. One of the few imported sections of the menu, the burrata was a soft creamy blob of happiness perched on top of a grilled tomato (that I ignored) and an olive tapenade and balsamic vanilla splashed disc of avocado. Lovely.\nThis was the highlight of the meal for me. The presentation itself was heaps of fun, as an overturned glass was removed to reveal a puff of smoke and a succulent bit of applewood-smoked lamb perched on eggplant risotto and a beetroot pancake. This course can be substituted with a Cherry Tomato Tart for the vegetarians.\nConsommés are such great comfort food. It was also an interesting serving experience as you see the red tuna, ginger, and quail egg gently surrounded by the stock poured in. The soup itself was good - a thick steamy, spicy clarified stock.\nThe little slab of fish was completed by some cherry tomato, fresh herbs, roasted pepper, and a tomato and basil salsa. The produce itself was so fresh that it barely needed spice to carry it through. The vegetarian option here, an asaparagus risotto, sounded (and looked) pretty delicious.\nServed with potato rosemary tart (although these were more like thin strips of potato), baby zucchini with miso bearnaise, the steak was perfectly executed. Lightly pink in the middle and with a light smattering of sea salt crystals, it did the meat justice. If you're not keen on red meat, you can opt for the smoked eggplant gratin with basil and tomato sauce instead.\nThe dessert featured mascarpone, raspberry vinegar, basil ice cream and meringue or of course a fruit platter. Unfortunately, the crumble itself was far too hard to crunch down on, but the rest of the ingredients and flavours at play were excellent.\nWhile the menu is carefully and created with great attention to detail and flavour pairing, I'd recommend you call ahead in advance and let them know if you have any special requests as the staff was very accommodating. Overall, they were quick on the draw when it came to offering wine, clearing plates, or explaining dishes.\nObviously this is going to cost you a pretty penny, but what do you expect for 7 courses, wine, and excellent service? It comes to Rs. 5700 nett for the full menu and Rs. 4700 nett if you're opting for the vegetarian menu. I appreciated the fact that there's no pesky hidden charges and taxes involved. It's definitely more expensive than your average weekend buffet that retails at about Rs. 3800, but you're going for a completely different experience here.\nIf you're a gourmand, want to take someone special somewhere special, or simply want to indulge in some good food & drink, this is well worth the money. The ambience and the excellence of the food makes for a beautiful sun-kissed Sunday, as long as you've got the cash and at least 2 hours to spend.\n",
  "url": "https://www.yamu.lk/blog/jetwing-colombo-sevens-degustation-lunch"
}