{
  "title": "John Keells X: What's Happened So Far",
  "abstract": "Here's a quick recap on what's happened during the first four weeks of John Keells X.",
  "author": "",
  "date_published": "6:47pm",
  "content": "Right now, John Keells X is accelerating quite a few startups which are worth watching. The application phase ended with over 280 startups hoping to get shortlisted for the year-long accelerator program. After reviewing the applications, John Keells shortlisted 20 teams for the second phase of the program.\nWhat these startups are benefitting from is an acceleration period leading into demo day in November. They're following the Disciplined Entrepreneurship curriculum and been having weekly check-ins with John Keells management to learn and keep refining and testing their ideas. Here's a quick look at what's happened in the last four weeks.\nThe first meetup for JKX 2017 introduced the teams to each other as well as the mentors from John Keells who'll be guiding them through the program. This provides the teams with a unique opportunity to work directly with the relevant John Keells subsidiaries within their industry verticals.\nThe second meetup featured Mr. Romesh David, President of the Transportation Sector at John Keells Holdings and CEO of South Asia Gateway Terminals. Mr. David spoke about the differences between corporate and startup work culture and how to balance the two. He spoke in detail about Cinnamon Air and the challenges they faced at the inception as well as the tech challenges they're currently facing.\nFor the third week, JKX brought in Mr. ⁠⁠⁠Charitha Subasinghe, Executive VP of JKH and CEO of JMSL (Keells Super), who shared his experience in retail and spoke to the teams about how the founding principles at Keells Super set the stage for it's success today. He also discussed possible integrations of the JKX startups into Keells Super in order to improve productivity and customer experience.\nWeek 4 of John Keells X 2017 posed the biggest challenge for the teams so far; The Hackathon. This wasn't your run of the mill hackathon though.\nJKX brought down Marius Ursache and Vlad Bodi, co-founders of the Desciplined Entrepreneurship Toolboox based on the 24 step startup guide by Bill Aulet, Managing Director of the Center for MIT Entrepreneurship.\nThe hackathon spanned over two full days with both Marius and Vlad mentoring the teams on key elements related to startup growth like how to calculate their TAM (total addressable market), customer segmenation and personas, determinig life cycle use cases and validating key assumptions.\nThis proved to be pivotal to the startups who, by the end of hackathon, had a new perspective on their business models and had vastly improved their initial pitch.\nSo that's the story so far. In the coming weeks the teams will continue apply their learnings from both the mentors and the Desciplined Entrepreneurship Toolbox to further refine their products and put the pedal to the metal to be ready for Demo Day.\n",
  "url": "https://www.yamu.lk/blog/john-keells-x-whats-happened-so-far"
}