{
  "title": "Jude Elder Care",
  "abstract": "A home away from home for the elderly.",
  "author": "",
  "date_published": "11:59am",
  "content": "When your elderly parents and relatives have reached the golden years of their life and you are looking for the comfortable homes for them, there are many homes to choose from. One of which is Jude Elder Care in Negombo. It is imperative to find the right living choice for elderly loved ones to make certain they are well looked after. Receiving the best care at is important when our parents and loved ones are elderly, feeble and fragile. Jude Elder Care is located in a very peaceful neighbourhood with utmost care taken to detail to provide a soothing effect to the minds of the residents of the home.\nThe elder care facility has been designed with the purpose of accommodating the aged. Every fixture or construction in the home makes it easy for the elder to move around freely. An elevator is also included for residents whenever they wish to move from one floor to another. They are accompanied by a lift operator who makes certain the elderly are safe. Railings are also installed to support and encourage the elders to move about and get much needed exercise.\nJude Elder Care is owned and managed by Dr. Tilak Silva, who is a MBBS qualified Doctor with years of experience. The home is maintained to the highest standard and maintained according to the standards set by Social Services Department of Sri Lanka. The home boasts of courteous and caring staff and has won many an accolade for demonstrating excellence in the field of elderly care.\nWhen you are a resident of the home, you can expect nutritious diet plans with high emphasis placed on maintaining a hygienic kitchen and dining areas. All meals are freshly prepared and provided. There are invigorating activities to keep the elders entertained The elderly benefit from all the recreational activities and games. For residents who are bedridden, Jude Elder Care guarantee 24 hours assistance to all those who are confined to a bed. The home has professional medical care because the home is owned and operated by highly experienced medical practitioners, extra effort and care is placed on medical care for the residents of the Home.\nJude Elder Care provides a home away from home with emphasis on compassion and care for the elderly citizens residing within these walls. The Home’s sole mission is to provide services and amenities so that senior citizens can enjoy a comfortable, healthier stay during the golden years of their lives.\n\nAddress: No 18, Galison Road, Negombo.\nWebsite: judecarehomesrilanka.com\nTelephone: (+94)31 222 7568\nEmail address: info@stjudecare.com\n\n\n\n\n",
  "url": "https://www.yamu.lk/blog/jude-elder-care"
}