{
  "title": "Know Your Enemy : An Overview of the English Cricket Team",
  "abstract": "This month, Sri Lanka embarks upon a 2 month tour of England that includes 3 Test matches, 5 One Dayers and a T20.…",
  "author": "",
  "date_published": "3:35pm",
  "content": "This month, Sri Lanka embarks upon a 2 month tour of England that includes 3 Test matches, 5 One Dayers and a T20. Plus 2 One-Dayers against Ireland (a surefire way to improve your average). As any Lankan who has been to England in early summer will tell you though; green pitches, cool overcast conditions and a seaming ball make for quite a difficult time. And being packed off to Durham (the 2nd test is at Chester-le-Street) in May is like being sent to a Siberian Gulag… except colder. England last lost a bad-tempered home series to us back in 2014, off the penultimate ball at Headingly, and they're out for revenge at the same ground on Thursday.\nPart of touring somewhere like England successfully is about gaining momentum, as the fragile English resolve and fickle public can be exploited if a visiting team gets the upper hand early doors. Knowing your opposition is a crucial part of that, so we've taken a look at England's 12-man squad for the 3-Test series. Sri Lanka have a young team, and pundits (and England players) are predicting an England 3-0 sweep. But, there is help at hand; putting on both my cricket-analyst hat and my sports psychologist one, I've broken the England team down and devised a plan to (against the odds) crush them mercilessly [cue evil laughter].\nSo, let's begin. It's easiest to split the team into groups so I've divided them up into The Warhorses, The Superstars, The Backbone, The Question Marks, and The Freshers.\nThese players have been around the block a few times. The thing about them is, short of a 'Jason Gillespie 2005 Ashes' style mid-series talent-disappearance, they're eventually going to come good. They will turn in some consistent, solid performances, sometimes even affecting swings in the momentum of a game by sheer force of will. Plan for it, deal with it accordingly. They will be successful a lot of the time. Settle with containing them, but if you get an opportunity to apply pressure (e.g. if they're not scoring runs or taking wickets) then really put the hammer down. If you do manage to get one of them under the cosh, don't let up; if they come good, you're in for a frustrating series.\nEngland's Captain and all-time highest run scorer is approaching the best years of his career. 10,000 runs beckons in this series (he's got 36 to go) and at the end of last year he made a monster 263 in Pakistan showing his appetite for big Test scores remains unsated. He has had excellent preparation for this series too, scoring 3 hundreds in the County Championship over the past month. His assured left-handed anchor-role at the top of the order often sets the tone for the innings, and indeed the game. Last time he played Sri Lanka he had a torrid time with the bat and the captaincy, and will be keen to rectify that this time. His slow scoring rate sometimes puts others under pressure, and will be keenly felt by fellow opener Alex Hales if England need impetus.\nHe's in rich form, so he's likely to score runs over the course of the summer. However, a few failures early on could really put the brakes on his momentum, and dictate the tempo the rest of the team play at. Bowl full and fast, and he often gets stuck on the crease. He probably fends a bit hard at balls on off stump, so he nicks it behind a fair amount. And as with all left handers, anything on middle he likes to try and work through mid-wicket bringing LBWs into play.\n\n\nEngland's right-arm fast-bowling spearhead has played Test cricket for the last 13 years, and has a couple more good years left in him yet. He is his country's top all-time wicket taker, and remains devastating in English conditions. He swings the ball both ways with great control and guile. He is on form too (after missing England's last few Tests through injury) taking 3 wickets in an over a fortnight ago vs Somerset. If he gets going, he can be unplayable, especially on a Headingly pitch that is traditionally bowler-friendly. His batting role as the Night-Watchman over the past decade has saved England's blushes several times.\nWhat can you say when facing the 7th highest Test wicket taker ever, in favourable conditions at home? It's going to be a hard ask. The only choice is to weather the initial storm and get well-forward to negate the outswing, plus hope you get hit outside the line if you miss an in-ducker. Wickets win Tests, and if you limit him to a few per innings, England are unlikely to get the 20 wickets required to win a match.\nThe tall volatile right-armer is the lynchpin of the England bowling attack. He very rarely has a bad game. He's got a penchant for cashing in on good wickets, and last summer took an extraordinary 8-15 against the Aussies to clinch the Ashes. He has good shape and gets decent movement off the pitch. Green-tops in early summer are right up his street, and expect balls jagging away from the right handers to keep the slips interested. However, in the 7 Tests he's played against Sri Lanka, he's never taken a 5-wicket haul and his strike rate and average are both near double what his career stats are. His left-handed batting is intermittently dangerous and his lower-order runs often push a below-average score into a defendable one.\nYou have to play for the movement (of which there is bound to be a fair amount) and smother it. He gets the majority of his victims (227 of 333 Test wickets) caught or caught behind, so be brave play forward and don't worry too much about getting LBW or being bowled. He can still be a bit hot-headed, so a bit of needle thrown his way may make him lose focus.\nThese guys are the coming men. World-class players who would be in the reckoning when Superstar XIs are being picked. At some point in the series they'll produce a genuinely match-winning performance that you can only sit back and admire. Expect this to happen. Don't be shocked by it. They won't be able to deliver all of the time. It's rare that series are won on the back of a superstar (unless your name is Chris Gayle).\n\n\nOver the last 2 years he has gone from strength to strength. He's been ear-marked as a future captain and is the number 2 Test batsman in the world. He was Man of the Series in the Ashes and is England's top run-scorer this year. He was also the top run scorer last time Sri Lanka toured England too (he averages 86 against us, and scored a double hundred). He's a pretty orthodox right-hand bat who is good all round the wicket, against pace or spin, gives few chances and punishes every single ball that's not exactly on length. He's primarily a front-foot offside player, but against the spinners he wheels out a whole array of lap sweeps and dinks down to fine leg. He sometimes has problems converting scores into hundreds, but when he does, they're big ones. He's also a useful right-arm offspinner, who will operate as Moeen Ali's back-up. He's a good catcher in the slips or under the helmet at short leg too. Never one to shy away from a bit of verbals and sledging, he really doesn't like us after 2014 and is definitely out to put the pressure on.\nHe's in good form with the bat and will likely finish the series as England's top scorer. The good news however is that he's easy to rile. He'll be up for a fight and he can get too bogged down in the combative element of the sport. A few choice words here and there will upset his concentration and flow. Hope that it's enough to entice a dismissal, because otherwise he's going to seriously rack up the runs.\n\n\nThe New-Zealand born hard-hitting all-rounder burst onto the scene a few years ago, but was let down by a few disciplinary problems. He's really kicked on in the last year into a proven world-class match-winner. His ultra-aggressive left hand batting is his strong point and if he's in the mood, no target is too large to chase. He scored 263 against South Africa in January this year, England's fastest ever 200 and 250, and the highest score by a number 6 ever in Test matches. He launches boundaries like it's a T20. He's a strapping lad so wields a heavy bat. When it connects it stays hit. Even badly timed shots clear the rope especially on the smaller English grounds. The good news is that he's an all or nothing kind of player. It's bonus or bust. His right arm fast-medium bowling is a useful addition to use up a few overs, and is occasionally deployed as a partnership-breaker.\nAt some point in the series he'll launch an onslaught of Gayle-like proportions and will no doubt score a big hundred. Whether it turns the tide of the match remains to be seen. The best you can hope to do is contain him when it happens. Bowling-wise, hopefully for us he bears the scars of Carlos Braithwaite's incredible last-over assault in the T20 final. A few aerial boundaries, and perhaps some doubt will creep back in.\nThis is where you can TRULY effect some change in outcome. These guys do not occupy either of the above two groups, but the team still requires them to function for success. Test matches are not won unless the backbone of your team fires. They should be targeted ruthlessly and not let off the hook for anything. Swamp them and strangle them when they bat, starve them of runs and you'll see their resolve disappear faster than Daryl Hair at Pettah Bus station. They should be made to feel nervous every time they are given a task to perform against us. Sow seeds of doubt everywhere you can, and watch them grow over the course of the series.\n\n\nThe 'Beard to be Feared', Moeen Ali is a batting all-rounder who offers England their only front-line spin option. He had a fairly lean 2015, especially with the bat, but he seems to like batting against Sri Lanka as his only Test century was against us in 2014. He is quite an elegant and unfussy Left-hand bat who is well-organised and tends not to take too many risks. He's an accumulator, but punctuates his innings with boundaries. His right-arm offspin is effective, but in all honesty should not be recognised as an international Test spinner. His bowling is based upon a decently turning offspinner, and a well-disguised arm ball. He can bowl a doosra, but rarely uses it due to lack of control. It was our own medium-pace spinner Kumar Dharmasena who advised him to be quicker through the air to survive in the top-flight, and Moeen is annoyingly successful with this tactic. Batting-wise he's in need of a good score after under-performing in South Africa.\nEngland rely on him, probably bowling-wise more than batting. He should be deliberately targeted and dispatched. Other bowlers can be played out, but Ali needs to be ruthlessly hit out of the attack. Without him, they have no proper spinner, and no variation. And if he's not there to get through overs, then it puts more of a burden on their pace bowlers and tires them out.\nWhen you're the son of a famous England keeper, it was an inevitability that Jonny would follow in his father’s footsteps at some point. That it’s taken him until his mid twenties, is probably due to the fact Matt Prior hung around a bit too long, and that England are blessed with another prodigiously talented keeper-batsmen in the shape of Jos Buttler. Buttler has excelled in the shorter formats, but is still quite unpredictable, and has failed in Test cricket. Bairstow on the other hand has firmly established himself over the last year as the go-to choice. He's not the best gloveman in the game, but he is tidy and with England's only real spin option Moeen Ali's part-time Right-arm offspin, it really doesn't matter too much. He has developed into a combative hard-hitting right-handed bat. He can score quickly, or play a studious longer innings (as evidenced by his 150 not out at Newlands earlier this year against South Africa, putting on a world-record 399 for the 6th wicket with Ben Stokes).\n: If he has a few good days behind the stumps and hits a few good scores, his confidence will soar. If he gets a few single figure innings then he'll start to worry about Buttler breathing down his neck. He is out caught in the ring most of the time (22 of his 37 Test dismissals) so bowl short of a length and get him to drive on the up into the covers. Stop his runs, and his keeping will take a dip too.\nYou cannot let any of these chaps turn in any string of significant performances, or they will slide into one of the above two groups. They have had previous chances, and still not managed to nail themselves to the teamsheet. The good news is that they are already on fairly thin ice, and any effective pressure applied will likely result in their confidence going down quicker than Rangana Herath when a runner is required. These guys should be specifically targeted and dispatched without remorse. Force the England selectors to doubt having picked them in the first place.\n\n\nDespite a good 2015 Ashes series, the 6'7\" Middlesex Right-armer has struggled to be a regular choice in any form of the game. He has had tough competition from Mark Wood (unavailable due to an ankle injury), and has only taken 4 wickets in 3 Tests in 2016 (in South Africa). Due to his freakish height he generates some serious bounce and bowls a nagging length that confuses batsmen as to whether to play forward or back. This will be less of an issue for our top order as they're not the tallest, therefore expect a lot of cutting and pulling. He's no slouch pace-wise either, his effort balls come down at about 90mph.\nOn a helpful pitch he's unplayable (for example when he took 6-79 against Australia at Edgbaston in 2015). However his confidence is fragile and his radar can be questionable. Punish the short stuff with boundaries and watch him lose focus.\nAged 32, Compton is a curious choice for an unestablished batsman. The Middlesex man may be from batting royalty but he's struggled at international level over the past few years. Neither does he have current form in the County Championship, so I can't imagine he expected the nod from the selectors. He's been on the receiving end of it from the critics (especially Michael Vaughan) in the newspapers, who can't believe that he's one of the top 5 batters in the country. I'm inclined to agree with them. With Hales and Cook also in the team, whether he opens or drops further down is also a question.  He's an old-style Test batsman, able to block the heck out of it Boycott-style and accumulate runs over hours. He has a slow strike rate, uses up a lot of balls, and his scoring areas are easily plugged. His main problem is that he's not exciting. He's got a lovely cover drive, and serviceable cut and pull, but feels anachronistic and a luxury in a modern batting line-up. He is in dire need of a big score in the 1st Test.\nThis one is simple, just get him out. Any way you can, as soon as possible. Anything less than a 50 will be seen as a failure and the press are just looking for an excuse to get on his back. Give them one.\nA tall right-handed opening bat, Hales actually had even worse stats in South Africa than Compton, but most people seem to agree that his place is less in jeopardy (albeit not by much). The difference being, he is currently in excellent form. He's tempered his obvious penchant for fast-scoring with a more measured approach. He still retains his devastating array of offside strokes, cuts and drives, so is a serious danger. However, his place is still up for grabs. If Ian Bell was fit, Gary Ballance was in form and Sam Robson had done a bit more, he could easily be dropped. This brings a certain amount of pressure, and whilst he'll probably get 3 Tests to prove himself, the key is to get him early. He's more of a natural number 3, but England seem to insist him opening and giving them a fast start. This means that whilst Cook is happy to eat up dot balls, Hales will be under pressure to score more freely.\nIf you don't give him bad balls to hit, he's unlikely to take the risk to manufacture runs from good ones. Stifle his scoring opportunities and maintain a line on off-stump (he was awful at judging which balls to play at in South Africa). He'll nibble one to the slips at some point, or have his off stump pegged back.\nThough he's on debut, he's already had a taste of international cricket playing 4 T20s and 1 ODI. Plus he's captained Hampshire in all forms of the game for the last year, so he's hardly a rookie. Often compared to his idol, Michael Vaughan, he's essentially an aggressive orthodox right-handed batsman. He's good playing straight off the front foot, especially through the covers, and he's got a good swivel-pull. The key is to stifle him early. He hits into regular areas, and doesn't have any real quirks, so he's predictable. He'll punish the bad balls however, and can put pressure on bowlers due to his high strike-rate.\nDon't bother with any needle just because he's on debut; he's unlikely to bite. Best to buckle down and concentrate on sending him back to the pavilion. Get him feeling outside off, with a bit of movement away and encourage the edge, or even bowl outswing starting on middle and try for an LBW if he tries to tuck it through mid-wicket.\nJake Ball's rise has been rapid over the past 6 months. He's enjoyed a successful England Lions tour to Pakistan, and is currently the top wicket-taker in Division 1 of the County Championship. He's a tall, rangy fast bowler, who whilst not being rapid, sends the ball both ways and can bowl over or round the wicket. He's useful against left-handers, and has good accuracy. Even our own Sanga speaks highly of him. He's been around his Notts team-mate Stuart Broad a lot, and is used to bowling with him. He even got the in-form Joe Root out for a Golden Duck a few weeks ago. For all intents and purposes Ball seems to be a rather nice chap, that I'd love to do well against any team apart from Sri Lanka.\nHe's new. He's on debut. He probably wouldn't be in the team were it not for a few injuries. He's going to be susceptible to an in-form batsman dominating him. And if the ball isn't moving then he's not quick enough to trouble you with pace alone. Get forward, smother any movement and wait until your eye is in, then cash in.\n",
  "url": "https://www.yamu.lk/blog/english-cricket-team-overview-2016"
}