{
  "title": "Late Night Burgers - Our Top 4 (2014)",
  "abstract": "Each of Colombo's late night burger joints have very a distinct style of burger making.",
  "author": "",
  "date_published": "4:56pm",
  "content": "Most of Colombo goes to sleep early, unfortunately, so it's awesome when you're a night owl and you find there are still a handful of affordable places open after 10. Personally I prefer Colombo's burger joints over its kottu, because each of these places has a very distinct style of burger making. So we've put together a list.\nWe're not going to talk about McDonalds, KFC or Burger King here because everyone's well aware of that mass produced international fast food shizzle. But our list includes burger places that many of you probably know quite well, in ranking order - it's been tough, because every one of these late night joints serves some top notch flawless mayo-dripping, mouth-watering burgers.\nWe absolutely love Acropol's burgers. The meat is heavy and juicy, and it's dripping with mayo and sauce through the melting cheese. Also this one's the cheapest on the list for Rs. 290 a burger.\n\nBurger's Hut burgers are great - they taste and look so much like Burger's King, we can barely tell the difference. Except that Burger's King did it first. Warm soft burger bread, plenty of meat, plenty of cheese and mayo - the location is great for those of us who want Burger's King but don't want to go all the way to Malay Street. Rs. 300 a burger here. It came only third on our list though, because it isn't anything new since its big brother pwnd this scene.\n\nThe elusive Sugar Burger cart that parks itself outside Silk on Maitland Crescent on only Friday and Saturday nights, serves some of the best burgers in the city. After much confusion - staking out the cart after 9PM at nights, not seeing it there most of the week and then finally finding their phone number (you're welcome - check out the old review for it), we procured the much spoken of Sugar Burger burger. Their main audience is the clubbing crowd that's mad with the munchies after a late night - but these burgers are so good, you need to try it when you're not actually drunk to fully appreciate it. The meat is hefty and tasty and battling for space with oozings of extra cheese and fresh chunky pieces of onions and lettuce. Very filling and very distinct, Rs. 500 bucks a burger.\n\nWe're sorry - I know a lot of people say that\nhas dropped in standard since its golden inception - but we don't give a shizzle, these burgers are still goddamn perfect. The Cordon Bleu is our all-time favourite but we picked their special the King Royal this time, and it was fantastic. For Rs. 360, it's the size, the epic amount of spicy, chunky meat in the burgers, and the thick predominant sauce of mayo and cheese that is just so generously slathered everywhere - that does it, and of course, the signature speedy service at this popular Malay Street joint. And the fact that they're the first of their kind and still going strong. Respect, bro.\n\n",
  "url": "https://www.yamu.lk/blog/late-night-burgers-our-top-4"
}