{
  "title": "Lion Index: The Price Of Beer In Colombo",
  "abstract": "How much does a beer cost in Colombo? This is our survey of 22 places to find out. The base price of a 625…",
  "author": "",
  "date_published": "11:58am",
  "content": "How much does a beer cost in Colombo? This is our survey of 22 places to find out.\nThe price of a Lion Beer can vary dramatically across Colombo. At the more working class bars its quite cheap, but at the posh ones it can be two to three times the sticker price. We did a survey of 22 places to see how much one of the big bottles (625 ml) would cost you around town. This is the second time we're doing the survey, see\n.\n\nNote that certain places (marked with a *) do not sell 625 ml bottles, so we've scaled the prices for the pitchers/mugs accordingly.\n\nHere's the full table, below. We've also calculated what 10% service charge and 12% taxes will do to your bill, which in the latter places on this list can't really be overlooked.\n\nSo the table is pretty self explanatory, with the slightly dodgy bars like Randoli and Ex-Servicemen's at the lower end of the spectrum. What's awesome though is that Machang offers the cheapest beer out of all these places, and the best part is that it's also a pretty great place to hang.\n\nOn the other end we have the likes of Cheers, Gallery Cafe and 7 Degrees which generally offer more in terms of ambience, but then again you're quite literally paying more than three times the retail price. If you're looking to a grab a beer beach side, then you're options are limited to the likes of Buba and The Station, but we definitely recommend the latter. The newer places like the Manchester and Mintage are also quite affordable.\n\nIf it's woman friendly places you're looking for, we'd suggest Park Street Mews (which happens to be surprisingly affordable), Barefoot or Casa Colombo, which has a great one-for-one offer on all alcoholic beverages between 5.30 pm to 7.30 pm throughout the week.\nWhile the retail price of beer has gone up by a bit, the price for a bottle at certain places haven't scaled so judiciously. In a general sense the dodgier places offer cheaper beer, but\nis an exception, with places like\nand\nalso being decent choices, if you go at the right time.\n",
  "url": "https://www.yamu.lk/blog/lion-index"
}