{
  "title": "Lunch at Lunuganga",
  "abstract": "Dining at one of Sri Lanka's most iconic gardens.",
  "author": "Kinita",
  "date_published": "10:10am",
  "content": "Since 1948, Lunuganga has been a living testament to an epic romance between nature and design. With sprawling English lawns, miniature tropical forests, lakeside beauty and more, it was the home, working experiment, and\nof one of Sri Lanka's most famous architects,\n.\nMake a tour reservation well before you want to arrive (details below). When you reach, ring the wrought iron bell and wait for someone to let you in. The tour lasts about an hour and snakes through sections of the rambling property. Little statues, sculptures, and metalwork pepper the beautifully landscaped property and curated gardens, each with their own story and history.\nYour tour guide will make sure to point out (in English) lots of amusing anecdotes of Bawa's life at the Gardens, as well as some of his inspirations and  interactions with his colleagues.\nYou'll also be privy to lots of artwork and gifts from Bawa's close friends and contemporaries, like a mural from Laki Senanayaka, pots by Donald Friend, and gothic windows given by the famed architect Anjalendran.\nWe genuinely enjoyed the tour, led by a friendly sarong-clad chap called Nuwan. Apart from clearly loving his job and the premises, he also had funny personal stories (from everything from the dog to Bawa himself), and stopped every so often to describe a plant or fruit in detail and let us taste berries and such. Keep in mind that you're going to be walking under the sun for about an hour, so come prepared with a bottle of water and a hat/sunscreen.\nDining is reserved to lunch and those with reservations. If you have reservations about the price, rest assured that even if the food isn't mind-blowing, you're here for the experience and ambience.\nThe lunch options are either a Sri Lankan curry spread or a Western grilled chicken and vegetables. Since the Western sounded dull, we opted for a full Lankan curry scene, which was a wise call.\nWe started with a light little portion of pumpkin soup, which had gentle suggestions of turmeric. We then impatiently waited for the belles of the ball - the curries.\nThey rolled out soon enough, a platter of red rice with around 9 little pots of assorted curries ranging from gotukula, beetroot, and dhal to sweet potato fries, cucumber curry, aubergine, and the crowd favourite papadam. They also brought out a chicken curry even though we'd asked for prawn during the booking. After we told our waiter, he was nice enough to bring out the prawn too. Everything was prepared well (especially the paripu and prawn), but lacked a certain depth and spiciness as it was clearly made with foreigners in mind.\nThe dessert options weren't wild, it's between creme caramel and ice cream (pretty much what you'd get at like Green Cabin). Being greedy, we opted for both in a bowl. It was fine, just normal creme caramel and elephant house ice cream, but the cold sweetness did us good in the April heat. Overall this was a good meal, but rice and curry is generally not worth Rs. 2000 a head unless it's at a historic spot like Lunuganga.\nOur service was overall quite friendly if not efficient. It took a long time and a lot of explanation to get a reservation over the phone, and when we arrived the next day they seemed confused by our presence. At lunch, even though we were seated almost 10 minutes before the table of 6 foreigners next to us, they were served first at every instance and we had to wait until they were done. Old habits die hard?\nThere's also a bit of confusion, as we were erroneously told we could bring a bottle of wine in as there's no liquor licence. However, it turns out that's only for in-house guests, so we were asked to stash away our wine (\n).\nDaily garden tours last about an hour each, and start at the following times:\nAdults entrance fees for the garden tour are Rs. 1500 and student fees are Rs. 500 (student ID is required for this). If you'd like to have lunch there, you need to book it in advance and pay an additional fee. The Garden Tour + Lunch costs Rs. 3500.\nFor contact details and directions, head to\n. If you can't make it out to Bentota or are more interested in Bawa's interior decor and design, check out Colombo's Number 11 instead.\n",
  "url": "https://www.yamu.lk/blog/lunch-at-lunuganga"
}