{
  "title": "Maalu Paan Taste-Off: 14 Buns, One Champion ",
  "abstract": "The maalu paan or fish bun is one of Sri Lanka's most beloved kade foods. We've put together most of Colombo's big…",
  "author": "Shifani",
  "date_published": "2:36pm",
  "content": "The maalu paan is one of Sri Lanka's most beloved kade short-eats. Although it's just a semi-triangular bun full of fish, it's still a huge favourite at bakeries, but it's usually hard to trust which shop has the best maalu paan. So we've put together the top 14 maalu paan contenders in Colombo for a final showdown.\nI don't know about the rest of the people in this office but I take my maalu paan extremely seriously. So we've measured our maalu paans, both in size and weight, looked at the bread-to-filling ratio, the fish-to-potato ratio, and finally how fishy, spicy and good it tastes.\nIt was not easy sampling 14 maalu paans at a stretch (Yumi Cake is missing in the picture above), but we did it anyway... for science. Most maalu paans were just okay, which is the general tendency, some were evil and deceptive (is there anything sadder than a malu paan with barely any maalu in it?), while a few were superb. Here are our highlights.\nMost of the contenders got a 2 out of 5 rating, either disappointing in terms of the fish quantity or in that elusive fish:potato ratio of tastiness.\nThese are maalu paans with hard bread and a very buttery filling. The filling to bread ratio was so-so and overall you'd get a maalu paan if you were visiting the place anyway, but we wouldn't recommend making the trip for it.\nThe fish filling here was buttery and actually tasted like it would make a good mix, better in flavour than the other 2/5's. The downer was that this was one of those maalu paans with a horrible filling-to-bread ratio. When you opened the big bun all you got was a tiny smidgen of filling, it was just rude. We needed a lot of water after this one to wash away the taste of betrayal.\nWe got both the regular maalu paan and the brown bread maalu paan, and we've got to say that unfortunately Paan Paan's maalu paan is not up to mark (though of course they're good at other things, like\nand breads and sandwiches in general). The regular maalu paan filling tasted sort of dry, onion-heavy, and odd, not keeping with the regular flavour of maalu paan stuffing. The brown bread, though it just looks wrinkly and not so appetizing, is definitely healthier because it's whole wheat, but the filling again had an odd flavour to it (a bit like seeni sambol).\nThe paan of the BreadTalk maalu paan was the softest of the lot, so it doesn't feel like your regular maalu paan. The filling was very squishy, peppery and curry-like, with lots of potato, so it was like soft bread filled with a moist fishy potato curry. Tastes okay, but low on the list of maalu paan standards.\nIt's not often you go to a hospital for short-eats. But in the case that you do, Lanka Hospital serves up some okay-ones, the filling is fishy and average, but the bread was quite hard.\nThese maalu paans didn't look appetizing, the bread was dry and the filling was very oniony - but not too bad. It's served across from the World Trade Center and next to Fridays. Sort of like a typical canteen maalu paan.\nSponge's maalu paans are for some reason more expensive than your average. Since it's not that spicy, Bhagya called it 'the white person's maalu paan'. It was okay but had those fat chunks of potato in it that I'm not fond of and the weird lingering flavour of leeks.\nSen Saal actually got a 1/5 rating from us. They might be good at other food stuffs but maalu paan is definitely not their forte. The potato to fish filling was all wrong, but mostly these ones had an overwhelming weird flavour of cinnamon - which really doesn't belong in a good maalu paan.\nThese are good malu paans. If you stopped for one of these you wouldn't be unhappy and they stick pretty closely to a winning formula.\nKlassy is usually a reliable bet when it comes to short-eats. They are a solid choice if you're looking for an average good, traditional maalu paan - very spicy, fishy, and with plenty of potato minced in nicely.\nThese guys also do a good solid maalu paan, though not as spicy as the Klassy ones, with a lovely flavoursome ratio of potato and fish.\nThese malu paans are worth going out of your way for.\nFab makes some very good maalu paan, this is one of the few places I'd head to for it since the place is easily accessible and consistent. Lots of chunky minced fish in this, and I think that's what a good bun is mostly about - the abundance of fish in it, since our more lackluster contenders seem to try to compensate with potato.\nTasty Caterers is my personal favourite for all my short-eat cravings (especially for eclairs). So it's not much of a surprise that it's up here with the best of the maalu paans: good bread, well-spiced good minced fish with a bit of potato, very light and pleasant unlike other maalu paans that tend to be overwhelming with aroma and chunkiness.\nIn the end, there can only be one bun to rule all buns. From the beginning of the taste-off I kept referring to Yumi Cake's probable victory despite the skepticism of other fools, but in the end, it turned out to be true. This one is made out of kurakkan flour which is healthier than ordinary bread, and weighs the most of the lot since it's absolutely packed to the brim with a wonderful home-made fishy filling. Of course, Yumi is the only one on the list that isn't an average bakery or hospital, but follows a baker's private recipe instead. If you are craving great maalu paan, this is worth the price, but order early since they sell out fast.\nSo that was the showdown between the heavy-weights of Sri Lanka's favourite kind of bunnis (the picture above is the re-arranged pyramid of maalu paans, in order of awesomeness). In the end we were queasy and kind of grossed out with ourselves, in need of much mouth-freshener, but it was worth it. If you feel we need to check out maalu paan elsewhere, don't forget to let us know in the comments.\nYou can also check out\n.\n",
  "url": "https://www.yamu.lk/blog/the-great-maalu-paan-taste-off"
}