{
  "title": "Memory Walk in Moratuwa: The Early Capitalists of Sri Lanka",
  "abstract": "Where I take one of GIZSriLanka's free memory walks and learn a ton of new things.",
  "author": "Halik",
  "date_published": "3:05pm",
  "content": "\nMercenary armies for the Portuguese, liquor barons growing fat on the profits of intoxicating a new working class, forced conversions, random assignment of family names that have survived for generations, ancestral houses, even older churches, the OGs of Sri Lankan capitalism. It all happened in Moratuwa.\n\nThe year was 1840, the Encroachment upon Crown Lands Ordianance did away with the\nsystem. People who couldn't prove their ownership of their land (which no one could because of what the British demanded they produce), lost it. When the British started coffee plantations, the mode of production changed, shifting from a feudalist, tilth based system to straightforward wage labor.\n\nIn addition to locals who suddenly found their working conditions changing, people were also brought in from India and other places in the empire to perform tasks ranging from looking after toilets to looking after cows. Over 10,000 of them settled along the coast near Moratuwa.\nThe demand for transport/vehicles meant that Moraruwa prospered. Families like the Salgodos and Peiris were already well established in their wealth. The Salgados were also experienced brewers. These early capitalists were in a prime position to exploit a brand new market.\n\nThat market was ‘alcohol renting’ i.e. retail. Old families like the Salgados owned land and distilleries. Whilst families like the De Soysas emerged into wealth by buying alcohol from the distillers and selling it by the glass, sometimes at 300 percent markups.\n\nOrdinary people were making actual money for the first time, and looking for new ways to spend it. Laborers drank as a ‘coping mechanism’. The renters actively fed and created this demand, distributing the product across the country. Vertical integration is how capital entrenches itself, and eventually renters became so rich that they bought over the distillers, overturning social hierarchies.\nThe De Soysas dominated the trade. In 1890 Charles Henry De Soysa alone made Rs 2.3m, while all the other renters put together made Rs 2m. Charles Henry became one of the wealthiest people, not just in Sri Lanka but in the entire British Empire.\nAll of this information unfolded during the first half hour of the Memory Walk, which happened on one hot Sunday morning. We gathered at a pre-arranged rendezvous, but I had to catch up to the rest at their first destination because I was 15 minutes late despite living 5 minutes away.\n\nThe walk was done by\nand\n. Our guide was the doggedly effervescent Sulakshana De Mel, herself a member of one of Moratuwa’s old families, and a keen historian to boot. The company was good, a curious bunch with lots of questions. And the morning passed pleasantly as we spent 3-4 hours walking around various historical landmarks in Moratuwa.\nWe walked into old houses reconverted into restaurants, schools,cemeteries and churches. In the process, an astonishing amount of information and anecdote after anecdote concerning the private lives of Moratuwa’s now long dead ‘aristocracy’ poured out of our guide.\n\nCharles Henry’s father, Jeronis, for instance first realized that something good was in store for him when a Buddhist monk read his palm and predicted that he would be the richest man in the country. As his wealth and power began to increase, Jeronis also strengthened his ties with the Anglican Church, making friends with a powerful Christian priest.\n\nThe Moratuwa capitalists were savvy enough to invest a lot in schools and places of worship. Charles donated his own land on which to build Prince of Wales College, conceived on an egalitarian idea (even though the application process saw parents being ‘interviewed’ as well) and taught anyone, as opposed to the select few who got into other high end schools, in English. Located just behind the school, the Carlton Tennis Club was defiantly Locals Only.\nCapitalists will be capitalists, and their time saw its share of oppression. Especially in the graphite mines, where labor conditions were exceedingly difficult. A rigid hierarchy was also maintained with imported Indian workers, whose usefulness as toilet cleaners and purveyors of other menial tasks meant that they were generally kept in their places.\n\nIronically enough, just as a monk heralded Jeronis’ rise to prosperity, legend has it that the words of another monk spelled the doom of his son, Charles Henry, who insulted the priest by making an offensive pun on his name. The monk then cursed Charles Henry, who was bitten by a rabid dog the following day. Charles died shortly thereafter with rumors of black magic plaguing his demise.\nWatch\nand\non Facebook for updates on the latest Walks. They are completely free, but you need to book early to make sure you get a place. They do walks quite often and themes can range from discovering lesser known goddesses and gods at the Museum to understanding ancient commercial relations between Kotahena and Pettah.\n",
  "url": "https://www.yamu.lk/blog/the-early-capitalists-of-sri-lanka"
}