{
  "title": "Modern Lankan Symbols",
  "abstract": "In this modern day and age, how do we represent ourselves on social media?",
  "author": "nanelle",
  "date_published": "1:00pm",
  "content": "So, you are engaged in a meaningful conversation about ales vs lager on a pub crawl. Before you know it, you are talking-up Sri Lanka. This calls for a bit of social media exposure because no conversation is complete without a little Instagram showdown of train rides to Ella, pictures of isso wadai and chill hammock selfies set against paradisal beaches.\nIn an age, where your degree and the new job matters mainly to your amma, her amma and their friends, what truly rocks your world may be your carefully curated social media presence.\nWhether our posts are what the internet-experts call ‘basic’ or ‘actual goals’, as we sort through various combinations of sari selfies, candid bikini shots and master the perfect beach to sea ratio, we are leaving clues of our innate Sri Lankanism. We are inventing a certain hieroglyph that represents us. Let’s take a look at symbols that represent us and what they say about us.\nKnown onomatopoeically, tuk tuks have been pulsing around Sri Lanka forever. Yet they were not always a cheap and reliable option. Around 10-15 years ago tuks weren’t so easy to find outside of central Colombo, in the peripheral suburbs. In the occasion, you did find one, you had better be prepared for a marathon of haggling to get to a reasonable price.\nFast forward a few years, prompt the advent of the meter taxi, start-ups like PickMe and the tourist boom of ‘Asia-hoppers’, the tired old Bajaj (or Piaggio or TVS) is now revamped as a major token of city life. Hundreds of thousands of tuks buzz around Colombo and other major cities like a swarm of mosquitoes and signify the cracks in our public transportation system. It is the fast and the furious way to squeeze through crazy rush hour traffic.\nAt this point, it also doubles as an extreme sport. It is the head honcho of Sri Lankan streets, the unofficial mascot of Colombo and will continue to embed in the Lankan vernacular. We want it to say- practical, affordable, uninhibited, wild, adrenaline rush- and it says just that.\nAn umbrella is universally a very practical device. But nowhere else in the world is it also the most important tool in a relationship. Lankan lovers take refuge under the metal framed, folding canopies to escape the disapproving glares of absolute strangers, who care like it’s their own business.\nIn a way, it makes sense. Sri Lanka is a small place. You are bound to be related to half the population in most accidental of ways. Streets of Colombo are constantly buzzing with busybody relatives and friends of friends.\nSo, budding couples have for years used the all-powerful umbrella as a potent shield against the many aunties and uncles you never knew existed, who will only surface to inform your amma of your escapades.\nIn Sri Lanka, where PDA is frowned upon, it basically lends to a comfortable semi-public display of affection..\nFrankly, not all of us surf, nor are we interested in ever braving the wert whirls of certain surf ayyas. However, surf culture is massive. It’s a multi-million-dollar industry, a form of expression, a lifestyle, an excuse to throw on those racer-back bikinis and run around the beach without getting side eye from aunties, and we want a piece of that.\nTrue Sri Lankanism dictates that we do not necessarily have to surf to live that surf life. Cue the indispensable surfboard. A perfect companion to ease the nerves of baring the fresh-out-of-gym abs, walk around Mirissa with a board in your arm, you’ve instantly earned the reverence of the whole tuk-tuk stand.\nThe symbol of the surfboard is now so synonymous with the laid back, lion-beer chugging, ‘good’ lifestyle that even Mathara Bath Kade in Colpetty is adorned with a wonky paint job of a board and a wave.\n\nThambili is the Sri Lankan Red Bull. On a hot day (everyday), nothing beats the sweet nectar of these golden coconuts. Substitute newsagents for thamibili kiosks lined up on either side of the road, occupying the few feet left for the forlorn pedestrians.\nNothing says road trip like stopping at a thambili stand, dotted along the Colombo- Matara or the Colombo- Kandy roads, where sticking to one’s own lane is only optional.\nIf you really want to get into it, drink straight from the husk and enjoy the sweet water trickle down your face and neck. Then proceed to eat the white jelly inside.\nThambili, thambili stand, the uncle who sells them and his bicycle that doubles up as the kiosk are all very hardened symbols of the casual paced, island life and the need for perpetual hydration. But of course, it’s now a super food.\nAn oldie, but a goody, the devil mask is a symbol of the vernacular craftsmanship and heritage of Sri Lanka. The most antiquated masks are allegories of animal and mythological demons. The mask-making tradition of Sri Lanka is a remarkable cultural nonpareil that has contributed significantly to Asian culture and heritage. So rightfully, these ornate works of art take a central spot in any display of Sri Lankan spirit, localism and culture.\nMost of us having never seen a thovil or a kolam, adorn our front porches, sitting rooms and gallery walls with these eclectic wooden masks, all thanks to the continuous undercurrent of the fad of regionalism. With handicraft shops popping up everywhere like teenage acne, selling overpriced coconut ladles and elephant monogramed anything and everything, the devil mask has become the Venetian mask of Asia.\nAll thanks to the ‘westpats’ on eternal ‘gap yahs’, and their ‘keen eye’ for ‘ethnic’ souvenirs, the locals mass produce and pass smatterings of iconography as cultural artefacts. Caught up in this wave of promotional gift shop mania, the miniature vesmuhunu, hooked to key rings and necklaces, splashed across cushions and t-shirts, collect dust on mantelpieces in different corners of the world.\nWhile it’s brilliant to have such an iconic symbol to embody Sri Lankan culture and artistry, it’s hard to ignore that like the elephant, the Kandyan dancer, the tea plucker, the vesmuhuna is also taken out of context and homogenised. But then again, I wouldn’t say no to vesmuhuna inspired bedspread- it’ll keep my cat away at night.\n",
  "url": "https://www.yamu.lk/blog/modern-lankan-symbols"
}