{
  "title": "Mother's Day Events",
  "abstract": "This Mother's Day, treat your mother to something unforgettable and something special with our line-up of events for the…",
  "author": "Rishani",
  "date_published": "12:56pm",
  "content": "This Mother's Day, treat your mother to something unforgettable and something special with our line-up of events for the first special lady in your life - because she deserves the best. If you have forgotten, the date to block on your calendar is May 13\n.\n\n\n\nDrop by with your mother to the\nHilton Colombo\nwhen they host their event\n. Treat your Mother to an extravagant spread of the finest culinary experience in Colombo, with a very special Mother's Day brunch. There will be a special guest appearance by the De Lanerolle Brothers! Complimentary hand massage by GAIA skin care products for all mothers at the exclusive pop-up spa! There will also be Mother’s Day hampers (limited offer and requires pre-ordering), specialty cakes, chocolates & soft toys will be available at Café Kai from 3\nto 13\nMay.\n\n\n\nSpend quality time with your mom and treat her to a delicious brunch at Pranzo, Waters Edge\nwhen they host\n. Spend a special morning with the first special lady in your life and treat your mother to a delicious brunch this Mothers' Day.\n\n\nIf you can't make it for brunch at Water's Edge, they have a whole array of events especially designed for your mother in mind. So make sure to drop in at their next event on the dame day for their\n\n\n\n\nIf you have little master chefs running about at home, here's an event for your children this Mother's Day. Shangri-La Hotel presents\nThis event is suitable for kids aged between 4 to 10 years only.\n\n\n\n\nThe Mövenpick Hotel Colombo  is having a Mother's Day Brunch with classic local and international favourites served in a charming setting with live music to set the mood with action stations, cold displays including raw farmer’s market vegetables, various salads and a separate kids corner featuring candy floss, pop corns and a selection of savories. With the finest wines and cocktails, the brunch happens at AYU\n\n\n\n\nTreat your mum to some quality one-on-one time this Mother’s Day at the special tea-party for two organised by The t-Lounge by Dilmah. Visit any of the t-lounges located at Arcade Independence Square, Chatham Street and Negombo.\n\n\nCelebrate Mother's day at The Galle Face Hotel. Mum's dine free for every group of four! Free for children under 6 and half price for children between 6-12. Take your mum out to the Verendah Restaurant between 12:30 PM and 3 PM on Sunday, 13th May.\n\n\n\n\nCreate something new with your children this Mother's Day holiday! On Saturday, May 12th come out and enjoy a time together with your family creating beautiful works of art using watercolors.\n\n\n\n\nWhat better way to celebrate Mom's Day than with brunch and some bubbly? Botanik is offering a special Sunday Brunch complete with Bubbles this Mother's Day, May 13th, so call now to snag a seat!Here's what is in store at the Bubbly Brunch, check out the menu here\n\n\n\n\nCome celebrate mother’s day at Jetwing Sea this Sunday! For a family of 5 people or more mother’s meal will be free of charge and a delicious cake will be served. For a family of less than 5 people 50% discount for mother’s meal and a delicious cake will be served.\n\n\n",
  "url": "https://www.yamu.lk/blog/mothers-day-events"
}