{
  "title": "My Dream School",
  "abstract": "Kawitha is a student from Batticaloa. She helps her father in his small village grocery shop during the…",
  "author": "Rishani",
  "date_published": "9:48am",
  "content": "Kawitha is a student from Batticaloa. She was extremely enthusiastic about beginning her new school term, but her enthusiasm would have been short lived if\nhad not stepped in to save the day. Kawitha's parents would have not been able to afford the list of school items she is expected to take to school.\nKawitha comes from a poverty-ridden rural village and, as with children just like her, she would not have been able to purchase uniforms, school shoes, new school bags filled with pencils, erasers, boxes of crayons, exercise books for a new term in school.\nAlthough national statistics show few patterns of exclusion at primary and lower secondary levels, with no significant findings on age, gender, wealth or rural–urban divide, it is acknowledged that a substantial number of children aged 5–14 years are still out of school and are being denied their right to an adequate basic education. Examination of micro-level studies on OOSC revealed the following common barriers to education.\nDemand-side socio-cultural barriers and bottlenecks influencing exclusion (non-enrolment, dropping out prematurely from school and high absenteeism) center on family poverty with other vulnerabilities. Poor health and disabilities also were found to prevent children from obtaining a full cycle of basic education. The inability of very low income families to spend on clothing, stationery, private coaching and books, and children kept back from school to look after younger siblings, to seek employment to support the family and to assist parents’ activities such as farming, fishing and small businesses emerged as determinants of non-participation in education. The absence of a conducive home environment and lack of study space and facilities are also barriers linked to poverty.\nMy Dream School's vision is to \"provide much-needed facilities to one school at a time to each province, each district and establish one school on our own in Sri Lanka.\"\nMy Dream School steps into these voids by providing solutions for underprivileged students and poor schools, one school at a time, by lending a hand towards making resources accessible and available. Apart from providing resources, the project also upgrades dilapidated buildings and helps schools create exciting spaces for children to learn and play.\nWe identify needy schools via referrals and conduct a need analysis after a field visit. These ideas are converted into reality through the generous contributions and collaboration of various organizations and individuals.\nMy Dream School's focus is to help underprivileged students and schools. They upgrade buildings and provide resources in order to further their education without a hindrance.\nMy Dream School is a project by International Movement for Community Development (IMCD). IMCD is a non-profit established in 2012, with the vision to be the global role model in community-focused social development. IMCD is registered under the Voluntary Social Services/Non-Governmental Organization (registration number L-149504).\nTo help out on their next project, visit\nTo volunteer or give towards My Dream School contact\n.\nTo gift a donation, send to:\nFor more information visit their\n, or\n(All images courtesy My Dream School Facebook page)\n",
  "url": "https://www.yamu.lk/blog/my-dream-school"
}