{
  "title": "National Parks in Sri Lanka",
  "abstract": "Wildlife, nature, seclusion. Some of the wildest, and best parts of the island.",
  "author": "Kinita",
  "date_published": "10:58am",
  "content": "If you're into the ridiculous rush of watching a sleepy leopard stare you down while it licks its paw, or soaking in pristine rivers weaving through jungles, or gorgeous fiery sunsets, your visit (or residence) in Sri Lanka is incomplete without a park visit. You've got plenty of choice too - Sri Lanka has\n, which is amazing for such a tiny island, and makes it one of the world's top 5 most biodiverse countries.\nWhile there are loads of other gorgeous parks, from the quirky\nin the North to the eerie Ussangoda in the South, we've focused on parks that we've visited and loved : our don't-miss list.\nEasily the most popular and frequently visited park on the island, Yala covers an impressive 979 square kilometers. It goes all the way back to 1938 as one of the country's very first national parks, and isn't just about the majestic\n(leopard, obviously men) that generally steals the show, Yala's also got some 215 bird species, 7 of which are endemic to Sri Lanka.\nI personally don't love Yala as much as other quieter parks, because it has a reputation for overcrowding, and I've encountered loud jeeps, and irresponsible tourists. Hopefully it's getting better with a bit of official pressure, because a Yala wildlife experience is breathtaking.\nfor more.\nWilpattu simply means \"land of lakes\". Despite being in Sri Lanka's dry zone, it's usually pretty lush, and fairly easy to access via Puttalam or Anuradhapura.\nPossibly my favourite park on the island, Wilpattu sprawls and meanders, with plenty of little ponds, jungle, and the delightful suspense of having to earn your wildlife sightings via patience and skill.\nThe Udawalawe Walawe Reservoir is massive, and is a huge draw for the region's elephants during Sri Lanka's dry season. They're ambling around, and generally easy to encounter (and easy to spot - they're not exactly compact).\nBundala is Yala's less glam neighbour. A lot smaller, and a lot more subtle with the wildlife on display, Bundala is blissfully open all year, and an absolute haven for birdwatchers. The sheer number and variety of bird species (some 200) both endemic and migratory, is staggering. Birdwatching requires a lot more patience than the braggado of swaggering around in a jeep and gaping at leopards, so this isn't for everyone.\nGal Oya is\nBut it's worth the trip, possibly just for the boat safaris via which you can watch elephants wade, forage, and hang out. Float along the Sri Lanka's largest inland body of water, the ancient Senanayake Samudraya tank, experiencing the birdlife and the pachyderms.\nAbout 90 square kilometers in size, the Minneriya National Park is home to one of the world's greatest wildlife sights - the Elephant Gathering. The Park features King Mahasen's Minneriya Reservoir, built about 1,700 years ago to provide for the area during the dry season. It still carries out this function, which has led to the elephants of the region migrating to Minneriya from neighbouring parks such as Wasgamuwa via the elephant corridor (the area, not the hotel). The park is also home to other species like wild buffalo, deer, the purple faced leaf monkey and lovely endemic birdlife. However, the pachyderm parade always steals the spotlight.\nProbably one of the most famous locations on the island, Horton Plains is famous with local and foreign tourists alike, mostly for its gorgeous natural landscapes. World's End and Bakers Falls are both within the park, as are a bunch of stunning waterfalls.\nYou'll also come across heaps of sassy Sambar deer, and if you're lucky the slender loris!\nPigeon Island is a stunning little patch of land a kilometre or so off the Nilaveli coast. It's beautiful, and the snorkeling is almost as rewarding as the diving, but it tends to get quite crowded and touristy during holidays. Your best bet is to visit early morning, and preferably on non-full moon poya days (because the water is choppy, and the place will be overrun with daytripping holidayers). You'll get to see plenty of marine life, coral reefs, and more.\n",
  "url": "https://www.yamu.lk/blog/national-parks-in-sri-lanka"
}