{
  "title": "Netflix In Sri Lanka (+ How To Use The US Library)",
  "abstract": "Netflix is now available in Sri Lanka. The best thing about Netflix is the content, but a strong #2 is the…",
  "author": "",
  "date_published": "9:49am",
  "content": "Netflix is now available in Sri Lanka. The best thing about Netflix is the content, but a strong #2 is the amazing picture and sound quality. I've actually been watching Netflix here for months now and the picture feels as good as Blu-Ray, even on a Dialog 4G connection. I've been using a VPN to pretend I'm in America, but now no one has to pretend anymore! It's actually available.\nUsing Netflix now is pretty simple. You just visit\nand sign up for one of their packages.\nThe standard one lets you watch on 2 screens in HD. I've been on this package and quite happy with it. Maybe Ultra HD is amazing but I fear it would melt my data package.\nYou can pay with credit card of PayPal, and the first month is free.\nFrom there it's pretty simple, just visit the Netflix website (or use apps on a SmartTV or Playstation) and click watch. It's deeply designed to suck as much of your time as possible, so suggestions keep coming and it learns from what you like. I'll also make a few suggestions of my own below. But first, a pro-tip.\nIf you use a VPN you can switch libraries, which means you can watch what's available in the US or UK. There aren't huge differences, but some are important. For example, AMC shows like the Walking Dead and Breaking Bad are available in the US library but not for Sri Lanka. So if you can't find something, it pays to switch around. And it's easy.\nI use\n, which is a free browser plugin for Chrome. You can pay if the occassional reminders bug you. From there you just hit one button in your browser to change locations (US, UK, whatever). With Zenmate you can even set it to automatically switch with the paid version. People also use stuff like\n, though we haven't tried that out.\nThis enables you to view basically everything Netflix has to offer, and it lets you view other geofenced content as well (The Tonight Show, The Daily Show). It's worth an install just to liberate yourself.\nThe basic way to watch Netflix on a TV is to either have a Smart TV (Internet connected) or use an HDMI cable to connect your computer. There are a few other ways and some details which we've written a full post on here:\n.\nNetflix is actually cheap compared to the data usage, which is important to remember.\nAs a quick test, I just watched for 15 minutes, in which time it downloaded about 400MB. So you're looking at roughly 1.6 GB per hour (not scientific, please comment if you know better). This can add up quite fast. If you binge Narcos (about 8 and a half hours) you'll be looking at 13.6 GB of data usage. Let's say 15 GB per series as a rule of thumb.\nTo use it like TV you honestly need like a 100GB package. Note that Dialog is giving you double your data at night (from midnight to 8 AM), so if you're a night owl this might work out. Sri Lankan Internet speeds are good enough to support Netflix, but the question is whether your wallet can.\nAnd now the fun part. If you're getting started on Netflix, here are a few shows I have loved. Note that most of these are Netflix originals, which is coincidental but cool.\nThis hilarious comedy by Aziz Ansari is basically the first time a brown person has been on TV and not been a doctor or scientist or been played by another race. He's a funny person who happens to be brown. Episode #2 (Parents) is must watching for anyone with Asian parents. Or anyone with parents really. The whole show is hilarious and especially relevant to Sri Lankans. He looks like us!\nI've read the book here and this story of Pablo Escobar's life is very close to what happened. Which is nuts. We're talking billions of dollars, lots of explosions, and a smoldering performance by Brazilian Wagner Moura, who even put on a little pot for the role (and smokes a lot of pot, incidentally). This is basically a long roller-coaster of a movie, superbly done.\nThis series by the Wachowski Siblings (from the Matrix, remember) is my personal favorite. A sprawling story of a group of 8 people that become psychically connected takes time to build its characters (in Iceland, Korea, India, America, Mexico, Nigeria, and Germany) but once you get the premise and the people, it kicks in with some of the best action sequences I've ever seen on television. This might not be for everyone, but I love it.\nThis take on a Latin American tele-novella (their version of tele-drama) makes you think it's making fun of the genre, but watch for a while and you're realize that you are watching a tele-novella. By then you'll be hooked on the characters, however, which are centered around some very strong women. My wife was into this and I just watched out of the corner of my eye, but then I got addicted myself. These characters keep getting in trouble and somehow getting out of it, in hilarious and heartbreaking ways.\nThis Marvel superhero is my favorite, because her powers are so understated and her problems are so real. The first season is actually the most compassionate look at rape, abuse and PTSD in any medium, but it doesn't feel like that. It feels like some ass-kicking, detective fun, but the emotional life of the main character is written in incredible detail here. It's a fun watch, but at the end of it you actually understand other human beings a bit better, which is nice.\nYou'll note that all of these are TV series. The Netflix format seems to work best for what are essentially long movies now, both in terms of quality and narrative arc. If only David Lynch had had Netflix when he was making Dune.\nBasically Netflix is awesome, especially with a VPN. Now if only Spotify would come, we could fully join the rest of the world.\n",
  "url": "https://www.yamu.lk/blog/netflix-in-sri-lanka"
}