{
  "title": "New Years Eve Parties in Sri Lanka (2015)",
  "abstract": "We've listed all the NYE parties for 2015. Hotels, restaurants and even a beach-side rave.",
  "author": "Imaad",
  "date_published": "3:37pm",
  "content": "We've got you covered for New Year's Eve parties this year in Sri Lanka - mostly Colombo. From hotel dinner dances (Hilton, Kingsbury) to EDM parties, there's quite a few options this year.\nHere's our round-up of the NYE events for 2015/2016.\nSlipping Chairs playing\n\nEvery hotel does their take on the 31st night party. Smart casual or formal dress code is the usual, but it's safest to go with the latter so that you don't turn up under-dressed. This year doesn't have as much variety, in terms of theme.\nMost of the parties that cost above Rs. 15,000 are all inclusive, which includes dinner and breakfast, but some of the less expensive ones charge a corkage fee between Rs. 1000 - Rs. 3000.\nIf you're just looking for a party, ON14 has a great deal with the option of party only, party dinner and breakfast or party and breakfast. The DJ's will be spinning electro, deep house and hit songs.\nIf you're looking for a decadent finish to 2015, Mount Lavinia Hotel is offering just that. From shisha to cigars, karaoke to cognac, and a stellar firework display, there's plenty to indulge in.\nRetro Fusion is a local twist on NYE. Annesley and the band Doctor will perform both English and Sinhala hits.\nCafe Francais by Pourcel is throwing their own NYE with a 7-course dinner. Duck, lobster and veal. Plus the bar and diner are open to anyone, and there's DJ music through the night.\nTNL is on board with Cloud Cafe for NYE, this year. So you can expect a performance by Onstage winners Cosmogyral and DJ Tharindu. Apart from the buffet dinner and breakfast, there's also discounts on dinner at Scarlet room and treatments at Amber Spa. Book a table of 10 and they'll throw in a bottle of scotch, a bottle of vodka and two chasers.\n, with dinner buffet, two bottles of spirits (brown and white), two bottles of wine and chasers to a table of ten, Sri Lankan breakfast, and dance music through the 70's and 80's. Also, the funkiest constumes can expect prizes.\nAmuseum and Taphouse are having their own NYE events. Amuseum's is by far the biggest, taking up the Taj North Lawn.\nHosted by Disciples, corkage is Rs. 2000 for spirits and Rs. 1500 for wine/champagne. The gig is presented by Kama but it's taking place at the Kingsbury, and it's meant to bring the feel of Paradise Beach Club in Mykonos.\nThis one is all about club music with DJ John Revox, DJ Danushka, Jayy Vibes, VJ Prasan and DJ Rami. They also offer a complimentary breakfast to work off the booze.\nTaphouse has got The Slipping Chairs performing this year, again. This year you can get tables for eight people for Rs. 40,000, inclusive of a bunch of drinks and chasers.\nR&B are bringing down two DJ's from Melbourne to deliver a taste of Melbourne night life. They'll be transforming R&B, taking on Melbourne's graffiti and signature landmarks.\nThese are some parties a bit further out of Colombo.\nIf you're looking for something kid-friendly and basically just want to eat, Loon Tao offers a buffet for Rs. 4,900 which is half price (Rs. 2,400) for kids and free if they're below five. They've got a black and white theme going on this year.\nThe Taprobana beach resort is chilled out and not too far out of Colombo. There's an international dinner buffet and kiri bath at dawn. Tickets for kids age 6 to 15 are at Rs. 1,500, and kids under 6 walk in free. Tables of ten receive a complimentary bottle of Johnnie Walker Black Label and Smirnoff. The music is 80’s to today's chart toppers performed by the live band and DJ.\nLadies walk in free until midnight, and then it's Rs. 1000 after. Kingfisher, in Unawatuna, is generally good for parties, so this one is bound to be fun with DJ's like Tim Tim at the decks. They've also got a DJ down from London.\nDeeper down south, there's Zephyr in Mirissa. Muku, who played at Peacock, will be DJing among others. Pretty much a rave.\nWith the sole aim of producing a hangover worth nursing, 41 Sugar and Sugar Bistro and Wine Bar will be taking charge of the food and drink, so there ought to be plenty. They've got six of the grooviest DJ's in town on their line-up with curated music - lot of lounge, deep house, soulful house, jazzy funk. Thalpe is a great place to be in this season and this should be one of the more civilized and hip spots this year. We'd suggest trying out the pizza at\nthe next day.\nHeads up, this is not a comprehensive list, and there will be updates. We're not sure why some of these parties don't have their fliers out and word spreading, but when they do, we'll add them.\n",
  "url": "https://www.yamu.lk/blog/new-years-eve-parties-in-sri-lanka-2015"
}