{
  "title": "Oktoberfest In Colombo",
  "abstract": "Würstl, Brezen, Knödel, Sauerkraut and all types of beer, here's a list of the places where you can find all…",
  "author": "",
  "date_published": "4:54pm",
  "content": "Würstl, Brezen, Knödel, Sauerkraut and all types of beer, here's a list of the places where you can find all these and celebrate Oktoberfest as well.\nThe Colombo Rowing Club hosts their\ncelebration on October 20th. Call Club office on 112433758 for reservations Oktoberfest buffet entrance will be through reservations only . Please reserve on or before October 19th.\nHead over to the Kinsgbury's\nfrom October 20th - 29\nfor a proper German fare including “Bavarian Mixed Grilled Platter”: Chicken/Pork sausages, grilled Chicken, grilled Pork belly, Spare ribs, German potato salad, stuffed potatoes, Bagels. Pretzels and two mugs of Oktoberfest brew just Rs.3,500/- nett per person sprinkled with the best line up of entertainment in the city.\nEmpty your belly, warm up your voice and bust out your best Bavarian dance moves because\nis finally here! With local and international beers to choose from, hearty festival food to tuck into and a loud German band to party with, this is the ultimate Oktoberfest experience. October 25th - 29th.\nExperience a one of a kind\nGrand Lawn with an entertainment lineup inclusive of an authentic Bavarian Band and popular local bands such as Slipping Chairs and Magic Box Mix up. October 26\nto 30\n.\nRaise your glasses, Oktoberfest is back in Negombo! This 3 day festival will feature live music as well as German inspired food and a variety of local and international brews! Head down to the Banyan in Negombo from October 19\n- 21\n.\nHilton Colombo celebrates\nin November. There will be a live Oompah Band & Bavarian Fare from November 9 – 18.\nIf you come across more, just add them in the comments section. Happy Oktoberfest.\n",
  "url": "https://www.yamu.lk/blog/oktoberfest-in-colombo"
}