{
  "title": "One Nation, Nine Flags; The Provincial Flags of Sri Lanka",
  "abstract": "Apart from the national flag, Sri Lanka has 9 provincial flags. How much do you know?",
  "author": "",
  "date_published": "12:46pm",
  "content": "In any civilized country, the national flag is a token bearing the identity of that nation. It represents social, cultural and many other unique values of its respective nation. Designing a flag is a tremendous task and can't just be created overnight.  It requires enormous effort, and must take into consideration numerous concerns and conditions.\nApart from the national flag, Sri Lanka has 9 provincial flags that represent each of the 9 provinces. Almost all of us know what each element in our national flag personifies, but how much do you know about these provincial flags?\nHere's a brief annotation for you.\nThe provincial flag of Central province represents the three districts in it; Kandy, Matale and Nuwara Eliya.\nThe golden lion that holds a sword in the middle represents Kandyan pride. The white background of the flag shows the Matale district, while the lotus flowers at the right hand side symbolise the Nuwara Eliya district.\nThe sun and moon depicts the eternal saying; “As long as the sun and the moon remains.\"\nThe Eastern province is made of three districts; Trincomalee, Batticaloa and Ampara. Each of these districts are indicated by an animal figure in their provincial flag.\nThe image of the fish on the far left corner showcases the dancing fish under the famous Kallady bridge in Batticaloa. The hawk in the middle is for Trincomalee as it has a harbour overlooking the ocean, and the lion on the right corner is to represent Ampara, A.K.A Digamadulla district.\nWestern Province represent!!\nThe Western province flag is pretty similar to the Eastern province one, as this one also contains animal figures to symbolise the three districts in the province.\nThis flag has four\nleaves in each corner, and they stand for the\n(the Four Divided Emotions of Buddhism);\n(Love and Kindness),\n(Compassion),\n(Harmony), and\n(Equanimity).\nNorth Central Province has a flag that portrays the glory of the Anuradhapura and Polonnaruwa kingdoms.\nThe\nand the stone work part of the image in the middle, represents the Anuradhapura district. It resembles the very first\nin Sri Lanka, the temple of Thuparamaya which was also built under the reign of King Devamnampiyatissa.\nNext to that there’s a drawing of King Parakramabahu I, which represents the Polonnaruwa district. He was a great king that united Sri Lanka under one rule, rebuilt the Buddhist civilization while sending expeditionary forces to India and Burma during his reign over the kingdom of Polonnaruwa. This sketch of him features the statue of King Parakramabahu I, near\n\nin Polonnaruwa.\nThe paddies that surround the image in the center indicate the bountiful agriculture in these two districts.\nThe flag of Uva province is pretty basic yet intricate in its design. The red coloured swan in the yellow coloured background reflects several qualities that Uva province stand for; hospitality, kindness and greatness.\nThe provincial flag of Southern province slightly similar to the national flag of Sri Lanka, but has a huge piece of history attached to it.\nKing Dutugemunu who reigned from 161 BC to 137 BC is renowned for uniting Sri Lanka for the first time after defeating the tamil warlord Elara who had invaded the kingdom of Rajarata. According to contemporary experts, the banner that was carried during this legendary battle had a drawing of a lion holding a sword on his right paw, along with sun and moon symbols.\nThe flag of Southern province has been designed with the influence of King Dutugemunu’s battle flag. The golden lion with a sword on his paw leaping in the center reflects justice and equity for all kind, and the energetic nature of the southerners.\nThis also has four\nleaves in its corners, and they represent the same thing as the Western province flag;\n. The sun and the moon symbols used on this flag are similar to the ones in the flag of Devinuwara Upulvan Devalaya (City of Gods). It speaks for eternal being.\nSurrounded by the Indian ocean from all sides, Sri Lanka is blessed with tropical beauty, and aquacultural benefits. We've shared a deep relationship with the sea since the beginning of time. The Northern provincial flag shows this bond, by having blue edges on all four sides.\nGreen on the right side of the flag showcases the agricultural prosperity of the Northern Province. While the red colour represents Hindu culture, the white symbolises harmony of all religions.\nThe average temperature of Northern province is naturally higher, as it gets direct sunlight all the time. Therefore, Northerners are very capable of using solar power as a natural source of energy. The bright yellow sun in the middle of the Northern provincial flag says it all.\nSri Lanka has a rich agricultural history dating back more than 2500 years. Although now it’s all about the economical aspect, for hundreds of years it helped to form a tradition of our own, an affluent culture and a peaceful society.\nThe North Western provincial flag perfectly captures this prosperous agricultural background by the drawing of a muddy coloured buffalo, as it’s is an essential part of our paddy cultivation.\nThe provincial flag of Sabaragamuwa is somewhat similar to the national flag of Sri Lanka, and also the Southern provincial flag. Justice, equity and the bravery is presented by the golden lion with the whip, while the\nleaves in all four corners refer to the\n.\nA flag may look like a small piece of fabric, but what it portrays for the rest of the world is bigger than the country or the province itself. Therefore, knowing each of our flags and understanding what they speak for is a must for all of us as citizens of Sri Lanka.\n",
  "url": "https://www.yamu.lk/blog/one-nation-nine-flags-the-provincial-flags-of-sri-lanka"
}