{
  "title": "Online Payments In Sri Lanka Suck (Discuss)",
  "abstract": "Online payments suck in Sri Lanka. Here are the current options and some future possibilities.",
  "author": "",
  "date_published": "12:23pm",
  "content": "Online (and cashless) payments suck in Sri Lanka.\nWe'll discuss this issue further today (September 14th) at the Hive Live, at 6PM. There's a\n, and you can\n.  These are the guests:\nUntil then, here's a quick discussion on online payments in Sri Lanka, as of today.\nToday you have a few options for processing money online, and they're not pretty.\nYou can setup a payment gateway from a bank (Sampath, HNB, etc) or GlobalPay. This costs a lot and is both difficult to setup (code, testing) and use (design and security from 1995).\nFor the consumer, these gateways are also not a pleasant experience. Each bank has their own one, so you're facing a different interface all the time. Furthermore, they all look pretty dodgy. Finally, your information isn't stored (tokenized) anywhere, so you have to keep re-entering details.\nAnd don't even mention app payments, LOL. PickMe is the only app that stores card details, thru HNB, and that was after years of lobbying and work. We approached HNB about getting the same facility and they don't really return calls or emails, presumably because they don't want the business.\nWhich is the main problem with the bank based system. They're banks and they already have money. They're not really incentivized to do something new, like enable ecommerce, plus they only make solutions for their own bank, meaning that consumers end up with 12 different options, none of which are very good.\nThe hack that a few Sri Lankan companies tried was some variation of 1) getting one payment gateway 2) routing multiple businesses through it. They solved the problem of crappy user interface and painful, setup, but it was still a hack.\nYou're not supposed to use payment gateways this way, and if you visit\nor\nor\ntoday they'll tell you some variation of 'the government told us to stop, come back later'.\nWhat they're doing is kinda logical as payments should be aggregated on top of multiple banks, but the regulatory environment doesn't currently allow it.\nThere are also places that do aggregation plus provide a website and shopping cart, like\nand I think\n. Those seem to have survived.\nThe other option is eWallets, like PayTM (which doesn't work here). That means that you use real money to transfer money into your eWallet. Then you can pay using that. There are a few similar options in Sri Lanka.\nThis is a bit of a pain because you have to keep topping up this wallet\nyou buy stuff, but when it reaches scale (like PayTM) it can be a real competitor for cash.\nDialog launched a system years ago called eZ Cash where you can top up a wallet at kades or banks or online or wherever and pay through that. eZ Cash has its market share, and lets you pay bills and stuff, but it hasn't really transformed ecommerce yet. It is acceptable at quite a few places and has a wide network for top-ups.\nEvery major mobile operator gave up and joined Dialog, except for Mobitel. They have their own mobile wallet which also has a very wide merchant and top-up network.\nDFCC Vardhana bank has an eWallet but this requires paperwork to basically setup a bank account with them. Once you set it up then they have a pretty big list of merchants, and of course you can settle bills through it.\nThis is a new one from Nations Trust Bank. The cool thing here is that you can setup a Savings Account with just a selfie and a photo of your passport/NIC. It's also supposed to enable NFC and QR code payments. Since it's new it has less merchants, but they seem to be onboarding a lot.\nI made up this term and it only applies to one product thus far, which hasn't really launched. The idea here is that your card information is stored on the app, so you don't have to manually top it up. You just pay and the money comes off of your credit card or, possibly, debit card.\nDialog Genie (or Pay By Genie) is a working app that you can download and use, but right now only for Dialog bill payments. The cool thing here is that you can enter your credit card details here once and store them. In the future they should be adding support for debit cards and thus connections to bank accounts.\nThe UI is pretty great, the security seems strong, and the possibilities are many. You can scan a QR code and pay, you can theoretically use it to pay online without entering card details, this could be the one. Also it has Dialog behind it, which means the product will be marketed and could reach scale.\nThis is a problem that has been solved in other countries, so you can actually just go to Singapore, find a local partner, register a company, setup a bank account and then do online business here normally - through PayPal or whatever. There are also some options that work without you physically leaving.\nStripe is a mature US based payment processor that will incorporate a US based company for you, open a bank account and basically set you up abroad, for $500. On transactions they take a 2.9% commission plus 30 cents. It's a pretty cool program.\n2Checkout is a service like PayPal that works in Sri Lanka. The rub is that they take 3.9% commission and 45 cents per transaction. There may also be a fee depending on how you transfer the money into the country.\nThe main issue here is the cost. You have to add 45-60 Rupees to each transaction, so this basically rules out a lot of smaller transactions here, like cab rides, or even food delivery and the like. There just isn't that much margin.\nAnother option is card on delivery, or opening up card payments to merchants that don't have fixed locations, or just don't want to pay big setup costs.\nThese are basically terminals that plug into the headphone jack on a phone and send your card details as an audio signal (which is kinda cool) that an app decodes.\nThe first big splash in space was HNB Momo. This had a big marketing campaign and widespread adoption for their little card readers.\nPayable is a well-funded startup that has processed over Rs. 750m in transactions since June 2016. They'll be at Hive today.\nThese are some options for the future, from most to least plausible.\nJustPay is a backend service that lets you transfer money between banks, without going to a switch abroad. The latter part means that fees are way lower.\nThe rub here is that it isn't a consumer product per se. Each merchant needs to integrate JustPay on their own, or an aggregator needs to come in and collect a bunch of merchants. Which hasn't happened yet, but it should.\nThe government was working on something that would tie into a national identity system and somehow handle all payments, but something went weird and it's been shelved for now.\nThis is what every geek has been asking for for years, but LOL. Like they want to deal with this mess.\n...\nSo that's kinda where Sri Lanka is now, online payment wise. Hopefully some more will come out of the smarter people at the Hive discussion today, you can watch live at 6:30, and we'll share the video here after the fact.\nAs always, if I missed anything or got anything egregiously wrong, please comment.\n",
  "url": "https://www.yamu.lk/blog/online-payments-in-sri-lanka-where-they-at"
}