{
  "title": "Online Shopping In Sri Lanka",
  "abstract": "If you ever feel like some retail therapy, here's a list of sites that deliver all the way here.",
  "author": "",
  "date_published": "10:44am",
  "content": "When it comes to swiping that delightful magnetic magic strip, our choices are locally limited. Unlike toilet paper, we hold a little more regard for our credit cards when it comes to swiping since quite a bit of moolah is spent on material items we don't really need (but choose to buy anyway). So, if you're interested in engaging in a little retail therapy (aside from\n,\nor\n) whilst simultaneously swiping through the buttcrack of capitalism then read on and indulge yourselves!\nBe it makeup or a pair of chinos for your cousin's wedding, these sites have got you covered, just be on the lookout for their Clearance/Seasonal sales.\nAsos is my go-to shopping site. They provide a range of quality items at rather high prices, but, if you bag a few items during their many sales, it's 100% worth it. Delivery is handled well. Although, you'll have to sit by the sill and stare longingly out the window for the items to arrive. You'll be pleased to know that they make it in very good shape.\nFashion Market has some really interesting and quirky pieces up for grabs, like their\n. There's also a ton of other beautiful pieces of clothing you can pick up if you have the cash, so why not?\nHonestly speaking, Dress Link looks a bit dodgy and is full of knock-off makeup products and clothes: possibly conceived in some in-the-shadows workshop somewhere in a desolate corner of the world. But uphold the magnificent Lankan spirit and make your purchase because nothing's better than affordable and not-too-shabby clothing!\nBH Cosmetics is a household name for cosmetics that aren't crazy expensive but aren't crazy cheap either. From personal experience I haven't had any negative reactions (like allergies and such, god forbid) from using their makeup products. If you feel like treating yourself after pay-day, then definitely check them out.\nIf you're lucky they'll have exactly what you want. Although they're pretty much like Amazon or eBay - everything under one roof - Jadopado is well known for their tech merchandise. They appear to be widely trusted and offer good service (from what I've heard), so if you're in need of a new subwoofer or headphones, then get yourself acquainted with their extensive range of items.\nOne of the sadder things in life is not being able to purchase certain books due to unavailability. From the rarer tomes to more commercial paperbacks, these sites might have what you're looking for - if not something better, perhaps.\nRecommended by many a bookworm, Book Depository is your one stop shop for any and all types of literature. From cookbooks to finance to history, they have quite a plethora of titles to choose from.\nDelivery Time: 10 days minimum.\nDelivery Charge: Free international shipping.\nThrift Books is pretty much the same as Book Depository, except that they charge for shipping. Chances are you might find what you want in either one. If not, you could comb through the books at the\n.\nDelivery Time: 15-20 business days for standard shipping.\nDelivery Charge: $4.99 for standard shipping.\nFor all your other needs, take a look at these websites:\nHappy shopping, and if you have any personal favourite websites, let us know in the comments.\n",
  "url": "https://www.yamu.lk/blog/the-online-shopping-guide"
}