{
  "title": "Online Bookstores That Deliver to Sri Lanka",
  "abstract": "New, used, and cheap books online.",
  "author": "",
  "date_published": "10:29am",
  "content": "Bookstores here have a rather limited selection. They're also incredibly expensive, if you're buying fresh pages. Getting books online is your best bet, both in terms of prices and options (just make sure that your shipping charges are fair, though).\nHere's a short list of places where you can happily browse and binge buy without feeling too guilty. They also offer great discounts!\nThis is my personal favourite because they offer free shipping, and because the prices aren't too bad. There's a\ntoo, which is pretty addictive if you're a hopeless case who likes binging on books but is also broke. They generally have a lot of discounts and sales, and you're conveniently notified of these if you've subscribed to their (actually not annoying) newsletter.\nYou can find used books here, in good condition and for cheap. Prices are in pounds and not dollars, just in case you miscalculate the conversion rate. Books sold in bundles are super cheap, with\nfor just under 5 pounds.\nFeaturing a massive selection in new\nused books, these guys offer a bit more than your average online store: you can sell, donate, and\n. Like the site says,\n. They have a tab for\ntomes, and for audiobooks as well.\nThis is one of your more obvious online shopping options. The site's rather clinical, especially when compared to Book Depository or BetterWorldBooks, but it's also organized a bit more tightly; like for instance, you can browse for newly published books, and also upcoming books (on the far left column). Their\nis a lot nicer.\nYou can buy books online through some of the local bookstores too (Makeen, VijithaYapa and the likes), but it's a bit pointless when you can just walk in and get the same thing anyway.\nIf there are any reliable and cool stores we've missed, do let us know. Happy reading!\n",
  "url": "https://www.yamu.lk/blog/online-bookstores-srilanka"
}