{
  "title": "Out And About In Mount: Mt. Lavinia Highlights",
  "abstract": "Mount Lavinia retains a bit of its colonial charm while holding onto the bustling complexity of a concrete wilderness. Here's…",
  "author": "",
  "date_published": "10:19am",
  "content": "Mount Lavinia-  named after the Governor's mistress Lovina Aponsuwa - retains a bit of its old world charm while holding onto the bustling complexity of a concrete wilderness. While not as dense as central Colombo is, it still possesses a good concentrations of hotels, restaurants, and the like.\nBuilt around the former residence of British Governor Thomas Maitland, the Mount Lavinia Hotel captures the fleeting essence of Ceylon’s lost grandeur. Dining at the MLH has never disappointed us though we have heard some complaints about consistency. Rich in history and dependable, the MLH is an establishment that is an integral part of Mount Lavinia’s identity. They have quite a few restaurants on the premises, which we include below:\nThe Governor’s Restaurant has arguably one of the best buffets in the city. While their a la carte left us with mixed feelings, for Rs.1900 the buffet is a great deal. The Governor’s Restaurant has some of the best views of the beach, with the terrace being the best. We highly recommend their buffet, which offers an excellent selection at a reasonable price. We’d make the trip just for their desserts.\nThe Seafood Cove - the MLH’s specialist seafood restaurant - has fast service and reasonably priced food. While it’s open throughout the day their whole range of seafood is only available after 7pm. Their daytime snack bar dishes are reasonably priced with portion sizes that are well worth it. You can’t go wrong with their fish and chips, and beef burger with bacon. Despite their limited dessert menu their homemade wattalappan is a good option.\nBeing the closest accessible beach to many Colombo residents, the Mount Beach often pulsates with some party or the other. The main body extends from the MLH all the way to Dehiwela. Unfortunately it isn’t the cleanest it could be. The once golden coast - while dotted with many a restaurant, café or pub - is often littered with garbage and dirt.\nA good deal of the coastline too has been eroded over time. However, on a good day, when the tide is low, the Mount Beach is a great place to visit whether you’re playing tap rugger with old school friends or simply taking your dog for a stroll.\nCharcoal is a cozy little cafe down Hotel Road in Mount Lavinia, that made us very happy. This is easily one of our favourite hang out spots in Mount Lavinia. They've got good food and coffee, great desserts, fast service and a perfect little secluded setting. You just don't want to leave.\nToby's Estate in Mount Lavinia is a very cosy hangout that serves decent-food that's a little on the pricey side - this international franchise is still best known in Colombo as a coffee stop rather than for its dine-in. One thing that was a surprise were their tasty desserts. They've also got a very accessible location on Galle Rd and tasteful interior decor.\nBixton is a new cafe of sorts tucked into a space which was once a car park. While they aren't the best they do serve creative drinks and good takes on Western, Asian, and Sri Lankan cuisine. We personally enjoyed their Hot Buttered Cuttlefish, which, in our opinion is second only to the Colombo Swimming Club's HBC. They've even got a Sri Lankan buffet that seemed popular with office crowds in the area.\nBarista is nothing new to anyone at this point but their recently opened cafe in Mount Lavinia is actually a good place to chill. The food and drinks are the same as at any of their other outlets but it's the spacious interior is what we liked here.\nLa Rambla is a pleasant little restaurant tucked away down Hotel Road in Mount Lavinia. If you're looking for a quiet, private meal in Mt. Lavinia with good food and quick service, this is one we'd recommend. Their honey glazed roast pork, with its five spice marinade and mustard sauce was particularly excellent.\nLa Voile Blanche is a chic white washed beachside restaurant in Mount Lavinia. The service is friendly and the food is pretty good, albeit a bit expensive. However, if you're looking to have a fancy(ish) meal on the beach, LVB might be a good choice. Our dish of choice here is the tiramisu, with its heavy layer of coffee flavoured cream, topped with a layered center of cream cheese, ladyfingers (it's the cake, not to be mistaken with okra), and coffee liqueur.\nOne of the older beach hangouts in Colombo, Buba has a secluded portion of the Mount beach to themselves which grants a modicum of breathing space. It used to have a reputation for being quite happening, but it’s quietened down a bit. While their seafood takes are decent a definite plus to Buba is BYOB ;) . Service is casual and mostly caters to foreigners. While the menu is limited and a tad bit pricey it certainly isn’t bad.\nBoat Haus Cafe has been a popular seafood spot among Mount Lavinians for a while now. They offer fresh seafood and classic deviled dishes, all of it at pretty reasonable rates. Boat Haus Cafe is a great choice if you're looking to grab some fresh seafood by the beach. The service can be trying at times, but we still think the option to pick your own fresh seafood and have it prepared the way you like it is pretty awesome.\nLoon Tao was once one of the better semi fine-dining Chinese restaurants in Sri Lanka. While it’s lost its way a bit in terms of service it still serves clean, dependable Chi-Lankan food in an elegant setting. It features a wide expanse that is half an open air beach hut while the other half lets you dine under starlight. On a good evening Loon Tao hires great musicians resulting in an overall good dining experience. If you're with a crowd, or just extremely hungry one of their best dishes is the Garupa prepared two different ways.\nSteam Boat has been around for quite a while and is still a popular choice among lovers of Sri Lankanized Chinese food. SB is what it is though - cheap Sri Lankan Chinese in large portions. Their rice portions are generous, and their cuttlefish though far from the best is fine if you're craving and don't want to spend.\nRasa Malaysia is a relatively new restaurant down the Mount Lavinia beach stretch. The ambience by the beach is obviously awesome, and their Malay inspired dishes are alright - but we loved was their unique take on HBC.\nSawadee, the beach front restaurant of the Mount Breeze Hotel offers perhaps the best service we’ve had in a while. They’re essentially a cheaper, more service-oriented version of Loon Tao with a bar. They serve good Sri Lankan Chinese and have a clean, airy but slightly run down restaurant away from the bar if you'd rather avoid it. It’s my personal favourite cheap Chinese place now. The portions are large, reasonable and good.\nThis is ideal for groups. The office crowds drinking tend to keep to themselves and mind their own business.\nMt. Lavinia was one of the first locations that Burger King chose when they opened up in the island. The whole McD's vs BK debate is mostly up to personal preference but BK seems to be winning over fans. The Mt. Lavinia outlet has a great location, spacious interior and plenty of parking which is all we can ask for outside of food.\nBig Bite, like Pilawoos, is a brand with many branches of wildly differing quality. We can say that the Big Bite Mount Lavinia is one of the good ones. It's run by actual Pakistanis and they do a unique and tasty take on biriyani (chicken/mutton) and BBQ (tandoori style) chicken.\nConsider yourself a proper carnivore? Well then Backyard BBQ is just what you're looking for. They're a barbecue specialist in Mt. Lavinia that does delivery and take-out. They've got a great selection of western barbecue at a pretty good price.\nFamily Baker is arguably the best mainstream bakery in Mount Lavinia. They've got a great selection of both savories and sweets, which have been consistently tasty time and time again. If you're in Mount looking for a quick bite to eat, the pies and kimbula banis at Family Baker are perfect.\nLittle Star is a not-so-little bakery in Mount Lavinia with a reputation for their Sri Lankan sweets. While all their offerings may not be brilliant, if  you order the right stuff, you'll be leaving with a smile on your face.\nArthur's Pizza is a modest new pizzeria in Mt.Lavinia next to the Lion Pub. They're not the most authentic but the food is still comforting with a real home made taste to their pizzas.\nArguably the pub with the coolest entrance ever in the history of pubs – The Lion Pub is an establishment in Mount. The portions of Sri Lankan Chinese fare are generous and tasty while the relaxing atmosphere compels you to sit down and enjoy a cool Lion lager. Ideal for groups, the pub has some of the lowest drink prices you’ll find. Service is super fast and you’re likely to run into many gentlemen having a few cold ones while watching cricket. Their Singapore Chilli Crab is one of the best we’ve tried with another generous portion yet again.\nShore by O has become one the more popular places to head to grab a few drinks. They’ve got their prices right down to the tee with a cool Lion lager coming in for just Rs.150. Their standards have dropped an ounce but their prices for drinks are amazing. In terms of chow Shore by O! is a tad bit disappointing with some dishes coming off bland and badly presented. We’ve heard some complaints about the service but ambiance wise Shore is one of the better places in town.\nSo that's the end of our jaunt around Mount. As always, if we missed anything let us know. Aside from the obvious draw of Colombo's only swimmable beach, there's also a nice dining and bar scene in Mount as well. We hope our guide helps you have some fun down the golden mile.\n",
  "url": "https://www.yamu.lk/blog/the-mount-lavinia-roundup"
}