{
  "title": "OZO Poolside Brunch",
  "abstract": " An ocean view and swimming pool makes for a perfect setting to an eggs benny and a stack of pancakes. ",
  "author": "",
  "date_published": "12:43pm",
  "content": "Brunch is the new lunch. Everyone's getting on the all day breakfast bandwagon, and OZO is not about to miss out. We dropped in to check out the scene, as the thought of an ocean view and swimming pool seemed a perfect fit to an eggs benny and a stack of pancakes. What we were served up was pretty good, but fell short here and there. Overall, we'd still say it's a good deal.\nWe were greeted with a menu not too long after we sat down by the poolside. Brunch at OZO is a la carte, so that makes it more affordable than most hotel brunches, which is nice. They brought out a bread basket and butter, while we decided on what to get.\nWe opted for the Eggs Benedict (Rs 1650) with smoked salmon. The price is quite similar to\n, which seems to be the gold standard of brunch these days. How does it compare, then? It's pretty close! The hollandaise is plenty but not as rich, there's a generous amount of very pink smoked salmon, and the brioche is toasted but soft.\nThe poached egg was not as runny as I'd hoped, but that really comes down to your preference. The avocado was also just a little more tangy, throwing off the balance of flavour a bit.\nWe also tried the pancakes (Rs 1200). And damn, it's quite a hefty portion. You get some brioche with whipped cream and a banana too. It's served with maple syrup as well as a coconut cream and chocolate sauce. Hands down, the coconut cream is a combo you have to try. It's rich and creamy and brings a lovely tropical flavour that fits the setting of ocean view and swimming pool.\nThe pancake itself could have been a bit more moist and fluffy, but we couldn't finish more than half of it because it was just too much for one person. This would easily be shared by two.\nAmongst the drinks options on the menu were coffee, tea and juice. We tried the latte (Rs 375) and it was pretty decent.\nNot too strong, the right amount of foam, and just okay.\nThe passion fruit iced tea (Rs 650) was super refreshing. Perfect for a hot, sunny day, this one's got fresh passion fruit in there and the tea flavour isn't too strong. This makes for quite a thirst quencher.\nOZO is a hotel, so the poolside ambience essentially consists of foreigners sunbathing, which is inoffensive to most.\nWe were surprised to be greeted by their manager, Jeremy, who brought us the brunch menus. The staff in general were on the ball and very cordial. They asked us how the meal was and didn't treat us like we were strays. Which is also nice.\nSo, basically, it's an a la carte brunch menu (which is great because you don't need to commit to a Rs. 3000-4000 buffet), that grants you access to the swimming pool (only on weekends). With the ambience in mind, it's a good deal, especially since you don't have to commit a fixed amount. Then again, service charge, VAT and government taxes are not included in the prices, so be prepared for a 25% bump on your bill.\nThe food wasn't executed perfectly, but it was quite good overall and they seemed receptive to our feedback, so hopefully they'll improve from here. We'll probably stop by just for the pool access and a la carte menu, if anything.\n",
  "url": "https://www.yamu.lk/blog/ozo-poolside-brunch"
}