{
  "title": "Paan Paan's  (Chicken) Salads",
  "abstract": "Paan Paan now does salads, with a smattering of meat.",
  "author": "Aisha",
  "date_published": "1:41pm",
  "content": "has expanded their menu to include a bit more than sandwiches and savouries. They're dishing out salads now. This has been on for a few months, I think, so we decided to go on that long overdue health-food spree. Except it wasn't exactly a spree.\nPaan Paan currently offers a grand total of four choices in their salad bar — a Green Salad, Hot and Spicy Chicken Salad, Tandoori Chicken Salad, and Smoked Chicken Salad. This comes with a choice of three dressings, but it's a bit confusing as to what the dressings are. More on that later.\nWe placed an order for the three meatier salads, all which were priced at Rs. 450 each. The Green Salad (which has, according to their product description, iceberg lettuce, carrot, red cabbage, green cucumber, tomato, corn, cowpea or kidney bean) clocks in at Rs. 350 per bowl.\nUnfortunately, the guy taking our order seems to have been a bit confused so only two salads (Smoked Chicken, and the Hot and Spicy Chicken Salad) were delivered. The rest of the stuff seems to have been lost in delivery. Or communication. We called back to clarify this and ask about our missing salads, but the lady who answered the phone the second time around was quite adamant that we'd placed an order for just two salads instead of three. Ah well.\nMoving on.\nFirst off, as far as greens and veggies go, the stuff in here were as fresh as it could get. The main components of these were iceberg lettuces, red cabbage, cucumbers, tomatos, carrots, and sweet corn.\nPictured above is the Hot and Spicy Chicken Salad. The freshness of the veggies really shine through in this one with the chicken adding a bit of heat. The veggies in here get a 5/5, and the chicken would too, if it was a bit more than just garnish.\nAll of whatever chicken there was was basically layered on one side at the top of the dish, and it disappeared pretty fast as there wasn't much to begin with. It was well-flavoured, spicy but not packing in too much heat — just flavoursome and well-marinaded. We think it could have used a lot more meat, given that there was just a smattering of it. So if you're thinking of picking this one up make sure to mix the chicken in, if not you'll likely finish the chicken early and be left with just a vege salad in the end.\nAlmost the same could be said of the Smoked Chicken Salad.\nThe greens were again top-notch, but the chicken was quite bland and a bit rubbery. And also insufficient to balance out the rest of the salad. It looks like there's a lot of it, in the picture, but that's pretty much all there is, with no meat underneath.\nThe dressings were a bit of a mystery, given that I'd ordered a Thousand Island Dressing and a Honey Mustard Dressing (at least, that's what the guy at the other end of the phone told me they were). We got something quite mustardy and vinaigrette-ish, but the Thousand Island wasn't there. That little glitch aside, the dressings were quite decent and packed a punch. They came in little tubs, and I reckon we could do with a bit more, but meh. They were both a pale greenish colour (as you can see in the first picture), with one being a bit thicker and sweeter in consistency and flavour than the other.\nPaan Paan's salads are pretty good but could work on adding a bit more meat to the carnivorous ones. They could also perhaps be a bit more attentive when taking down orders so that it doesn't leave all of us confused. You'd probably need to get them to repeat the order thrice, as opposed to the usual twice.\n",
  "url": "https://www.yamu.lk/blog/paan-paans-salads"
}