{
  "title": "Photography Competition: Pic Your Values ",
  "abstract": "A competition for social conscious young photographers",
  "author": "Halik",
  "date_published": "9:29am",
  "content": "‘Pic Your Values’ is a photography competition that The Asia Foundation is doing in partnership with the Photographic Society of Sri Lanka. If you're between the ages of 18-29, interested in photography and consider yourself some sort of activist, read on.\nThe competition is based on six themes: peace, respect, tolerance, compassion, honesty/sincerity, and solidarity. It's open to young people who seek inspiration from their own communities, reflect, and can capture what these values mean to them.\nThe competition is open until May 30, 2018, winners will have exciting prizes, and non-winners still win anyway because all of it is for a good cause. Check the details below.\nAs part of its campaign ‘Values4All’, The Asia Foundation calls all amateur photographers to reflect on what inspires them to promote a better Sri Lanka, and share it through photography. Hence, ‘Pic Your Values’ photography competition is based on six core humanistic values: peace, tolerance, respect, honesty, compassion, and cooperation.\nAnyone between the age of 18 to 29 (as of May 30, 2018).\n1. Take a photograph that depicts one of the values mentioned above.\n2. You are allowed to submit a maximum of 3 photographs; only 1 entry per value.\n3. Save your picture(s) under the name of the value it represents. (For example, if you are sending a photograph that depicts ‘Tolerance’, the image should be titled and saved as ‘Tolerance’.)\n4. Email your photograph(s) to: picyourvalues@gmail.com\n5. Please include the following details in your email:\n• Full name\n• Date of birth\n• NIC number\n• Residential address\n• Contact number (preferably a landline and a mobile phone)\n• A caption and a brief description explaining how the photograph depicts the\nvalue selected (a maximum of 50 words will be allowed for each description)\n• The overall competition winner will receive a gift voucher sponsored by CameraLK for Rs 50,000.\n• The overall winner and the top three winners, in each category, will be awarded medals by the Photographic Society of Sri Lanka, and a certificate by The Asia Foundation.\n• Winning photographs will also receive giftpacks.\n• Winning photographs and shortlisted photographs will be featured on the upcoming Values4All website, and Android mobile app, developed by The Asia Foundation, with credit to the photographers.\n• Images should be saved in JPEG format\n• Maximum file size is 500KB\n• Images should be a maximum of 1400 pixels in width and a maximum of 1050 pixels in height (including any borders)\n• Image resolution should be a minimum of 300 dpi\n• Photograph can be in colour or monochrome\n• Pictures can be taken from a mobile phone or a digital camera\nWinners will be selected by a panel of judges including representatives from the Photographic Society of Sri Lanka, The Asia Foundation, National Youth Services Council, and Sri Lanka Unites.\nDeadline for submission of competition entries: May 30, 2018\n",
  "url": "https://www.yamu.lk/blog/pic-your-values-photography-competition"
}