{
  "title": "PickMe and Uber: What the Fare Increases Mean For You",
  "abstract": "PickMe and Uber became very popular, very fast with value for money and (theoretically) ease of use. But with their recent…",
  "author": "Dili",
  "date_published": "10:57am",
  "content": "Once upon a time in  Sri lanka you only thought of using a taxi when you had to rush someone to a hospital or to a flight. You need only take a glance at the roads to see how much that has changed.\nThe sudden\nincrease of three wheelers, and the advent of the Tata Nano and similarly sized vehicles meant that taxi services exploded in size and number. They evolved from cars and vans, to tuktuks and nano cabs, and finally to the app based system pioneered in Sri Lanka by PickMe and Uber.\nValue for money, (\n) ease of use, and name recognition made PickMe and Uber very popular, very fast. But with their recent price hike, is that still valid?\nUber maybe newer to us but it’s the big boy. It’s a global company that’s raised up to 15 BILLION US Dollars in investments. Yet it recently came to light that they were losing money on each trip, with passengers paying only 41% of the cost and the rest being paid out by company subsidies. Maybe it was that, maybe it was the drivers complaining, but either way Uber in Sri Lanka has raised prices for long trips.\nIn short\nnow.\nWhich means UberGO will still have the base cost of Rs.50, then Rs.30 per kilometre for 10 kilometres and any further distance will cost Rs.42 per kilometre, plus Rs.2 per minute of the ride.\nUberX will still have the base cost of Rs.100, then Rs.50 per kilometre for 10 kilometres and any further distance will cost Rs.62 per kilometre, plus Rs.2 per minute of the ride.\n: “Colombo, we know your love for long drives to your favourite destinations. So, to ensure availability of your favourite ride for these drives, we have slightly changed the fares for the benefit of our driver-partners.\"\nOne of those is increasing\nFrom the driver’s perspective this is understandable. Since there are so few PickMe drivers outside the major urban centres, picking up a hire in the boondocks often means travelling further for the pickup than for the actual fare.\nAlso\nand so encourage more drivers to come to that area. (Hmm. I wonder where we’ve heard about something like that before.)\nAlthough, unlike every Sri Lankan government, they have included a price reduction. PickMe used to have an additional\n. It is however still applicable to three wheelers.\nLong distance trips will have a heavier hit on your wallet than before. Same for short distance rides outside Colombo on PickMe. If you usually travel short distances inside Colombo when the traffic is low, you won’t have a problem.\nBecause of these changes it’s not harsh to think twice about taking an Uber if you’re going on a journey that’s more than 10 kilometres. With PickMe, even if they haven’t changed the base rate, it would be better to just get a tuk off the road for short trips.\nYou can keep using PickMe and Uber if the changes are acceptable to you. If not, there are alternatives.\nhas a lot of Taxi service numbers on its sidebar, with the rates as well. Services like Budget Taxi, Fair Taxi, Home Taxi, OnlineCabs.lk work at rates lower than both Uber and PickMe. The downside is that you’ll have to deal with their call centres and usually lackadaisical customer service.\nIn any case, now you know. And like G.I.Joe said, “knowing is half the battle”. So next time you’re taking a trip, do the math and check what’s best for you.\n",
  "url": "https://www.yamu.lk/blog/pickme-and-uber-srilanka-what-the-fare-increases-mean-for-you"
}