{
  "title": "Pimp My Tuk",
  "abstract": "Ever wondered where all those baby pictures, Bob Marleys and wise sayings on our Lankan tuk tuks come from? We followed…",
  "author": "",
  "date_published": "9:49pm",
  "content": "If you live in Sri Lanka you might have noticed that the average tuk tuk here is pimped out with interesting pictures, wise sayings and miscellaneous decor (plastic grapes seem to be the latest trend).\nOur tuk tuk drivers express themselves through their three wheeler bling, whether it's a 'Power Of Jesus' or 'Masha Allah' on the hood, film actresses on the side mirrors, Che Guevera on the seats, or a precious bit of wisdom on the tuk tuk's behind, such as this:\nWise words indeed. Sometimes I'll be heading down traffic minding my own business, when BAM, a tuk tuk just blows my mind with its stickers of proverbs (my personal favourite was a 'who flies not high falls not low').\nWe don't know about you, but these sticker and poster covered tuk tuks have always made us wonder: Who comes up with these lines? Why do tuk tuk drivers like Bob Marley so much? And why is there a fat-baby picture staring at me on the inside of this tuk?\nWe followed these questions right to the source, using our super sleuthing abilities (that is to say, we asked a tuk driver) - and we found ourselves heading to Maligawatte, the place where drivers all over Colombo head to, to pimp their tuks.\nOur trusty guide on this meaningful journey was Ajith of Maharagama, seven years a tuk driver, who himself prefers keeping his tuk simple and bling-free, save for a bunch of fake grapes that hang near his rear view mirror. He told us there are a lot of shops that help make your tuks awesome, in Nedimala, Karagampitiya, Maharagama and Moratuwa to name a few, but the most popular are in Boralasgamuwa - and then the holy grail of tuk bling, Maligawatte.\nOn the long trip there we came across some awesome things in Maradana, just before Maligawatte. The first was\nride, bright pink, with rasta themed lining, side mirrors with babies on them, pink seating and a banging sound system (unfortunately the driver was absent). We also saw a horse on a roundabout made entirely of car parts. We stopped at a bunch of places along the way, and we've outlined them all here, from the sticker shops to the baby poster guys.\nThis is the stretch of three wheeler repair shops/garages, just before you reach Dutugemunu Street near Kushmi. It's mostly a repair zone, where you can get your tuk tuk serviced, sheathed over the top, and get little decorations like plasticy silver handles and Buddhist flag stickers. The decor costs around Rs. 100 - 200. Ajith told us Dehiwala and Boralasgamuwa are big on spare parts, but low on stickers. The search continues.\nAuto & Stickers was our first stop on reaching Maligawatte. Maligawatte seemed to be home to mostly Muslims, Tamils and a few burghers, and Sri Saddharma Road was described as the 'number one place for spare parts'. A&S is an impressive popular store with game changers like buffer speakers in a range of colours (Rs. 6000), a multitude of fake grapes (Rs. 350), and special plastic with outlined artwork that lights up (Rs. 2000). The stuff in Maligawatte is local, Chinese or Indian, said the boy at the counter. But did they have stickers? Apparently not, and we had to travel further interior to find the street of the tuk stickers.\nNawala Stickers was a sign that we were getting closer. It's not on the great sticker street, but it's on a little bend off Temple Road. You get some randomass ones here, like tiny icons of dolphins and pandas, and very somber looking 'Born to Party' stickers, but mostly full-body decorative stickers (lightening shaped lines etc.) to paste over the edges of your tuk. If you keep going down this road you enter Jumma Masjid Road, where the town mosque and similar shops of the kind are.\nWe'd finally reached the holy grail. The NHS Road is where it all happens - all the upholstering and sticker bling a tuk driver's heart could desire. Shifan Auto, run by a guy called Fazmi, features a few jovial young men printing stickers and then manually cutting them out with blades and rulers. I pointed at a sticker that said 'Fear no fire' and I asked Fazmi, why? Where did he get the idea to print out such a line? He blinked back at me and said he Googled for proverbs and picked the ones he liked. You can get an interesting one-line sticker here for about Rs. 250, while a full-body sticker makeover can go up to as high as Rs. 6000.\nCris Ads on the same road, pimps out your backseats and side boards (the 'walls' of the tuk) whether you want Tamil films, Spiderman, Che Guevera or just fat babies on them, for about Rs. 500-1000. We saw a range of stylish tuks around here. The Spiderman seat was our favourite. There was also one featuring Vijay from a Tamil film, along with System of a Down and Slipknot stickers on the sideboards, showcasing the driver's obvious eclectic tastes.\nCris Ads' boss Prasad showed us how it works on his computer - he's got a gallery of most popular images, and drivers usually pick from it, but they can also bring their own artwork for printing (a lot of people get their kids' names on their tuks for example). I asked him what people ask for the most, and he said Hummers, American flags, Tamil actresses and natural scenery top the list. Then he showed me this mind boggling artwork where Sigiriya frescoes, the Statue of Liberty and the Eiffel Tower were all Photoshopped together. I won't lie, that's what I'd put in\nThese guys do stickers too and said the prices are anywhere between Rs. 250 to 10K, depending on how bomb diggity the driver's style is. I asked Abdul Rahman, the owner, what kind of sayings people wanted the most and why. He said people liked poetry and film the best, and that Sri Lankans love them some love poems. It depends though - we saw 'Love is the way to happiness' and 'Better not come in my way' stickers on the same block.\nI then asked Godfrey, the coolest Maligawatte tuk driver and my guide through the shops on this street, why most stickers were in English, most baby pictures were white, and a lot of the film posters were from Hollywood. He laughed and said those are easy to find on the internet, there aren't a lot of cute South Asian babies online, and that it's simply what tuk drivers like.\nTip Top is run by Jabbar, who says he's pioneering a new tuk tuk style - side doors made out of decorated transparent plastic. He makes stencils of images (Bob Marley, ships, Captain Jack Sparrow) and then paints through them on the plastic, and attaches lights above them so the drawings glow. This stuff is some next level shizzle though, so it costs about Rs. 4000.\nAnd thus we bid adieu and journeyed back to south Colombo, having learnt so much about the tuk tuks we know and love. It's really a kind of crazy, legit art when you think about it - tuk tuk drivers expressing themselves through images, words and colours plastered over their vehicles. It's super random, like the Chinese baby party above, or that sticker we saw that said 'Mother told not to talk to girls' but that's what makes it so awesome.\nOne running theme throughout all the randomness is that tuk drivers seem to like happy, wholesome images (babies, mothers, their kids' names), and lines that generally give out a good vibe ('Make the heart grow'). Make sure you check out our gallery for more classic tuk tuk stylin' and if you've seen an epic piece of tuk wisdom, share it with us in the comments.\n",
  "url": "https://www.yamu.lk/blog/pimp-my-tuk"
}