{
  "title": "Places To Get Avurudu Sweets (2015)",
  "abstract": "Avurudu is coming up in a few weeks. Here's a quick list of places to get traditional Avurudu sweets, though you…",
  "author": "indi",
  "date_published": "10:29am",
  "content": "Avurudu is coming up in a few weeks. Here's a quick list of places to get traditional Avurudu sweets, though you should probably order as early as possible.\nLakpahana (across from the Racecourse) takes orders for the whole range of Avurudu sweets. \"Kavum, Kokis, Aasmi, Athirasa, Mung Kavum, Kaludodol, Aluwa, Pani Walalu, Narang Kavum and Cadjew Puhul.\" Plus a lot more. They're a reliable bet, especially for slightly larger quantities.\nThe Good Market will also be having Avurudu games and festivities on Saturday the 11th of April at the Racecourse Grounds. GM usually offers some of the most authentic food at their stalls so we expect this to be no different.\nOne of our favourite Good Market graduates, Achcharu Kade specializes in all things Sri Lankan cuisine. So expect them to have a range of special Avurudu items come April.\nFor an indulgent treat,\nare delightful and sweet. A lot of people don't actually like traditional Avurudu sweets, but these are a safe bet. They cost Rs. 550 for a box of five, 1,000 for a box of ten and 1,500 for a box of fifteen. One piece is really enough for two people. Note that Nandi's has teamed up with FedEx to deliver milk toffees anywhere in the world (basically, maybe not North Korea). You can't pay online as of yet but you can send to relatives abroad from here.\nTammy is a home baker that offers something very few others do- bibikkan, and she does it extremely well. So if you want to try something a bit different from the usual kevili, you can contact her on\nFoodie Colombo is a home baker that will be having a line-up of rasakevili for this Avurudu season at some very reasonable rates. It's a pretty comprehensive list with some unconventional stuff like\nMount Lavinia Hotel will open up it's Avurudu Kevili Kiosk from the 10th - 14th of April, right throughout the day from 10 am to 8 pm. We've had the rasakevili at Mt.Lavinia hotel in the past so we can definitely vouch for it. Other hotels will also most likely be having Avurudu sweets available so keep an eye out.\nOdel will be having a sort of fair from the 8th to the 13th with Avurudu sweets as well as traditional activities.\nMost of the bakeries will be having Avurudu sweets on offer, but not all of them will be very good. A few places we can suggest would be\n,\nand\n.\n",
  "url": "https://www.yamu.lk/blog/places-to-get-avurudu-sweets"
}