{
  "title": "Places You Can Volunteer for Flood Relief 2017",
  "abstract": "Where and how to volunteer for Flood Relief 2017.",
  "author": "Rishani",
  "date_published": "5:24pm",
  "content": "is a group of charities working together in various and flood affected locations. Keep an eye on their\nto find out their needs.\nrequires volunteers to help on the 1st of June, at 9 AM to pack relief items. Contact Andrew on 0772428442. The office is located at No. 95, Galle Road, Dehiwela.\nrequire assistance of volunteers on 31-05-2017, from 9 AM to 9 PM.\n. Contact Shifan: 0757848181, 0777101133 Akila: 0773104181 Moses: 0772512374.\nrequires large vehicles for transporting rations from markets to centres (so you can volunteer within Colombo itself), along with people to help sort/pack. Account No: 101000432815Account Name: The Voice FoundationBank/Branch : NDB (National Development Bank) Battaramulla, Sri lankaSwift: NDBSLKLX | Bank code: 7214 | Branch code: 8090\nThe people at Volunteers.LK need help too, so fill in the form\n.\n\nUrgently require volunteers to help with packing. JCI Colombo, 108/10, Wijerama Mawatha, Colombo 07. Contact 0772381981,  757848181  477710113\nrequires transportation immediately to transport large quantities of relief. Contact  114 248 220.\nThere is an urgent need for clothing and a requirement for volunteers to transport relief items to various locations. Contact 112 588 881.\nKeep an eye on\nas they update the volunteer needs and appeals as an when it comes in.\nis in urgent need of volunteers. LEADS will be We will be carrying out various projects for children affected by the disaster. To be of assistance, contact: 114 000 259, 117 398 105.\nIVolunteer: IVolunteer International is partnering with Disaster Relief Project “United as One – එකාවන්ව එකමුතුව” . You can keep an eye out for\n.\nFollow our previous blog\nwhich provides information about where to donate and the dire needs. This blog is updated as and when information comes in. You can add in volunteer needs and updates in the comments section and we will add it on the blog.\n",
  "url": "https://www.yamu.lk/blog/places-you-can-volunteer"
}