{
  "title": "Places to Watch the FIFA World Cup 2018 Live",
  "abstract": "A list of places screening FIFA18 Live!",
  "author": "",
  "date_published": "10:00am",
  "content": "After four years, it's finally here! The biggest sporting event in the world. FIFA18 kicks off today in Moscow at 6.30 pm with a grand opening ceremony. It will be held from 14th June - 15th July.\nWe compiled a list of places that is screening the matches live so you can get your cheer on with some good food and beer. Also, here's a\nof all the matches.\nYou can catch the World Cup live at Movenpick at their rooftop bar\n, with giant screens and live entertainment. With up to 50% discounts on beverages from the 14th June - 15th July.\nWhat's more? If you predict the winner prior to kick off at Vistas, you can get 15% off on your total bill.\nBotanik Bistro & Bar will be screening the Fifa World Cup every night from 6.30 pm to midnight. They'll be having exclusive deals on bottles and shots along with some great offers on their excellent botanical cocktails and snacks!\nAs always, Playtrix is all ready to give you the best experience possible with extra large satellite dishes, broadcasting multiple feeds in case of rain. They are also prepared with special streaming options in case of a thunderstorm. And of course, it's all High-Def!\nSpirits are all inclusive (works out to a 20% discount). Beer and Cider will be subjected to 27% service charge and taxes. The Tsingtao deal is the best one with 650+++ for 2 beers.\nThey also have special deals that run on specific days (for example: on Fridays, they have unlimited free beer pong after 9 pm) as well as Ladies Night deals.\nLadies Night: After 9 pm on Friday, 1 free cocktail for each lady. Unlimited Cider for all the ladies (Somersby/Strongbow). Also, any group with 5 girls or more gets 25% off the total bill. This Friday especially they'll be giving free cookies from Kookies with a K.\nOn weekdays, Happy Hour is between 5-9 pm; Buy 1 Get 1 Free on all drinks (except bottles of hard liquor like Jameson etc.) and 30% off on food.\nCheers Pub at Cinnamon Grand is a great place to watch the match on the big screen with some drinks. They have pretty good offers as well. Also, they serve a great plate of nachos if you're looking for something to go with all the drinks.\nShangri-La also plans to host the event live on the big screen at their elevated lawn with a marquee. Table seatings will be on a first-come-first-serve basis! For Premier Seating reservations, you can contact them on 011 788 8288. As for food and beverages, they will be around Rs. 500 nett.\nYou can catch the matches live at The Kings - Lobby Bar where you can lounge with friends and family while enjoying some delicious food from their special Match Menu. You also get 50% off on draught beer and there's also a FIFA Beverage Menu.\nFor reservations, call or whatsapp them at 077 108 7720\nwill be transformed into a football field with a reveling atmosphere, filled with food stalls, international beverages, games and activities, competitions and live entertainment.\nYou can watch the match on the giant screen, dressed in your team's colors which will grant you the chance to win the title of, \"Fan of the series\".\nThere's also a weekly draw you can enter into to win amazing prizes like 2 air tickets to Singapore inclusive of 2 nights' accommodation for two on bed and breakfast.\nThey also have Exclusive Cabanas and a VIP Lounge.\nBunkyard Hostels have some great offers for the first half of the calendar with special dinners like Pizza Night, Kottu Night etc. It's pretty great.\nSo there you have it. All these places will be screening the event live throughout the month so you can call and reserve your spot or just walk right in. We will update this list with more places so keep a lookout.\nHave fun peeps!\n",
  "url": "https://www.yamu.lk/blog/places-to-watch-the-fifa-world-cup-2018-live"
}