{
  "title": "Plasticcycle - A John Keells Group Initiative",
  "abstract": "Kudos to John Keells Holdings and their project Plasticcycle for tackling plastic pollution in Sri Lanka.\r\n",
  "author": "Rishani",
  "date_published": "3:04pm",
  "content": "John Keells Holdings has newly introduced the project\nin the hope of reducing plastic usage in Sri Lanka. And you can be part of it!\nPlasticcycle is committed to making a difference by:\nPlasticcycle was launched in July 2017 in two wards belonging to the Colombo Municipal Council located in Colombo 2 (Wekanda and Hunupitiya) with the intention of adopting the learnings from the pilot in expanding the project.\nUnder this initiative John Keells Holdings has introduced bins to collect plastic waste for recycling. The project, which initially began with just three bins, has now expanded with bins being placed across many of the Keells\nSuper outlets in and around Colombo. To find a bin near you,\n.\nThe manufacture of plastic, as well as its destruction by incineration, pollutes air, land and water. Synthetic plastic does not biodegrade but accumulates in landfills and pollutes the environment.\nPlastics are a municipal waste nightmare, prompting local governments all over the world to implement plastic bag, and increasingly, styrofoam bans.\nChange has to start with each and every individual. We can all take the pledge to:\nplastics. Start right now by recycling plastics and using Plasticcycle Bins, it's super easy.\nPlasticcycle bins are designed to easily dispose of recyclable plastic.\nThere are two clearly marked slots in the bins – one for plastic bags, the other for harder plastic like bottles and cups.\nRinse plastic containers with water before dropping them off.\nPut in your plastic one at a time rather than tied up in a bag.\nFlatten out plastic bottles to expel as much air as possible.\nPlasticcycle is a\nInitiative with a vision of being the catalyst in significantly reducing plastic pollution in Sri Lanka.\n(Images and information kind courtesy of Plasticycle FB page and wesbite)\n\n",
  "url": "https://www.yamu.lk/blog/plasticcycle-a-john-keells-group-initiative"
}