{
  "title": "Pork In Colombo - 17 Places To Get It",
  "abstract": "Pork lovers in Colombo don't have a lot of choice. There are, however, a few places that do the meat justice. Here's a…",
  "author": "Bhagya",
  "date_published": "11:14am",
  "content": "I've spoke of the Pork\nAnd my love for it's crunch\nNow I must give due credit\nTo whom I had for lunch\nPork lovers in Colombo don't have a lot of choice. Pork is a vital ingredient in Asian and much European cuisine, but Colombo's large Muslim population means the demand isn't really there. There are, however, a few places that do the meat justice. Here's a round up our favourites spots in and around Colombo to get your pork fix.\n\n\nItalian cuisine and pork share a very close bond. You could say that their rendition of pork is the less greasy and visually appealing in the form of prosciutto, salami and chorizo. Unfortunately, not all local Italian eateries and pizzerias offer pork, instead opting for the infuriating \"fakon\" aka chicken.\nGiovanni's is one of our favourite new additions to the local pizza scene and his bacon and cheese is fantastic. Depending on what he has in stock he'll sometimes have Italian sausage or other delights. We usually get a half bacon and cheese and half whatever Dimuthu recommends.\nIf you're looking for a place in the suburbs, we'd suggest trying out La Rambla in Mount Lavinia. While La Rambla isn't really a dedicated Italian restaurant, most of their dishes are influenced by Italian cuisine. The honey glazed pork roulade was roasted perfectly, with the five spice marinade further enhancing the flavour.\nHarpo's does real Italian pizza with parma ham, etc, yes, but what we really want to talk about are their ribs. Yes, you can order ribs for delivery and they're delicious. We developed a craving while watching House Of Cards and never turned back. Note that the above is their photo, we haven't taken one.\n\n\nAh Deutschland, a land only second to China when it comes to it's appreciation of pork. Sadly though, here in Sri Lanka we have only a few proper German restaurants here in Colombo. Thankfully, they're all lovely.\nWhen you talk about excellent pork dishes in Colombo, the crispy pork knuckle at Bavarian is probably at the top of most peoples' list. This one has been tried and tested over and over again, and it never disappoints. The portion is massive, cooked perfectly with a crispy rind and melt in the mouth fat. It's served with sauteed potatoes, sauerkraut and subtly sweet gravy which complements the pork knuckle very well.\nAfter initially making a name for themselves at the Good Market, The Bread Company now has a dedicated bakery in Thimbirgasyaya that offers arguably the best pork bakes and sausages. On our first visit the we had their cold cut sandwich, and on the next we had the pork burger and the pork hot dog, all of which was excellent. Coupled with their fresh baked breads, it ticks all the right boxes.\nThe Sovereign German Restaurant in Nugegoda is the lesser known of the two main restaurants, but still offers a good range of pork dishes as well. We tried their pot roast pork which was swimming in savory gravy and accompanied by creamy mashed potatoes and buttery carrots.\n\n\nAsian cuisine and pork go hand in hand, more specifically East Asian. While most of the Chinese restaurants in Colombo offer pork dishes, we've found a few that really do it justice. Not to be outdone, Korean cuisine is also a good source for pork dishes, some which are basically just bacon you cook yourself and mix with kimchi and other delights.\n\nMin Han is probably our favourite Chinese restaurant in Colombo. What they lack in terms of ambience, they make up for with excellent, consistent cooking and cheap prices. One dish we almost always order is their pork belly which is prepared much like a stir fry. You can opt to have it either with a soy based sauce, or spicy with a lot more chilli. They also offer an excellent pork soup which they call water pork, as well as something called ginger rose, basically shreds of pork.\nTong Ni BBQ is a bit different from most other Chinese eateries in Colombo with their table top barbeques. The preparation is quite similar to how you do it at Korean restaurants (ie, you do it yourself), although the way it's eaten is different. Their barbeque pork strips, quite simply put, are large strips of pork belly which you cook at the table and have along with the contemporary Chinese rice and noodles. It's very simple, but it just shows that you don't need to mess around too much with pork for it to taste great.\nHan Gook Gwan is one of two Korean restaurants in Colombo (The other being\n). Just like Tong Ni, they offer barbeque pork strips, which they call \"three ply pork\". The difference here is that it comes with a whole bunch of sides like lettuce, kimchi cabbage, honey peanuts and Korean pancakes which you combine to form a sort of wrap. It can be a bit messy, but if you like interactive meals you're sure enjoy it.\n\n\nSo finally come to our very own. Pork curry isn't something Sri Lankan cuisine is immediately associated with, but it can be really solid when prepared with the right spices. Black pork curry is a known classic.\nThe VOC Cafe at the Dutch Burgher Union is very popular for its lamprais, but they also offer a great yellow (ghee) rice with pork curry. They also offer sometimes offer pork badum and homemade pork sausage. It's like Burghers' gift to Sri Lanka. They also do great burgers (no relation), with real bacon on top.\nBarefoot Cafe has a knack for making it on to our top lists and this time around it's with their rendition of black pork curry. It's one of the most popular local preparations of pork and it doesn't really need much other than some steamed rice to have it with. We've heard rave reviews of the black pork curry at\nas well.\n\n\nPork based baked goods are nearly impossible to find nowadays, but the few who offer it seem to do it very well.\nLittle star kind of caught us by surprise when we found out they offer pork buns and pastries. So naturally we tried one of each. Their bacon and egg pastry was good but what really made us happy was their bacon and cheese bun which was stuffed full of bacon and topped with cheese.\nKlassy won't blow you away with their pork selection, but they do have it. Their bacon and egg bun has actual bacon, though chicken bacon is available. Also, their patented sauce is the bomb.\n\n\nThere's only a few listings under this category, but they're solid. You can actually get deviled pork at quite a few bars, and Cheers has a range of foord including pork, but nothing beats the late Summer Garden (RIP).\nOn the other end of the price spectrum, TGI Friday's near Dutch Hospital isn't cheap, but their Jack Daniels Ribs are quite good. Some people go here just for that dish, though they do have other preparations. And other styles of pork, but the ribs are definitely recommended.\n\n\nIf you want to go straight to the source, here are a few suppliers of pork products. We should also mention that the Bread Company (listed under German above) does great sausages and are a supplier in and of themselves.\nOutside of Negombo, Colpetty Market is the best place to get pork and pork sausage (like lingus). There's a pork butcher on the second floor, but this place isn't for the faint of heart. You will see actual animal bodies here.\nSuchetha is a guy who has a smoker and makes smoked bacon, pulled pork, ham, etc. Especially good around Christmas and other suitable holidays.\nSo that's our round up folks. It's quite possible that we may have missed a few good ones, so if you know any, please let us know in the comments section.\n",
  "url": "https://www.yamu.lk/blog/best-pork-places-in-colombo"
}