{
  "title": "Poverty Porn or Social Activism? Photographs from the Periphery",
  "abstract": "This is the second crop of young photographers that CPBR has produced. I happened to see some of the photos from three…",
  "author": "",
  "date_published": "11:43am",
  "content": "On the 7th of December I walked into an interesting exhibition of photographs. A bunch of young people from all over the country, almost one hundred, had gotten together to put up an amazing collection of pictures they had amassed from nearly four years of hard work on the walls of the Lionel Wendt. But aside from the photographers themselves, about 35 of them were there, only a handful of others attended.\nThe photographers (trained by the Center for Peacebuilding and Reconciliation – CPBR) are from what is known in NGO jargon as ‘the periphery’, which in general means that they are from lower income groups or from areas outside Colombo. At first glance these shots were a great example of the ‘bottom of the pyramid’ (that is, lower income groups in societies in which inequality gives the most amount of money to a very few at the top, leaving the rest in increasing degrees of poverty) recording itself. This allows the work produced to have more legitimacy in denying accusations of ‘aesthetic consumption’ (to use a term borrowed from Susan Sontag) of the poor.\nBut still, on closer inspection I found out that most of the photographers were themselves from privileged groups within their own communities, and a lot of the photographs themselves can be easily classified as ‘poverty porn’ to use a crass term developed to categorize a certain type of Instagram photography aestheticizing lower income groups. But is poverty porn really poverty porn? To document and represent anything requires the use of certain privileges, certain powers that will be used to appropriate and depict the subject.\nThis calls for the incorporation of another lens through which their work can be viewed; if you understand these photographs as emphasizing a social contract (as Ariella Azulay puts it) from the part of the viewer to the depicted, with the photographer simply being a conduit who actively constructs the narrative . A lot of these young photographers idealistically spoke of how they were trying to create positive social change, and some of them have already had an impact, or so they claim. Exhibitions at the local level have apparently produced dialog and sometimes even solutions for micro problems in their communities, which were recorded through their lens.\nThe pictures, around 200 of them, were curated by Jayanth Dharmawardene who also trained and guided the photographers. A lot of the photographs viscerally draw you in. The closeness of the photographers to the communities they captures is evident in many of the shots. The subjects are caught unawares, in intimate settings. They are a refreshing change from the often exoticized depiction of Sri Lanka’s poor, à la Steve McCurry and India, though there were plenty of examples that fell into this category as well.\nDespite all the questions this type of photography might raise; is it invasive or does it liberate? Is it aestheticizing poverty or depicting its reality? In a country where most rural communities tend to be documented by foreign photojournalists who swish through in a hurried few days, this new young crop of documentary photographers offer a refreshing new perspective. Here are people invested in their local communities, and (mostly) committed to using photography as a medium to address problems they see in the world around them.\nThis is the second crop of young photographers that CPBR has produced. I happened to see some of the photos from three years ago and remember being impressed. So I went as soon as I heard about this, which I almost didn’t; while the project had obviously been well executed, promotions were less than satisfactory. The exhibition has now moved on from the Wendt, to where exactly is not clear. CPBR told me they have plans for another Colombo exhibition before March, and a few others at universities island-wide. Hopefully CPBR will also consider uploading them onto the internet, or producing a book or something. Watch this space for more information.\n",
  "url": "https://www.yamu.lk/blog/poverty-porn-or-social-activism-photographs-from-the-periphery"
}