{
  "title": "Priyantha Udagedara - Orientalism",
  "abstract": "Priyantha Udagedara’s latest show, Orientalism, is now open at the Saskia Fernando Gallery. ",
  "author": "Halik",
  "date_published": "12:09pm",
  "content": "Priyantha Udagedara’s latest show, Orientalism, is now open at the Saskia Fernando Gallery. At first glance his work appears highly decorative, and the aesthetic force doesn’t fade as you look twice, and then again, but the closer you go, a wealth of detail begins to emerge that point at bigger ideas in operation.\n‘Orientalism’ is heavily influenced by Udagedara’s interest in Edward Said. Whose seminal book of the same name reassigned the meaning of this word, which was previously used to describe a branch of legitimate study into the ‘orient’ (or everything East of Europe).\nSaid exposed how this discipline effectively exoticized, othered and constructed a reality of the East which made it easier to categorize, understand and colonize by Western powers. Though Said's work was more specific to Arab cultures, his theories provide a framework that allows us to unpack power, knowledge, representation and imperialism in virtually any context.\nWorking in the beginning of the twenty first century, in a Sri Lanka now under neo-colonial influence not just from the classical West, but also China, India and other imperialist powers, Udagedara wants to question if the gaze upon the Orient, as turned upon this Island today, is still the old gaze of colonial times. ‘How is Sri Lanka seen through the eyes of the globalized, multi-polar imperialist lens of today?’ Is the question, or one of the questions, he seems to be asking.\nThis series is rife with intricately crafted symbolism. The closer you go, the more you see. His travels in China have been an obvious influence in\n, a huge 6 piece canvas. And\nvaguely invokes images of mythic India.\nWhat I found interesting was to first look at a piece from a distance, allowing it to give me a sense of a certain cultural stereotype, and then go closer to explore exactly why I felt this. The cultural stereotypes embedded in his works, revealed after first drawing the viewer through a vision of an exotic paradise (a recurring theme for Udagedara) feels like a tactic that forces the viewer to undergo the process of exoticizing something themselves, resuting in a feeling of slight shame when one realizes what has happened.\nOther symbols are purposely obscured, by the all consuming motifs of the exotic fauna he loves to use. This being contemporary art, a lot of it is open to interpretation. You start with a broad theme and the product of the artist's imagination, and then try and get a sense of what the work seems to be telling you, appreciating the tangential thoughts it provokes as a part of the experience, at least that's how I'd go about it.\nThe works are for sale, check with the gallery for a full list and prices. But even if you're not buying, the show is on until January 6, 2018, free and open to the public. I fully recommend taking advantage of this and dropping in for a look.\nBefore you go, read\non the show for more context.\n",
  "url": "https://www.yamu.lk/blog/priyantha-udagedara-orientalism"
}