{
  "title": "Pros And Cons Of Being A South Asian Man",
  "abstract": "A South Asian man contains multitudes.",
  "author": "",
  "date_published": "10:23pm",
  "content": "A South Asian man is, geographically, someone from around India (so Sri Lanka, Bangladesh, Pakistan, Maldives,\nessentially).\nBut what is a South Asian man, inside? What are his feels? What are the pros and cons of his existence?\nThat is what we'll explore here, in an entirely perfunctory manner.\nWith the exceptions of Sri Lanka and Nepal, there are more males than females in South Asia. The map above shows countries with more men in pink and those with more women in blue (they're defying gender/color norms there, but you get the picture).\nThis is not some error in the cosmic shuffling of chromosomes, there is active infanticide of girl babies in the region, though really in India and Pakistan. As you can see, Sri Lanka and Nepal actually have more women. Overall, however, a South Asian boy still has a better chance of making it out of the womb and being welcomed.\nA sarong is the ideal form of clothing for chilling, but it has proved very hard for non Southies to pull off (see David Beckham). As a South Asian man, you can wear a sarong with comfort and pride. You can wear it around the house, you can wear it formally and - if you're especially skilled - to sleep.\nBe it your mother, grandparents, or in-laws, it is highly probable that someone will ask if you've eaten. And if there's a gang of uncles, it's quite likely that they'll offer you a drink. Drinking is also a heavily gendered activity in South Asia (ie, something frowned upon for women).\nLuckily South Asian men are not limited to their looks, which as you'll see are globally not that attractive. If you can get an education and hold down a job you will be 'marriagable' and a network of family will probably step in to pair you off. Honestly, even if you're not you can probably still get married off. Bonus points if you're not an alcoholic or wife-beater, but that's often (and sadly) not a deal-breaker.\nYou're going to be shorter than most people. In the world. Sri Lanka and India are near the bottom of\n. In practical terms this means not being able to see at concerts, not having a career in professional basketball and limited creative freedom in hanging paintings. Also women find you less sexy.\nBeing a South Asian man is basically the worst thing to be on dating platforms (Tinder, OKCupid). In a\n, it emerged that Indian males got the lowest response rate of any type of male.\n",
  "url": "https://www.yamu.lk/blog/pros-and-cons-of-being-a-south-asian-man"
}