{
  "title": "Quintessential Sri Lankan Comfort Foods",
  "abstract": "Here's a list of comfort foods that have helped many a local stay on their feet.",
  "author": "",
  "date_published": "9:50am",
  "content": "It doesn't matter if you're on a diet or if you're the king of fitness; every now and then the blues hit you and you crave something that'll quell the sadness.  Unlike most comfort foods worldwide, ours are a bit more vibrant in terms of flavour. So move over bland chicken soup, here's a list of local comfort foods that keep us going.\nYou could be a white rice enthusiast or a red rice aficionado but either way you won't find yourself in the pit of despair once you've gorged on a full plate of\n. Whether you enjoy the occasional dollop of spicy potato curry, oodles of\nwith a nice chunk of chicken or if you're into a portion of\nand crumb fried fish; nothing beats the absolute satisfaction and reassurance that a plate of rice and curry provides.\nTraditional beef\n(porridge) is hands down my go-to comfort food for when I'm hit with the gloom. There's only a handful of things better than diced chunks of beef seeping in coconut milk infused rice. If you aren’t lazy like I am, you can make your own with this recipe for chicken kanji. If you’re more of a beef person, just substitute the meat and you’re good to go.\nThis falls under the rice and curry category but it deserves a special mention. The mere sight of a\npiled to the top with steaming saffron infused rice is enough to soothe even the most savage breast.\nThese bad boys put lacy lingerie to shame. What is a flimsy bit of cloth in comparison to a plateful of\n?\nWhether they're presented in the form of biriyani or kotthu, or simply on their own; these stringy delights are the original sexy. Pair them with a hefty helping of\nfor an instant explosion of flavour.\nNobody knows for sure how this miracle-dish sprung up but it's certainly thriving in almost every\nand fancy chophouse alike. Probably one of the most diverse items on this list, kotthu can be served with a myriad of toppings. You can also substitute the traditional\nroti for any roti of your choice or even\n(bread)!\nThese packeted, MSG infused budget noodles have been the staple food of every family home in almost every corner of this island for generations. Whether you simply cook and serve, or go the extra mile with the garnish and add-ons, there's a variety of ways in which you can manipulate this stuff to cater to your belly.\nThe staple food of many a bar-crawl alike, HBC will forever remain in our hearts as the ultimate accompaniment to an ice cold beer. Many a night has been spent lamenting over one's losses in life while popping these batter-fried beauties. Chewy cuttlefish batter-fried to golden-brown perfection and mixed with a hefty dose of chilli: nothing else matters.\nI could say bread but that simple word won't do this staple food any justice. Paan, whether store-bought or home-made has brought joy to many a hungry tummy and in cohorts with a nice helping of parippu/pol sambol; proves as an unstoppable duo when chasing away the blues.\nThese oily treats are a godsend for when you're driving around aimlessly, not knowing where to get dinner from. Thankfully you can get them almost everywhere that serves up some good vegetarian grub, so be on the lookout for a Saraswathie Lodge by the roadside. If you're looking for more variety, try opting for a\nvade or head to Galle Face for your isso vade fix.\nThe fundamental snack of many a grandpa and adolescent alike (now with many variations i.e cookies and milk) a cup of plain tea with Tikiri Marie makes for the perfect nibble, day or night.\nAside from providing a sense of nostalgia and sensory satisfaction, these dishes soothe the tension in our souls. What's your comfort food?\n",
  "url": "https://www.yamu.lk/blog/comfort-foods-srilanka"
}