{
  "title": "Ramadan Explained",
  "abstract": "Here's a simple explanation as to what Ramadan is really about.",
  "author": "",
  "date_published": "11:28am",
  "content": "Ramadan is an important time for Muslims all around the globe. It's the ninth month of the Islamic calendar (seriously, it's the name of the month) and leads up to one of the most revered nights according to the Islamic faith.\nFasting is one of the five pillars of Islam. It is mandatory for all practising Muslims to fast as a sort of spiritual cleanse/journey towards enlightenment.\nBasically, we vow to stay away from all worldly temptations and abstain from consuming food and water. This is a training period for those involved so we can emerge as stronger, more disciplined individuals.\nAlso we get to experience what it is like through the eyes of the less fortunate in terms of hunger and thirst.\nSo no shisha (even after 6 PM), no parties unless they're evening sermons and certainly no gallivanting.\nIt's really not that complicated. We sit down before dawn, have a meal, ensure we're hydrated, say the prayer that indicates that we're hereby fasting and when the sun rises we embark on our food-less, pleasure-less adventure towards spiritual awakening.\nWe go about our daily activities without engaging in salacious acts and try not to whine about the smell of a freshly opened buth packet.\nAt around 6:15 PM-6:30 PM, at the first sound of the call to evening prayer, we break our fast. This is convenient because we don't seem like impatient, greedy gluttons when our hands shoot out and grab glasses of water/dates.\nThe Suhoor/Sahar is the meal we have before dawn. This is usually at around 3:30 AM-4:30 AM depending on when the morning prayers start. At first sound of the Adhan, our fast becomes valid and it's the other way around for Ifthar.\nIfthar is the pre-dusk meal we have some time between 6:15 PM-6:30 PM to break our fast. Simple, really.\nEid al-Fitr is the \"festival of breaking fast\". Once Ramadan is over and we've overcome all challenging obstacles such as not watching TV at 6 PM/complaining about our coworkers eating around us; we get to celebrate.\nHow? By donning new clothes, going to the mosque for prayers, visiting relatives that we've avoided for months and other fun activities.\nUncles whip out the non-alcoholic beer and talk politics, children run loose with fireworks etc.\nIt's just another festival.\nAlso, if you're lucky and under 15 years of age, the grown-ups give you money. I'm over 15 but to heck if some kid asks me for money. Sorry bruv, no can do.\nWe get a lot of honest questions this time of year from people who are genuinely curious. Some of us Muslims are clueless ourselves (nothing wrong with that btw, we're all learning) and so this post is meant to provide some sort of clarity in a simple way.\nIf you're a curious bystander, I hope this post is of some help. If you're observing Ramadan, then you can gain points and impress your pals with all this knowledge.\nThis is just a simplified guide explaining what Ramadan is for anyone who's curious as to what these Muslims are up to. Going into detail about this topic is like falling into a never-ending rabbit hole. There are loads of extended texts like the\n, the\n, the\n, the\nand more, that can give you lots of in-depth insight.\nA month of no indulgence seems like a laborious task. It can be.\nBut it's also a wonderful month to those who choose to observe. It's a time of communion, discipline and moral uplifting.\nNot to mention lots and lots of kanji, faluda, short-eats and nights at the masjid contemplating existence.\nRamadan Kareem and Eid Mubarak!\n",
  "url": "https://www.yamu.lk/blog/whats-ramadan"
}