{
  "title": "Ranatunge Karunananda; The Unsung Story of a Sri Lankan Olympic Hero",
  "abstract": "Ranatunge Karunananda, a forgotten Olympic hero of Sri Lanka.",
  "author": "Vishvi",
  "date_published": "9:39am",
  "content": "Ranatunge Karunananda; does this name ring a bell?\nUnfortunately most Sri Lankans aren’t aware of him or the contributions he had made as an athlete who represented Sri Lanka in the 1964 Olympic games. Even though his story made into a chapter in Japanese school textbooks, we don’t have a record of him, except for few newspaper articles.\nBorn in 1936, Ranatunge Karunananda (Karu) showed a great ability in athletics while growing up. Even though he chose to become a soldier in the Sri Lankan Army, he didn’t forget his dream of becoming a talented athlete. Back then, he was the best long-distance runner Sri Lanka had ever seen, which led him to represent our country in the 1964 Summer Olympics at Tokyo, Japan.\nThis particular Olympic Games was an important event for Japan. Japan was a war ravaged city only rearing its head from the ruins of World War II. They were willing to do whatever it took to host a successful event to draw attention of foreign investors, and to encourage the citizens of Japan and to build up their morale.\nThe day was October 14\nof 1964, and everything was set for the Men’s 10000 metres event. Twenty nine athletes from 17 nations participated in this, and Karunananda was one of them.\nHe was suffering from a bad cold but still he wanted to take part as he wanted to make his baby daughter happy. He knew that she's awaiting for his return as a proud athlete who competed at Olympics, which gave him the strength he needed.\nAs the starting signal was fired, he started running beside Billy Mills of the United States, the eventual winner of the event. The event required completing 25 laps (400m x 25), and by the end of the first lap, Karunananda was 200 metres behind the rest of the runners. While the other runners completed the tenth lap, Karunananda was running his ninth. By the end of 20\nlap, Karunananda was the last placed runner, but he did not give up.\nThe race ended with Billy Mills from United States, Mohammed Gammoudi from Tunisia and Ron Clarke from Australia touched the finishing line as Gold, Silver and Bronze medal winners. Karunananda still persisted and was running his 21st round, alone on a lap while around 60,000 spectators in the stadium mocked, humiliated and booed him. Even though he wasn’t entitled to any medal, Karu’s name made into the history books.\nEven after the other runners finished running, Karunananda kept his pace and continued to run. He could’ve stopped, but he continued running the last four laps alone. As he started the 23\nlap, a round of applause was heard from the audience, followed by a massive cheer. The whole stadium was reverberating with the chant “Karu Ceylon, Karu Ceylon!”, Karunananda ran the last 400 metres of his run. Though he didn’t achieve any medal, he won the hearts of many admirers all over the world.\nKaru’s persistance motivated the citizens of Japan, and the whole world. He had no hope of winning the event, but still he represented his country, participated in the event and played it fairly as a honourable athlete, because that’s what the Olympics is all about. Even though William Mervin \"Billy\" Mills was the victor of the race, the true winner of the people was Ranathunga Karunananda.\nNewspapers, TV and radio stations in Japan and many countries around the world talked about humble Karu’s courage and his self confidence so much so that a chapter about him was added to the school textbooks in Japan as a life lesson to the children.\nKarunananda received a warm welcome as he returned to Sri Lanka, but only for a brief period of time. There was even a plan to build a ground to honour the legend of Karu, but they proved to be empty words. Karunananda wasn’t discouraged and continued serving his country as a dedicated soldier.\nIn the year of 1975 Karunananda received an invitation from Japan to obtain a special award. His whole family was invited to this occasion.\nEverything was set for the journey, but two weeks before the event Ranatunge Karunananda's life mysteriously came to an end when he drowned and died in the\ntank. His death to this day remains a mystery. Some say it was a murder while others say it was an accident. No one knows the true cause of his death as no proper investigation was carried out by the government of Sri Lanka.\nThe Japanese government grieved his tragic death. A team of Japanese divers  recovered his body, and Japanese media - their newspapers, TV and radio stations repeatedly mentioned this tragedy. Karu’s son was even offered a full paid scholarship from Japan, but the authorities in Sri Lanka turned a blind eye and didn’t pay the due attention Karu. In 1996, a Japan television channel came to Sri Lanka to record a documentary about this legendary athlete. Even then, they weren’t given due support by the local media authorities.\nDetermination, integrity, courage and self confidence are some of the many qualities we can learn from Karu’s character. It’s sad how Sri Lanka has forgotten his story, while some others the world over still admire him for his courage and persistance.\nThe next Summer Olympics is to be held in 2020, at Tokyo, Japan where Ranatunge Karunananda made history. Here’s to a hope that his unsung story will be remembered and honored one last time.\nImage Credits :\n",
  "url": "https://www.yamu.lk/blog/ranatunge-karunananda-the-unsung-story-of-a-sri-lankan-olympic-hero"
}