{
  "title": "Restaurants We Wish Existed In Colombo",
  "abstract": "These are some restaurants we wish existed. Some or a bit silly, some are serious, but we hope they're fun. If you…",
  "author": "Shifani",
  "date_published": "4:34pm",
  "content": "These are some restaurants we wish existed. Some are a bit silly, some are serious, but we hope they're fun. If you have any ideas for restaurants you'd like to see in Colombo, leave them in the comments below.\nHave you ever had a big meal and just felt like passing out? Dine & Recline makes it easy. After you're done eating you can just recline your seat, doze off, and the waiters will roll you into a nearby capsule hotel (basically a filing cabinet for people).\nAfter your choice of a 20 minutes power nap or 90 minutes of REM sleep, you are gently woken up by ambient light and wind chimes and given bed tea. Then you can go home, feeling refreshed.\nThis is a mermaid themed restaurant, aka every Disney buff’s dream come true. Basically the dining tables are surrounded by aquariums full of realistic mermaids in a realistic underwater setting (trained male and female actors, taking swimming shifts).\nAlternatively, even something like a ninja or medieval themed restaurant would be pretty awesome.\nA gingerbread house of sorts, where everything looks edible and some things are. You have to pay a fee according to the time you plan to spend here (half hour, one hour) and you get full access for that time.\nSome things around you like the cutlery and ornaments are made out of candy, and there needs to be a particular room where a device continuously pumps out candy from the ceiling.\nEDITOR'S NOTE: this sounds like it could get sticky and gross fast.\nThis is a cinema dining experience. It shows interesting new and old movies and also has a full restaurant menu and cocktail bar.\nAs an added trick, you don't need to have waiters coming and going. The kitchen is one floor below and each seat gets food delivered via a little dumb-waiter (a small elevator). You order via a touch screen and the food comes up from below. When you're done you push a button and the plates disappear.\nBesides that trick, the main draw here is that the food is restaurant class not the usual cinema junk food.\nThis gym/restaurant requires you to burn off the calories of whatever you’re going to eat before you eat it. If you order a 300 calorie meal, you need to bike vigorously for half an hour, etc. Seeing as most good meals require hours of exercise to burn off, this is more of a joke than the other options.\nThis idea is quite serious, and possible. If you're unfamiliar, molecular gastronomy is basically food science. It is huge in other countries and can make for a truly unforgettable dinning experience. You can get everything from instant ice cream using liquid nitrogen, to illusion dishes like meat fruit and tiramisu flower pots.\nThe only catch is that this type of cooking takes quite a lot of training to master coupled with sound knowledge of science. That being said, it's certainly not unachievable. Just imagine the possibilities.\n",
  "url": "https://www.yamu.lk/blog/dream-restaurants"
}