{
  "title": "Roadtripping Northern Sri Lanka",
  "abstract": "Roadtripping the North of Sri Lanka with a baby and a toddler!",
  "author": "Michelle",
  "date_published": "3:47pm",
  "content": "Putting aside debates on planes and trains, we decided to do an old school road trip, leaving Colombo behind and heading off to drive around the North and East of Sri Lanka… The catch? We were doing it as a family of four (including a toddler and baby).  Spanning 10 days in April, the trip was planned to have a mix of time on the beach and the road.  We braved the heat during the day, eating out and exploring as often as possible, but nights were spent in family-friendly destinations with generators (and A/C), and an epic amount of ice cream.  The result was a trip that was full of music, monkeys and giant water monitors, buffaloes, beaches, flamingos, the occasional toddler meltdown, history, snakes, elephants and watching the children be (literally and happily) pulled into families wherever we went. It was brilliant.\n\nAnuradhapura definitely warrants attention in its own right as a destination to explore (\nfeatured in Disney’s Monkey Kingdom, a family movie favourite).  However, for the purpose of this trip, the city cameoed only as a stopover to break the drive.  Leaving Colombo in the late afternoon, we reached the ancient city in about 4 hours. We took the road towards Puttalam, letting us travel for quite a bit of the trip along the waterfront.  The route has plenty of gas stations (if you need a bathroom break) and then veers inland through a treat of roadside snack stops for steamy, sweet corn on the cob, king coconuts and fruit.\nWe stayed on the outskirts of Anuradhapura at the eco-billed\nfor just one night.  The rooms were like large half-cabins, with outdoor balconies that looked onto the forest-type garden domed by trees.  A late dinner in the room (inside, due to the happy bug population drawn to any form of light) wasn’t fancy, but was quickly prepared and amply portioned.  The main bed came with a mosquito net canopy, which was useful, as were the mosquito nets we had brought for the children’s beds.  In the morning, explorations around the sprawling grounds revealed an elephant sleeping by the hotels’ private lake and a massive, cool but cloudy swimming pool under palm trees.  A basic buffet breakfast was made easy by friendly staff and a flock of high chairs to choose from.\n\nThe route to Jaffna is the classic A9, now full of buses but still moving faster than any road near Colombo.  Once through Vavuniya, the drive quickly changes from a lush to open and stark landscape.  The only thing to slow down for through old check point areas such as Omanthai are the cows wandering across the road.  A stop at the\nto break a coconut adds an interesting touch to the trip; ask anyone there to help you out with the customs of buying and using the firestarter and coconut.  This small Hindu shrine, just off of a main turn in the road, has survived the war plus the rebuilding of the A9, and still sees a significant portion of travellers passing through the area stopping to give thanks and ask for blessings.  It also has a pocket of stalls selling homemade baked goods (including slightly charred but still yummy peanut cookies).\nContinuing north, we stopped in Kilinochchi at the neon-hued\nfor lunch. A favourite amongst NGO staff for years, the Chilli serves up fast, generous portions at prices that, like the furnishings, haven’t really changed in a decade. Staples of fried rice and seafood noodles are available throughout the day, as are heartier and spicier curries and, thankfully, cold drinks (and a freezer of take away ice creams to top off the meal). The restroom was the first on our trip that was big enough to enter with kids, but not for the faint hearted. Take tissue and toilet paper. And hand sanitizer.\nIn a post-meal haze, the drive from Kilinochchi takes you past numerous Sri Lankan military monuments and sites of the war. In the city itself there’s the impossible-to-miss toppled water tower, and giant concrete war memorial.\nEn-route to Jaffna there’s also another two official war memorials, but what makes the most impact are the visible scars in the landscape and skeletal building remains.The children missed most of this in our trip, preferring to focus on the cows and goats crossing the highway (often slowly; moooooove along became a recurring joke). The waterways near Elephant Pass also held water buffalos and flamingos.  Note to self: come back when the full bird migration is on, as this place has the potential to be an eco-paradise.\nWe arrived in Jaffna just in time for a sunset ice cream, but once we checked into our room, we knew we wouldn’t be going anywhere.  We’d chosen to stay at the new\n(very new; the extra bed for our toddler was unwrapped from the manufacturer’s plastic in front of us) and though it had been inaugurated just a few days earlier, the staff seamlessly met our needs for an early supper for the children, showed us to a room with an extraordinary view of the city (clocktower: check; fort: check, ocean view: check) and gave us that incredibly warm Jaffna welcome that we had heard of.\nThe food at the hotel lived up to the\nthat we had been waiting for, from pittu and crab curries, to idlis with all of the fixings.  The city was as busy as the A9, full of families and open shops, though it was nearly impossible to find unoccupied tuktuks (with a bit of a wait though, they would show up and be almost exuberantly happy to show off the city).  Though we spent our first hours of the morning wandering around the\n, the heat soon forced us back indoors where we ravaged ice cream (choosing the shops that had the outdoor playgrounds with the most shade), and then planned out our afternoon drives.\n\nWe went down to the lagoon to see the fishing boats, then veered up, getting lost along the coast and passing sites of relocated family settlements, until we reached Point Pedro and the classic Sri Lankan ‘end of the world’ and destination signs (apparently Point Pedro is only 4,760 km from Madagascar).  The day was rounded out by a visit to the Subramaniam Children’s Park.  With swings, climbing areas, teeter totters, and full sets of playground equipment as well as sand galore, the park was also full of gardens, which were lush even in spite of the heat.\n\nAfter plying the children away from their new friends and the playground fountains, our second evening was spent ravaging the food at\nwhich made crispy, buttery dosas larger than our youngest daughter.  The outdoor dining space was basic but cooled off by the fans. The bathrooms were also basic, flooding after each use, so be prepared to roll your trousers up.  The evening was finished with a lassi, and a mental note to return when Mango's actually has mangos.\n\nThe next day we drove from Jaffna back to Kilinochchi, then over to the coast via Mullaitivu.  We chose this route on purpose, wanting to at least drive by the spaces which were being set up for ‘memorialisation’ of the war, including what was left of the wreck of the Farah (only a portion of the hull is now visible, down a rough, fairly unmarked section of road set inside settlement camps and a military base), and another Government war memorial and museum of memorabilia. Little of the signage was in English, but much of what was on display didn’t require explanations to understand how it had been used.  The most striking sight however was the number of palm trees and houses either razed by the fighting or still bearing scars of bullet holes and shelling.\nAfter a seaside lunch at the\nof seafood fried rice and crackers, (run by military, as most infrastructure in the area appeared to be), we continued down the coast until turning inland onto ‘roads’ of packed red sand raised above wetlands teeming with buffalos and birds.  We were off the map, but didn’t care; one bend in the road led us to a stand selling watermelon, and further turns finally led us over makeshift bridges and back to the coast (if you take this route, do so during daylight, be patient and have a full tank of gas - it’s slow, and fairly remote).  Once (thanks to Google) we reached a paved surface again, we were met by swarms of monkeys and roadsigns that warned of both wild elephants and (one of the last rare ones in the island, thankfully) landmines.  In spite of an early start, we reached our destination by late afternoon, exhausted by the emotions of the sites along the way, as well as the literal bumps in the road.\nseemed to be of another world, with spacious bungalows set throughout the mangroves and forest, with the occasional snake, monkey and an entourage of birds greeting us along paths that weaved between trees; we loved it, every aspect, from the swimming pool surrounded by a lily pond and vines, to the porches of each bungalow that opened out onto sand.\nBungalow showers were also outdoors, enclosed with natural materials and shaded by trees, and bath time became as much of an adventure as exploring the manicured mangrove mazes that lined the beach, as the kids bathed in an inflatable pool under the waterfall of the shower (none of the hotels in the North and East that we booked had actual bathtubs). The little ones raved about getting clean under the sunshine, with the occasional monkey looking on.\nWe spent every meal, from breakfast to dinner, exploring possibly the best creative and epic cuisine that we had been privy to in Sri Lanka. Platters of grilled seafood were made exceptional with the addition of innovative creams and reductions.\nDesserts held surprises of homemade orange salsas and honeycomb. Service rivalled the food, with staff being attentive to the needs of both the children and adults — at least twice we had to order food to the room when the little ones were sleeping, and the hotel happily obliged by not only sending the food to us, but sending each course at a time, so that food would remain just as hot and well presented as it would have if we’d dined in their open air restaurant.\n\nWe reluctantly piled ourselves back in the car after two nights and headed further south, down via the labyrinth of\nand China Beach to Pasikuda.  We’d heard rumours of the wide stretch of sandy goodness that is privy to\n(where we stayed) and other hotels in the area, and the reality lived up to the stories.  Unfortunately, others had obviously heard the rumours as well — the beach and bay were packed during the day, as was the swimming pool.  Though the white sand and clear aquamarine waters were definitely worth our stay, and some areas of the hotel had stellar service, a few aspects of the hotel were disappointing, from the incredibly bland food that was on display, to the residence-style accommodation.\nAttempting to go a-la-carte in the main restaurant threw staff into a frenzy as well, though this could have been an issue with balancing a fully-booked property with limited staff.  The seafood platter at the small hut on the beach however, BBQ’d in front of you, was great value, and the staff manning this smaller area were incredibly helpful, from getting the food ready for children first (without us having to ask), to carrying strollers with sleeping toddlers across the sand.\nWe were lucky to have a room with a view of the beach that led right onto a grassy area then the beach (we requested this when booking with Uga in Colombo), which was great for the kids through the day, and, with a small veranda to lounge on, lovely for the adults in the evening as well.\n\nAnother two nights later we left the beach and our sandcastles behind, and turned inland, heading through to Heritance Kandalama Hotel for our last night on the road. The location, set between the East Coast and Colombo, served to break up the drive back.\nAn aging heritage hotel set into the natural surroundings of rock and forest, from the moment we checked in we felt the weight of the popularity of the iconic Bawa hotel. Returning here after a decade, the rooms seem to have seen little renovations, but were clean, and the staff were kind yet but short on warmth, probably due to the sheer volume of people on tour buses that were coming through the property. We had booked on a BB basis, which turned out to be a mistake due to the steep prices of a la carte (though portions were generous, especially off the more affordable kids menu), and the good quality of food available for buffets.  Breakfast and dinner spreads were plentiful, and fresh (especially large salad sections), and sprawled from the indoor dining area into a bustling seafood and meat bbq-filled outdoor haven.\n\nExploring Kandalama gave us a workout (I think I read that somewhere that it was the longest hotel in Asia).  Two of its pools were essentially off limits to us (the rooftop pool had a rock base that was novel, but too slippery to use with the kiddies, and the infinity pool was much too packed to even enter), but we found respite from the heat in the deep but cool third pool at the back of one of the hotel’s wings.\nKandalama offers a variety of outings, from climbing Sigiriya to hot ballooning at dawn or taking a boat ride on the lake, but while we were there, the hotel’s outdoor activity centre and play area were an abandoned group of buildings with one sad owl in a cage.  A few elephants kept at the lake also offered rides through the jungle and water, and seemed much more well treated than those we’d seen at other areas.  We decided to give in and take a ride, and the staff helped all four of us balance on Sophie, as she took us for a wander down to — and into — the lake.  Our eldest daughter loved this part of the trip, but I wasn’t sure…the mahouts were friendly but recent debates on the treatment of ‘domesticated’ elephants in Sri Lanka were in my head the entire tour.\nOur room, like all in the hotel, had a balcony that opened out to vines that monkeys climbed up and down throughout the day. It wasn’t really a child-friendly set up (the entire hotel was open concept, read: limited railings, lots of drop offs), but the views of the lake and surrounding areas with Sigiriya hiding in the background, and the feel that you were really in a part of nature even while in the room, were worth the energy it took to make sure the kids didn’t drop off the side of the hotel.\n\nFor the first time of the entire trip, our daughters slept in the car on the way home, missing the overarching trees and stalls of steamed corn, the turns slowly blending from green into urban.  We were all exhausted…the journey had covered over 1,300 kilometres, 10 days, and 14 milk boxes. Our youngest daughter learned how to crawl in Jaffna. Our eldest thought that buying watermelon on the side of a dirt road near Mullai was the best part of the voyage. We, as adults, were still happy and sane, proving that in spite of the craziness and emotions we encountered along the way, a Sri Lankan road trip as a family was not only possible, but was well worth the planning involved, and we returned to Colombo not only with a serious appreciation for road maps, but also a completely different understanding of the country as a whole.\n\nWe planned ahead and had a case of water, milk boxes and cookies in the car incase of a breakdown or, more likely in our case, a toddler meltdown at being stuck in a car seat for another hour. We also packed enough diapers and baby wipes for the full trip in case we couldn’t stock up along the way, and a mini first aid kit (with panadol and a thermometer) as well as basics of bug spray and suncream, and old school printed road maps.\n",
  "url": "https://www.yamu.lk/blog/roadtripping-north-sri-lanka"
}