{
  "title": "Rooms for Couples in Colombo",
  "abstract": "Safe, clean, and nice rooms in Colombo for couples. Sorted by price bracket.",
  "author": "",
  "date_published": "10:28am",
  "content": "If you and your partner are above the age of consent, healthy, and both consenting, there are no legal barriers to spending time together, or spending the night together. The moral barriers are vague and arbitrary so we trust you, as adults, to make those decisions yourself.\nFor vital information, please read our two blogs on\nand\n. Keep in mind, if you think buying condoms is embarrassing, an unwanted pregnancy or STI is a LOT more embarrassing.\nSince\nare the most commonly searched terms on yamu.lk for the last 5 years, we thought it might be time to make this easier for everyone.\n- If you are two consenting adults, you do NOT need to bribe anybody, the police has absolutely no right to arrest you, demand your ID, or harass/threaten you in any other way. Sexual intimacy for heterosexual unmarried couples is not a crime in Sri Lanka. Don't let yourself be extorted.\n- If you go to a dodgy, unverified hotel, you are setting yourselves up for failure. They could ask for your IDs as a form of blackmail, they could have hidden cameras, or worse. Always choose a safe and reputable place. In all honesty, you're not going to find a safe and reputable place for less than about Rs. 4000 in Colombo. Unless it's your friend's house.\n-Even a fancy hotel may ask for you ID to take a copy at check-in, but that's it. They can't keep it with them or demand it later. They also can't ask you if you're married, if your family knows where you are, etc.\nAny 5 star or international chain hotel is more than happy to give you a safe, clean, room for a 22 hour period. Of course, you'll have to shell out, anything from Rs. 10,000 to Rs. 30,000 a night including breakfast and full use of the hotel's facilities.\nKeep an eye out for discounts on sites like booking.com and you might even get budget hotels for as low as Rs. 8,000 a night.\nColombo's really upping its hostel game. We've visited a lot of beautiful, chic, and friendly hostels recently with cheap dorms and private rooms in central Colombo locations. The best part is they're reasonable and ask no pesky questions, but we've heard they may not be too welcoming to local couples looking for suspiciously short stays. It might not be super romantic to dine with a bunch of sunburnt backpackers, but neither is a pay-per-hour room out in Mount Lavinia. For a private room, you could pay anything from Rs. 2,000 to Rs. 10,000.\nAirbnb is an option if you're not uncomfortable with staying in somebody else's house or guest house. If you're looking for your own space (especially over a weekend or for a few days), Airbnb is often a reasonable option where you can share a room or even an apartment or house for a period of time. This is especially good if you want to cook, watch TV, etc. We've mentioned some of the\n. We also got a comment from\n, which has excellent ratings and is even LGBT friendly!\n- These are a series of converted houses around Colombo that offer short stays starting at about 3 hours onwards at about Rs. 2500. A YAMU user vouched for their safety, but apparently they do keep one ID for the duration of stay.\nSolid Hotels - This chain has locations around the city, in\nand\n. It's about Rs. 4000 a room. Definitely a bit dingy, but not dodgy per se.\nSignature Hotels - Another chain like Solid, Signature Hotels has locations all around central Colombo including Carwil Lane, Shrubbery Gardens, and 5th Lane. Prices go from Rs. 5000-Rs. 6000 a night.\n- Another super central option, you can get a double room here for Rs 5000 from 12 noon to 12 noon. They will charge you the same rate even for shorter stays. This is definitely one of central Colombo's seedier hotels (seedy enough that they helpfully cover up your car number plate for you in case you're meeting someone other than your wife), but they have\n.\n- A beautiful old 1837 building steeped in history and overlooking the port, the GOH is sort of close to the Dutch Hospital etc, but is pretty dated. You're also not getting your money's worth at Rs. 11,000 upwards for a room unless you're really into Chekov.\n- Based in Dehiwala, this hotel is quite pretty from the outside, and they let you have rooms either for upto 22 hours at around Rs. 6000. You can stay for a shorter period, but the price is the same.\n- Seedy yet safe, Hotel Janaki is in the heart of Colombo 5. Rooms start at about Rs. 7000 upwards for a double. They also have a pool, in case you're feeling a dip.\n- Down in Welawatta , the Sapphire is on Galle Road and relatively central. Prices start at about Rs. 10,000 upwards.\n- The Nippon is a gorgeous old building, recently renovated and reopened. Prices for a double room with a balcony are about Rs. 10,000 upwards, but it's worth it for the historic value. There's also\n.\n- Right in the heart of Colpetty, Pearl Grand will give you A/C double rooms for Rs. 13,000 for a full night or Rs. 12,000 for upto 6 hours. Which kind of makes no sense. Pearl City will do the same at Rs. 10,800.\n- This is a simple booking site with rooms all around Colombo (and the country). They maintain basic standards of cleanliness, A/C, Wi-Fi, and breakfast, and prices are quite low from Rs. 3000 to Rs. 7000 for private rooms.\n- An international booking site that lets you sort according to a bunch of variables like price, date, room type, availability, location etc. Watch out though, prices lower than Rs. 2500 generally indicate dorm rooms.\n- This local booking site lets you sort according to price, and the spots registered on it are verified in advance so you know they're legit.\nAnd that's our list. It's a work in progress, so if you know any places that are cheap, clean, and legitimate, please comment below so other users can find them too. In the meanwhile, we hope this was useful. Please be responsible and stay safe!\n",
  "url": "https://www.yamu.lk/blog/rooms-for-couples-in-colombo"
}