{
  "title": "Roses Are Red And Flowers Are Expensive",
  "abstract": "If you've got a special someone you'd like to greet with flowers, here's three approaches you could take.\n",
  "author": "",
  "date_published": "10:51am",
  "content": "Valentine's Day is just around the corner, and if you've got a special someone you'd like to greet with flowers here's three approaches you could take.\nIf your goal is to communicate how much money or status you have, this probably isn't the place, but if you're just trying to give a thoughtful gift of flowers, you can't go wrong with picking your own bouquet down Dean's Road. Silani's is just one of the shops among many florists around the area. They might be meant for funerals, but they're still flowers and it's always the thought that counts.\nThe white tents pitched along Water's Edge are in full bloom thrice a week, from just past dawn to near midnight, what with flower/ plant vendors and landscape artists rooting themselves there from Friday to Sunday. Why settle for a bouquet? Go all the way and get your significant other a potted plant in full bloom! Not only will it last longer, it's also high maintenance - just like your girlfriend.\nShirohana is an upscale florist which means they have fresh flowers, arranged and packaged nicely and priced at a premium. You could grab a single rose for maybe Rs 500 or bust as much as Rs 12,000 on an arrangement. Plus, they've got everything on their website, so if you're in a hurry just get a pre-prepared bundle, they're good.\nWe haven't reviewed this place yet, but their Valentine's deals grabbed our attention. There's a \"Be Mine Forever\" vase, an \"Ultimate Valentine's Gift\" that comes with a card, jewellery and perfume, and of course the straightforward bouquets of roses. You can work with a budget of Rs 1000 to Rs 6000. You can also order online and they'll deliver. If you give this one a shot, let us know how it goes!\nThe Borella Cemetery has some of the biggest trees in Colombo. The place is massive and fresh with flowers, plants and birds, and neat petal-strewn pathways that meander through the grounds. There's always a funeral, so, if you head there at the right time, in the right outfit, you could grab some flowers, a whole bouquet and make a day out of it. Sure, this approach is not for everyone, but it's an experience you can take to your grave.\nIf you're lucky, you might be able to spot a burst of pink around the city, particularly Viharamahadevi Park, when the tabebuia rosea is in bloom. It's a beautiful sight that will take her breath away. The last time we spotted them was around January/February, two years ago. A tree in full bloom looks quite similar to a cherry blossom tree. The flowers are papery thin and light and they twirl as they fall, covering the grass in a sheet of snowy pink.\n",
  "url": "https://www.yamu.lk/blog/roses-are-red-and-flowers-are-expensive"
}