{
  "title": "Run For Their Lives 2017",
  "abstract": "RFTL is back for their 8th straight year!",
  "author": "Staff",
  "date_published": "8:47am",
  "content": "Back in 2010 Run For Their Lives started off as a relatively small charity run organized by the Roteract Club of Colombo Uptown in aid of the Maharagama Cancer Hospital. Fast forward seven years and RFTL has become probably the biggest charity run in the country with thousands of people taking part.\nWithin the last seven years they’ve also turned RFTL into a social gathering by expanding it into a carnival of sorts, bringing together a bunch of different vendors and sponsors. The best part is that they’ve done it in a way that further benefits the cause, raising over Rs. 19 million over the years, which is no small feat.\nThey’ve managed to do all this without diluting the most important element of the entire event being the run itself. While the funds they’ve raised for the Maharagama Hospital has been incredibly impressive, they’ve also brought in a secondary element of health and wellness to the forefront which really wasn’t happening at this scale prior to RFTL.\nFor this year’s edition of RFTL they’ve partnered up with AIA Vitality to really highlight the health and wellness aspect of the event, which we is think is great. They’re actually bringing in a bunch of cool activities and rewards, which will fit perfectly with the carnival atmosphere.\nThey’ll be having a sort of mini competition during the race called the AIA Vitality Hotstepper where they’ll be giving away a Fitbit to the person who records the most number of steps during the run. You’ll need to have a fitness app or step tracker to take part, but you can just download one on Android or iOS (we recommend\nor\n).\nThey’re also giving away free juice at the end of the race. The catch is that you have to make it yourself by quite literally riding a juice bike that will power the blender, which is pretty damn cool.\nBesides those, they’ll have a little photobooth at the 4 km mark for groups to snap a quick photo during the race and they’ll also have a free BMI checkup at their stall for anyone that wants to find out their body’s actual age, which will likely blow your mind if you’ve never had a BMI checkup before.\nRun For Their Lives is one of the best executed charity events in Sri Lanka and it’s been better every year. The run itself is enough reason to register, but there’s so much more to do afterwards that they’ll have something for everyone. The run begins at the Racecourse Grounds at 6.30 am followed by the carnival which ends at 1 pm.\n",
  "url": "https://www.yamu.lk/blog/run-for-their-lives-2017"
}