{
  "title": "Salads In Colombo",
  "abstract": "Attention all health buffs -  here's a round-up of some of our favourite places to get salads in Colombo. ",
  "author": "indi",
  "date_published": "11:33am",
  "content": "If you're trying to keep healthy or just feel good, salads are a good bet. They're low calorie and, done right, delicious. This is a round-up of some of our favorite places to get salad in Colombo.\nLife Food is tucked into the\nacross from Racecourse. They do big, amazing salads for Rs. 500 and juices for around Rs. 250. We tried a strawberry, avocado lettuce and feta salad which was a lovely blend of sweet, salty and tanginess. Their Japanese Miso salad is also as complex and interesting as salads get. At Rs. 500, however, these aren't cheap.\nCalorie Counter is an innovative spot on Thimbirigasyaya that does super fresh salads for Rs. 450-650. These range from the fruit salad above (watermelon, strawberries and blueberries for Rs. 450) to the toothsome beet root, feta and orange salad (Rs. 650). If you get takeaway they give you the salad in a big jar. This is also on the expensive end of the salad scale, but you get great quality.\nThe Bread Company does great bread, yes, but also some of our favorite salads. The quinoa salad with greens, pomegranate and dill deep is one of the most flavorful salads we've had ever and they have a range of tasty and healthy stuff.\nIf you want to go salad crazy, the Kingsbury's weekend buffet has the best overall spread in the city, we think. So many vegetables and greens. They also have a strong seafood selection, among other things, but we're just talking salads here. Paying the full buffet price for salad is unusual, but if you did we think you'd actually get your moneys worth.\nHealth Factor in Kohuwala is actually attached to the High Octane Gym, but you don't need to be a member there. This place actually has two menus (healthy and less-so). On the healthy side, the Thai roast chicken salad (Rs. 350) is both affordable and tasty, as is almost everything they do here.\nEat Right is a delivery meal plan, so you can't just knock up and order. You usually get a week of meals at a time, actually, for Rs. 450 each. The seafood salad we tried was generous and tasty.\nThe other salads-only delivery is the Salad Bar, which used to have its own space next to Paan Paan in Rajagiriya, but they only work through Quickee now. We've tried their chicken caesar salad and smoked salmon salad, and for about Rs. 500, the portions are big and quite fresh and tasty.\nHealthy Living is another delivery option, but you can order bits and bobs and it's all under Rs. 400. Just order early in the day. They have a nice chicken salad (dinner only) and an ever changing range of things.\nSo them's some salad places. If you want to make your own, there's this Uva place that sells salad greens packed into tupperware at the\n, plus you can get all the veggies and dressing ingredients (and some dressings) there as well.\nand\nare also good places for salad fixings.\n",
  "url": "https://www.yamu.lk/blog/salads-in-colombo"
}