{
  "title": "Saree, Not Sorry : Everything You Need To Know About Buying a Saree in Colombo",
  "abstract": "Everything you need to know about sarees in Sri Lanka.",
  "author": "",
  "date_published": "12:10pm",
  "content": "A saree (or sari) is a long cloth (between 5-9 yards) that is traditionally draped around the female anatomical structure in most of the Indian Subcontinent. Depending on the style, richness of embroidery, or material, they can be worn during special occasions or on a daily basis (usually in more traditional occupations or as a uniform - Sri Lankan Airlines air hostesses, Government employees, school teachers). An everyday cotton saree can cost as low as Rs. 400. A custom hand-sewn silk wedding saree can easily go into lakhs.\nBecause they want to look like Aishwarya Rai. Or because they just want to wear a damn saree. Or for science.\nThis item of clothing flaunts your curves whilst making it difficult to pee. Sarees are notoriously pliable, which makes them flattering for all body types - they add the illusion of curves to skinny frames, and delicately drape over chunkier ones. This is probably the only \"one size fits all\" tag that works in reality.\nIf your job requires it, or otherwise on special occasions like weddings, opening ceremonies, your ex's funeral or when you don't know what to do with your bed sheet. Look out for cues - the richness of the work on the saree, its weight, material used (heavy silk or cotton?) can let you know whether it's more suitable as a casual day saree or a formal wedding outfit.\nIt's impossible to list down every single store that sells sarees, but here are few spots to get your 6 yards from!\n(Please feel free to drop a comment with your favourite saree spots too)\nYou cannot wear a saree without a saree blouse.\nHere's where you can get your saree blouse tailored -\nIf you know of any tailors, please drop a comment.\nThere's so much you can do with a saree.\nThe most commonly worn styles in Sri Lanka are the Kandyan saree and the normal looking Indian-style saree.\nYou can either get your saree draped by someone or drape it by yourself.\nIf you are\nto get it draped, you will be charged about Rs. 500 minimum. If you are going to the closest aunty to get it draped, you will be charged with questions about your love life.\nSo learn to drape it by yourself by watching YAMU TV's easy DIY down below!\n",
  "url": "https://www.yamu.lk/blog/saree-not-sorry"
}