{
  "title": "Sepala Ekanayake; The First Ever Sri Lankan to Hijack a Plane",
  "abstract": "Sepala Ekanayake is the one and only Sri Lankan to hijack an aircraft.",
  "author": "",
  "date_published": "1:31pm",
  "content": "On 29th March 2016 an aircraft travelling from Alexandria to Cairo was hijacked by an Egyptian citizen. Flight 181 was property of EgyptAir and he demanded for it to be diverted to the Larnaca International Airport in Cyprus. The hijacker claimed to be wearing a belt with explosives and due to passenger safety measures, the pilot staged a landing at the requested airport.\nSeif Eldin Mustafa, the hijacker of Flight 181 isn’t a terrorist, nor a gangster or a man with any criminal record. The only reason he did it was to see his estranged wife in Cyprus. He surrendered to the police after 7 hours, and revealed the story of how he wanted to patch things up with his ex-wife, the mother of his four children.\nThis whole story about Mustafa, reminded me of a similar incident that happened in 1982. The headlines were made locally and internationally because this particular hijacker named Sepala Ekanayake is the one and only Sri Lankan to hijack an airplane; and he did it out of the love for his family.\nBorn and raised in Matara, Sepala Ekanayake had a complicated childhood. His mother died when he was only a child, and his father got married again after a while. Most of the time he was looked after by his grandmother and uncle.\nSepala studied at Yodha Kandiya Maha Vidyalaya, Hambantota, but only for few years. He dropped out of school when he was 15 and came to Colombo. He stayed here for few years and then moved to West Germany in 1973, seeking employment.\nThe choice he made to live on an strange land wasn’t always a fun experience. He was a young man of 23 and there were many lonely nights. But his job and the hobby of travelling the globe kept him going. In fact, that’s how he met his first wife, Anna Aldrovandi.\nAnna and Sepala were introduced to each other by a mutual friend. She was a beautiful Italian girl, and it was love at first sight.\nAfter a few months they came to Sri Lanka, as Sepala wanted to introduce his future bride to his family. The Ekanayakes weren’t really happy about their son taking a foreign bride, but Sepala stood firm on his decision. Once they returned to Italy, they registered their marriage and moved to Anna’s hometown; Modena city. In 1978 they had their first child, a baby boy. He was named Free Ekanayake.\nA few years passed, and this beautiful family was happier than ever. Everything was perfect, until one day when Sepala’s request to extend his visa was denied. He was living on a residential visa, which needed to be renewed annually. But the Italian government refused to extend it due to an incident that happened earlier that year.\nSepala was having a beer at a restaurant in Modena, when he heard a man criticising Sri Lanka. He was annoyed by that and got into an argument with him, which led to a fight. Unfortunately, Sepala didn’t know that the person he conflicted with, was a close relation of the director at the Police Department of Modena.\nThe Italian government didn’t specify the exact reason for not extending Sepala’s visa, but asked him to apply from Sri Lanka again. At the time he believed that the incident at the restaurant could be the reason behind it all.\nWith the hope of getting his visa again, Sepala came back to Sri Lanka. He tried applying for it from the Italian embassy, but again his request was turned down. He did everything he could do to get it, but nothing worked.\nSepala lost clarity when the embassy said that it will take 5 - 6 years to get his visa back. He couldn’t bear the thought of not being with his family for all that time. He was stressed so much, that it caused him to hijack an Italian aircraft to fulfill his wish.\nFirst, Sepala flew to New Delhi India to make the necessary preparations for the hijacking. On 29th of July 1982, he got into a Boeing 747, an aircraft that belonged to Italian airline, Alitalia. It was travelling from Rome to Tokyo, with around 300+ passengers aboard.\nSepala decided to execute his plan when the airplane was cruising over 35,000 feet from the ground. He handed over his demands written on a piece of paper to an air-hostess, to be passed to the pilot.\nSepala's first demand was that the airplane had to land at the Bangkok International Airport. The second was that his son and wife should be escorted safely to the\nairport, and the third; a ransom of US$ 300,000.\n\nApart from these, the following things were also mentioned among his demands:\nThe plane landed at the Bangkok airport and passed Sepala’s demands to the Alitalia staff. Sepala was also able to speak to the Chief of Staff, about the Italian Government's unfair ploy to keep him away from his family.\nAfter about 30+ hours Anna and Free arrived at the Bangkok airport, escorted by the embassy officials and the Alitalia staff. Sepala released the passengers he kept as hostages and stepped out of the airplane.\nEven though Sepala was able to see his family, there was the problem of finding a place for them to live with the ransom money. He had no intention of actually hurting the passengers he took as hostages, but he knew that the government of Italy won’t tolerate his actions.\nThe Sri Lankan ambassador of Thailand, Mrs. Manel Abeysekara came forward at this moment and promised him that she’ll do everything in her power to give them a chance to take up residence in Sri Lanka.\n\nHowever, the Italian government opposed. Over and over they asked Sri Lanka to hand Sepala over to the Italian authorities, so they could arrest him. Due to these influences, the government of Sri Lanka faced a very complicated situation. At the time, there were no punishments in the legal system of Sri Lanka for this sort of crime, which made the situation worse.\nBut at last, the Galle Police arrested Sepala. While he was put behind the iron bars of Welikada prison, his family was sent to Italy. It was the first time Sri Lanka implemented the\nlaw; a law that affects an action which was committed in the past.\nSepala was sentenced to 3 years in prison. He was released from prison in 1987, and by then, Anna had already filed for divorce. After another 3 years, he cut the cords with his past memories by marrying Yasangani Madhupali, a wonderful woman who understood him well. He is now a father of two; a daughter and a son.\nSepala’s children and wife managed to reach Free, after 16 years since the hijacking incident. In 1997 Free came to Sri Lanka to meet his father, and apparently they still keep in touch with each other to this day.\nSo the tale of a man who hijacked an airplane for love, ended like that. Currently he is a businessman, and based on his life experiences, he was able to write a novel called\n.\nSepala doesn’t have any regret for what he did, except for the part where he caused an inconvenience for the 300+ passengers that he took hostage. His life could’ve been something so different if it wasn't for that slight incident, but he’s happy the way that things worked out.\nBecause life isn't always what we expect it to be, but battling the challenges that come in our way with courage, and learning from such experiences is what makes living worthwhile.\n",
  "url": "https://www.yamu.lk/blog/sepala-ekanayake-the-first-ever-sri-lankan-to-hijack-a-plane"
}