{
  "title": "Seven Cups Of Colombo Coffee (2013)",
  "abstract": "Coffee in Colombo",
  "author": "savan",
  "date_published": "5:09pm",
  "content": "Getting a good cup of coffee in Colombo has long been a major challenge. While every neighboring country/region from South India to Vietnam produces sought after coffee beans, Sri Lankan coffee is typically weak and has a distinct and unwelcome earthy (read muddy) undertone. Sweetened muddy water with some milk, that's how things were for a long time - ie pretty rough. Through the 90's you'd find the city's real aficionados holed up in the 5* hotels. Though of these only the Hilton really did a good cup of coffee. After years of coffee famine Hansa arrived in the early 2000s and their locally produced coffee marked a great leap from the traditional\n. Then over the past few years of peace and presumed post war prosperity coffee chains, independent cafes and cafe-restaurants sprung up by the dozen. This influx has taken coffee out of the hotels and into Colombo's avenues, streets and suburbs.\n\nBut with all this investment in the worlds most popular caffeinated beverage has it finally become easy to get a good cup of coffee in Colombo? Not exactly but YAMU has prepared a rundown of some of your best bets for a good coffee fix.\n\n135 Jawatte Rd Colombo 05\n\nTheir claim to fame is that they use coffee from US coffee chain king Starbucks. Basically a US coffee chain imitation but the imitation is well done. Open till midnight, if you're around Havelock town and need somewhere to chill out this a good choice.\n\n\nA Starbucks style selection lots of things with cream and flavorings. We had a honey hazelnut latte(Rs 500) and white chocolate mocha and were disappointed. Just too milky you can’t taste the coffee for all the flavorings and milk.\n\n\nTwo coffees or a coffee and a sandwich - which wasn't too inspiring.\n\n\nThey have the fastest public wi-fi in town. That's awesome, so who cares about the coffee.\n\n24 Fife Road, Colombo 5\n\n\nColombo's independent, underground coffee house. Owned by Sri Lanka's best coffee producer- Hansa, the coffee is inexpensive and excellent. Just have their cappuccino if you're skeptical of Sri Lankan coffee you'll be converted, it's world class.\n\n\nThey use exclusively their own Hansa coffee beans and achieve exceptional results. It's strong, smooth and somehow free of that earthy (muddy ) taste that characterizes local coffee. This is quite comfortably the best coffee in Colombo, local or imported and for a fraction of the price you'd find elsewhere.\n\n\nA lot. With coffee for less than Rs 200 you can get a brownie(Rs 130) a cheese toast and maybe something else! (the food is simple and good)\n\n\n\n2 Maitland Crescent, Colombo 7\n\nThis is Colombo's American franchise coffee house. It's pretty much indistinguishable from a coffee bean you'd see in LA... or Hanoi. A central Colombo 7 location, tons of comfortable seating, a massive (but expensive ) range of coffee based beverages and food.\n\n\nThey claim to use the best 1% of beans from estates worldwide but it doesn't really show. It’s not at all bad though and the iced coffees can be pretty refreshing. Their mocha (Rs 470) is rich but oversweet.\n\n\nTheir fancy flavored items are between Rs 500-600. So coffee and a croissant. They have breakfast sets for Rs. 550 but the food is only so-so.\n\n\nBrand name. Wow something American(it's actually somewhat Singaporean) in Colombo, this is still exciting.\n\n\n\n\n95 Wijerama Mawatha, Colombo 7\n\n\n\nThe city's only Italian coffee franchise. They have an incredibly extensive coffee menu. It's hard to imagine there's so much you can do with coffee- cream, meringue, mousse, chocolate and yoghurt toppings and the basic espresso is above average.\n\n\nSurprisingly good. The variety is astonishing and while the menu tends towards the cream and flavoring infused the coffee underneath is good. The 'cafe confuso'- espresso, dark chocolate cream, light whipped cream and amaretto biscuits is very good.\n\n\nThe cream and meringue topped wonders are pretty expensive Rs 500 however the cappuccino is reasonable value (Rs 300). For Rs 1000 you can get a cappuccino and a pasta dish.\n\n\nThe varied menu where else can you get Argentinian Coffee or meringue topped coffee in Sri Lanka.\n\n\n\n\nAlfred House Road, Colombo 3\n\nPeople tend to think of the Paradise Road Gallery as more a restaurant however the great setting works just as well as a Cafe. Their coffee has always been good, it was life saving back in the 90's and it’s worth ordering a cup one just to sit in the space.\n\n\nStrong and never disappoints. The plain black coffee with a dash of milk is an excellent pick me up. None of the trendy flavorings you find elsewhere just the classic espressos, Americanos and cappuccinos.\n\n\nIt isn’t cheap at Rs 350 for an American Coffee but it's worth it to be able to sit in the lovely space and use the wifi. For Rs 1000 you’d struggle to get much else on the menu but for about Rs 1100 you might manage coffee and a dessert.\n\n\nLocation. It’s in Geoffrey Bawa's old office so a prime sitting spot.\n\n\n\n\n32, Ward Place, Colombo 7,\n\nColombo’s be seen coffee spot is for more than just posing. The coffee is good the service is excellent and it’s opened late everyday of the week. Their veranda is a particularly chic-spot in which to sit and sip your macchiato.\n\n\nWhile, in keeping with the craze for American-style coffee confections, you’ll find ginger bread lattes(rs 430), and no-end of flavored options, they use good strong Italian Coffee(Filicori Zecchini) so even their creamiest concoctions actually taste of coffee.\n\n\nMore than you think.. Their creamy concoctions are around Rs 400-500 and macchiato Rs 320. A coffee and a slice of good cake or one of their cheaper mains should be under Rs 1000.\n\n\nThey have good coffee, decent food and a swish setting but the service is standout. The staff are attentive, ever-smiling and friendly without being intrusive.\n\n\n\n\n231, Galle Road, Colombo 4\n\n\n\nColombo’s most under utilized (at least by non-guests) boutique space Casa’s super-glamorous setting is a great place to while away an evening or afternoon. While tea is their specialty their coffee is inexpensive and good.\n\n\nYou get a cafetiere full of smooth, aromatic coffee(enough for two or three people) as well as a jug of milk and plenty of sugar for just Rs 250! This might be better value than Hansa.\n\n\nEnough coffee for three people, a dessert or something from their amazingly well priced tapas selection.\n\n\nCoffee for three for Rs 250 in an awesome space.\n\n\n",
  "url": "https://www.yamu.lk/blog/seven-cups-of-colombo-coffee"
}