{
  "title": "Slingshot Startup Series : Healthcare",
  "abstract": "On the Slingshot Startup Series we’ll be breaking down a new industry, looking at local and global startups in…",
  "author": "",
  "date_published": "12:30pm",
  "content": "The startup scene in Sri Lanka is bigger than ever right now. With things moving so fast, we’d like to slow things down and get some perspective. On the Slingshot Startup Series we’ll be breaking down a new industry, looking at local and global startups in that space. This month we’re looking at healthcare.\nSri Lanka is no stranger to the global tech scene with companies like WSO2, Sysco Labs and 99x punching well above their weight. While we have had a few startup successes in healthcare like\nin the past decade, things have never looked as promising as they do right now. Here’s a look at three of the most interesting local startups in healthcare.\nOur first Sri Lankan healthtech startup is oDoc, which is an app that connects patients with doctors for video consultation on their mobile phone with a simple process that allows patients to send notes or any existing reports and be talking to a doctor, all within a few minutes.\nIn a country like Sri Lanka where access and quality of healthcare services can vary quite significantly from city to city, an app like oDoc presents a great opportunity to offer the best consultations to patients anywhere on the island. Once a consultation is concluded the doctor will provide a e-prescription which the patient can present at pharmacies for their medication.\nA few weeks ago oDoc closed on a US$1 million seed round, the\n. With a team including doctors, Stanford PhD's, ex-senior executives of the John Keells Group and a veteran lead investor in Mr. Ajit Gunewardene, oDoc’s prospects of going global with their products seems very promising.\nNext up is Pulz Solutions with their wearable ECG device named Panacea’s Medi Belt. PMB is capable of remotely tracking the ECG, heart rate, motion of the person and most importantly possesses the ability to pre-identify several Cardiac Arrhythmia types (Heart Attacks) with the support from a proprietary algorithm and assistance from a 24/7 live monitoring team consisting of doctors.\nWhat’s interesting is the fact that the project initially began as a wearable ECG jacket, but over the last two years the team managed to compress the form factor into a belt, making it a lot more compact. This was actually the first wearable ECG device developed in Sri Lanka and the first one to receive clearance by the Ministry of Health, which is no small feat.\nThe medi belt began as a 5-year development project by a group of undergrads at the Sri Lanka Institute of Information Technology (SLIIT). In 2015 Hemas Slingshot partnered with SLIIT and invested in Pulz Solutions to help them see the product to completion and commercialization. They’ve won a whole bunch of\n, both local and international, with their most recent being the 2nd place in Non Communicable Diseases Category at the Commonwealth Digital Health Awards 2017.\nNext up is Clardia by a startup called Olivescript. It’s a smart family health assistant, where the user’s health parameters are monitored through the Clardia platform and analysed to predict a broad scope of ailments ranging from cardiovascular, respiratory and nutrition related diseases.\nClardia allows you to keep track of key health parameters through a hardware platform (similar to weighing scale) and an analytics component which focusses on identifying potential threats of diseases, providing predictive health analytics which can be viewed through their mobile or web apps.\nRegular medical checkups aren’t really something Sri Lankans do too well, which makes prevention of diseases increasingly difficult, but a comprehensive platform like Clardia could potentially change that by providing families and individuals the actionable insights.\nThey’ve also been doing the rounds at startup competitions, finishing second runners up at Microsoft Imagine Cup (SL) and winning the Hemas Slingshot Startup Battle at Disrupt Asia 2017.\nOf course, healthcare is a human issue, so what inspiration can we get from international startups?\nBabylon Health is a London-based healthtech startup which has raised a total of $85 million. The reason we’re talking about it is because it started as a telemedicine company, with a model quite similar to oDoc, enabling doctors to make diagnoses via video and allowing patients to rate the quality of each interaction.\nBut now they’ve introduced a new product in the form of an AI-powered chatbot that analyzes a patient's condition against a database of symptoms, while incorporating the patient's own medical history and responses to the chatbot's questions. This is still in it’s early stages and the accuracy of the analytics are under scrutiny but the potential is huge.\nCaelum Health, a Y Combinator startup, looks to use their software to offer people behavioral health treatments without prescribing drugs. Caelum states that their behavioral health treatments are almost three times more effective than prescription drugs, and has pilots with 7 of the top 10 health systems in the US.\nThis is particularly interesting since it’s one of the few new global startups looking to disrupt the pharmaceutical industry, and in a country like Sri Lanka where Western medicine isn’t always well received, an idea like Caelum could be viable if integrated with Ayurvedic medicine.\nSo those are some innovative ideas in healthtech both here and abroad. If you think you’ve got something better or different, get in touch with the Hemas Slingshot program at\n.\nBeing a startup ourselves, we understand how difficult it can be to find funding and support. The Hemas Slingshot program is actively looking to invest in startups within their business verticals (Healthcare, Logistics, FMCG and Leisure). If you can impress them with your startup; they’ll fund you, help you develop your business model and the give you the opportunity to actually test your product with their companies.\n",
  "url": "https://www.yamu.lk/blog/slingshot-startup-series-healthcare"
}