{
  "title": "Smile Sri Lanka ",
  "abstract": "A not for profit organisation focused on developing and supporting, underprivileged and orphaned children.",
  "author": "",
  "date_published": "12:37pm",
  "content": "Children’s rights include the right to health, education, family life, play and recreation. Not all children are privileged to have all of these or an adequate standard of living. Whether labeled as disadvantaged, low-income or at-risk, underprivilged children often lack basic life necessities and access to resources for dealing with family related issues such as motor development, nutrition and literacy.\nFortunately, you can assist children in need with resource development by partnering with charities who work in these areas.\n(SSL) is one such organisation. Founded in 2009, SSL aims to provide poor children with a better future by providing education, leisure events as well as financial support.\n\nThey provide education for street kids who receive free education from government institutions but do not receive special attention and guidance. SSL works towards improving language skills (English), basic computer skills and artistic skills. Also, orphans, just like street kids, do not receive the attention needed to excel in education, suffering from added mental stree due to their situation and requiring special attention and guidance. SSL's education program hopes to create a stress free environment for these kids.\nMost orphans are sent out of homes when they turn 18, and the probability of them being ready to face the 'real world' is very low. Our programs are designed to provide counselling and guidance to these kids and provide them with the same direction as they would have received from a parent of their own. The SSL team organises monthly visits to orphanages nominated by fellow volunteers. Orphans are engaged in sing-along sessions and volunteers have a great time playing with the kids. Volunteers are only urged to bring with them a positive attitude that will bring joy to the life of a kid faced with a negative situation.\nTo support the work of Smile Sri Lanka, you can use the following contact information:\ne-mail: info@smileceylonfoundation.com\nFacebook page:\nPhone: 773 111 374, 112 722 112,\nFax: 112 716 424\n(Images courtesy Smile Sri Lanka)\n\n",
  "url": "https://www.yamu.lk/blog/smile-sri-lanka"
}