{
  "title": "Space Junk Near Sri Lanka - When & Where To Watch",
  "abstract": "At 11.50 AM on November 13, space will be showing us its junk. Our junk, really.  A piece of space debris…",
  "author": "indi",
  "date_published": "11:15am",
  "content": "At 11:50 AM on November 13, space will be showing us its junk. Our junk, really. A piece of space debris named WT1190F (WTF) will burn up in the atmosphere, about 100 km off the coast of Sri Lanka, near Hambantota.\nThe whole world is talking about this, but Sri Lankans will have the best view. Here's how and where to watch.\nThe space junk is most likely a rocket booster or fuel tank from a previous launch (i.e. human made). It's actually not very big and seems like a hollow object not more than a few metres across. As such, it's definitely not visible to the naked eye yet, but on November 13, it will hit the atmosphere and burn up — quite brightly.\nSince this will happen at 11:50\nyou won't get the best possible view, but it should still be visible in daytime, for a few seconds at least.\nBut anyways, for those precious few seconds, here are some places to watch:\nThe absolute best place to watch it will be the Great Basses Reef Lighthouse, 13 km off the coast of Yala. Arranging this, however, is nearly impossible and probably foolhardy this season.\nThis isolated lighthouse is the mythical edge of Ravana's kingdom that tipped into the sea. It's now managed by the Sri Lanka Navy and—while it offers great diving between March 15 and April 15—is not especially welcoming at other times of the year. Like now.\nIf you want the absolute best view, you must be hardcore, and you must go through the Navy. So file this under amazing but unlikely.\nSaraii Village is an eco, tree-house hotel near Hambantota, but isolated enough that you can see the stars remarkably well. It's neither on the coast nor is it high altitude, but the lack of light pollution makes this a great spot. However, since the fireball is during the day, that day's weather will make more of a difference than light polution. You'll still get an amazing view at night, and it's also a lovely hotel with good food. See\n.\nOn a good day in Ella you can gaze down the southern coast. This goes for many spots in hill country in general. Even if you're not close to the impact, being high up will give you a better view.\nMore than light or height, the limiting factor for visibility will be weather. So just go wherever it isn't raining.\nBarring all of this, just stick your head out the window at 11:50 and look. You should see something.\n",
  "url": "https://www.yamu.lk/blog/where-to-watch-the-space-junk-in-sri-lanka"
}