{
  "title": "Spicy Food Round-Up",
  "abstract": null,
  "author": "",
  "date_published": "3:29pm",
  "content": "To be honest, the spiciest food you can find will be at your local buth kade. We've included a few of those, including the old-school ones that can leave you weeping and still shovelling rice through your tears. Beyond those, there actually aren't too many other places pushing the spicy envelope hard, but we've included those that we know of. As always, hit us up with more suggestions in the comments.\nTom Yum’s namesake dish is one of the best iterations of the classic Thai soup you’ll come across in Colombo. If you've ever heard the phrase 'explosion of flavour', this soup is the best way to experience it. With all the key ingredients—kaffir lime leaves, galangal, lemongrass, cilantro, shrimp, prawns and a ton of chilli—this is one of the spiciest soups you can try in Colombo. God have mercy on your soul if you bite down on one those chilli seeds. But, like us, you'll most likely keep going back for more through the tears.\nYarl Eat House is our favorite banana leaf place in Wellawatte. They do a famous crab curry and cuttlefish, and excellent mutton. If you want to be lame, they also serve chicken and a good selection of veg. Generally, the curries here are quite hot, so much so they made the stalwart Janith cry. It burns but the food tastes so good that you keep going back for more.\nJaffna Kade is a tiny hole-in-the-wall in Slave Island renowned for its\n(tripe), if you're into that. They also do a good, simple and insanely spicy rice and curry. This is an old-school, rice-puller style rice and curry. It hurts, and you eat more rice to soothe your tongue, and on it goes until you've pretty soon eaten a lot.\nNai miris sauce is a spicy bundle of joy/pain. The squat green or red chilli is really, really spicy. The heat on this one really hits you and lingers. But it is a really good sort of pain. Nai miris adds a unique taste and spiciness to almost any type of food and we were very happy to find it available in paste form at the Good Market.\nPanino also offers\nsauce as an addition to their sandwiches. While the sauce isn’t as spicy as Firestarter’s paste, it still adds that heat we locals love so much.\nChili paratha is a dish that certain South Indian restaurants offer. It's basically like a spicy paratha kottu with a mix of onions and chickpeas, served with a raita. As the name suggests, this is a very spicy dish, so the raita really does help to balance out the heat. Although it's spicy, it's also flavoursome, which makes you keep going back for more.\nTaste of Asia in Bambalapitiya is a sort of food court that offers everything from rice and curry to hoppers. While most of their Sri Lankan fare is tasty, their crab curry is the reason they’re on this list. The crab is deliciously prepared in a thick, spicy and sweet gravy, and we ended up wiping the shell clean. Like most of the other spots on this list, it’s that balance of heat, seasoning and spice that really appeals to us. But it's not a big crab, so although sharing is usually caring, don't share in this case.\nJeewa’s is one of our favourite stalls at the Good Market . We had a classic kade pol roti and lunumiris, for just Rs. 50. The roti comes thin and sliced into triangles and the lunumiris is absolute dynamite — a simple but superb lunch if you're a fan of this combo (and a fan of not spending much money).\nThey also offer range of hot pastes and chutneys.\nClosing out our list is everyone’s favourite spicy snack — achcharu. More specifically, we love Achcharu Kade's offerings. We’ve tried them time and time again and we are fans. Although this is upscale achcharu, the flavour is authentic. There's no skimping on the spices or ingredients, and the tangy overtones come through nicely. We tried the two mango variants they had, which were both adequately spicy and decently tasty.\nThere are a whole bunch of varieties, and the stall is very popular so they keep quite a large quantity there. This also means that the vegetable/ fruit has time to properly marinate in the various spices.\n",
  "url": "https://www.yamu.lk/blog/spicy-food-round-up"
}