{
  "title": "Sri Lankan Culinary Communities",
  "abstract": "Thanks to our ethnic diversity, we have a ton of different cuisines within Lanka itself. Here's a (very) short list of…",
  "author": "",
  "date_published": "11:09am",
  "content": "Sri Lanka is home to some pretty amazing food, be it rice and curry, kottu, or anything else sweet or packed with spices. While we have things that are uniquely Sri Lankan as a whole, we also have a few dishes which are kind of exclusive to each ethnic community within the country — and I say 'exclusive', because that's what each community is known and loved for. For example Christmas, when Catholics break out the Christmas Cake, or Eid that brings about hot pots of biryani and watalappam. You get the idea - that's how you know who to approach when each festive season rolls around.\nWe decided it would be fun to do a piece based on what dish each ethnicity makes best, so here goes. Feel free to tell us your favourites or what we've missed out!\n\nAvurudu, nuff said. Deep fried delicacies like\n,\nand\nare seasonal favourites, especially among the non-Sinhala community. Yes,\nis something we got from one of our colonial ancestors, but it's so built in to our culture today that it's a big part of local celebrations.\n\nBest made with\nor tuna, ambul thiyal was originally a method of preparation to preserve fish. It's intensely flavourful, with a ton of spices thrown in and the fish is slow cooked for a while. It's apparently best prepped in a clay pot.\n\nMade traditionally on Pongal (as the name suggests), this includes predominantly a variety of pulses and rice. It's also sweet, with jaggery and raisins in the mixture, and texture-wise is almost comparable to kiribath. Temples make vats full of this, so if you wander into one during Thai Pongal, you'd be able to get a portion or two.\nOther popular favourites are dosais, especially masala, and ghee dosais. We're rather biased towards the ghee dosai at\nin Fort, because of how crisp, aromatic, and perfectly flavoursome it is. Combined with chutney and\n, the ghee dosai makes for a light and filling meal. The best part is that you can get it at any time of the year, so no waiting for a festival to roll around.\nThe Moors have biryani. Despite also being an Indian dish, this is insanely popular especially during Muslim weddings and festivals in the country. It's popular with beef and/or mutton, but chicken's a decent substitute too.\nContributions into the food scene include what our local foodcourts make a mess of — Nasi Goreng — and meatier items like satays and beef rendang. That beef rendang is something, tbh. You can get it at Sentosa, or the\n.\nLamprais and wine, with wines more specifically focused on milk wine and king coconut wine. Lamprais is like biryani's brother in terms of rice popularity; we've even had a grand\nwhich you can read about (tl;dr: best over the counter lamprais is at Fab and the\n). I just realized that I've never actually had homemade lamprais despite having Burgher friends (I'm looking at you, Crystal).\nOh, and this baked little goody. We're not sure of homebakers who specialize in Breudher, but we've seen it at Perera and Sons during festive seasons.\n\nThere are plenty of things which are common to all Sri Lankans, regardless of which community they're from — like rice and curry,\n, pol sambol, but there are also dishes which are special to each ethnic community on our little island. If you haven't had any of these while living here, it's high time you befriend someone who could bring a dish over, come Vesak, Pongal, Eid, or Christmas.\nHappy eating!\n",
  "url": "https://www.yamu.lk/blog/culinary-communities"
}