{
  "title": "Sri Lankan Books To Get At The 2016 Colombo Int. Book Fair",
  "abstract": "Here's a (rather small) bunch of Sri Lankan books we'd really  recommend.",
  "author": "Aisha",
  "date_published": "12:52pm",
  "content": "It's that time of the year again — the month dedicated to bibliophiles, and the one month in which our bookstores suddenly remember that their books are exorbitantly priced and decides to be considerate to us book-lovers by handing out a few discounts.\nMore excitingly, it's also the month in which the Colombo International Bookfair hits town (mark your calendars, it's from 16 - 25 September).\nGiven that tis the season, we're writing a few helpful tips on English Sri Lankan books you could check out this month. Note that we haven't listed classics like\nor\n, but these ones are pretty great too.\nFull of humorous little anecdotes from Sri Lanka's Colonial past through the eyes of Muller, this book also presents you with tidbits of his life and times. A riotous little book that will leave you in fits and giggle, take a walk through old Ceylon when a group of mischeivious sailors created a bit of havoc by winking at the Queen on one of her visits, to being a journalist in the Middle East.\n\nby Theena Kumaragurunathan\nShortlisted for the Fairway Literary Award this year just mere months after its publication, the First Utterance is the first part of the Miragian Cycles Trilogy. It's the first Sri Lankan book that's based on magical realism, and keeps the readers on their toes by switching swiftly between poetry, prose, and drama within it's short 80-odd pages. The story takes place within a distopian world where mad men are hidden away from society, and where there's a prophesy which predicts the end of the world as we (or the Miragians) know it.\n\nNihal de Silva created a few literary gems which perfectly encapsulated what Sri Lanka was during turbulent times. The Giniralla Conspiracy is one, and if you haven't read this already, we strongly recommend that your go buy (or borrow) it at once.\nThe book gives readers a very real insight into what happens (or used to happen) at universities, and how the student activism which bloomed in there lead to more revolutionary things in the country. Reading this helped me understand why governments in the past were really repressive of student union activism, and why and how ragging was such a big part of the campus culture. What's exciting about this book though, is not that — it's the fact that this could possibly have been real, the disaster which was the\nconspiracy could very well have been true if not for an undergraduate who was also a journalist. de Silva, at the beginning of the novel, says how he was approached by someone who tried to sell him the diaries of a young undergraduate during the war. He procured these diaries, and then was pulled into a world of intrigue and disaster for Sri Lanka which (clich\u008déd as it sounds) was averted at the very last minute. He writes the novel based on those diaries, and it's pretty darn epic.\n\nNarrated initially through the eyes of a six year old boy,\nfollows the story of Sri Lanka as seen by Arjie, a Tamil boy from a well-to-do family in Sri Lanka, whose biggest problems involved rivalries while playing with his cousins, and escaping punishment from school — only to be replaced by his life being thrown into complete disarray following the ethnic tensions between the Tamils and the Sinhalese back then. The story of ethnic upheaval goes hand-in-hand with conflicts regarding his identity crisis as Arjie realizes (even at a very young age) that he's homosexual; something that's frowned down upon in his and the larger community. Selvadurai weaves an idyllic yet shattering story as he explores Colombo as it was in the early 80s.\n\nPillow Politics is a very... how could I put this...\nbook. It's vividly described through the eyes of a disabled boy — someone's who's practically a vegetable and needs constant care and attention — but also someone who's extremely observant and with a skill of being able to 'read' people.\nFrom what I've read of local writing, this story is fresh not only in terms of plot but also in the style of writing. Infused with a healthy smattering of local lingo and Sri Lankan English, it might be difficult for someone who has no idea of our idioms and proverbs to get the subtleties, but it's still a very refreshing, entertaining, and heartbreaking read. It's intensely realistic, and is also one of the very very few novels I've read which DOESN'T have our civil war play a large role in it.\nAs the narrator says,\nEveryone's heard about Karunatilaka's masterpiece, in which fact and fiction blur together leaving you heady and exhilarated after this refreshing read. With the central focus of the story being on the protagonist's (who's a retired sports journalist) obsession with a 'mythical' cricketer and finding him, this book touches upon many things Sri Lankan — cricket, drunken conversations, domestic drama, politics (always always politics), dodgy bars and arrack and ill-placed bets, families, and everything else that's imaginable under our tropical sun (including what happens between neighbours when their Muslim daughter and Sinhala son run away with each other).\nHaving been a copywriter, Karunatikala has a way with spinning words, mixing them up the way our protagonist Wije mixes alcohol and slurs. It's humourous, it's sad, and it's heart-touching — and best of all, even people who aren't fans of cricket (like yours truly) can enjoy it.\n\nThe Road from Elephant Pass is what put Nihal de Silva on the map. With a cover image like this, all I can say is that this is a perfect example of why you shouldn't judge a book by its cover. Despite the cartoony silhouette foregrounded against a huge tusker, this story is a lot more than a couple of people running away from an elephant. Set during the civil war, this is a quintessential (I love that word) war novel which gives you the story of the combatants on both ends of the spectrum.\nThis may sound clichéd, but in a country where two ethnic communities were at odds with each other, this serves as a great reminder about how many similarities we share as a community as opposed to the differences we have between us. It's also a story of adventure amidst a war torn Sri Lanka, of the relationship that develops between a Sinhalese Army Captain and a female LTTE Cadre —arch enemies, the both of them — as he has to get her across the country to safety in exchange for invaluable information.\n\nFor something so Sri Lankan to be written by a non-Sri Lankan, Tenduf-La does an incredibly good job. The story is (no spoilers, don't worry) about how Eddie, an Englishman teaching English in Sri Lanka, falls in love with and wants to marry Menaka.\nThe problem however, comes with Menaka's father who's an absolutely amazing racist and wants pretty much nothing to do with Eddie. Hating everything down from Eddie's white skin to his incapability to speak Sinhala and drive Sri Lankan, Thilak Rupesinghe (Menaka's father) does all he can to make Eddie flip a table in despair and pack his bags in defeat. Given Herculean tasks to prove his love and commitment, Eddie does everything humanely possible to butter up to his irascible future father-in-law, including getting used to spicy food and Sri Lankan aunties and uncles (hats off to this guy, fictitious though he is).\n\nNayomi Munaweera is yet another award-winning Lankan writer, whose debut novel\nreceived critical acclaim by winning the Commonwealth Book Prize a few years ago.\nis more recent and was published just last February. It's received a positive response so far, and is themed on how the main character commits what's possibly an unforgivable crime. Presented in the first person\nin the present tense, it can't get more realistic and relatable. Readers unanimously agree that it's a heart-wrenching novel that's bound to leave you in tears.\nA post-tsunami story, Sonali Deraniyagala pens a touching account of picking up her life after being hit by the wave. Having lost her children in the tsunami, Wave is a book of unrelenting grief and pain, a memoir of her life.\nBy the same author as The Amazing Racist, Panther is another humourous and tongue-in-cheek tome. Slightly darker than his first novel, this follows the story of Prabu, a boy who's accepted to a high-end International School for his cricketing abilities.\nThis is what Muller called 'faction'; a mix of fact and fiction. Read through his worldview of how Sri Lanka was during WW2, and of his rather controversial portrayal of the Burger community. It's received mixed ratings for being crude, vulgar, and brutally honest while also maintaining Muller's trademark humour.\nQuite a bit darker and bleaker than most of the other books listed here, Anil's Ghost gives The English Patient a run for its money. Set in a turbulent Sri Lanka during the era of a wildly militant JVP and an eternally politicized bureaucracy, Michael Ondaatje weaves characters, situations, and complications seamlessly into each other without somehow overwhelming the reader. He does succeed in depressing most of them though.\nMadhubashini Rathnayake's Graetian Award Winning novel is rather low-key and isn't as well known as it's other award-winning counterparts, which is strange. There's Something I Have to Tell You is a poignant, raw, and intensely Sri Lankanized novel. It's rather reminiscent of\nin terms of evoking memories of friends and childhood activities.\nThat's our updated list for this year. If you've got any we've missed and you think we — and everyone else! — should check out, hit us up in the comments with your favourite local reads.\n",
  "url": "https://www.yamu.lk/blog/sri-lankan-books-at-the-book-fair"
}