{
  "title": "Sri Lanka's Future Expressways",
  "abstract": "Where will the next Sri Lankan Expressways go? Based on public information, these are our best guesses. ",
  "author": "indi",
  "date_published": "4:04pm",
  "content": "As YAMU expands our coverage island-wide, the question we ask is ‘where next?’ One major factor is where the roads go. While we hope for good trains and more accessible transport, expressways are still the quickest way to network the country. So where will the next Expressways go? Based on public information, these are our best guesses.\nRight now, the Southern Expressway (E01) is operational, and has been for years. This toll road has made Galle and now Matara nearly suburbs of Colombo. This means that you can live beachside in Unawatuna and still be back in Colombo within a few hours.\nMatara is a bit further but it has some beautiful architecture, nearby beaches and is actually a charming urban space. The Expressway also has a planned extension to Hambantota coming up soon. While there isn't much to do in Hambantota, this does make Arugam Bay, Ella, and Yala much more accessible.\nThe other transport change has been the Katunayake Expressway (E03), connecting Colombo to the Airport, but also to Negombo. The main strip in Negombo probably has a higher concentration of restaurants and bars than any place in Colombo and it's a fun place for a day (or night) trip.\nAs the Outer Circular Road (E02) connects these two expressways, this also means that tourists and locals will be able to bypass Colombo traffic entirely and connect to places like Galle.\nThe Kandy road is currently one of the most frustrating in Sri Lanka. Kandy is only 117 km away but it can easily take four hours — hours requiring constant attention and tension.\nA Central Expressway (E04) to alleviate this drama was proposed in 2002, launched by Mahinda Rajapaksa in November 2014, scheduled for 2018 and then sort of stalled post-election. They actually called it a Northern Expressway, but that was jumping the gun a bit. A connection to Kandy and the central provinces is what’s most needed, and this is the project the current government has resumed, calling it a Central Expressway.\nA less-than-two-hour connection to Kandy would be a game-changer. Besides people with homes or family in Kandy, the hill city is a beautiful place for an overnight stay. With better transport perhaps the town could also support more than a handful of bars and restaurants.\nOf course, no Expressway will make the congestion within Kandy better. The proposed exit in Katugastota, however, could also take you direct to Knuckles, scenic but also not so far removed. This connection also makes Nuwara Eliya a lot more accessible.\n\nIn the next decade, the Sri Lankan landscape will be very different indeed. At this point, you can assume that Negombo, Colombo, Galle and Kandy will be tightly networked. It’s also quite possible that the Ruwanpura Expressway (E06) will be online, connecting the Expressways network to Pelmadulla, via Ratnapura. Construction was said to be starting in 2014, to be completed by 2019, but we don’t think that’s likely. Within a 5-7 year time-frame, however, we think the E06 will happen.\nWhat this means is that Ratnapura will be 45 minutes away and Pelmadulla one hour. That brings cool and beautiful tea country like Haputale within a few hours reach and it brings Ella and—to a lesser extent—Nuwara Eliya within reach. It also makes the trek to Arugam Bay and the east coast less of an ordeal.\nWithin 10-15 years, you’re looking at the East Coast coming online. This could mean a Northern Expressway going through Kurunegala, Dambulla and then across to Trinco. It could also mean the Southern Expressway going through Hambantota (that part is now under construction) and snaking around Yala to Ampara and Batticaloa. At this point, the Hambantota Airport would also become useful, if it hasn’t returned to the jungle.\nYou’d also be looking at the North connecting up. The A9 already supports speeds of 100 km now, plus the rail line is fast, but any sort of connection through Dambulla would open up Vavuniya and Jaffna. Jaffna would still be at least 4 hours from Colombo, but that's not bad. And that’s just assuming current transportation technology. By then, the rest of the world should be onto self-driving cars, and God knows Sri Lankans could use those.\nFifteen from now, honestly, who knows. Sri Lanka still has to worry about climate change, governmental change, economic change, all factors which could affect a lot in the long run. Assuming some stability, however, we’ll hopefully be looking at a country which starts to look a bit like mythical Ravana days — the city of Lanka. This would be a place where the country is highly networked, where transport is efficient and—hopefully—mostly public (buses and trains, or self-driving cars).\nThis also means that culture, restaurants, music and business will spread out of Colombo, enabling people to live where they want without giving up on the connections they need. In time we think the whole of Sri Lanka could be like one big metropolis, which should be fun for everyone.\n",
  "url": "https://www.yamu.lk/blog/future-expressways-sri-lanka"
}