{
  "title": "Sri Lankan Holidays 2017: Long Weekends & Where to Spend Them",
  "abstract": "Every long weekend, public holiday, and opportunity to travel!",
  "author": "Kinita",
  "date_published": "10:25pm",
  "content": "Sri Lanka has a ridiculous number of\n, probably the most in the world. Be thankful you live here, in the midst of all the chilling, thambili, and sexy beaches, and check out our list of public and mercantile holidays for 2017.\nWe've noted the ones that are mercantile holidays (days you get off work in private companies) in green. We've also mentioned where you can take leave for maximum long weekends, and suggested some places to go, especially if you're not celebrating a religious holiday.\nAll underlined links will take you to our comprehensive guides, pages, or hotel websites, so click on them for more.\nTake the Friday off and spend a blissful 4 day weekend\nwith the\n. This holiday is the same time as the\n, on from the 11-15th. While you're there,\n.\nThis may be a dry day, so stash your beer in advance. The\nin the Law Courts square will be in session though!\nHonestly, stay home. The parades will shut down Galle Road and you do not want to get stuck in the ensuing traffic.\nTake the 3 day weekend as an early Valentine's getaway. We suggest somewhere romantic like\n, or if you're a laidback surfing type, somewhere new and hip like\n.\nTake a scenic train from Fort to Ella, get your hiking shoes on, and get ready for a lush long weekend getaway in the hills. From\nto\n, your hiking options are boundless. If you're feeling fancy we'd suggest\nor\n.\nfor the family and have a nap.\nTry and get the 11th & 12th off, and you can enjoy an 8 day holiday from the 8th to the 17th of April. This is a good chance to\n. If you're not keen to get out of Sri Lanka, consider\n, or\n.\nThis is traditionally a time when everyone returns to their ancestral villages, so expect public tranportation to be packed. Not a good time to travel.\nIf you're celebrating the New Year, this is definitely a day to stay home and\n.\nThe 14th is also Good Friday, so you can also visit a range of gorgeous\nthat celebrate Good Friday and Easter in full.\nIn Colombo, most major political parties hold May Day rallies and processions, which, while checking out the floats is fun, can also clog up traffic.\nOn the other hand,\n, so take the long weekend to check out the rash of Pottuvil Point's seasonal hot spots.\n,\n,\n, the options are endless.\nIf you're staying in Colombo, the whole city is lit up, especially around the\n,\n, and\n.\nIf you want to take a 4 day weekend, it's a good time to check out Jaffna. If you want to save on travel time and have some extra cash, consider\n. Once you're there, we recommend staying at\nor Jetwing Jaffna closer to town. If you're more of a\n. Don't forget to immerse yourself in the\n!\nIf you're taking Friday off, it's a 4 day weekend. If you're not, head to\nfor the day, or stay in Colombo and enjoy the mid-week break.\nOnce in Negombo, the best thing you can do is eat well, drink well, and head for an\n. Otherwise, stick to old dining favourites like\nor\n.\nExplore\n! The dry season is now in full swing, and your chances of a leopard sighting are fairly good. The\nis huge, diverse, and unfortunately often touristy. Get ready for early morning safaris and star-gazing nights. If you're looking for luxury, try Cinnamon Wild or some of\n.\nStay home and\n.\nIf you want to get swept up in the excitement of a big festival (lights, fire swallowers, elephants, et al), head up to Kandy for the weekend where the fortnight-long\nwill be coming to a beautiful finale.\nVisit\n! The annual Elephant Gathering from June to October is when elephants from the neighbouring regions migrate to the ancient Minneriya Reservoir, and you'll see hundreds of these gentle giants ambling, flirting, and foraging.\nIf you take off Monday the 4th, you can swing a 5 day holiday, and head to the North East. Once there, make sure to catch\nwhile you still can. Pristine beaches, lovely weather, and snorkelling galore.\nIf you take Friday off, it's a 4 day weekend. If you don't want to take Friday off, consider one of the gorgeous city leisure spots, or get yourself a luxury bungalow for the day. We'd suggest Airbnb or even hotels like the\n.\nIf you can take Friday as a holiday, go on a\ntour - Dambulla,\n, Anuradhapura, Wasgamuwa, Polonnaruwa. Basically the ancient and wild of the paradise island while it's not too hot.\nUse this mid-week break to explore Colombo and its colonial architecture. If you're Hindu or keen to explore more about this multi-faceted religion during a beautiful, illuminated festival time, visit one of the island's many intricate\n.\nSince you have 3 days, try heading up to\nfor the beginning of the season and\n! We'd suggest\n.\nIf you're not celebrating the festival, head down the West Coast. Kick off the December season with a 3 day session Down South. Go beyond Galle, and stick your toes into Thalpe or Weligama's sandy shores. We'd suggest\n,\n,\n, or\n.\nStay home and sulk about the wasted holiday opportunity. Well actually you probably won't even get to stay home because you'll have\n.\nIf you're not swamped with Christmas events, head to\n.\nCosy up in a gorgeous bungalow in the hills for some of that real snuggly Christmas spirit. We'd suggest the historic\n, Jetwing's\nor\n, or any of the gorgeous\nup for rent. There isn't always too much to do in Nuwara Eliya, but\n",
  "url": "https://www.yamu.lk/blog/srilanka-public-holidays-2017"
}