{
  "title": "Sri Lanka In Asia's Top 50 (Restaurants)",
  "abstract": "Sri Lanka has two spots in this year's list of Asia's Top 50 Restaurants.",
  "author": "",
  "date_published": "4:01pm",
  "content": "Sri Lanka is already in Asia's Top 50 overall because there are only 48 countries in Asia. What's more notable is that Sri Lanka also has 2 entries in this year's list of\n. Those two entries are\n(29) and\n(49), both headed by Dharshan Munidasa.\nYou can see Asia's culinary hotspots in the map above. Or in this graph:\nWhat's interesting is that Sri Lanka has the same number of entries (2) as both mainland China and India. Given our population, this is nuts. That means that Sri Lanka has 61 times more top restaurants per capita than India, and 66 times more China.\nDoes this mean that Sri Lanka has better food than India and China? No, it just means that Sri Lanka did better on this list, which isn't a statistical sample, or even trying to be rigorous. So that caveat in hand, we can still be proud that Sri Lanka did well, and benefit from the exposure.\nThe question that follows is, what is this list? For some background I recommend this long and fascinating New Yorker article -\nIt covers the success of the World's Top 50 list (now extended regionally) and the pros and cons of its methodology, in detail.\nOne quirk of their method is that they depend on international of volunteer judges, who generally recommend places they know. They are not, like YAMU, going out and trying everything new, nor would that really be possible on a global scale.\nAccording to the New Yorker, each region has\n\n. These volunteers are allowed to take free food, and there is possibly lobbying and who knows what. I mention this not to say that it is a bad or disreputable system, but just that it is a system which is prone to human fallibility and is thus, at best, an approximation of a particular reality at a particular time. But then, so is all perception. All is illusion.\nThe food at Ministry Of Crab and Nihonbashi is really really good. YAMU consistently rates it among the best places in Sri Lanka, and I'd personally rate Ministry Of Crab as the best. One thing I've heard is that Dharshan is a great marketer, which of course has an effect on a list like this, where\n53 people are asked to select from what they're aware of.\nHowever, I don't think marketing is a bad word. What he's marketing (the food) is excellent and the marketing isn't like he takes out TV ads. Ministry Of Crab is an experience from the location to the menu to the celebrity partners to the name, all of which contributes to your experience as a diner, perhaps as much as the food.\nIn my opinion these restaurants and Dharshan definitely deserve the honor, and hopefully the added business and visibility. His restaurants do well by this, but this also puts Sri Lanka on the map as a culinary destination.\nSo, congratulations to Dharshan and his team, and to Sri Lanka. If you're lucky enough to live here,\nand\nare well worth a visit. If you're a tourist, these two restaurants are just the vanguard of a growing and vibrant culinary scene. The whole country is worth a visit, and Colombo shouldn't be missed.\n",
  "url": "https://www.yamu.lk/blog/sri-lanka-in-asias-top-50-restaurants"
}