{
  "title": "Sri Lankan Make Up Hacks",
  "abstract": "Here are a few little tips you can incorporate into your daily makeup routine to keep yourself in check, minus the…",
  "author": "Sarah",
  "date_published": "7:32pm",
  "content": "There are enough and more commercials that command the good women of Sri Lanka to purchase their products to cleanse their skin of impurities and melanin. Ridiculousness.\nOur skin type is not only complicated, but most of us have a combination of oily/dry skin and are prone to breakouts more often than not. Skin tones vary immensely and since most tutorials cater to Caucasian skin, a lot of us end up looking cakey and/or grey. In a climate like this, it's best if makeup is neat and minimal to prevent the sun/humidity taking its toll. Here's a few tips you can use to cut down on the amount of makeup you wear daily.\nWash and gently exfoliate your face every day. This helps a lot in the long run with maintaining your skin. Use papaya skins to give yourself a soothing face mask. Papaya is known to have antioxidant benefits and does a great job of brightening up your skin and cleaning out your pores.\nIf you have larger pores, or pores vulnerable to humidity, rub an ice cube onto the areas where your pores are most visible. This helps shrink them so your make up doesn't end up entering pores or looking like the Grand Canyon. Ice is known to promote circulation so this will make your skin look bright and tight.\nThe benefits of using Lacto Calamine are endless but, in general, it keeps your skin moisturised, evens out your skin tone and prevents rash and breakouts if used consistently. Since Calamine Lotion has a bit of a tacky texture to it, it'll help with even distribution of foundation on your face, so you won't have to spend extra cash on a fancy schmancy primer.\n\nNote that if you have dry skin it's best to just use a simple moisturiser (with no alcohol) instead.\nThe Sri Lankan sun is as unforgiving as that aunty whose niece eloped. Mild exposure to the sun can ruin your makeup and do heavy damage on your skin and pores, causing acne, over-production of oil and the occasional rash. If it's humid outside then wave goodbye to your carefully applied foundation.\n\nWhat you can do is mix a tiny amount of foundation with your moisturiser or sunscreen and you've got yourself your own BB cream. You can adjust the amount of foundation used, of course, but keep in mind that the goal is to have as less cosmetic product on your face as possible.\nWe've all seen the Youtube make-up 'gurus' practically slap on concealer like masons slapping cement onto walls. Not only is this an absolute disaster for island skin, it's also a waste of product. If you take a walk with that much makeup on, you'll end up looking like a sad ice cream cone left on the side of the pavement.\n\nWhat you CAN do to hold your concealer in place without using copious amounts:\nInvest in a good waterproof mascara. While you won't need to use it often, it's good to keep around if you want to swipe through just to give your eyes that extra lift.\n\nIf you don't want to buy waterproof mascara then that's fine too. Just use Vaseline through your eyelashes and comb through to distribute evenly.\nI was casually surfing through this little Instagram kadé for makeup and what do I see? A few sheets of blotting paper on sale for JUST 1200LKR!\n\nIf that isn't the most ridiculous thing I've heard, I don't know what is. A great alternative for blotting paper is either tissue (which we're all aware of) or baking paper. Baking paper is literally a slightly thicker version of blotting paper.\nI've also heard that Toilet Seat Covering Paper works well, too. You can get a pack of them free with a Flora pack of toilet paper.\nAt the end of the day, your beauty routine is up to you. If you feel like you can rock blue and green eyeshadow at lunchtime then kudos to you, mami.\n",
  "url": "https://www.yamu.lk/blog/every-day-makeup-tips"
}