{
  "title": "Sri Lanka's March Madness - Big Match Season 2017!",
  "abstract": "Loyalty to one’s school runs deep and strong in Sri Lanka, and that sentiment is at it’s most visible during Big…",
  "author": "",
  "date_published": "9:54pm",
  "content": "There’s many a little quirk of our beloved pearl in the Indian ocean that’s baffling to outsiders and sometimes even us islanders too. The side-to-side head shake, calling your significant other Aiya/Akka/Nangi/Malli,\n… and something that’s not so little; Big Match season.\nLoyalty to one’s school runs deep and strong in Sri Lanka. That sentiment is at its most visible during March of every year when the oldest, largest, most prestigious boys schools turn Colombo into their own party town for their annual cricket encounters. Affectionately called ‘The Big Match.’ Often having about a century of history behind them, a big match will draw old boys from these schools, not just from around the town, but around the world. Having 80 year old great grandfathers passionately wearing school colours and waving flags next to kids still in school and wearing uniform is not unusual. It’s the norm.\nAlso, the giant parades that run through the city in the days before the match are quite the sight. While creating gridlock, is an explosion of colourful chaotic insanity. You can expect anything from elephants to sports cars to coffins, as well as raucous cheering as they pass by the girls' schools.\nIf you want to check them out (or avoid them), these are some of the big ones.\nThe\nwill be fought between Isipathana College and Thurstan College for the 54th time at the SSC. While Isipathana will be keen to retain the trophy, Thurstan is riding a wave of success in the current season and expects to put up a strong performance.\non\nThe saints will come marching in on the 3rd and 4th. St. Peters college and St. Josephs make up the\n, which began all the way back in 1933. It’s said that this time both teams are balanced and are in good form. So expect a great match.\non\nAnanda and Nalanda colleges have moulded many a great cricketer through the years. You might be able to see a few in action at the latest\n.\non\nThe oldest and perhaps the biggest of them all;\n. The 138 year rivalry between Royal College and S. Thomas College makes it one of the longest unbroken sporting events in the world. This year the on field umpires will even have tv replay technology on hand to assist on line calls.\non\nAnother big match with a long history is the\nbetween St. John’s College, Jaffna and Jaffna Central College, which will be played for the 111th occasion in Jaffna.\nPrince of Wales college and St. Sebastian’s college have been embroiled in the\nsince 1933. Some interruptions means that this is only the 67th encounter, but it’s no less than any other.\nThe\nmarks its centenary match when the Trinity and St. Anthony teams take the field. A win hasn’t been recorded by either side since 2012. Winning the 100th would be quite the honour so there’s sure to be extra effort from both sides.\nThe\nhas a history going back to 1893. 2017 will be the 111th match between Kingswood and Dharmaraja colleges.\n",
  "url": "https://www.yamu.lk/blog/sri-lanka-big-match-2017"
}