{
  "title": "Sri Lankan Salary Calculator",
  "abstract": "How much do you earn? How far does it get you?",
  "author": "Kinita",
  "date_published": "3:11pm",
  "content": "Your salary in Sri Lanka determines a lot of things. Your marriageability, your status, your very existence. What exactly can you buy with it though?\nInput your monthly salary in LKR in the field below, and find out exactly how much of each thing you can get per month.\nHere are some basic facts you need to know about living and earning in Sri Lanka.\n, not only in comparison to developed economies, but also in comparison to other developing nations in the vicinity like India or Malaysia. A key reason for this is that most Lankans live with their parents until marriage, and often after too. This way, rent, food, and bills are taken care of by an older, moneyed, or landed gentry generation.\nThis is unlike India, because many young professionals need to move out of their parents house to work in big cities, whereas Colombo and its suburbs are small enough to commute. This means that expenses are often just relegated to \"spending money\" instead of a means to survive. And in turn, this means that people are very laissez-faire about negotiating for their worth, and are willing to work for low salaries.\nAnd in turn, this leads to a massive brain drain because people who know they deserve better and have educated themselves move abroad for better opportunities, and people who stay here cannot afford to contribute to the economy via buying property, investing in businesses, tourism etc.\nSri Lanka has\n. The top 1% of the country own properties around the world, yachts, own a cool dozen odd cars, and their kid earn \"salaries\" (i.e allowances) at Daddy's company over multiple times that of the average employee. The\n.\nFurthermore, prices in Colombo are sky-rocketing. Skilled wages are lower than India, but\n.\nNot much really, except negotiate, or change your job. If you've worked hard on your education, training, and/or have put in the time at your job, you have the right to be compensated accordingly. Speak to your co-workers, speak to your boss, and have open and educated dialogue about what you need.\nMake your case - what you contribute to the company, what you can offer the company's future, and your credentials. This isn't a union of bloated government workers demanding benifits they haven't earned, this is a rational justification of better working conditions and compensation. Watch the video below (and adjust for Lankan sensibilities and incomes) :\n\nGo slow on your maalu paans, forget about the Lambos, and unless you're working at daddy's company or driving one of his multiple sexy cars, start taking a long hard look at your financial future.\n",
  "url": "https://www.yamu.lk/blog/sri-lankan-salary-calculator"
}