{
  "title": "Start Your Own Startup (JKx)",
  "abstract": "How John Keells X provides a great opportunity for new startups.",
  "author": "",
  "date_published": "1:32pm",
  "content": "YAMU is legit proud to be the campaign partner for\n. If something like this had been around when YAMU started we would have been way more successful, and have avoided much pain. Why? Here's a few reasons.\nWhen YAMU started, in 2012, the startup scene was just beginning. There were investors, but getting funding was a long, negotiated process.\nWith a program like JKx, the process is simplified, which makes it go faster.\nAt any stage you could possibly negotiate a better deal, but negotiating takes time. Like, lots of time. And energy.\nThe JKx process is simple, which makes it fast. A 2 million seed is pretty good (in Sri Lanka) and you can then pitch for up to 50 million in a year, when it's clear whether your idea works or not.\nIf you want to succeed you also need to hire good people, you need to market, and you may need assets (computers and servers at the least).\nA lot of startup programs in Sri Lanka offer the chance to pitch to important people, or exposure, but few offer hard cash at the end. Which is actually what you need.\nWith JKx, they actually give you cash. Rs. 2 million is more than YAMU had to start with, plus office space. For most ideas, that's enough to develop a minimum product and get your core team together, and then there's a path to pitch for up to Rs. 50 million more in April, which is enough to really go hard.\nThis isn't enough for certain ideas, however, so if your idea requires tens of millions to get started you should A) ask whether you could test a minimum product for cheaper and/or B) apply to another accelerator, or pitch to investors direct.\nMoney is like gasoline. If you use it strategically, it moves you forward. If you use it without a strategy, it just lights you on fire. For early stage startups, it really really helps to have some basic training.\nPersonally, I really wish I'd studied some basic economics and accounting much earlier. Having a basic knowledge of business and entrepreneurship lets you break the rules because you understand them, not just because you're stumbling around.\nJKx puts teams through a training program in August based on\n. I just skimmed through those ideas and they would have been very helpful to YAMU.\nFor the teams that get funded, JKx then brings down experts on growth hacking from Growth Tribe in Amsterdam. You work with them hands on to learn how to scale, which isn't something that just happens.\nIn Sri Lanka, a lot of business is still done based on who you know. For YAMU I leveraged my connections as a blogger and from my previous work, as did my co-founders and team. Without that we couldn't have gotten anywhere at all, but those were just the connections of a few people.\nWith JKx you'll have the connections of Sri Lanka's biggest conglomerate on board. Internally that means access to expertise, markets and customers in tourism and leisure, retail, consumer foods, beverages, property, insurance, banking, transport - basically everything.\nKeells is looking for startups that can benefit and benefit from their existing lines of business, which is a very good place for a company to start. Finding your first customers and markets is the hardest, and having a blue-chip investor on board can really help.\nI'm not saying JKx is the best thing for your idea. There are a few tradeoffs\nIf you accept the first round of investment (2 million) you agree to give JKH right of refusal on your next round, at a maximum of Rs. 50m for 25%.\nThat means that if someone offers you 10m for 25%, JKH has the right to match their offer. If someone offers you 60m for 25%, JKH has the right to get it for 50m.\nWith my limited experience, this is a fair deal, especially for all the other support they give. A lot of investors in Sri Lanka try to take 30% in the first round, which leaves you little room to move. And a 200m valuation after one year is crazy high, that's a good problem to have.\nIf that doesn't make sense take some time to think about it, or\n.\nStartup competitions don't always pick the best companies. The real competition isn't who can pitch the best, it's who survives in the market. So you may want to do your startup by raising money quietly, bootstrapping and just getting to work without all the extras.\nBig, public companies are not especially agile, because they shouldn't be. No one wants part of their pension fund to randomly pivot to video chat or something.\nThe idea behind a startup competition like this is to invest in innovation happening outside the company, but that's a rather new model globally and it may not work. It may be that startups perform better with traditional venture capitalist funding, or bootstrapped, or that having traditional corporate connections actually slows them down.\nJKx is a startup itself in a lot of ways, and the model may not work, and we won't know for a few years.\nSo those are the benefits and downsides from our perspective. If this was 2012 and we were starting YAMU again, I'd definitely apply. It's a good amount of money, the connections would have been priceless, and we definitely needed the training.\nOverall the whole thing would have saved us a bunch of time, suffering and I can highly recommend it if you've got some ideas of your own. So\n, and\n.\n",
  "url": "https://www.yamu.lk/blog/a-real-startup-competition"
}