{
  "title": "Street Harassment in Sri Lanka ",
  "abstract": "Street harassment, eve teasing, whatever else you want to call the daily verbal (and sometimes physical) abuse on the…",
  "author": "",
  "date_published": "12:23pm",
  "content": "It's not a compliment.\nIt's not boys being boys.\nIt's not flirtatious.\nIt's an act of aggression, informing you, as a woman, a gay man, or a trans person that when you walk in public space, your body is for public perusal. It's constant, it's horrible, and it happens to most women in Sri Lanka, as\nreflects below.\nIt ranges from \"ah nangi!\", to a low exhale of breath \"sssss\" which sometimes poetically flows and evolves into the ever-charming \"ssssexy\" or the borderline Shakespearean \"niiice, sexy, how! hott ammoo\". If you're an openly gay man it will be classic stuff like \"ponnaya\" or \"nachchi\".\nApart from being predominantly female, it's pretty difficult to pin down an average victim type.\nshowed women from all over the age spectrum, starting from as young as 12 and going up to late 60s. Gay men and trans people are frequent victims too.\nWomen of all ages, sizes, religious and ethnic backgrounds, and in a variety of clothing get harassed daily. In saris. In hijabs. With their young children. In work clothes. In office clothing. In school uniform.\nearlier this year which actually maps street harassment, with markers and stories detailing encounters of everyday women, while #StreetHarassmentHurts also ran a pretty interesting campaign a couple of years ago, detailing the stories of many Colombo women.\nThat being said, it's probably time to stop trying to assess the demographics of the victims as clearly neither the moneyed Colombo elite, nor the stressed suburban mother of four, nor the hijab-donning adolescent schoolgirl are spared this daily verbal undressing.\nIt affects everyone. Even if you're a man and it's never happened to you, it indirectly affects your life. Women feeling unsafe and prone to attack, equals a host of negative repercussions for the country. How?\nIf 51% of the population feels too unsafe to step out on the street alone/ unaccompanied after dark, that's a massive chunk of people that will not take longer-hour jobs, will shirk employment far away, will not go shopping alone, will not go to restaurants/bars. It's a loss to businesses, it's a loss to the workforce, it's a loss to public transport.\n. We walk different (often longer) routes, we spend a ridiculous amount of money on private transport in order to escape bus groping, or we simply drive/taxi short distances to avoid walking on the road etc. Some women are fortunate enough to have the option to pay their way out of molestation and harassment by taking a taxi instead of walking or taking the bus. Many do not have that luxury.\nHarassed tourists aren't going to take it lightly. Tripadvisor reviews, word of mouth, guidebooks, it all adds up. If Sri Lanka wants to create/ maintain a reputation for being women-friendly, irritating or molesting foreigners isn't the way to go about it.\nIt affects happiness. Many women are made to feel angry, scared, or attacked before they even get to work or school. This, in turn affects interactions between men and women. We are now often automatically hostile/ unresponsive to even perfectly innocent/ harmless male contact. You want directions? You just want to say hello? Forget about it. The decades of verbal abuse, stalking, and fear means the average woman on the street will probably ignore you and hastily move on. It's virtually impossible to meet people in Colombo or Sri Lanka that you don't already know via friends or family. Want new friends or to ask a pretty stranger out for coffee? Not going to happen.\nNOTE : Interestingly enough, every man that I've spoken to about this has said that they've quite rarely seen it happen, since if they're with their female friend/co-worker/wife/ girlfriend, nothing happens. Is this because the cowardly road rats are scared of another man's \"dominion\"? Or do they respect another man more than they respect your right to exist without harassment? Another mystery of the universe.\nMost people we polled did nothing. Ignored it and walked on. It's understandable - you just want to get away from the situation, ignore it, move on. Unfortunately you're then internalising a lot of that anger and irritation, instead of addressing the problem. Worst part? The perpetrators know they can get away with it, and will continue to act that way. What are your options?\nYour biggest priority is your safety. If you're alone, in a secluded place, or feel that the situation might get out of hand, DO NOT confront your aggressors. Immediately text or loudly call a loved one and mention your exact location, and that you'll see them in a minute. Try and get out of the situation and into a crowded/better lit/ security presence area ASAP.\nIf you do feel safe, take a video or a photo of what's happening. It's proof, it's a way to hold them accountable, and it's a way to identify the perpetrators should you wish to follow up on #4 or #5. The fear of being identified also almost always makes them scatter/ stop.\nIf you're in a safe space, not outnumbered, or in potential harm's way, respond. Politely but firmly turn around and simply ask \"What did you say to me?\" or \"Can you please repeat that for the camera?\" or \"Did you know you could go to jail for that?\" in whatever language you are most comfortable in. Also ask them for their NIC number/ employment/ school/ whatever necessary to make it clear that there are repercussions. Sometimes, street harassment comes from a place of ignorance, and men literally not realising that their behaviour could be damaging or is unacceptable, especially if it's a social norm for them.\nIf you're feeling particularly sassy,\nand handing them out to road pervs.\n\"Eve teasing\" or \"outraging the modesty of a woman\" is a criminal offense. According to Penal Code (Amended) Act No.22 of 1995 – Sect 5\nWhoever, by assault or criminal force, sexually harasses another person, or by the use of words or actions, causes sexual annoyance or harassment to such other person commits the offence of sexual harassment and shall on conviction be punished with imprisonment of either description for a term which may extend to five years, or with fine or with both and may also be ordered to pay compensation of an amount determined by court to the person in respect of whom the offence was committed for the injuries caused to such person”\nNo, this isn't always the best option. Plenty of people would rather avoid the cops than appeal to them in cases like this, and there have been instances of cops actually doing the harassing. Even if you do file a case, you're bound to be subject to a bunch of questioning about where you were, why you were alone, and what you were wearing. So prepare for that.\nA lot of street harassment comes from the raging hormones of school boys with few healthy female interactions, female friends, or the allowance of normal teenage behaviour. Since their only stab at freedom is around school events or school days, there's a full chance they will be in uniform. Ensure they know that you identify their school and will be in touch with their headmaster.\nThe older, but no more wiser types of harassers may also be in work uniform, or with name tags, or actually AT their place of work when they harass you. Last week, a waiter at the Bavarian waited till I was slightly separated from the group to hiss \"ahh niiice hair\" at me as we exited the building. Needless to say I won't be dining there again any time soon.\n, it's going to land you in a pile of legal poop. If you feel genuinely cornered and want to take it to the cops,\ncan temporarily faze your attacker with a pungent smell, and leave them stuck with indelible ink. Easy to identify to the police, easy for embarassment.\nIf you see this happening to someone else, stand by them. You don't have to confront the aggressors. Just stand with the victim, talk to them, help them along. If you feel brave, and safe enough, you could always tell the harassers off too. Sri Lanka appears to have a huge problem with bystanders taking no notice/ not helping at all,\n. If you're a man, use your \"machang\" card to neutrally address the perpetrator and inform them that real men treat people with respect.\nAh, Street Harassment, the ugliest one-way street of them all. The best way to end this exhausting bullshit? Systemic change, educational overhaul, and better ways for men to deal with sexual frustration (demystification of masturbation? a breakdown of the\n?), and gentle explanations to ignorant perpetrators that their actions are unwelcome, and criminal.\nFor now, I think it's time people stopped putting their heads down and walking on. We're not weak, we're not a minority, and it takes only our collective silence as women and men in the face of disgusting behaviour to let it continue. And frankly, we deserve better.\n",
  "url": "https://www.yamu.lk/blog/street-harassment-in-sri-lanka"
}