{
  "title": "Strongbow Cider In Sri Lanka",
  "abstract": "Strongbow apple cider has finally hit the shelves here in Sri Lanka. So naturally, we decided to see whether the…",
  "author": "",
  "date_published": "4:04pm",
  "content": "Strongbow apple cider has finally hit the shelves here in Sri Lanka. So naturally, we decided to see whether the world’s leading cider was deserving of the moniker.\nFor a bit of backstory, Strongbow started up in England in 1962 where it was produced for the better part of the next four decades. It was only in 2008, after their acquisition by Heineken that the cider started hitting global markets. That’s the reason it’s available here in Sri Lanka now through Heineken Lanka.\nJust like with most other ciders, Strongbow comes in at 330 ml (4.5% alcohol) with the current retail price starting at Rs. 550. It’s only been around for a few weeks, so it’s only available in Colombo right now. You can get your hands on it at Arpico and Keells supermarkets as well as at restaurants like Botanik, Asylum, Steuart and Dutch Bar.\nSo before we get into the flavour, one thing we have to mention here is the aroma, which really caught us off-guard (in a good way). It really gets the taste buds primed with the smell of apple which sticks around just long enough.\nThe cider itself is not overly sweet, which is something we can really appreciate. This lets the flavour of the apple come through, accentuated by the slight kick of the alcohol. There’s also a sour undertone which adds a welcome contrast to the sweetness and really brings everything together.\nThough Strongbow comes in at around the same volume of alcohol as a lager, it goes down a lot smoother than most beers due to the more pronounced flavours and lower level of carbonation.\nWe also managed to get our hands on Botanik’s Strongbow cocktail which was super tasty and surprisingly simple. It’s mix of crushed basil leaves, amaretto liqueur and Strongbow, served with a good amount of ice.\nNow we’re generally not huge fans of too much ice in cocktails, but Strongbow’s own line says “best served over ice”, and it actually works. The basil adds a unique crispness while at the same time offsetting the sweetness of the liqueur. The cocktail goes down so smooth that you don’t even realize until you look down at your drink about fifteen minutes into a conversation to see it’s almost done. Good stuff for a humid day in CMB.\nSo what’s the final verdict for Strongbow? We honestly can’t find much fault in it at all. Just to be clear, we aren’t cider connoisseurs, but we’ve tried just about everything available here and Strongbow is right up there with our top picks.\nThe best thing about Strongbow is it’s versatility. It’s one of the few drinks we’d say can be had as an alternative to both a lager and even sparkling wine, making it a great choice for just about any occasion, whether it be a casual Sunday brunch, after work chill session or even with a meal.\n",
  "url": "https://www.yamu.lk/blog/strongbow-cider-in-sri-lanka"
}