{
  "title": "Thai Food In Sri Lanka",
  "abstract": "Here's a roundup of 8 places to sample Thai food around the country.",
  "author": "",
  "date_published": "12:01pm",
  "content": "Typically when it comes to foreign cuisine, we seem to be big on Chinese, Indian and maybe Italian. Thai food however seems to be an unexpected growing contender on the scene.\nThai food usually focuses on preparing dishes with a strong aroma and a spicy edge, playing with four or five taste senses in a single dish. So this cuisine is hard to truly nail, especially given the local food scene's tendency to Sri Lankanize everything — but here are the places we could think of that dabble in it either way. As usual if we've missed out any, then let us know in the comments.\nFor the longest time Royal Thai was the epitome of Colombo's Thai scene, but as of 2015, The Boulevard takes our top spot. With the ever involved Chef Mama at the helm, The Boulevard has been dishing out top notch Thai from day one. They're on the pricier end of the spectrum, but it's well worth it both in terms of the quality of dishes as well as the service. It's a very complete Thai dinning experience, with the food having a great balance of flavours, seasoning and spices while staying true to the authenticity of the dishes. They know what the people want, and so far they've outstanding at delivering just that.\nRoyal Thai consistently produced great Thai food in the past and has yet to dissapoint us on any of our visits. That being said with the loss of Chef Mama to The Boulevard, we've heard that things have changed a bit, as one would expect. The flavours you expect from authentic Thai - lemongrass, kaffir lime, ginger, cilantro - all come out well in their dishes and are nicely balanced. The food is clearly cooked with restraint - Royal Thai doesn't give in to the temptation of Srilankanizing their curries to appease the local palate - you really get that poignant hit of Thai you're looking for. They also win on the ambience front - stringed Thai music, golden lighting and latticed screens make for a great dining experience.\nJack Tree is the third on our list and though admittedly aren't always strictly Thai in terms of flavour - there's sometimes a tad of Sri Lankanizing going on with the spices - but the dishes still keep with the general theme and the seafood variants especially are quite tasty. They do a mean sweet-corn saku for dessert.\nTom Yum sticks out from our list - they specialize in some Thai street food and their prices are thankfully quite mid-range. The namesake Tom Yum soup here is\n. It's an 'explosion of flavours', a great fusion of ten or more flavours including shrimp, squid, kaffir lime leaves, galangal, lemongrass, mushrooms, and a whole lot of chilli. They've also recently added a bunch new items to their menu which include Thai ice coffee and BBQ.\nGrand Thai is one of the out-of-town Thai restaurants on our list. It's a very tasteful restaurant at the Grand Hotel in Nuwara Eliya, all ceramic vases, purple orchids and soft acoustic Thai music. The portions are pretty big, and they do Thai dishes with a bit of a modern twist. The papaya salad and the pad thai koong were on the dot in terms of flavours, but our favourite of the lot was the beef massaman curry - tender meat in a creamy, flavourful curry, mild and with an emphasis on the coconut milk.\nSiam House serves up good Sri Lankanized Thai dishes in big portions and is another favourite among us. Some memorable dishes we've had here include the papaya salad and the classic red curries - both deliciously cooked up with a mix of Thai flare and Lankan spice. They've also do more adventurous dishes than your usual Thai, like the fish bowl salad.\nThai Heritage is located in the Galle Fort. They've got a limited menu and though we wouldn't call any of their dishes mind blowing, they're not bad. While the seafood we had here was a hit and miss, bland save for the slathering of lemongrassy sauce, the Pad Thai had a very strong, interesting mix of flavours, somewhat salty, sweet and spicy. We wouldn't say its one of the best places for Thai cuisine but it's like the only option for Thai in Galle.\nQuick Thai is another popular Thai restaurant, with branches both in\nand\n. The food here may not have the attention to detail that\ndoes, but tends to keep more to the spirit of the cuisine than at\n. The seafood dishes and the red curries are a win. Our vegetable and beef red curries are particularly memorable - thick, milky, flavoursome, with that strong hit of lemongrass. Note, they do an interesting, delectable twist on batter fried prawns.\nThe owners of the Lankan-Thai Siam House branched out to also give us Kinnaree at the Old Dutch Hospital, a restaurant that stays truer to Thai flavours. The cuisine is not as refined as at Royal Thai or The Boulevard, but the they offer good value for money for those not looking to dish out Rs. 2000+. The omurice is a dish we remember fondly – a seafood fried-rice enclosed in a light, street-vendor style omelette, a subtle blend of Thai flavours from which kaffir lime leaf won out.\n",
  "url": "https://www.yamu.lk/blog/thai-food-in-colombo"
}