{
  "title": "The Hottest Buttered Cuttlefish (YAMU's Top 5 for 2014)",
  "abstract": "The best spots for golden hot butter cuttlefish in 2015",
  "author": "Kinita",
  "date_published": "4:47pm",
  "content": "Hot buttered cuttlefish is more than Colombo's most glorious seafood nibble. It's also a massive bone of contention for the good people of the city. Which god-sent establishment invented it? Should we favour the classic dish over these upstarts putting it in Kottu and dipping it in cheese? Most importantly, who does the best HBC? We decided to add fuel to the flames with a definitive HBC taste-off.\nOur methodology included identifying the places that got lots of votes and comments on our site, and refining it to the top 20. We then ordered boxes of the good stuff, made some questionnaires, and got collating.\n\nWe decided to gauge based on a couple of simple factors: quantity, price, spiciness, presentation, crunchiness and an overall score. We did a pretty legit blind taste test at a party, removing any indicatory branding, and providing about 20 guests with cards with the scoring criteria. We then added, averaged, and graphed.\n\n\n\n\n\nIt's pretty clear that the old order has made way for the new, with relative freshers like Barracuda and Floor/Shore by O! dominating the scoreboard.\n\nIt's also clear that beer goggles go a long way in setting us up for disappointment - places like White Horse (which we voted for ourselves too) were just plain depressing in the light of day (much like everything else you'd generally else you'd pick up at White Horse).\nThere were a few stalwarts that squeezed onto the leaderboards for sheer straightforward flavour and consistency, like Flower Drum and China Doll. The majority battle was really between the Chinese restaurants and the Marine Drive beach bars, barring a couple of outliers.\n\nBottom line is it's pretty hard to define what makes a perfect HBC. It's such an intrinsic part of our culture and consciousness we felt intimidated even approaching the topic. One thing we can confirm is that the variation is pretty stunning, from colour to size to taste.\n\n\n: Finding good HBC is like finding a good woman - it takes experimentation, determination and a fair number of bar crawls. But when you get there, it's beautiful and you stand by it even when it's a bit soggy. Try Barracuda, Floor/Shore by O!, or the Station.\n\n\n\n\n\n\n",
  "url": "https://www.yamu.lk/blog/the-hottest-butter-cuttlefish"
}