{
  "title": "The Éclair Taste-Off",
  "abstract": "A quick guide to getting the best and worst éclairs in Colombo!",
  "author": "",
  "date_published": "8:20pm",
  "content": "Finding an éclair that tastes as good as it looks is as rare as finding a middle aged Sri Lankan man without a pot belly. We have constantly been deceived by pretty éclairs that taste like chocolate flavoured cement mixed with sadness. When will this travesty end? Where do we find that perfect éclair? Does it even exist?\nThese questions bothered us so much we launched The Ultimate Éclair War.\nWe hopped around Colombo to hunt down the best éclair in the city, and the contenders were -\nGreen Cabin's éclair didn't blow our tastebuds away. It was your basic bakery éclair with a really soft choux pastry and super sweet chocolate cream filling. It tasted a lot like the icing on their chocolate cake. So, chances of the filling being their mass produced chocolate icing are quite high.\nKlassy's éclairs have been satisfying in the past. This time around, too, we couldn't really complain much besides an overdose of chocolate via the filling and icing combined. The soft choux pastry coupled with extremely decadent chocolate is not for the faint hearted (and diabetic).\nIt was a well established fact that their éclairs were the bomb. But it is with deep regret, remorse and sadness that I inform you these didn't taste as great as they used to. The pastry was a little hard, the filling tasted of margarine and on the whole, they didn't taste too fresh.\nHere's hoping this was just one unfortunate experience and they get back to making their amazeballs éclairs ASAP!\n\nDespite succeeding at getting airy and soft pastry, there was no distinct taste coming through. It wasn't sweet either, and that completely contradicts the whole point of making an éclair. Plus this presentation was...uninspiring.\nFor Rs 145, you'd expect more than a mere thin chocolate coating atop very hard pastry. The filling, on the contrary, satisfied us with enough chocolate, but definitely not worth the monies.\nFor Rs 50 you're not really getting an éclair. You're paying for a hard pastry filled with icing sugar with a hint of chocolate topped with a thing chocolate coating.\nCheap, but definitely not worth buying.\nThis was the prettiest éclair of all. The pastry was slightly soft and the chocolate coating was decadent. However, the filling felt a lot like a sugary icing you'd top a cupcake with, and that didn't work too well for our liking.\nThe choux pastry was alright - neither soft nor hard. The filling was basic chocolate icing and the top was basic chocolate.\nIt was average.\nFor a ginormous price, you'll receive a ginormous éclair that calls for sharing. The filling inside tasted richly of Nutella, but there's just SO MUCH of it. Besides the extra generous filling, the éclair on the whole was soft with the toasted nuts adding a little crunch now and then. If you love Nutella and éclairs, you'll be in for a real treat.\nThis éclair looked quite appealing but it was an average, insanely sweet éclair that didn't really stand out.\nBiting in to this felt like trying to take a bite of Sigiriya rock. The extremely hard pastry had a filling that looked brown enough to remind us of chocolate (and other things, if you're creative and slightly disgusting), but it didn't taste of chocolate. Weird and bad tasting, this is an éclair that is best avoided.\nSoft choux pastry with a filling that had a mix of both custard and icing, topped with rich chocolate and nougat, this tasted heavenly. Unanimously, this éclair was crowned the winner in this mellow, chocolatey battle. At Rs 200 this lands on the pricey posh end of this French pastry spectrum, but was it worth the money? HELL, YEAH.\nBased on our experience, Cravings is the new (yet pricey) spot to sate our éclair cravings.\n",
  "url": "https://www.yamu.lk/blog/the-eclair-taste-off"
}