{
  "title": "The Great Mutton Roll Taste-Off",
  "abstract": "We went to a bunch of different places in search of the Best Mutton Roll. Did we succeed?",
  "author": "Sarah",
  "date_published": "5:53pm",
  "content": "The Mutton Roll is considered a sacred delicacy amongst most sensible mortals that inhabit this blessed planet (and greater Colombo).\nThese questions I'm sorry to say, shall remain unanswered as the only truth I set forth to seek out is where the best mutton roll resides.\nI plundered through the city in mechanical chariots and ravaged six establishments in this courageous crusade, but did I succeed? Did I overcome the troll under the bridge of mutton rollery?\nI did.\n\n\nThe Sponge is a cult favourite amongst Kollupitiya's working population as it usually turns into a full house around lunch time. Their mutton roll was a slim, minuscule little thing which is packed with equal parts of minced mutton and potato. Be that as it may, there was only a slight inkling of mutton flavour and the entire thing tasted bland. The crust was crispy though, so that's the only plus here.\n\n\nKlassy is a beautiful little patisserie tucked down the leafy De Fonseka Road at Colombo 05. Their mutton roll was a pretty golden brown, perfectly rolled and was a reasonable size. Woe betide us though it didn't really deliver in terms of taste thanks to having contained nothing but extra large chunks of potato and teeny sprinklings of mutton. Oy vey.\n\n\nNippon's rolls are legendary. Stories have been told far and wide of how the mutton in these rolls is spiced to perfection and jam-packed with flavour.  I'm happy to report that these stories are 100% true as the roll was basically bursting at the seams with mutton. That being said, it was also bursting with so much oil that the paper bag was soaked through. It was also soggy and flaccid so it delivered a slightly unhappy experience upon consumption.\n\n\nAs you can see pictured above, the Fab's mutton rolls contain ample amounts of large chunks of mutton. It's basically heaven in a roll. The veggie presence was kept to a minimum as they've clearly done a good job at making the mutton the star of the show. You get a few hunks of meat with every bite which makes for a deliciously chewy experience. The casing wasn't too thick which made this one of the best rolls on the list.\n\n\nLast but not least we have The Gourmet Station (Kingsbury Serviced Apartments). They're a\nlittle posh bakery down Kollupitiya (they've also got their main outlet at the Kingsbury) and they serve up a bunch of gourmet treats.\nThe mutton roll here is the absolute best out of them all thanks to its sheer size. It's a large roll chock full of mutton, potato and cilantro, fried to the most golden of browns and crusted with proper bread flakes.\nIt's the best out of them all but I'll admit that the Fab is a close contender in terms of the mutton to roll ratio.\n\n\nAt the end of the day, your preference is up to you. We just asked the\n, gathered a bunch of people from the office and most of our opinions matched up. We did have a lot of fun distinguishing the good from the baaaaa-d though, because mutton rolls are wonderful regardless of their shape or size. We hope this roundup gives you the necessary info you need to pick out your ideal rouleau de mouton. Bon appetit!\n",
  "url": "https://www.yamu.lk/blog/the-great-mutton-roll-taste-off"
}