{
  "title": "The 5 Jazziest Things You Can Do at The Colombo Jazz Festival 2017",
  "abstract": "Apart from listen to the jazz, that is.",
  "author": "Kinita",
  "date_published": "8:01pm",
  "content": "Trying to figure out plans this weekend? Apart from soak in the slick beats and tunes from 60 of the jazz world's local and international artists at the\n? The fest's got a lot to entertain, spoil, and treat you, from wicked beats to sleek design, and a wine list to sip ever so slow. Here are our favourite stalls and nibbles to look out for:\nHand-created women and menswear from the slick designers at PR are going to be on display at the\nsection, including classic favourites like\nsunglasses,\nand\n, along with fresh new names like\n. You'll also find a selection of Good Market designers present, including the ever-funky\nupcyled collection.\nDancing, drinking, and shopping are great, but they're also tiring as all hell. What you really need is a perfect little mid-jazz getaway. Head to\ns pop-up spa, and indulge in a lavish soak, foot rituals and more. The luxe brand will take care of your body while the lilting jazz takes care of your blues.\nThe Colombo Jazz Festival is bringing back last year's über-popular Oyster & Champagne Bar, along with dozens of international vintners' picks on the list, ranging from Laurent Perrier to the New World's Oyster Bay and Yalumba. If you're more of a G&T aficionado, swing over to the botanical bliss of the gin garden, complete with the chic local Colombo 7 gin, or stick to a good old Hendricks.\nGet yourself a picnic basket filled with decadent nibbles, charcuterie and cheeses, and pair it with a celebratory bottle of bubbly. Then proceed to settle in for 20 hours of amazing jazz (not non-stop, you animal, you have to go home at some point).\nWe haven't repeatedly named the Galle Face Hotel's terrace one of the best addresses for a sunset in the city for no reason. The uninterrupted view of the horizon, the lazy lapping of the Laccadive Sea, and the fiery sunsets date back to the hotel's inception in 1864. And you're going to get to experience it over a stunning weekend of international music and incredible dining. Oh, and did we mention sunset barbecues?\nGet swinging, get sipping, and we'll see you there!\n",
  "url": "https://www.yamu.lk/blog/5-things-you-can-do-at-the-colombo-jazz-festival-2017"
}