{
  "title": "The Colombo Jazz Festival 2017: A Review",
  "abstract": "Everything you might have missed at the CJF 2017!",
  "author": "Staff",
  "date_published": "3:31pm",
  "content": "The\nwrapped up a couple of weeks ago to our dismay (why can't this be an every-weekend sort of thing?). With some 60 artists and bands featuring jazz, blues, and all sorts of soul, it was a proper weekend of slinky music.\nThe performance included new artists, along with international and local jazz legends and groups - a first for Sri Lanka.\nPrior to the event,\n, and we weren't disappointed. If you missed out on the Jazz Fest or would like to recreate some of those experiences, you can check some of this out:\nIf you missed out on the shopping, you can still pick up some Jazz Fest themed t shirts that feature quirky caricatures of the beautiful historic Galle Face Hotel at PR, Horton Place. All the other brands can still be found online or around Colombo, mostly at PR or the Good Market like\nsunglasses,\nand\n,\n, and the ever-funky\nupcyled collection.\nIf your'e looking for a repeat of that soothing massage and spa action, you can still head over to one of to\ns many branches around Colombo and Sri Lanka. For food and drink experiences, we'd suggest you head over to any of the CJF's dining partners, like Sugar Bistro, 41 Sugar, or the Galle Face Hotel itself! You may have missed the jazz, but you can still soak in that classic sunset.\nAs obvious as it may seem, the sheer strength of the musical acts ran the show this year. Incognito's performance got the crowd (and us) super enthused, with powerful performances and electric on-stage energy.\nIt rained, it poured, it drizzled, but the show swung on. Almost all the acts scheduled to play came on, and the crowd seemed undiminished by the waterworks. Overall, we were impressed by the dedication of the sound team and the commitment of the crowd to the prospect of a good concert (especially when the water damaged the equipment and a little impromptu side stage was set up for an intimate sunset performance). There was also more wine than we care to remember, and lots of dancing on the lawn.\nWe did really love the fresh local oysters and the French rose on offer, although the fish and chips made for a legit dinner spread. Our key disappointment was that the afternoon/early evening sessions had to be pushed back a little bit, which dampened the good old spirit of Lankan day-partying.\nWe'd also be amiss if we didn't mention our favourite bit of the CJF set up, the beautiful Colombo 7 Gin corner. The wooden paletts, the fresh flowers and greenery, and the theatrics of the barman got us really digging those G+Ts!\nOverall, the rain didn't appear to dampen most people's spirits or penchant for spirits. The jazz, the drinks, the crowd, got us aching for a repeat. To be fair, Colombo's going to find it hard to wait another whole year for a concert on this scale. In the meanwhile, head over to\non weekend evenings to get your wine and jazz fix!\n",
  "url": "https://www.yamu.lk/blog/the-colombo-jazz-festival-2017-a-review"
}