{
  "title": "The Colombo Cheese Kottu Round-Up 2014",
  "abstract": "Kottu rotti and cheese is probably one of the best combos that anybody has ever come up with - but the trick is in…",
  "author": "Shifani",
  "date_published": "5:05pm",
  "content": "\nSri Lanka is known for its kottu - if you haven't had it, they say, you haven't really experienced our food. It's made from diced godhamba rotti and meat/vegetables. Cheese kottu is a relatively new invention and it's now a very popular order.\n\nWe've put together a list of our favourite spots in Colombo for cheese chicken kottu after visiting a bunch on popular recommendation. We tried to cover variety - different kinds of cheese, different kinds of preparations. And we had all of this cheese in one day (Don't Try This At Home) to be fair in our cheese and taste comparison, because we've heard the quality of cheese and preparation sometimes varies according to the day and time. This happened on Sunday from 7 to 10PM.\nAfter much expert analysis, we graphed out our Data on Cheesiness in our best fonts.\n\nBefore we get to it, here's a couple of things you should know about going on a kottu adventure if you've never gone out and tried the stuff.\n\nOur kottu places usually function past lunch but they say you get the best cheese kottu only after 7PM. Most people go for it after a late night of partying and the munchies since these places are some of the only ones in Colombo that stay open past midnight. They've all got dining areas with plastic chairs and dodgy cliques of boys, and these spaces are sometimes full at night, so the most comfortable thing to do is to drive in (unless you are that dodgy clique of boys) and get the plate brought to your vehicle like a lot of customers do. Make sure you drive in with swag, with\nblaring out the stereo and big goday sunglasses even though it's night time.\n\nThe Sausage Principle states that if you really love something (like sausages), then don't try to figure out how it was made that way, because it's probably going to be gross and you'll regret it. But don't worry, there's nothing gross about cheese kottu - the kitchens are however a bit make-shift and a bit dubious in the hygiene department. A lot of places, however, make the kottu in the shop window, so you can see everything. The kottu that comes out of this process usually tastes awesome, so question it not. A fun fact is that some places throw some milk into the pan when they make cheese kottu, so the cheese really dissolves into the kottu and increases levels of cheesiness.\n\nCheese kottu everywhere is about Rs. 400 per plate. Iced milo or nestomalt will cost about Rs. 150.\nSo here we go:\n\nThe cheese here is different from all the other places - it's liquidized and then poured over a cake of kottu. It looks awesome, and the rotti is tasty, but because the cheese is poured on the outside and doesn't really get up close and personal with the kottu - the cheese just becomes a dip. So the dish isn't all that cheesy - it's alright for people who want just a side of cheese with their kottu.\n\n\nis kind of new and their ordinary kottu usually comes highly recommended. The cheese kottu is however made with dry processed cheese so the cheesiness doesn't really get to you, also the cheese is treated as an add-on for Rs. 100. The guy just gets a cube of cheddar and shreds it over the kottu. The quantity of cheese is very high and the rotti is spicy but lesser in quantity than at the other spots.\n\n\nMost kottu lovers love the Plaza and they're going to hate us for putting Pilawoos above it. Please don't get butthurt - cheese kottu is after all very subjective, different people like different levels of cheese and sogginess. Plaza's cheese kottu was tasty, of huge quantity (as is most Galle Road kottu) and very filling, but we found it too soggy, we could feel the cheese clogging up our arteries - too much milk perhaps. This spot wins Cheesiest Place on our graph above though.\n\n\nPilawoos used to be the biggest and best spot for kottu but word on the grapevine is that it's dropped in quality since its glory days. We however loved their cheese kottu, it was quite cheesy, extremely filling, and we especially appreciated the big pieces of crunchy chicken in it. We think their kottu rotti is diced too small though.\n\n\nFayaz was our unlikely winner. The rotti was thick and dry and not soggied-up by the cheese, and the cheese was very creamy and sticky as opposed to watery, so the dish tasted fresher than some of the other popular Galle Road spots. We washed it down with an extra-sweet iced Nestomalt and then headed home having had enough cheese to last a couple of months.\n\nCheese is a powerful ingredient and Uncle Ben from Spiderman was right when he said with great power comes great responsibility. Kottu rotti and cheese is probably one of the best combos that anybody has ever come up with - but the trick is in the consistency of the cheese - if it's a little too dry or too watery, then the dish isn't going to taste so great. Also the more cheese there is in your kottu, the better.\n",
  "url": "https://www.yamu.lk/blog/colombo-cheese-kottu"
}