{
  "title": "The 6 Weirdest Dishes in Colombo",
  "abstract": "The weird and wonderful of Colombo's food.",
  "author": "Kinita",
  "date_published": "11:36am",
  "content": "In our many experiments in Colombo's eateries, we've come across some strange superstars tucked away in seemingly innocuous menus. Keep in mind that we use \"weird\" in the wonderful sense, and don't mean to offend anybody's\nsensibilities.\nOur friendly neighbourhood Chinese spot,\nhas this on their menu. We haven't tried it (YET), but this is quite a good deal, especially when you consider the sheer size of ox genitalia (2 and a half feet on a cold day). To be fair, this dish isn't that strange in China and some parts of Jamaica, but it's still not common. Pro tip:\n, so maybe eat some of this on your next date night.\nis known for some pretty funky fusion cuisine, especially their cocktails. Their ice cream selection includes this mélange of true Lankan nibbles like seeni sambol (a sweet and spicy condiment featuring onion) and sprats (you know, the small smelly dried fish). It's actually oddly palatable at a pricey spicy Rs. 550 for a couple of scoops.\n, and why we love this.\nis one of the city's best founts of odd menu typos. In all honesty, I'm not sure if this is a Google Translation gone wrong or whether they've actually pioneered a way to extract enough liquid from unfortunate skin conditions to make this work at Rs. 800 a pop (pun intended). I suspect there's a possibility it's a detox soup, but I can't guarantee it.\n, in case you're keen on trying pimple soup at home.\nIn a state of true ignorance, I've actually never come across non-animal product eggs before. Colombo's first fully vegan spot,\n, has got these specially brought down from Australia and they're quite a good substitute (you just can't make a fried or poached egg though). At Rs. 300 for a vegan Spanish omelette, that's animal, environment, and wallet friendly!\nNot nearly as cruel as it sounds, dolphin kottu has scared tourists and newbie locals alike in kottu stands along our coasts. Turns out, it was an invention by the genius chaps at\n. Usually comprising of chicken and larger, torn up chunks of parota (and definitely no dolphin meat), this is dangerous for its spice and not much else.\nIn all fairness, brain and baabath\nfairly common foods for certain Sri Lankan communities, especially the Malays. It isn't particularly wild or interesting to them, so we apologize in advance for our curiosity/enthusiasm. That being said, brain isn't something many Colombars (or tourists) usually eat as an evening snack, so the Hulftsdorp Street Food down Abdul Hameed Street can be an adventure. Prices here are often arbitrary, so dress conservatively and don't be afraid to let the uncles recommend stuff to you.\nHave we missed anything unique or unusual? Let us know in the comments and we'll try them out or give them a mention!\n",
  "url": "https://www.yamu.lk/blog/the-6-weirdest-dishes-in-colombo"
}