{
  "title": "The Mother Charitable Foundation",
  "abstract": "The Mother Charitable Foundation (MCF) is a not for profit NGO which began its operation in 2013 to serve the…",
  "author": "",
  "date_published": "3:17pm",
  "content": "The\n(MCF) is a not for profit, NGO which began its operation in 2013 to serve the needy. This charity dedicates its service to children and communities in need.\nMCF works with children and adults with special needs, elders, cancer and people iwho suffer from AIDS, as well as patients with any other disease and people who are isolated and cast aside by society due to various stigma. MCF’s goal is to uplift the living standards by providing the needy with education, health, protection and other basic human needs.\nMother Charitable Foundation conducts the following projects:\nestablished in 2011 in Beruwala Provincial Council, Kalutara District helps around 25 children. They are being educated in this center with the help of two teachers. Children between ages 6 to 15 are educated in this center. Children with Down Syndrome, Autism, Learning Disabilities, Physical impairments and Mentally retardation are provided educational assistance at Pathum Uyana.\nwas established in 2014 in Kirinda, Matara. Here around 20 children are provided with education in the center with the help of 3 teachers and a coordinator. Children from age 6 to 30 are being assisted with education in this center. Here too children with down syndrome, visual impairment, learning disabilities, autism are provided education.\n\nThe MCF hopes to establish a home for the neediest in our communities. A home for the poor who have no home or are not welcome under any roof. People who are are neglected, discriminated and rejected by society.\n\n\nIf you are looking for a place to connect and invest your time, the Mother Charitable Foundation are in need of people who can volunteer. MCF welcomes volunteers interested in serving them.\nThe Mother Charitable Foundation runs on the generous giving and donations of people. If you would like to give towards the work of the charity forward your gifts to:\nACCOUNT NUMBER: 1590042555\nSWIFT CODE: CCEYLKLXXXX\nBENEFICIARY: The Treasurer, Mother Charitable Foundation\nBANK NAME & ADDRESS: Commercial Bank of Ceylon Ltd, Moratuwa Branch, Moratuwa, Sri Lanka.\nContact:\n\n\nPhone number : 718 053 000\n\n",
  "url": "https://www.yamu.lk/blog/the-mother-charitable-foundation"
}