{
  "title": "The Big Bad Wolf Book Sale",
  "abstract": "The Big Bad Wolf Sale has landed in Colombo. All hell has broken loose.",
  "author": "",
  "date_published": "10:23am",
  "content": "The Big Bad Wolf (BBW, ha) is a book sale that initially started off in Malaysia and spread on to Thailand and Indonesia. What they do is sell off all the excess stocks that remain from large distributors, at low prices.\nThey're on from the 5th to the 15th of October at the SLECC. With free entry, 24 hour service and a monstrous range of books, they've managed to drive the general public into a frenzy.\nAnything, really. Well, mostly anything. They've got sections with signs put up so have a look see before you plough onwards.\nAs you walk in you can pick a trolley up or a basket to carry your wares in. The entire convention centre is piled high with books, books and more books. The eyes of the people were hungry with need. It was every bookworm for themselves.\nAs you can see, a trolley isn't such a good idea. At the sight of all these books our brains went into survival mode and we found ourselves piling the trolley high with books we convinced ourselves we needed.\nTheir sections consist of Fiction, Non-Fiction, Autobiographies, Lifestyle, Home and Kitchen, Design and Photography and many other miscellaneous titles.\nI can't guarantee you'll find precisely what you're looking for. I went in looking for a specific set of books and they didn't have them.\nThis is pretty much a hit or miss, but you'll definitely find some interesting books along the way.\n\nCheck out their humongous range of adult colouring books. I'm personally not a fan, but a lot of people I know love collecting these and I've been told that these have therapeutic purposes so to each their own.\n\nThe Young Adult Fiction area is probably the most crowded section in the entire place. People were\nclose to pushing and shoving, but thankfully we had none of that.\nThey had some interesting titles by Meg Cabot, Terry Pratchett, Anthony Horowitz and so much more. You have to go there and see for yourself to understand exactly how big their selection is.\nThey've also got a ton of biographies. Whether you're interested in Mandela's life story or Chairman Mao's these guys deliver. Also check out their 'Music' section for some superb books on some of the world's most legendary musicians/bands.\nThe books start at Rs. 320 and go way past Rs. 10k. Certain books have a ridiculously low price margin thanks to their subtle 60%-80% discounts.\nYou can, but in all honesty I don't see the point. We were approached by a staff member who promptly signed us up and told us we were eligible for discounts but only on 20 selected titles. These supposedly discounted books have a yellow sticker which you have to watch out for. We didn't find any. Lame. You're better off ignoring the membership.\nYou can ask the staff for help, but they're a bit slow and disoriented. The people at the checkout counters take aeons to bill your goods, which is good because you can finish reading an entire book during that time.\nStick to self service. It's an adventure in itself.\nThe 24 hour concept is a brilliant one. I'd love to go there at 2AM and just drool over the books. If you haven't gone yet, then now's the time to go.\n",
  "url": "https://www.yamu.lk/blog/the-big-bag-wolf-book-sale"
}