{
  "title": "The Great Lamprais Taste-Off 2012",
  "abstract": "The ultimate lamprais in Colombo",
  "author": "",
  "date_published": "5:17pm",
  "content": "\nThe annual (well it will be annual) YAMU lamprais taste-off took place this week. For the good of all Colombars a crack team -\nauthor\n, Cassandra Mascarenhas (Daily FT),\nand Savan Wijewardene - engaged in a thorough degustation of six of the city’s most popular lamprais.\n\nThis was no frivolous endeavor, lamprais is the pride and joy of Sri Lanka’s diminished but still proud, Burgher community. However, as every good Burgher auntie knows, finding a decent lamprais in Colombo is becoming an ever more difficult task.\n\nAs the generation of housewives that kept the labor intensive arts of the frikkadel, vambatu pahi and stock-simmered rice alive vanishes into history, the fate of a dish that is an essential part of Sri Lanka’s culinary heritage hangs in the balance.\n\nOur taste-off was held with the intention of tipping the scales back in favor of the continuation of this fine culinary tradition.\n\n\n\n\n\n\nAfter lengthy preliminary discussions our six competing lamprais came from:\n\n\nWe were only testing what’s readily available on a day’s notice for individuals. We know there are very good freelance suppliers operating - old Burgher aunties dealing out of their homes - but like certain other scarce commodities, you need to someone who knows someone and generally need to order dozens at once.\n\nIn keeping with the gravity of the task YAMU’s tasting procedures conformed to the highest international standards. The lamprais were removed from any branded packaging and numbered 1-6 to ensure all tasting was effectively blind. Judges were given tasting cards and asked to grade the lamprais according to a few key criteria:\n\nThe general banana-leaf quality, greasiness and wrapping. Inside, the appearance of the curries, ideally not a solid grey lump but distinct colors and a fresh glow.\n\n\nThe smell of a lamprais is crucial. As you peel open your curry-filled prize there should be notes of banana from the wrapper, the clear savory scent of the stock-simmered samba rice and the delicate waft of spice- cardamom, cinnamon, lemongrass. There shouldn’t be an over-powering curry smell nor should there be a dominant fragrance, odorlessness isn’t a good sign either.\n\n\nPreserving culinary traditions was a key part of the exercise. We were looking for lamprais that stayed true to the Burgher archetype. It’s only kosher if it contains the following elements:\nThese are the six hallowed components of the orthodox lamprais and judges were asked to deduct marks for omissions and extraneous additions - pol sambol, eggs, raisins, etc.\n\n\nThis carried twice the weight of the other categories because that’s what counts, even more than authenticity, you want your lamprais to be tasty.  Obviously this is something of subjective measure but you know what we mean - somethings are tasty, some aren’t.\n\nThe numbered lamprais were arranged from 1-6 and placed on a round table. For the first tasting round the four judges moved from one parcel to the next diligently taking notes. Cutlery was strictly forbidden (as per the best Sri Lankan traditions) and judges were allowed just a few well-mixed fingerfuls.\n\nWhen they reached the final lamprais there was a break and mouths were washed with  beer (this being the lunch-time Sri Lankan equivalent of a sorbet). Notes were compared and the judges then proceeded on another tasting round. Once again they moved from 1 through 6 but this time they were given more time with each lamprais in order to examine the individual lamprais components and detect any shortcomings. Once again the round ended with a comparison of notes and some palate cleansing.\n\nThere was also a third and final round of tasting (in David Blacker’s case perhaps even a fourth) but we weren’t really sure what the purpose of this was beyond pure greed...\n\nFrom the very first round, Lamprais 2 emerged as the clear favorite among all four judges. While slightly smaller and more humble in appearance than the other parcels, the proportions of curries to rice was excellent and the flavors well-balanced.  Mixed together, everything was complimentary - the sweetness of the seeni sambol, the blachan’s savory tang, the soft alu kehel. What really stood out was the meat curry- discernible chunks of pork and beef rather than the grey largely chickeny mass found in other packets.\n\nWhile there was no unanimous second place finisher the general consensus seemed to favor Lamprais 6. This was well presented with a good vambatu pahi and a tasty rice base, however the shortcomings of its mixed meat and blachan kept it from reaching the heights attained by no 2.\n\nOnly after the judges made their final pronouncement was the cipher cracked and the winning name unveiled...\n\n\n\n\n\nAfter a brief moment of anticipation it turned out that our beloved no 2 was none other than the DBUs’ offering.  That’s right the long established gold standard struck a blow for Burgher Orthodoxy and Dutch ancestors on your male line by putting the upstarts in their place. Those lineage guarding, midday tippling, baila dancing Burghers might be a dying breed but their lamprais is alive and still kicking the competition into second place.\n\n\n\n\n\n\n\nOur second place finisher turned out to be from the Dutch Grocer. Something of a surprise as the operation has only been going a few weeks.  With an upgrade to its mixed meat it could really give the folks at the Thumulla a scare when it comes time for next year’s taste off.\n\n\n\n\n\n\n\n\n\n\nMrs Warusawithana’s homecooked lamprais also gets an honorable mention – hers is a filling and tasty packet but the vambotu pahi and seeni sambol are somewhat overpowering.  The final product lacked the finesse of our top picks.\n\n\n\n\n\nPerhaps unsurprisingly, the commercial lamprais finished last. Replete with such heresies as chicken legs and over large grains of rice these packets weren’t just unorthodox they lacked simple tastiness making them at best serviceable lunch packets but not really lamprais.\n\n\nJust as all lamprais aren’t created equal, they aren’t equally priced either. Taking price into account the first place place DBU at Rupees 430 is fully worth it. The Dutch Grocer’s 360 rupee parcel is very competitive, while Bars’ Rs. 440 excuse for a lamprais really places at bottom of the pile.  You could also do much better than spend Rs 660 on a Colombo Fort Café lamprais.\nThe DBU is the top lamprais on all counts - taste, authenticity and value. Dutch Grocer, however, is an exciting new contender. The homecooked lamprais from Mrs. Warusawithana remains a reliable classic. All the commercial joints are kinda fail.\n",
  "url": "https://www.yamu.lk/blog/the-great-lamprais-taste-off"
}