{
  "title": "The Bibliophile's Guide to the Colombo International Book Fair",
  "abstract": "Some tips from YAMU for the Colombo International Book Fair that we've gathered from extensive experience over many…",
  "author": "Dili",
  "date_published": "5:32pm",
  "content": "September. The month of many things… that I can't seem to think of right now. I should check our\npage later…ANYWAY, the reason for the blank spot is probably because one event in September tends to drown out everything else happening during the month. That would be the Colombo International Book Fair.\nHappening for almost two decades now, the CIBF has gotten only bigger and bigger. While some picky bibliophiles have been lamenting a lack of quality, it certainly has stayed popular, bringing hundreds of thousands of people in every September. It's probably the biggest single event in Sri Lanka. You can't help but wonder \"Where the hell were all these fellow readers all this time and why can't I find them on regular days?\" or maybe some of them are there for the Mount Lavinia Hotel chicken kottu and a tub of instant noodles. I dunno.\nWhichever one you are, let us be your Colombar's Guide to the Book Fair. It's a jungle full of wild book hungry animals out there at the BMICH and you're going to need some pointers. Trust us. We have extensive experience over many poorly executed excursions into this wilderness.\n\n\nThis might seem a little loony but hear me out. The book fair is a big thing in a big place with a big number of people and a big amount of places and things to go through. You need to figure out why you're going so you can decide on the optimal way to approach it. For example; are you going to browse books from stall to stall or are there specific titles that you intend to hunt down for your trophy... I mean book case? Are you just going to people-watch with popcorn and Maggi or are you just keeping your ardent reader friend company? Depending on what you want to do, the distance you walk, the halls you visit, the stalls you go to, how much you end up carrying, the day you go and many other factors can drastically change. So like an overprotective dad to his daughter's suitor in a cheesy romantic novel, I ask you; What are your intentions?\n\n\nIf there are any specific titles you need to find, we strongly recommend you write it all down in a list. Hell, even if you don't have anything specific in mind write down your general book fair goals in a list.  Actually print it out on paper. At the very least type it out on that phone you always carry. This way you won't forget anything and it can save you time when you just show it to the people at the stall and they tell you if they have them in stock or where you can get them. Easy peasy.\n\n\nThis is very important. Especially to you out there who spent ALL their money on books and had to walk home with all of them. (What? No, this totally didn't happen to us. *whistles nonchalantly*) The book fair is a double edged sword for a book lover. While it's an opportunity to get all the books you ever wanted, no one here is giving away books for free (or accepting books as currency, which I think is a major misstep). Make a note of how much you can afford to spend before you go and try to keep to that amount. After you go, remember that you'll probably need some cash to get some sustenance and maybe transportation home as well. So save some for that as well. Apply some common sense and don't end up emptying your bank account getting books you can't afford and don't have time to read. Which is absurdly easy to do when there's an ATM at the Sirimavo Hall.\n\n\nNo, not the significant other you'll be dragging along with you. The actual date. This time the book fair will be held from the 16\nto the 25\n. That means this from this poya Friday, through a week and till the Sunday after that. Which means there's 5 holidays (16-18, 24-25) and 5 working weekdays (19-23). It's generally considered that the best time to go is the first day's morning or a weekday morning because of relatively lower crowds and lesser sunshine. While it's better to go as early as you can to avoid books getting sold out, you could find some insane discounts on the last days as stalls try to sell off their stocks. Usually you have to go on at least two occasions. Once to scout the terrain and a second time to actually do the book hunting. Or if someone went before you, you could just ask them for details.\n\n\nGoing to the book fair is not like going to any other event. No no no. Just like one of the hikes that our\nor\ntake, you need to be ready with the necessary equipment to help you survive this.\n\nWe hate to sound like that annoying aunty of yours from Victorian England that's always telling you what you can't wear, but this is important. Wear clothes that you are comfortable in for long periods of time. This is no place to be dressed sexy. This is a place as crowded as Pettah during rush hour where you have to walk, sweat, carry a ton of weight, often in tight cramped spaces. So wear comfy clothes that you don't mind getting rumpled and can stand the pressures that canned salmon go through. Wear sturdy comfortable shoes that you can walk in for miles. Bring a hat/umbrella/shades for the outdoor areas.\n\n\nAfter all you need something to bring all you bought with. It's true that a handful of stalls might give you something that has a passing resemblance to a sturdy bag. But they won't have the room or the strength to handle the weight of your purchases. Mostly you'll get the same old environmentally-unfriendly plastic bag which is completely unacceptable. Bring a travelling bag or preferably a backpack because that will leave your hands free. Use your budget and your book list and estimate how big a bag you'll need. Then get one slightly bigger.\nThere will be enough food stalls at the fair to sate your hunger and thirst. But the problem is they aren't always easily accessible. You might be far away on the other end of the fair with a thousand people between you and the food stands when you suddenly need a sip because you're so dehydrated. ALWAYS carry water and something easy to eat with you. It's all too easy to forget your body's needs and suddenly collapse because you ignored the signs for too long. So this is vitally important. Refill as soon as you can after you've run out.\n\n\nIf you need special medication, take that with you. Even if you're a perfectly healthy person take some first aid remedies for things like headaches and heartburn. It's more than likely you'll need one if you spend a whole day and finding meds is going to be really difficult.\n\n\nIf you're using our glorious public transport come at a time when you can maneuver that big bag we mentioned. If you're driving in, come as early as you can because parking spots get occupied insanely fast. We'd recommend taking a tuk tuk and skipping the parking drama. If you are taking a tuktuk, try one from\nbecause they can drop you off right at the door of the BMICH.\n\nWhile going around the book fair on your own has its own liberating charm, it can get monotonous and boring real fast. So it's nice to have a someone (or several someones) to chat away the slow times with, bounce ideas off or at least help carry the book load. Just remember to pick the right partner.\nBookworms pick another bookworm because if your partner's just here for the popcorn they'll forever be complaining as you go through yet another bookstore with the same books for the umpteenth time wasting their time.\n\nThis isn't just good life advice, it's good book fair advice. Don't just start walking aimlessly the second you walk in the door. At the door they'll give you a map of the fair. Study it. Memorize it. Or you know… just hang on to it. You can also use the\nif you want. Jot down all the notable things you found on your first trip on the map. That way when you go again you don't have to waste more time. You can just refer to your notes.\nUsually stalls are laid out in sections. Literature in one section, educational bookshops in one section, stationery in one section and so on. Plan a route of attack so that you spend the least energy and visit the most number of stalls with some breaks in between and stick to it like it's your yellow brick road. Also remember the little things like how books will probably be cheaper at the publishers' stall rather than at a bookstore. Which also brings us to the next point.\n\nThere's a few big name publishers and bookstores in Sri Lanka that we always end up going to because they have the widest selections. But why go to just those stores at the book fair too. The advantage of the book fair is that it brings all kinds of shops and publishers under one roof. So you don't have to spend any additional energy commuting like usual. Take a look at the smaller stalls. Some may offer better deals to be competitive with the bigger stalls. Some may have niche content that the bigger stalls don't carry. Anything is possible. So don't be lazy to look around.\nA special mention goes out to the second hand book shops. Arrrr matey! There's gold in them there stalls if you're willing to put in the time and effort to mine through all the books they have. If you do, it's almost guaranteed that you'll find something you'll love and it'll be at a fraction of the price elsewhere. You might even find something really cool with a story behind it or some other diamond in the rough that'll be worth way more than what you paid.\n\n\nWhen you've been starved for good literature for most of the year, seeing the seemingly endless shelves of books at the book fair can be overwhelming. Serious bibliophiles can even forget their surroundings. We've heard many a tale of book lovers walking in to stalls, buying a few bags of literature and then leaving while forgetting to pick up the other bags of literature they left at the security desk. Also on how people have lost their wallets or even had their wallets stolen. So remember to remember what you have with you. Don't let the books be your Pied Piper.\n\n\nWe cannot stress this enough. Do not be a slob. It's the lowest of the low. We know it's tough carrying all the books but there's always a trash bin just nearby and it's the decent thing to do to put your trash where it belongs. Anyone who doesn't is just.. well.. trash.\n\nSo there you go. Some tips for surviving the Colombo International Book Fair. If there's anything we've missed, do let us know for us and for anyone else reading. Stay safe and have a good read.\n",
  "url": "https://www.yamu.lk/blog/the-bibliophiles-guide-to-the-colombo-international-book-fair"
}