{
  "title": "The Bane of Local Universities: Ragging and What It's All About",
  "abstract": "Widely accepted as a subculture of State Universities, raggings occur with disturbing persistence despite laws against…",
  "author": "",
  "date_published": "1:11pm",
  "content": "Ragging is another word for bullying, one that's widely accepted in State Universities especially as it's considered to be a part of university culture. You're either in or out, and opting out of it denies you of certain rights and privileges, plus labels you as an\n. In literal terms this means 'potato'.\nThe perpetrators justify this by calling it an initiation process — one which equalizes students from all walks of life and pulls 'posh' students down from their pedestals and make them 'down-to-earth' by compelling them to mix with everyone at campus regardless of whether you like them or not.\nI feel this is important to mention because not many students seem to know that it's illegal. There's a whole Act devoted to it: namely, the\nof 1998. You can be produced before courts, made to pay compensation to the victim, and also be sentenced to up to two years of imprisonment. Sadly, not many raggers are apprehended or imprisoned unless the freshers press charges or something serious enough happens that the ragging ends in serious injury and hospitalisation.\nWhy indeed. There are a few reasons for this, based on both political and classist reasons. You won't find this anywhere on record because the student unions will insist that ragging does\nexist, but the rags are usually initiated and carried out by those in the student unions. The worldview of the unions are usually of the socialist and communist mindsets, so their version of equality is to strip freshers of autonomy by forcing interactions and activities on them — the activities in question being utterly ridiculous in most cases: usually to do or say something perverse, degrading, or sexual. The raggers also enforce dress codes: no trousers for girls, what sort of footwear to wear, dresses only, and so on and so forth.\nThe freshers' take on this is mixed: some abhor it, the others see it as an initiation process and continue the tradition when their turn comes. It's a cycle of bullying where the bullying is justified by the perpetrators and in certain instances, the victims.\nThey can, at a cost. Choosing not to participate leads to verbal harassment and then being completely ignored, to not being allowed to use specific libraries, canteens, or other public spaces within your university. The non-participants are also excluded from university events and competitions, forcing them to be marginalized. Additionally, they're also called an\n. The\nare basically the step-children amongst the pool of local university undergraduates.\nCurrently, the same as always. Freshers rarely lodge official complaints against their harassers because of the consequences that follow and how unpleasant it could get for them later on. The rag period lasts anywhere from 3 to 6 months. Given that it's kept under the sheets and that it continues each year regardless of whatever Acts legally exist, this rarely gets into the limelight or creates public outrage, except in rare instances where the damage is so serious that the victims end up being hospitalized: like just over a week ago, where\nfor the\nof their juniors.\nFreshers have two options: accept and live with it, or be an outcast. There are plenty of stories and anecdotes of how students just drop out of university because of this as well, but I couldn't find official numbers for it.\n",
  "url": "https://www.yamu.lk/blog/the-bane-of-local-universities-ragging-and-what-its-all-about"
}