{
  "title": "The Tampon Travesty: 6 Intriguing Issues About Menstruating in Sri Lanka",
  "abstract": "What do demons, the cosmic forces, and milk baths have to do with menstruation? ",
  "author": "",
  "date_published": "2:37pm",
  "content": "There are a bunch of incredibly fascinating issues, beliefs and facts about menstruation in South Asia. They're flawed and hilarious at best, and downright scary at worst. Here are some of our favourite Lankan ones.\nOne of the most confusing yet intriguing beliefs about menstruation in Sri Lanka is that it makes women vulnerable and thus prone to demon attack - which could make them emotionally unstable. This may just be one of the greatest explanations for PMS we've ever come across - don't forget to use it liberally the next time someone condescendingly asks you if you're PMSing.\nIf you want to learn more, dig up Deborah Winslow's 1980 paper,\n.\nFor most traditional Lankan Buddhist or Tamil families, a girl child getting her first period (more elegantly termed \"menarche\") is cause for much celebration for various reasons (coming of age, ability to bear children, now considered a woman etc). At the same time, family members ensure she is kept away from other people (especially males or male family members), even in urban communities, until her cycle is done.\nA ritual seclusion, feeding, and bathing is usually the norm, along with some gifts signifying her blooming into a woman etc. Sometimes the bathing is done with milk, which makes you question whether you're now a woman or a Marie biscuit. So it's a mix of celebration and quarantine - a little confusing for a young girl.\nPossibly my favourite of all the facts, this refers to an ancient superstition in Sri Lanka within some rural Tamil communities that menstruating women can cause cosmic imbalances, and so should be kept away from the ground/earth. In order to maintain this, they would sometimes be made to live away in shelters on stilts.\nAs Knight, C. (1995) mentions in the academic paper\nthis was\nto prevent the cosmic disasters which earthly contact would invite\". I'm not sure why Neil deGrasse Tyson hasn't weighed in on this yet. Maybe a woman with period cramps in Gampaha caused the gravitational waves, who knows.\nLess fun than Temple Run, this ban extends to some Buddhist and Hindu temples and mosques, that explicity dictate that menstruating women are not allowed as they are \"impure\". A temple in India for example, not trusting wily women to be honest about the timing of their menses, has put down a\nuntil a \"period scanner\" is invented. Detractors claim that the reason women in ancient times were denied entry was to allow them time to rest and cope with cramps without having to undertake temple duties. In all honesty, it was probably a mix of both.\nFinding tampons in Sri Lanka (well, Colombo), used to be difficult but not impossible. The big Keells outlets and Arpico would stock them, mostly O.B non-applicators. Now the only tampons available are the brand Ria, available\nat Healthguard or on\n. We're not sure what to attribute this scarcity to - the high prices of importing tampons, the low demand, or simply a cultural stigma surrounding the insertion process. For now, most women just end up getting their sanitary products abroad and lugging them back.\nIt's important to also keep in mind that disposable sanitary napkins are made of synthetic plastic polymers that are\n. This just adds more strain to Sri Lanka's already ineffective waste management system (i.e: fling everything onto a pile).\nPart of the whole avoidance of menstruation includes avoiding actually saying words like \"period\" or \"menstruation\". Living in Sri Lanka, you'll get used to deciphering a variety of euphemisms, including \"my friend is here\", \"that time of the month\", \"Aunty Flo\", amongst others. It can get really confusing if you're not in the loop, you'd just feel as though a lot of women had very insistent house guests.\nAnother incredibly universal and confusing issue is why all sanitary napkin ads involve blue liquid. We're not using pads to mop up spilt Harpic, you know.\nSouth Asia's treatment of its women has historically been pretty flawed, and dichotomous. You need look no further than mythology or religion, which simultaneously deifies and vilifies women.\nWhile a lot of these issues sound absolutely hilarious in a modern contemporary setting, it's important to remember that these issues negatively impact and affect many women in the country. Working or studying women in impoverished or rural areas find themselves having to drop out of school or skip work during their period due to a lack of sanitary bathroom conditions, or stigmas surrounding a woman's \"incapacitation\" during menstruation. It causes breaks in education, and a lack of financial independence in some cases.\nUnless you're directly involved in awareness programs or rural sanitary education projects, the most you can do right now is be honest and open in menstruation dialogue. Also feel free to pull the demon card when PMS strikes.\n",
  "url": "https://www.yamu.lk/blog/the-tampon-travesty-issues-with-being-a-woman-menstruating-in-sri-lanka"
}