{
  "title": "The YAMU Staff's Favourites in Sri Lanka",
  "abstract": "Our secret favourite spots we didn't want to tell you about.",
  "author": "Kinita",
  "date_published": "3:37pm",
  "content": "Sri Lanka's way more than the same handful of sexy hotspots that turn up in every international travel mag. In a world saturated by PR shoots, Instagram promos, and blanket 5 star reviews, we've been hoarding our favourite places away like Gollum hoarded the ring. But I wheedled some of our staff into writing about some of their personal, absolutely arbitrary favourites. There's no criteria here except personal preference.\nMy favorite place is dead. The Castle Hotel had everything I like - history, character, characters (shout out to Solomon), cheap arrack and bites. This was the king of dodgy bars but the king is dead, to be replaced by a Tata office or something. I understand development and all but this is one place I dearly miss.\nThere is something deep in the ambience of Barefoot that makes it delightful. It's not the food or the garden or the art or the store per se, it's the underlying creativity of Barbara Sansoni and her family that permeates the place and gives it soul.\nBarefoot is perhaps associated with an 'English elite' culture that people like to hate on, but if you can put down the haterade and just be in the space for a minute, it's exceedingly pleasant.\nI like things that are tall, I like things that are lesser known, and I like Buddhism. Hence the giant, elevated stupa tucked away in Fort is one of my favorites. There's an amazing view of the Port and Port City construction (once you make the climb) and some interesting artwork inside.\nMin Han is a weird and wonderful place featuring a colourful waiter named Wijeypala, numerous rats making sweet love in the walls, a collection of chain-smoking Chinese regulars, and pretty good food. This is sort of my replacement for\n.\nThe SoS villages is probably one of my favourite causes in Sri Lanka. Rural orphans are grouped and housed in homes with a \"mother\" who takes care of them family-style, and they live, go to school, and work with other kids in the group of houses like a village. It's a beautiful idea that provides the kids with structure and love, and they also send you adorable cards with photos for Christmas/New Year's and an annual progress report when you sponsor a child for a year.\nJaffna is going to be a vibrant tourist destination in the coming years, but for now it's still relatively quiet. While the bullet-ridden abandoned mansions haunted me, Casuarina Beach was a happy, vibrant place full of frolicking locals and achingly azure natural beauty. My favourite part was taking a boat out into the sea and paddling on a sand bank in the middle of the Ocean - surreal. Once you're done, head to\nfor a snack and some retinal burn.\nThese books shops have always been one of my favourite bits of Sri Lanka. Leafy trees fringe this\n, stuffed to the ceiling with yellowing, mouldy, silver-fish ridden vintage books, hardbacks, all hidden by the selection of sleek new prints of self-help (7 WAYS TO BE HIGHLY SUCESSFUL AND SIMULTANEOUSLY LOSE 60 POUNDS) and academic books. Just ask the uncles for help, they're super helpful.\nThis place is so trippy with lots of psychedelic art and all. I think they do actually target tourists who are 'tripping,' although I'm not sure whether we should mention that. Also the Russian couple that run this place is super cool and friendly.\nOne of the most authentic Sri Lankan food places in Colombo, with a wide range of rare local dishes (like, rare varieties of greens and vegetables).\nIt's not mentioned in Indi's review. But waiters here are super chilled! You'd find grumpy waiters even in Colombo's upmarket places, but not here.\nApart from great pizza, I love their cosy upper floor which gives me a feeling of living inside a '80s movie like Wild at Heat or Goodfellas. We also order this in to office after work all the time, it's one of the few things that unite us.\nDiyaluma was my first waterfall hike and I found the whole walk and the end view to be spectacular. Haven't been to Bambarakanda (Lanka's highest!) as yet, so this sufficed. Plus I\nthe lemongrass fields we trekked through!\nAs a skeptic who thinks terrible things of restaurants that mark up prices on 'normal, local food,' I was pleasantly surprised with my experience here because of how authentic and simple the food was, and how amazing their rather expensive mutton rolls are. Would happily go broke for those.\n\nI initially liked Black Cat because they had cats, but continue to frequent it even in its current cat-less state. Definitely has to be something with their ridiculously friendly service and comfortable, homely atmosphere. Food and drinks are not too bad either (this is an understatement, but I don't want Kinita to say I'm gushing about it again).\nBeen here twice and got lost both times: it's a great place to stumble through and push yourself, especially without a guide. It's by far one of the most arduous hikes I've been on here, Kirigalpottha was a walk in the park compared to this. Your reward is the stunning sunrise (but only if you start early enough).\nMy experiences here have been very satisfactory because their portions are HUGE and come stuffed to point where the burgers are tiredly leaning to the side on account of being stuffed with so much meat.\nThis my go-to for when I want to eat a lot but don’t necessarily have the means to do so. The Shawarma Platter here is my favourite because it comes with shawarma, fries and a salad on the side which is more than enough to satisfy the qualms of my rumbling stomach.\nIn addition to that I’m not extremely overjoyed at their interior decorating skills because the yellow and orange walls make me feel like I’m on a hot grill.\nThe first time I ever went to The RE.PUB.LK, I was really annoyed at the name of the place because it’s an inconvenience to spell and it makes no sense.\nI then walked in and my irritability disappeared as the lights make me feel like I’m a part of some tumblr blog post. Also at night if you sit at the right area you’ll be able to catch a cool view of the WTC all lit up with the fairy lights boosting the whole scene. Pretty cool.\nAnyways, my favourite thing to get here would be the soft shell tacos because they’ve got chicken or whatever pretty much spilling out of them which makes manoeuvring your way around them a little difficult. But if you’re an indomitable spirit like me you’ll plow through because the mess is pretty trivial once you’ve had your first bite.\nGot any secret favourites you're benevolent enough to share? Drop us a comment!\n",
  "url": "https://www.yamu.lk/blog/the-yamu-favourites-srilanka"
}