{
  "title": "The Ice Cream Challenge: Top 5 (2012)",
  "abstract": "The best 5 Lankan ice creams in 2012",
  "author": "",
  "date_published": "4:59pm",
  "content": "\nHaters will say it's bland and boring. Just so vanilla.... But add a little chocolate sauce, smash in some mango, a strawberry or two or drizzle over the classic\nand good old Vanilla Ice becomes a hard to beat treat. You also can't really conceive of milkshakes without it.\n\nOne of the many little things that makes our Lankan land great is the availability of many, inexpensive yet highly satisfactory brands of vanilla ice cream. Still not all Vanillas are equal. While Elephant House has long been the dominant force in local ice cream Cargills seems pretty keen to take a hunk of that profitable pie. Various underdog competitors also exist and the partisans of Highland and Kotmale can be quite fanatical.\n\nTo cut through this sundae of icy options YAMU thought it would weigh in with an ice-cream challenge.\n\n\n\nWhich is the tastiest of them all?\n\n\n\n\n\n\nFinished at the bottom of our frozen pyramid.  The classic ice cream parlors 1 litre vanilla ice was synthetic and thin.  It really didn't taste like there was much milk in it and we got the sense that nothing but preservatives and E-numbers kept it in vaguely solid form. The best way to describe this is something like the bargain bin, cheapest sort of ice cream you find in British supermarkets - not a good thing. Somehow in their Galle Road ice cream parlor the stuff tastes fine even rather good but take the litre box home and it's a different story.\n\nGiven the island's high ice cream standards though it wasn't objectively bad but lost out relative to it's competitors on creaminess and price - Rs 270, the priciest of our selection.\n\n\n\n\n\n\nThis was a bit of a shock. People speak highly of Highland with many saying it's straight up vanilla flavor is the best around.  They are major milk producers so it would make sense that their ice cream is good and creamy but our sample tasted distinctly off. Creamy for sure, there's a lot of real milk in this but it tasted like the milk had gone off.  Off milk isn't the taste you want in your ice cream.\n\nPerhaps they just haven't mastered pasteurization, as we had a similar problem with their packet chocolate milk.  This was a fresh box from Keells though so maybe you need to stand outside the factory to get the good stuff? A shame cos the creaminess had potential but on the day it didn't match up to the heavy-weights.\n\n\n\n\n\n\n\n\n\n\n\n\nFor so many Colombars the default ice cream - Elephant House, finished second. This is a classic for a reason they're big on the vanilla, and its nice and smooth.  Maybe because of the relatively strong vanilla flavor it tastes a bit like cake batter- in a good way.  The ivory colouring is also a nice touch, the other brands' bone-whiteness isn't quite as appetizing. What kept this from the top of the table was the lack of creaminess. While some people might appreciate the lightness it felt to use like they were stingier with the milk and cream than our top ranked competitor.\n\n\n\n\n\nIt's the best. A fraction ahead of Keells - it was the best balanced of our bunch. Creamy but not pasty, enough vanilla but not too much. Smooth and really a perfect base for other toppings.  Again it’s supermarket vanilla ice cream so it's not going to make you go wow but for subtle tastiness this one won us over.  We've been a bit critical of Cargills products in the past  but with vanilla ice cream at least they are onto a winner.\n",
  "url": "https://www.yamu.lk/blog/the-ice-cream-challenge"
}