{
  "title": "The Diaspora Roundup 2015",
  "abstract": "If you've been out of town for a year, these are the places you missed.",
  "author": "Kinita",
  "date_published": "3:43pm",
  "content": "December usually marks the en masse return of Sri Lanka's prodigal children and annual visitors. If you're excited about experiencing a tropical winter this year, you can expect a host of interesting new places from bars to restaurants to homebakers.\nYou probably have seasonal lovers, aunties, and dengue to divide your time between, so we'll also let you know which old favourites are no longer worth the visit. Here's a quick look at what you should check out, and what you should rule out.\nYou must allow us tell you how ardently we admire rare. Enough to quote Austen, as it appears. Given the great quality of their steak and ribs, you'd think the restaurant's name was a meat reference. It's not. While their seeni sambol and sprat ice cream is suspiciously palatable, the three course weekday executive lunch menu is just exemplary at Rs. 1,500.\nWe recommend you go there and order the lobster for your main course before the management realises this deal is a steal. If you're  feeling flush, go and have a lovely cocktails session here. You'll come across some weirdly charming boozy Lankan concoctions, like the\n.\nAn esoteric and very private dining experience, Contemporary Ceylon breathed fresh air into Colombo's fine dining scene (almost as fresh as the air from the penthouse balcony where it's located). With exquisitely crafted courses proving their worth as the lovechild of fresh local produce and international style, it's a must-visit.\nYou are, however, going to have to book beforehand and trick at least 5 other people into being your dining companions for the night to lock down a reservation. And it's definitely booked out this month, unless you know the chef personally and can emotionally blackmail your way in.\nWhile\nhas flapped its way out of our good books, their upstairs section called the Love Bar is pretty slick. Featuring funky decor and charmingly kitschy design, it's one of the city's best new watering holes. The cocktails are lots of fun too, and come delightfully arranged with flowers and leaves held together with twine. Not only do they look cute, but also serve as a smooth way to ply your date with flowers.\n\n\nSure, BB's been getting some flak recently, but they're still one of Colombo's best places for coffee and desserts. It looks like a chic doll's house, and their cupcakes have been around for yonks under the Good Market banner.\nDisques is the new lounge/ club that the cool kids frequent. We haven't reviewed it yet, mostly because Disque's timings are solidly within the realm of a YAMU team member's bed time. But it's at a great location at the Racecourse premises, and they're really kicking off December madness in style with a rash of parties and guest DJs.\nThe key reason why Lankan people are less concerned with expanding waistlines than the rest of the world is because sarongs always fit, no matter how chunky you're getting. As of 2015, you can get your hands on healthy meal options in Colombo. Calorie Counter's breakfast and drinks options are great, in case you need a morning fix after your run.\nThis space just opened up, and is already gaining a loyal visitor base thanks to its quirky repurposed furniture, second hand books for sale, quality ginger beer made from their veggie patch, and its eponymous black cat. They also focus on what they do well, which is sandwiches and coffee. With a location smack bang in the middle of Colombo 7, it's also a perfect place for you to bed down when you're in town.\nThe legendary institution of Lankan-Chinese food has been around for decades on end, and much like many other Lankan institutions, it's either dead or dying. It's newest reincarnation has slowly but surely slid into confusion (they're now calling themselves Oak Ray Flower Drum, a seemingly random collection of words). The new place is alright, but not worth your precious holiday time. Console your uncles.\nChesa Swiss used to be pretty much the only proper non-5 star hotel fine dining place in Colombo since 1991. It had a charming old Colombo vibe, nestled in an old mansion in Cinnamon Gardens. Super pricey by Lankan wartime standards, it was the go-to spot for the rich and the romantic. It's now closed down, but will always be fondue-ly remembered.\nSummer was a super al fresco boozy institution in the heart of the city. Framed by a beautiful old nuga tree and famed for their cheap beers, cheap food, and quick service, it was the ultimate boys' boys hang out. Now Colombo's men have been forced to upgrade to private clubs or Playtrix. It's a national tragedy.\nThis used to be a real family-friendly joint. Like, really good for families. Service was incredibly efficient if you knew the management, but we've heard plenty of complaints from people who generally favoured other establishments. We generally attribute the demise of this fine establishment to a traumatic hopper incident, or perhaps an undefinable foreign conspiracy.\nWe hope this was helpful. Welcome back, and may your social exchanges be more fruitful than your currency exchanges this season.\n",
  "url": "https://www.yamu.lk/blog/what-you-missed-in-2015"
}