{
  "title": "The Mosquito Menace : Dengue, Prevention, & Cure",
  "abstract": "How to pronounce & prevent dengue.",
  "author": "",
  "date_published": "3:07pm",
  "content": "As if disease and death weren't enough, one of the most troubling aspects of dengue is understanding how to pronounce it. Den-gee? Den-goo?\n, and we'll help you with preventing it. A disease endemic to Sri Lanka, dengue is a mosquito-borne viral disease that can lead to severe illness, or in the case of over 70 Sri Lankans, death in the last year.\n, mosquitos aren't just a Sri Lankan thing, but since the 1st of January 2017, some 24315 cases have been reported to the\n. While the problem is country-wide, 41% of the reports were from the Western Province, which seems worryingly disproportionate.\nYou can most commonly get dengue from the bites of the female mosquito\n, which act as vectors between humans carrying the disease. They tend to be daytime feeders, so the most dangerous period is in the morning and before dusk.\nWhile a\nhas been very recently created, it's not in the country as yet, so prevention is still the best bet in Sri Lanka.\n1. Citronella oil - The direct application, diffusion, or spray of this aromatic natural oil heavily deters mosquitos. Some people dislike the strong smell, but it's not too offensive even to put directly onto your body after a shower. You can even make your own body spray at home like a craftsy crocodile. Mix lavender water, citronella oil, and put into a little spray bottle - done! Fair warning; all these ingredients are kind of pricey in Sri Lanka.\n1. Wall plug-in- These are available at most supermarkets, along with either mat or liquid bottle refills. They're generally effective within short distances, but take a while to activate to protect a full room.\n2.\n- We found a heap of gadgets online that promise to ward off mosquitos, but they look expensive and difficult to ship here.\n3. Baygon, Mortein, and other aerosol sprays - These are super effective, super strong, and\n. You're basically fumigating your immediate area. These aerosols also attack cockroaches and other crawlies, so check the label.\n4. Coils - If fumes aren't your thing, coils may not work out for you. However, they are one of the cheapest and most commonly used options in Sri Lanka, especially outdoors. Keep in mind that these fumes are specially treated, just chainsmoking furiously won't keep mosquitos away.\n5. Bug zappers - These are loud, bright, and generally unsightly. They do, however, succeed in killing off a whole variety of flying insects. That sound of electrocuted bugs isn't nice though.\n1. Sticker Patches - This are great (and generally safe) to put on children, or if you're sitting or walking around in mosquito-prone areas. It's also great if you're sensitive to smell and/or don't want to smell like repellent.  Or if you want to look like a human laptop covered in stickers.\n2. Creams and ointments - Imported creams like Odomos are superb for keeping mosquitos away. They're also a lot less smelly and smeary than they used to be, making application easy.\n3. Sprays - sprays here are expensive! The non-aerosol ones are the only ones we've noticed in shops here, but that's better for the environment anyway.\n4. Bracelets - A less smelly, less sticky option. These bracelets are kind of pricey and only stay effective for about 12 hours, but they do work.\n1. Mosquito nets - Mosquito nets are probably more common in Sri Lankan bedrooms than orgasms are (if this bothers anybody, you can write your righteous indignation in iambic pentameter and recite it to us on the next full moon). While these bulky multicoloured contraptions can make you feel like a princess in a four-poster, they're not super effective because a lot dengue vector mozzies attack during the day.\n2. Window & door screens - It's almost always sweltering outside, so tempting a breeze in is necessary. Just make sure all openings of your house have screens on them to keep the buzzing out.\n3. Turn the fan on - Easy, effective. If your A/C is high enough that works too.\n4. Mosquito/fly swatters - A more tedious, less effective strategy. These can be bought hella cheap on the road, unlike your life. We'd probably only suggest this if you're trying to relive your glory days as an Under-14 badminton hero.\nOne of the best ways to squash the mozzie epidemic is to discourage breeding. As a tropical country, we're prime breeding ground, but measures can be taken to ensure your house isn't a bug paradise.\n1. Get rid of empty tires, pots, broken things around the house that collect water. Rainwater harvesting is environmentally friendly, but stagnant water is the perfect breeding ground.\n2. Lemon grass , mint, basil - You can grow these naturally repellant plants around your house and garden. They all grow pretty easily in Sri Lankan climate, and you can use them for cooking (and making mojitos) too.\n3.\n- Particular types of ornamental fish like guppy, goldfish, fathead minnows and mosquito fish all eat mosquito larvae!\n4.\n. They will tell you what you can improve on, give you a Green Star if your house passes inspection, and will even fumigate the premises for you during their rounds. They're basically the\nof Colombo.\nFever, pain behind the eyes, sore joints, vomiting, nausea can all start to show between 4-7 days of being bitten. In some rare cases, dengue can even be\n.If the illness perseveres, it could lead to Dengue Hemorrhagic Fever (DHF).\n, symptoms of DHF include severe abdominal pain, vomiting, diarrhoea, convulsions, bruising, and uncontrolled bleeding. In rare cases, it could cause death, so seek medical treatment as soon as possible.\nOf course, prevention is better than cure. If it's too late for that, the best bet is to go straight to hospital if there's suspicion of the symptoms mentioned above. Apart from the big private hospitals,\nis one of the best treatment sites in Sri Lanka, just ignore their hilarious stock text on the photo. Also make sure to avoid aspirin and other blood thinners as they could exacerbate the haemorrhaging.  The key is to ensure you replace lost fluids and rest.\nused to aid treatment in Sri Lanka, but medical research doesn't confirm this as yet.\nIn the meanwhile, keep spraying and just follow your doctor's advice!\n",
  "url": "https://www.yamu.lk/blog/the-mosquito-menace-dengue-prevention-cure"
}