{
  "title": "The Tikiri Trust",
  "abstract": "The Tikiri Trust located in Kandy is a haven for stray dogs and cats.",
  "author": "Rishani",
  "date_published": "10:50am",
  "content": "located in Kandy is a haven for stray dogs and cats. This haven run by Eva Ruppel started in a house in 2004. The shelter at present houses around 150 plus dogs on its premises while another 10 more are regulars around meal time.\nTikiri Trust takes strays off the road, sterilizes and treats them and when they are sick. The trust also works at rehoming these strays but some of these animals don’t get adopted and then they grow up at the shelter and have become permanent residents.\n\nIf you live and work around or holidaying in Kandy and are looking to adopting a pet visit the Tikiri Trust. One of the challenges facing animal welfare organizations today is the number of animals in need of assistance. For people concerned about animal welfare, adopting pets from an animal shelter or rescue organization is the right thing to do. Firstly it provides housing for pets taken in for adoption into loving homes. Seocndly it creates more room and resources for animals left behind.\nYou can also volunteer to lend a hand to Eva by taking care of their cute and fluffy residents..\n\nSince most of these dogs and cats have been picked up from the streets, they need a little bit of human interaction and love, so feel free to pop in once a week or so for a cuddle and to befriend a stray puppy or a kitty, or both.\nThree weekends a month, the vet comes in to provide sterilization and the animals spend a few days at the shelter for some R&R and aftercare. Among the 50 cats in residence at the moment, many of these are permanent residents and have been at the shelter for a long time and get on amicably with the dogs. There are also kittens of various ages and sizes which are up for adoption. So if you have some room in your home and your heart, drop by at Tikiri Trust to pick a pet of your choice.\nIn spite of many sterilization-campaigns being carried out by various animal welfare organizatons, dogs are still being abandoned. For this reason, the Tikiri Trust needs places, where such dogs can find refuge.\nThe day-to-day upkeep of the shelter has to be secured first, it may be too early to talk about future-plans. However it would be very useful to purchase another piece of land adjoining this property for a quarantine-facility and to space out the animals, as with 200 animals on 90 perch some are living under stress, which we would like to relief as soon as possible.\n\nFor more information contact Tikiri Trust via their Facebook page or call Eva Ruppel on 777 426 229.\n\nAdopt a puppy or a kitty today.\n(Images courtesy:\n",
  "url": "https://www.yamu.lk/blog/the-tikiri-trust"
}