{
  "title": "The Drinking Yoghurt Round-up",
  "abstract": "We tried out a ton of drinking yogurt. Don't do that, because it can cause tummy problems. Stick with one bottle. Or…",
  "author": "",
  "date_published": "3:59pm",
  "content": "We've seen drinking yoghurt slowly infiltrating our local market and fridges, and have adventurously attempted to buy all flavours and brands available to taste them all (which, honestly, isn't a lot).\nThe most common brands around are Kothmale, Richlife, and CIC; and the most available flavours are strawberry and vanilla (which is pretty much the same as an unflavoured yoghurt). Bhagya was brave enough to buy a woodapple flavoured one too. Meanwhile, here are our thoughts on them.\nMy personal favourite is Kotmale, which legit has little strawberry pieces (or pips) in it. It's what I find most authentic, though Bhagya would beg to disagree. It's a bit more watery than the other brands we tried, but overall, everyone liked it.\nFlamingo pink in its little bottle, this one screams of artificial flavours and of tasting just as unnatural; so imagine our surprise when this was actually sourer than Kotmale's, giving that little acidic kick that strawberries are wont to. It's definitely not as artificial as it looked, so happy times. Despite the slight sourness, it's also the sweetest of the lot we tried, plus the thickest.\nUnanimous favourite of Bhagya's and Shifani's, this was super creamy without being sweet at all. Unlike the other brands though, this doesn't come bottled. Grab a straw and make sure you don't spill as you beat the heat with this light, almost milky concoction.\nAs much as the strawberry was good, their vanilla is unremarkable. You don't get the vanilla essence flavour, and it's pretty much regular yoghurt except it's liquidized. It was Bhagya's least favourite one, until he tried Richlife's.\nThink of condensed milk, and you're almost there. CIC's vanilla — just like all three vanilla flavoured yoghurts we tried out — pretty much didn't exist, but if you've got an insatiable sweet tooth, go buy this.\nTo put it nicely, it tasted quite, quite bad. Overpowering sourness, not in the least refreshing. It left us wondering how this happened.\nRichlife's Mango was meh. It had the mango flavour, yes, but it didn't really taste authentic. It was like a regular mango flavoured drink, a bit slippery because of the yoghurt's texture.\nWoodapple (brought to you by Kotmale) was the biggest surprise of all. We expected to be grossed out, but even I liked it (and I dislike woodapple in general unless it's in the\nform). The woodapple flavour was quite accurate, it blended well with the yoghurt, and it had a tinge of savouriness which went well with the yoghurt's sweetness. If you want to appear gastronomically adventurous while actually playing really safe, check it out.\n",
  "url": "https://www.yamu.lk/blog/the-drinking-yoghurt"
}