{
  "title": "The Human Rights Arts Festival 2017",
  "abstract": "The Human Rights Arts Festival is happening until the 17th of December at the JDA Perera Gallery.  ",
  "author": "Halik",
  "date_published": "8:13am",
  "content": "If you're feeling like some hifalutin culture mixed with some hard hitting political critique, the Human Rights Arts Festival is currently on and open to the public at the JDA Perera Gallery. And it's free.\nFeaturing the work of 32 local and international artists, the festival, the first in what will be an annual event, curates art forms ranging from visual, sound, performance and installation works.\nCurated by Chandraguptha Thenuwara, the space created at the JDA is a visceral mix of artworks originating from a range of ideological leanings. Artists from the Jaffna School, such as T. Shanathanan, S.P. Pushpakanthan, Vijitharan Maryathevathas and Susiman Nirmalavasan have contributed thought-provoking works dealing with post-war violence and anguish.\nThe work of artists like Anoma Wijewardene, Kingsley Gunatillake, Prageeth Rathnayake and Nuwan Nalaka echo these themes. These engage and immerse the viewer, forcing them to question Sri Lanka's post-conflict socio-cultural frameworks.\nOther artists critique the idea of human rights itself, as used within a neoliberal modernity, and question as to whether they are sufficient to deal with unrecognized violations suffered by most humans today such as economic injustice, mental health and childhood trauma.\nWorks by Menika Van Der Poorten and Gayan Prageeth situate the issue in real world contexts, the former through a series of photographs taken of 'old IDP' (Muslims displaced in the early 90s) women and the latter through his powerful work on the Welikada prison riots.\nStand out performances on the first day included those from international artists in residence at Sura Medura in Hikkaduwa and Venuri Perera's crew. If you missed the opening, you can catch them on video at the venue.\nSound and video installations also form a key part of the festival. The resident artists' video installations offered a reflective glimpse of Sri Lanka as seen through a foreign perspective. While a documentary film on Wilpattu attempts to overturn commonly held stereotypes and notions about the recent conflict around the National Park.\n",
  "url": "https://www.yamu.lk/blog/the-human-rights-arts-festival-2017"
}