{
  "title": "The Great Polythene Ban",
  "abstract": "Polythene bags, rigifoam and such inconveniences are banned from the 1st of September 2017. How will we…",
  "author": "",
  "date_published": "4:17pm",
  "content": "Polythene bags are\nnow. So are rigifoam lunch containers and lunch packets. Does this mean we will face a sudden lamprais-boom? Hopefully. Either way, only good things shall result as a cause of this ban.\nUh, because the planet is dying and we're polluting our environment with such monstrosities. This isn't the entire reason but it should give you an idea as to what we're going through right now.\nAlso, plastic is the devil. It takes about 500-1000 years for a single shopping bag to decay. So we're doomed. Unless we take action, that is.\n\nAll this plastic and other garbage eventually finds its way into the bottom of the ocean. Not good. If we're going to doom ourselves, might as limit it to only the human race because I don't see whales or turtles walking out of Arpico with shopping bags.\nRemember back in 2016 the government issued a blanket ban on Polythene & co? Well that wasn't effective enough because people didn't listen/care and so we went about with our careless dumping.\nReports have been coming in from around the Colpetty area of a truck making announcements in the early morn. This sounds a bit apocalyptic and it may very well be if we don't listen.\nThere have been numerous articles in the papers as well as many awareness campaigns to educate the general public and to possibly save someone from having to pay an exuberant fine over a plastic bag.\nIt will.\nBut, other than those they'll also be\nand polythene bags that are thinner than 20 microns. Which means that you can't use sili-sili bags, but thicker plastic bags (like the ones you get at House of Fashions etc) are okay.\nThere have been mixed reviews and reactions. We don't know why, or how anyone can have mixed reactions when it concerns the safety of the planet, but humans always find a way.\nSmall businesses might find it difficult to adjust to the new and slightly expensive methods of packaging.\nPeople also remarked that brown paper or cloth isn't really a suitable replacement as either wouldn't hold goods that are way too heavy and then some.\nThe ladies at the Perera & Sons close to work informed me that they've been given a few updates on the current plastic ban and you'll now be able to walk out of small bakeries like this with biodegradable plastic bags. Same goes for most if not all bakeries and cafes. Everyone's afraid of the 10k fine.\nSupermarkets and the like will now be promoting the usage of cloth or reed bags.\nIn addition to all this you can:\nFor more info, check out our blog on\n.\nObviously the country's plastic content isn't going to be completely eradicated overnight. Sili-sili bags are still in circulation but that's mostly because people don't know what to do with their leftover stocks, so they just give it to other people to solve this issue.\nDoes it work? No.\nIF you get caught using/manufacturing/distributing plastic bags/items you will have to pay a\nand could face up to two years in jail. Is this worth a sili-sili bag? Don't be sili-silly.\nAccording to most people I know, no. I walked by a random\nand a gent sauntered out with a plastic bag full of paraphernalia.\nSomeone mentioned people coming into work like nothing's wrong, with their plastic carry-bags which is sad.\n\nLet's hope everyone wakes up by the time September ends, or in the near dystopian future the planet\ngo into eternal sleep.\n",
  "url": "https://www.yamu.lk/blog/the-great-polythene-ban"
}