{
  "title": "The Great Lankan Beer Taste-Off",
  "abstract": "We tasted every locally brewed and available beer. In the name of science!",
  "author": "Kinita",
  "date_published": "8:55am",
  "content": "Sri Lanka's beer game has never been too strong (unlike BISON XXX), but things are picking up.\nWith\nand\nmaking it awfully difficult to own or run a bar here, drinking in the peace of your home has become ever more attractive. For those less flush with cash, these policies have also made illicit liquor (over 65% of the market, if not more) and subsequent badly distilled alcohol-related illnesses and deaths more rampant. Ah well, these are sad stories for investigative journalists much less inane and banal than us to cover.\nUs simple chaps at YAMU HQ decided to launch the Big Lankan Beer Taste-Off, where we got big bottles of all the locally brewed brands and attempted a blind tasting. Here's the full video below, but I'll summarize it for you anyway.\n1. Three Coins and Baron have disappeared off the shelves.\n2. Marketing and sentiment are tricky bedfellows. A lot of our opinions were based on existing bias rather than actual taste preferences.\n3. South Asian brews tend to be lagers (as opposed to ales or stouts) because they're lighter, easier, and go better with our weather and food.\n4. Cold strong beer isn't nearly as disgusting as we all thought it was. Except Bison, which is even more disgusting.\nDamn, Lion really isn't the only cat on the local beer market anymore. With lots of contenders like Tiger, Anchor, and even Sando (shudder) in play after\n, our choices were surprisingly vast. Our overall favourites were :\n1. Tiger Lager for its crisp, summery palatability.\n2. Lion Strong because it was the least odious strong beer.\n3. Anchor Pilsener since it's light, easy, and super cheap at Rs. 270 a pop.\nKeep in mind that all of these differently bottled, positioned, and marketed beers are only here to give you the illusion of choice, they're basically brewed by just 2 local breweries. Happy sipping!\n",
  "url": "https://www.yamu.lk/blog/the-great-sri-lankan-local-beer-taste-off"
}