{
  "title": "The Big Match: What's The Big Deal?",
  "abstract": "The SSC will be the centre of the universe for every Royalist and Thomian for three days this week.",
  "author": "janith",
  "date_published": "10:54am",
  "content": "It's that time of the year again when big match parades roll around town and lead boys (current and \"old\") to their school big matches. Every school will claim that theirs is the greatest rivalry on the face of the Earth, but I'll be writing today about my own big match: the Royal Thomian \"Battle of the Blues\", the 137th edition of which gets under way at the SSC this Thursday (10 March).\n\nRoyal College was founded in 1835 as the Colombo Academy. S. Thomas' was founded in 1851. Dr. James Chapman, founder of STC and the first Anglican Bishop of Colombo, was an Etonian who favoured cricket and introduced the game to his students. The first game between the two schools was played in 1879 (involving masters and students), and from 1880 onwards it was purely played by the students of the two Colleges.\nThe match has been going on continuously since, and went uninterrupted even by the two world wars. This makes it one of the, if not\n, longest uninterrupted cricketing series in the world. Many distinguished personalities have played at the big match, including 4 Prime Ministers of Sri Lanka, and countless national-level cricketers. Check out\n, one of those highly decorated cricketers.\nThere are some amazing tales from big matches past, including the story of two daredevil climbers armed with Royal and STC flags scaling the Radio Ceylon tower in the late 50s (meeting halfway up and exchanging pleasantries), invading the old Parliament lawn to garland statues of D.S. and S.W.R.D. (old Thomians, both) with College flags, shenanigans at girls' schools with troops of boys going on 'hat collection', and on one occasion a permanent stand being set on fire by the\n. The 'unrestrained merry-making' at the match has certainly been toned down in recent years, owing mostly to tighter policing and the security situation in the country.\nThe traditions and rivalries of big match are legendary. Highlights include:\nBoth Royal College and S. Thomas' organize official cycle parades that snake through the streets of Colombo. \"Cycle Parade\" is a bit of a misnomer, since most participants take cars, flat-bed trucks and buses these days. Various school clubs and societies contribute their own segments to the parade, including the cadets who usually carry a giant school flag.\nThis is the face-off between the Second XIs of Royal and S. Thomas'. It traditionally takes place the week before the big match, and is played at either the Royal College ground or the S. Thomas' big club ground. It's a chance for the students to get involved in the cricket before the main event begins.\n\nThis is a tradition that students of the two big colleges might not be aware of. Traditionally, old boys of S. Thomas' Preparatory School would visit their old school on the first day of the match, ring the school bell and escort all the students to the match venue. Although this has been discontinued in recent years, I'm personally holding out for a revival.\nOn Thursday morning, two nervous teenagers walk out to the middle at the SSC and toss a coin, perhaps the most important coin toss in their lives\n. Over the next three days, the two teams will battle it out. There will be the pitch invasions, the chants of\n, the inevitable batting collapses and the rescue missions from lower order batsmen which will be labelled \"Royal Spirit/Thomian Grit\", the customary removal of the letter T from the scoreboard entry reading \"S. Thomas'\", the drunken brawls which evaporate as suddenly as they appear, the uncles who show up without fail from all corners of the world to spend time with their brethren, the professionals who mysteriously fall ill and visit the SSC for treatment, and of course the cricket that often goes unattended until something dramatic happens.\nThroughout these few days though, the main feature that one notices is the camaraderie between the two schools. Every Royalist and Thomian has close friends from across the divide, and it shows. The rivalry is built on a foundation of mutual respect, and the jabs are seldom mean-spirited.\nIf something, —anything— is passed to you in a bottle or a cup, it usually has alcohol in it. Now, most people relish this free flow of high spirits, but if you're not one of these people—do look out.\nFood at the venue is consistently terrible, and will always be the same old \"mystery meat patties and sausages wrapped in dodgy bread\". You might want to venture out for noms. We'd recommend\n,\nfor variety,\nor\n, all within walking distance of the SSC.\nThere are many\nsongs that can be heard at the match venue, sung by boys in various states of inebriation. Now, it's all well and good to sing these at a loud cricket ground, but it's best to avoid singing them in front of your parents.\nThis has always been my favourite part of the day: during the lunch break, tea or after the conclusion of the day's play, the spectators are allowed onto the field to stroll around. This is the best time to meet up with friends who are at other tents, or run into old classmates who you haven't seen since the dinosaurs roamed the Earth.\n\nA lot of boys, booze, and bromance leads to the inevitable clash or two—most often between good friends and not the two schools. They tend to resolve themselves, so it's best to just avoid and ignore. Unless you're\n.\nThere are designated tents for the different schools. It's usually considered\nfoolish to heckle Royal at a Royalist tent or vice-versa, but there are the brave few who manage to do this and get away with their limbs intact.\n\nIf you're an innocent bystander who's been coaxed to go to the match with your friend or significant other, you can flip a coin and decide to support a side. If your family hails from one school, and your SO from the other—well then, good luck navigating those murky waters.\nWhat are your favourite Big Match traditions and memories? Do tell us in the comments. If you won't be able to make it this year and want to keep track of the score,\nwill have excellent coverage. Also check out their\n.\n",
  "url": "https://www.yamu.lk/blog/the-big-match-whats-the-big-deal"
}