{
  "title": "The Hottest Buttered Cuttlefish (Top HBC for 2015)",
  "abstract": "These are some of YAMU's favorites spots for Hot Butter Cuttlefish, for 2015.",
  "author": "",
  "date_published": "11:45am",
  "content": "Ah hot buttered cuttlefish, our favourite Chinese dish that isn't really Chinese at all.\nwe had Barracuda taking our top spot but the HBC scene has actually gotten a lot more competitive and varied in terms of preparations. In light of that, this year we're extending the list to a top 10.\nOne thing you'll probably notice is the fact that many of the classic Sri Lankan Chinese restaurants like Chinese Dragon & Flower Drum haven't made the cut. While most of them are still quite decent and offer some very reasonable prices, they just don't match when it comes to the most important factor- the taste.\nThis year we're taking a slightly different approach by broadening our spectrum, so you'll see a mix of different cuisines, cafes and even clubs making up our top 10.\n\n\n\n\nStarting things off is the HBC at 168, which is incidentally the only veteran on this list. Two things we appreciated about this was that while the batter was \ncrispy, it wasn't dripping with oil and the pieces were just the right \nsize. A portion for three at Rs. 600 is also a pretty tough price to \nbeat. If you're trying to pick between the old school restaurants based on HBC this is what we'd go for.\nCSC is the odd one out on this list since it's the only club. This is one of  the two wet HBCs (those with a bit of a sauce) on this list (see #3 for the other). In fact it was CSC that came up with the dish initially, it just so happens happens that the imitators ended up doing a better job of it.\nSo we're cheating a bit with this entry but we think that ZaZa's batter fried calamari (Rs. 300) deserved to be on this list. It's technically not an HBC but we felt it would be unfair for it to not be included on a list of fried cuttlefish dishes. What you get is crispy, well seasoned calamari rings served with one of the best chilli mayo dips that we've had in a while. We generally drop in during their happy hour deal and get two of these for the price of one.\n\nThe best thing about the HBC at the Boat Haus Cafe is the fact that it's super fresh since they give you the day's catch, and the fact that you can decide how much you get (Rs. 270 for 100g). They prepare it with a batter that's thicker than most others but it isn't dense or hard. The real hero, however, is that fresh cuttlefish which works brilliantly with a heat of the added dried chillies.\nBeach Wadiya has been Bamba's most popular beachside restaurant for a while now. They recently had a bit of a fire but they were back on their feet in no time. What's unique about Wadiya's HBC is that they fry the cuttlefish in a \nthin bread crumb batter which was a great change up from the \ncontemporaries. The seasoning was also on point with a good balance of \nsaltiness and spice. The portion for Rs. 575 wasn't huge but still plenty for two.\n\nBarrucuda was our top dog last year but they find themselves relegated a few spots this time around. Truth is that there's very little separating our top 4. Their HBC is still excellent with a light, flavoursome and crunchy \nbatter on top of perfectly cooked cuttlefish . This one is very much in line with the classic HBC preparation, so purists will likely pick this over some of our top 3.\nThere's a good chance that you not have heard of Bixton Street Cafe. Partly due to the fact that they're very new and also because it's a small street cafe in Mt. Lavinia. All of their offerings aren't great but their HBC is definitely a standout dish. This one is both wet and crispy at the same time, essentially Colombo Swimming Club's preparation done better. It's got all the flavour of a classic HBC along with a creamy butter sauce which just makes it that much better.\n\nThe Station has become one of my favourite spots to hang back and grab a beer. One thing that took us by surprise during our last review was how surprisingly good their Sri Lankan Chinese was. Theirs is the culmination of everything that locals expect in a good HBC - crispy batter, well cooked cuttlefish, adequate spice and heat with a large portion at an affordable price.\nThe Boulevard was recently revamped into one of the best Thai restaurants in Colombo. This may be a controversial pick but we loved their Thai HBC. At Rs. 1350 it's the most expensive on this list by quite a bit, but chef Mama has really nailed it in terms of flavour and texture. This one is entirely different from the Chinese renditions since they add a lot more ingredients, a more puffy \nbatter and an almost glaze like sauce. You get to taste a bit\n of everything from salty to sweet to tangy, which makes this one our top pick for 2015.\n",
  "url": "https://www.yamu.lk/blog/the-hottest-buttered-cuttlefish-top-hbc-for-2015"
}