{
  "title": "The Weekend Wrap ",
  "abstract": "Here are a couple of things you can get up to this weekend.",
  "author": "",
  "date_published": "3:48pm",
  "content": "Here are a couple of events we recommend you can get up to this weekend.\nIf you missed Reinhard Kleist at the Galle Literary Festival, the German award-winning graphic novelist will be at the Goethe-Institut. Catch him today for a unique collaborative live drawing concert together with critical singer-songwriter Ajith Kumarasiri and his band of rock legends. The event is on the January 20\nat 6 PM. The Goethe-Institut is located at 39, Gregory's Road, R. G Senanayake, Colombo 7.\nWould you like to listen to musicals like 'My Fair Lady', 'Les Miserables', 'Camelot', 'Annie'? Gehan Cooray is teaming up with Soundarie David Rodrigo to treat you to a musically and dramatically rich programme ranging from the grand operatic works of Mozart and Puccini to the showstoppers of much-loved musicals when they perform at\nwill take place at the Bishops College Auditorium on the at 7:30 PM.\nFor all the ladies, it's Ladies Night at Playtrix Sports Bar. Gather your flock and spoil yourself. There will be a one for one on Somersby & Choco Mint Cocktails for ladies from 8 PM to 11 PM and free Beerpong Tournament for everyone. ( Free Registration starts from 8pm onwards). No 15, Boyd Place, Colombo 3.\nAre you an artist located in Kandy? Would you like to express yourself? Alliance Française de Kandy has set up a special wall for everyone at Alliance française de Kandy to express their thoughts on any form of Art. Should prove to be an exciting event. Head over to Alliance française de Kandy, 640/2, Peradeniya Road, Kandy.\nIf you can't visit the wild, the wild comes to you. From the Masai Mara in Kenya to the Serengeti in Tanzania, to the Lionel Wendt.\nis an exhibition of photography by photographers Amrit Rajaratnam and Shanik De Silva. The exhibition is at the Lionel Wendt Theatre on January 21st.\nTo wrap up your weekend, support local artists by visiting\non Sunday. The annual Kala Pola takes place on January 22 at Ananda Coomaraswamy Mw. The Kala Pola is an outdoors exhibition of paintings and sculptures featuring over 300 local artists.\nCheck out the\n.  The Sooriya Village hosts The Sooriya Workshop Series with none other than \" Shadow and Light \", an Indian Fusion band whose styles of music infuses Hindustani classical, pop, jazz, and electronic. The vibe is contemporary and cinematic. The Sooriya Village is located at No. 49, Skelton Road, Colombo 5.\nDrop In at the\nat both Colombo and Galle.\nThese are just a handful of events we think you will enjoy this weekend. For the whole list of events visit our page\n. Have yourself a great weekend.\n",
  "url": "https://www.yamu.lk/blog/the-weekend-wrap-93"
}