{
  "title": "The YAMU Lamprais Taste-Off (2015)",
  "abstract": "Lamprais is a classic and beloved Sri Lankan meal - the appropriated history of the Dutch empire on a plate.…",
  "author": "",
  "date_published": "1:52pm",
  "content": "Lamprais is a classic and beloved Sri Lankan meal - the appropriated history of the Dutch empire on a plate. Or a banana-leaf, more accurately. This is our 2015 taste-off of eight-contenders for the best lamprais in Colombo (in our opinion).\nThis tasty and self-contained meal is:\nIn our review, what we looked for is taste above all. A good lamprais is a flavor of symphonies, all working together, nothing out of place. We also looked for authenticity, but as long as they pulled off the\nof a good lamprais we weren't strict.\nPlease note that\n. There are excellent cooks that take orders in advance (like Jean and Jennifer) but we will cover those in a separate article. These are lamprais you can get on any given morning.\nWe start with the 'meh'. While these might be OK rice and curries, they're not good lamprais. None of them had the harmony and balance of the top contenders.\nRs. 320\nPerera & Sons has great distribution and this was the cheapest lamprais on the list, but it fell flat in terms of taste. This dish sorely missed a salty blachan and a balancing ash plantain, and the rice was oddly spiced with tumeric. The only real positive is that you get a pretty chunky piece of chicken. Besides that it was a bit of a weird biriyani/lamprais Frankenstein.\nNow we're getting to the good contenders. These won't leave you unhappy. These are good lamprais which we recommend.\nRs. 866\nSugar Bistro's lamprais was the most generous and looked quite appetizing. When it came down to taste, however, they didn’t quite deliver enough for the Rs. 866 price tag. If you order this, however, you won't be unhappy. It's a good lamprais.\nThe positives here were that they hadn’t skimped on any of the elements. The rice was pretty good, and the ash plantains were quite tasty. The letdown here was that the meat which, while cooked well, lacked balance of flavour and tasted a bit too peppery. That's a minor detail and if we were sitting at Sugar we'd be quite pleased. We just wouldn’t get it for take out at that price.\nRs. 350\nThe Pol Sambolaya lamprais was probably the biggest surprise of the lot. Pol Sambolaya is a humble buth kade at Colpetty Junction, but their lamprais can hang with the big boys.\nThe rice had the right texture and was well-flavored on its own - essentially for a good lamprais. This balanced out well with their blachan which had a bit of chili in it (not canonical but nice). You also get a sizeable piece of well-seasoned chicken. It’s not boneless though, so that maybe a bit off-putting to some. We enjoyed this lamprais and for the price it's a great value.\nRs. 350\n\nWe were a bit hasty at the beginning when it came to judging Green Cabin, so when we tried it again a few months down the line at Pagoda Tea Rooms, we found their lamprais to be far better with most of he key elements - frikkadel, blachan, a good piece of chicken, plus a tasty dollop of seeni sambol which though isn't in your typical lamprais was still welcome. So we're bumping them up the list to a far more respectable position.\nRs. 475\nDon’s Deli offers a mixed meat lamprais from a sweet little lady named Mrs. Flogesteen. It’s not entirely premade so you need to wait like 10 minutes while they pack it up. This actually turned out be one the best one of the lot, falling just a little short of DBU and Mrs. W’s.\nWe’d gladly have this for a lamprais fix. While some elements weren’t quite as good as higher rated places, their mixed meat preparation was fantastic. Nice mix of fatty pork and leaner beef and chicken. If the meat is one of the most important elements in a lamprais for you, then this one won’t disappoint. Quite satisfying.\nOur top three lamprais go above and beyond. These are classic lamprais, where all the elements combine for hearty mouth-happiness.\nRs. 400\nMrs. W has become a favourite among lamprais lovers in Colombo, and we can totally see why. Hers ticks all the right boxes each element sings.\nWhile some of the other places had stand-out elements, Mrs.W’s is just solid all around, which makes it an excellent choice for a small get-together. It comes with fragrant rice, two sizeable frikkadels, lightly peppered boneless chicken curry, ash plantains, brinjal and seeni sambol as well. It's also quite affordable at Rs. 400 and you get the satisfaction of ordering from a (admittedly sophisticated) home cook. You can place your orders by calling\n.\nRs. 500\nIn our blind tasting this lamprais looked the least impressive, but our opinion was quickly changed when we tasted it. This one is very well balanced and probably the most authentic of the bunch. This falls in 2nd place just behind Fab but at this point it's honestly a matter of taste. Some of us prefer the DBU rice (especially since they offer mixed meat) and they could legitimately share the top spot.\nThe rice here looks ordinary, but it's full of flavor. They really stew the samba in a hearty stock. Their mixed meat of chicken, beef and pork is delicious, but there was very little of it. If you like large portions you may be a bit disappointed here. An authentic lamprais is a delicacy and is not supposed to be big, but just be forewarned. That being said, the rest of the elements- frikadels, blachan, ash plantains and brinjals were all spot on as well. This is a classic experience, coming from the source, and you can't go wrong here.\nRs. 370\nOn the day of our main tasting all the Fab lamprais were sold out, which was a good sign. We showed up early the next day and it was dope. This was a nice modernization of the lamprais - an authentic flavor balance but with modern innovations like boneless chicken, bigger portion size and a deep-fried egg. At just Rs. 370 this one also hits the sweet spot in terms of price, and Fab has distribution everywhere.\nThe rice was well cooked, flavoursome and not too oily. The chicken was spicy and well seasoned with the blachan adding a bit more saltiness. This also comes with a seeni sambol that complements the rest of elements by adding a bit of sweetness. Only the frikkadel was a bit underwhelming, but that still wasn’t enough to knock this out of our top spot.\nSo that's our lamprais taste-off for 2015. To see what we thought in 2012,\n. Overall, we'd say that none of these contenders are bad meals, but some of them really personify a great lamprais. The savory rice, the textured meat, the salty blachan, the sweet brinjal and the special something that makes it all come together. Lamprais is a magical meal, and one that's best enjoyed with friends and family. This was just our opinion, so please share what you think in the comments below.\n",
  "url": "https://www.yamu.lk/blog/lamprais-taste-off"
}