{
  "title": "The Best Sri Lankan Reactions To The US Elections.",
  "abstract": "Creativity within the Sri Lankan social media sphere is booming bigly, right alongside the US elections.",
  "author": "Aisha",
  "date_published": "12:08am",
  "content": "As fear, frustration and excitement in the US of A was on the rise, creativity within the Sri Lankan social media sphere boomed bigly.\nWe know (or rightly assume) people are trying to move the hell out of there and migrate to Canada soon as results showed how close Trump was/is to winning, because\nWhile most Lankans are just sitting back and laughing at the rise of the memes, some  are truly horrified at the state of affairs while others are just planning out their shopping lists.\nHas the Dollar fallen yet?\n\n*fires up eBay*\n\nLets do this.\n\nIt's like Christmas came a month or so early.\nWaiting till them dollars to fall. So I can buy a Macbook Pro! :D\nGiven that this is politics, not everything was about shopping lists. It's sad, but it's also funny.\n\nCanada to build a wall to stop American refugees from crossing the border! Trudeau will make America pay for it.\nYup.\nFrom the first black president to a president endorsed by the KKK !\nmaking lighthearted but completely believable references to one of former president Rajapaksa's more hilarious election campaigns.\nMorally, ethically and multiple time financial bankrupt US Presidential candidate Donald Trump’s divisive campaign sunk to a new low last evening when he rolled out a look-a-like candidate R Sirisena, mirroring the same tactic employed by former President Mahinda Rajapakse.\nDespite all the entertainment, we're not completely oblivious to the eff-ups of our government. (Allocations for education has been slashed in half, while more funds have been granted to My3's office and for the telecom sector. #Yahapalanaya, but we've time to cry in despair about that soon after we finish enjoying the drama that's unfolding in the USA. It's rarely that we Sri Lankans get to watch another country go through almost exactly what we went through during our last elections).\nMeanwhile, My3 & Ranil to Ravi, \"Yako, patas-gaala, apey budget allocations increase karapang. Everyone distract-wela with Trump\"\nAh well.\n\n",
  "url": "https://www.yamu.lk/blog/the-best-sri-lankan-reactions-to-the-us-elections"
}