{
  "title": "The Greatest Hits of Dr. Lester James Peries; A Tribute",
  "abstract": "As a tribute to Dr. Lester James Peiris's memory and service, we selected 10 greatest movies he ever made.",
  "author": "",
  "date_published": "10:16am",
  "content": "It is true that the chronicle of Sri Lankan Cinema started off with the movie\nin 1947, but the true identity of our silver screen was established a few years after that. Because until then, all the Sinhala movies were recorded and edited in the studios, while their storylines were inspired by the traditional Indian films.\nIn 1956, Sri Lankan movie industry turned over a new leaf, as the very first Sinhala movie that was shot in the real world came out.\nThe man who was behind this path-breaking venture is Dr. Lester James Peries, the internationally acclaimed Sri Lankan Film Producer, Screenwriter, Film Director and a man who dedicated half a century of his life for the advancement of Sri Lankan film industry.\nHis late departure broke the hearts of the fans from all over the world. Throughout his life, he managed to create some of the most insightful showpieces that the world has ever seen. As a tribute to Dr. Lester James Peiris's memory and service, we selected 10 greatest movies he ever made.\nDr. Lester James Peries made his cinematic debut through the movie\n, which revolutionized our film industry. Instead of remaking the South Indian films and adapting them into our context, he considered the village life and their mythical beliefs in Sri Lanka, which turned out to be a movie that was well-received internationally.\nThe initial response for\nwas good, but slightly slumply as it wasn’t in-line with the popular expectations at the time. But it’s the only movie that was nominated for Palme d'Or, the highest prize awarded at the Cannes Film Festival in 1957.\nThis movie contains some of the best soundtracks of Sri Lankan movies which are still very popular among us.\nis the first book of the three-part novel written by Mr. Martin Wickramasinghe. The rural life of Sri Lanka, the urbanization, and how it propagated people's thoughts over generations have been discussed through these three novels.\nThe movie\n, directed by Dr.Lester James Peries was able to breath life into the characters we met in the book. It was indeed a groundbreaking creation in the history of Sinhala cinema, followed by two more movies;\n(1963) and\n(1964).\nShot entirely outside of a studio, using a single lamp and hand held lights for lighting,\nwas acclaimed locally and internationally. Golden Peacock at the International Film Festival of India, Best Director and Best Film awards at the 1965 Sarasaviya Film Festival are some of the many recognitions it received.\nis a movie that depicts the thoughts and emotions of the newly rich people who lived in the 60s. It's a story of a young man belonges to a rich family, who becomes embroiled in a murder cover-up, and how his dignity, mounting tensions and conscience make his life very unbearable.\nMany spectators tried to portray it as a French influenced movie, but Prof. Siri Gunasinghe defines it as the begining of the modern Sri Lankan cinema.\nThe love story of Dammi and Sugath, a mischievous girl and an introverted boy who studied in the same school, beautifully captured the classic teenage love. This movie was adapted by the popular romance novel of the same name, written by Mr. Karunasena Jayalath.\nThe imapact that\nmovie made, painted Sugath and Dhammi (Wickrama Bogoda and Anula Karunatileke) as the romantic icons of Sinhala pop culture in the 60s.\nSince then, there have been many romance movies in the Sri Lankan cinema, but the love we have over\n, hasn't been faded, not even for a little bit.\nAccording to the contemporary experts,\nis the greatest movie that was ever made into our film industry. Every aspect of this movie was a perfection, including its scripting, editing, music, art direction, and makeup. It's based on the short story of the same name, written by Mr.G.B. Senanayake, the prominent Sinhala writer.\nThe protagonist of this tale is Willy Abeynayake, a wealthy man who's sacrificing the life his wife (Irene), to achieve a treasure that belongs to an ancient king. This treasure is hidden in a rock cave, and unfortunately he is yet unable to get it.\nIt was too late when he realized that he lost the only treasure that really mattered, his wife Irene. He returns home with a heavy heart, and decides to hang himself after writing the story.\nThis movie went on to become the biggest attraction of the early 70s. It was awarded with Silver Lion of St.Mark at Venice International Film Festival, and also selected as one of the best 13 movies made in the 20th century, receiving a diploma, at Busan International Film Festival.\nThe bold but stubborn Upali, innocent Jinna and lazy Hinni Mahaththaya became well-known charaters to us through the beautiful young-adult novel\n, written by infamous novelist, Mr. Martin Wickramasinghe.\nThe movie that Dr. Lester James Peries made from that story, brought those characters into life. It's the first eastern coloured movie he directed.\nThis record-breaking movie was loved by thousands, and was screened in Savoy cinema hall for 70 days, and 80 days at the Lido Cinema.\nThe 70s is considered as the golden era of Sri Lankan film industry, and\nwas a triumph made in that decade.\nThe movie tells us about a dominating husband, who is a doctor by profession and refuses to be at his wife's side when she gives birth to their child. The wife dies during the childbirth, and he is forced to live with the specter of his wife hanging over him.\nThis brilliant film won number of awards at the very first Presidential awards ceromony held in 1979, including the prize for best director. It was also screened at Kairo Film Festival.\n\"The Village in the Jungle\" is a novel written by Leonard Woolf, an assistant government agent in the Southern Province during the British colonial period of Sri Lanka. It describes about a place called Beddegama, which is actually a tiny village surrounded by the jungles of Hambantota.\nLater on, this book was translated into Sinhala language by Mr.A.P. Gunaratne, which Lester James Peries used to construct the movie of the same name.\nWhile projecting the lives of the peasants who lived in Beddegama, this movie shows the sociological and political relevance at the time.\nDr. Lester James Peries took some liablity during this creation, without harming the original story. He chose several dry-zone jungles of Hambanthota to shoot this movie, and it helped to capture the harsh reality of the village life, the corruptions, and the fiery emotions in a perfect manner.\nIn the year of 2002, Sri Lanka was able to submit their first movie to the Academy awards, and it's yet another masterpiece of Dr. Lester James Peries.\nThe storyline of this movie is inspired by The Cherry Orchard, a popular drama written by the infamous Russian writer, Anton Chekhov. Apart from academy awards, this movie was well-recognized at 2003 Cannes Film Festival.\nThe last movie that was ever directed by Dr. Lester James Peries is,\n. It's a heart-touching movie of a widowed mother, Sumanawathi and her relationship with her three grown-up children, Premalatha, Kassapa and Saliya.\nSame says that Dr. Lester James Peries caged himself in a different frame, while rescuing Sri Lankan cinema from the Indian influence. But, the contribution he made to the movie industry of Sri Lanka, will always be remembered and admired.\nHe was truly a silver lining on our silver screen. Rest in Peace legend! You will be missed.\n",
  "url": "https://www.yamu.lk/blog/the-greatest-hits-of-dr-lester-james-peiris"
}