{
  "title": "The Battle of the Five Books",
  "abstract": "The Swarna Pusthaka Awards took place on the 9th of September and the winner has finally been crowned!",
  "author": "",
  "date_published": "6:55pm",
  "content": "September is the month of bibliophiles; the month when bookworms vanish amongst a stampede of smoke and screams to get to book sales and whatnot.\n\nThe \"\nAwards\" have partnered with Colombo International Book Fair (CIBF) and is one of the biggest events held to mark the Literary month. It is also a much-awaited prestigious prize among Sinhala Writers in Sri Lanka.\n\nIt's organized by the Sri Lanka Book Publishers Association (SLBPA), and takes place every September. Inspiring and encouraging a new generation of Sinhala writers to produce good novels that nourish the Sinhala literature is the purpose of this contest.\nIn\nAwards, the writers are given a certain time period to submit their books published in the previous year (For 2017 contest, writers have to submit books published in 2016).\nOnce the submission period is due, evaluation of the books starts, and it happens in three stages.\n\nAt the first stage, ten eminent judges\nin the first panel read every book that has been submitted. Based on mutual discussion they select 10 - 15 books for the second round, which will be investigated by the second panel of judges\n.\nshortlists five books for the final round. The responsibility of selecting the winning book for the\nAward is decided by the third panel of judges\n.\nIt's announced at the awarding ceremony which takes place in September at Bandaranayake Memorial International Conference Hall (BMICH).\nThe winning book gets a huge attraction and a reputation at CBIF. All the final round nominees are rewarded with cash prizes.\n123 novels were submitted to the 2016 contest, and the following five books were nominated for the final round.\n\n- Liyanage Amarakeerthi\n- Mahinda Prasad Masimbula\n- Sunethra Rajakaruna\n- Eric Illayapparachchi\n- Sumudu Niragi Senevirathne\n\nAs many of you might already know, the novel\nby Mr.Liyanage Amarakeerthi won the\nAward in 2016. It's the second time he received the honour.\n\nThe final round nominees of this year's contest were:\n\n- Sumithra Rahubadhda\n- Kathyana Amarasinghe\n- Keerthi Welisarage\n- Shamel Jayakody\n- Nishshanka Wijemanna\n\nThe competition was tight this year, as two of the previous\nAward nominees are selected to the final round. Both Mr. Shamel Jayakody and Mrs. Sumithra Rahubadhda are competing for the award this time. Mrs. Rahubadhda already won the\nAward in 2010, for her novel\n. Mr. Jayakody has been nominated to the final round in previous\ncontests. So it was as heated as could get.\n\nLast year’s cash prize for the\nAward winner was Rs. 500 000, but this time it has been increased to Rs. 750 000 which is pretty impressive. The nominees of the final round are awarded with extra Rs. 50 000 to their usual cash prize, making it to Rs. 100 000.\nAfter going head to head in this literary battle, a winner has been crowned!\nThe novel\nby Nishshanka Wijemanne won the Swarna Pusthaka Award this year.\nWe wish Mr. Wijemanne all the best!\nIt's all over now, so what to do in the meantime?\nFor you bibliophiles, you get to finally look attend to your favourite event of the year, CIBF which is to be held on 15th - 24th of September. See you there!\n",
  "url": "https://www.yamu.lk/blog/whats-happening-with-swarna-pusthaka-awards-2017"
}