{
  "title": "The Veg Roundup: 10 Vegetarian Options In Colombo",
  "abstract": "Funnily enough, Sri Lanka isn't the most vegetarian friendly country. Here's a roundup of some of the few quality places…",
  "author": "Shifani",
  "date_published": "11:46am",
  "content": "Sri Lankan restaurants are generally not all that concerned about vegetarians and vegans, save for the salad starters, but the scene is probably better than it was about a decade ago.\nHere's our roundup of some of the reliable places in Colombo that are veg-friendly. As usual, if we've missed out on places or even if you know of an excellent vegetarian dish you had at a regular restaurant, share it with us in the comments.\nShanmugas is one of the oldest and most reputed vegetarian Indian restaurants in the city. They're comparatively pricier, but the food, a bit on the spicy side, is very good and the service is excellent. The ghee masala dosai here is one of the best we've had in a while, the potato masala, sambar and chutneys coming together nicely.\nJeewa's Polos & Kuma's Natural Foods is one of our big favourites at the Good Market at Diyatha Uyana. It's probably the most affordable stall on the block, and if you're in the neighborhood the food here is very simple, very tasty Sri Lankan stuff. Jeewa's serves meat, but also has an extensive range of local vegetarian options such as pol sambol, jackfruit (polos) and mango chutney. My own favourite is the pol roti and lunumiris for 50 bucks. Note that the Battaramulla Good Market is only open on Thursday and the Racecourse one is on Saturdays.\nDelicieux is one of the very few home bakers who make amazing cakey delights that are totally vegan. The Klubnika, a gooey double chocolate cake featuring strawberry puree, is a winner, with a silky smooth texture that us lick our spoons clean.\nSmokey's is the other home baker on this list. She makes some amazing brownies, that happen to be vegan as well. Best part about this is the portions, you get a generously massive six-pack box of soft yummy brownies that are more like a dozen, for just Rs. 570. The peanut butter brownies are a wonderful treat.\nMilk & Honey is one of the few places to try out for healthy and vegan options. They've got a big range of mocktails and wraps that are totally vegetarian and well-prepared, and great for a snack in a quiet atmosphere. I liked their cheesy seeni sambol sandwich - also, watch out for the vegan cookies.\nQuick Thai isn't a vegetarian restaurant, but if you'd like some veg options, they do a few very good ones. We still haven't sampled truly authentic Thai in Colombo but these guys come close, with their simple but satisfying preparations often carrying that familiar hit of lemongrass. From the large portions of Thai veg curries to the basil fried rice, this is one of the few non-Indian places that can make vegetarian food tastily. Try out the mango salad.\nSaraswathie Lodge is a great place for veg food and it's total value for money. It's one of the very good ones among Colombo's saivar kades (some others being\nin Pettah and\nnear the Colpetty junction). The restaurant itself is very clean, open and runs quite efficiently - we really like their Madras Meals, the most expensive thing on the menu (Rs. 200), which is a great big silver thali of rice laid out on banana leaf, served with a bonus vade, surrounded by a bevy of tasty curries.\nKrishna is an easy, reliable stop for vegetarian food at the Arcade food court. Biriyani, paratas, dosa, they've got it all. We've had takeaway from here once, and tried out the biriyani combo, which included rasam, chutney, onions, and a square of Indian sweet, for Rs. 230. It was actually pretty tasty, with plenty of vegetable chunks, a very spicy chutney, and a nice strong hint of thick masala in the rice.\nParadise is a small joint next to the Sri Sambuddhatva Jayanthi Mandira (Buddhist Cultural Center), so this is one of the very, very few pure Sri Lankan vegetarian stops in the city - good for rice and curry. Actually we're not sure if there are any others, although you can always go to\nand pick out the veg curries from their extensive buffet. The prices are easy on the wallet and they've also got a good juice bar.\nFoodie Adventure is a home cook in Nawala that does take away and delivery. We tried a bunch of her stuff and pretty much all of it was amazing. While she does both veg and non-veg, her quinoa burger in particular was a very pleasant surprise. Quinoa is actually very rare and healthy so this is probably the best choice for a guilt free burger. For those looking for greener options, her salads are also very good.\nAlternatively you can check out\n. The list includes\n,\n,\n,\n,\n,\n,\nand\n.\n",
  "url": "https://www.yamu.lk/blog/the-vegetarian-roundup"
}