{
  "title": "Things To Do This Christmas Season",
  "abstract": "A round up of festivities this Season.",
  "author": "Rishani",
  "date_published": "3:49pm",
  "content": "Christmas is just a handful of weeks away, and so we're putting down a list of all the Christmas events taking place this season in and around Colombo so you, your friends and family can partake in the festive cheer this season.\nThe annual Carol Service of the Kollupitiya Methodist Church will be held as per tradition on Christmas Eve, December 24 at 6 PM in the Church.\nDate: December 24\nTime: 6 PM\nPlace: Kollupitiya Methodist Church, 252, Galle Road, Colombo 3.\n\nThe carol service of the St. Andrew's Scots Kirk will include music by Sussex Carol, Once In A Royal David's City, A Great & Mighty Wonder, Good King Wenceslas, In Dulci Jublio, In The Bleak Mid Winter and more. The Choir will be Voice of Praise conducted by Denham Pereira. The minister taking the service will be Rev Gary VanBrocklin. All are welcome.\nDate: December 15th December\nTime: 6:30  PM\nPlace: St. Andrew's Scots Kirk, 73, Galle Road, Colombo 3.\n\n\nChristmas Celebrations with Weligama Marriott. Spending Christmas in South Coast, has never been this fun as the country’s first and only Marriott resort brings you an array of a feast complimented by inventive drinks and live entertainment.\nDate: December 24 - 24\nTime: 7 PM - 11 AM\nPlace: Weligama Bay Marriott Resort and Spa. Matara Road, Pelana, Weligama\n\n\nA musical evening with Melissa Pereira & Lydia Goonetilleke to kick start the Christmas spirit.\nDate: December 8.\nTime: 7  PM- 9PM.\nPlace:\n\n\n\nHot waffles with nutella and a bit of shopping on a Saturday or Sunday evening enjoying some accoustic music? That's what the Jingle Mingle market is all about.\nDate: December 9 - 10.\nTime: 3 PM - 10 PM.\nPlace:\n\nGet an early start on your Christmas shopping with The Christmas Market at Hilton with over 30 vendors to choose from. Share the love this December with unique Christmas goodies prepared by the Pastry Chef Ranjith and his team.\nDate: December 9.\nTime: 10 AM - 6 PM.\nPlace:\n\n\n\nLook forward to an abundance of delicious, beautifully packaged edible Christmas Gifts during this two day sale. A selection of Christmas hampers, aprons and tableware will also be available.\nDate: December 16 - 17\nTime: 10 AM - 5 PM\nPlace:\n\nDate: December 17\nTime: 6 PM - 9 PM\nPlace:\n\nCarol service of the St. Mary's Choral Group, with participation of the Children's Choir of St. Mary's Church and guest performance by the Peterite Chorale. A collection will be taken after the event in aid of Samata Sarana.\nDate: December 16\nTime: 7:10 PM - 8:40 PM\nPlace:\n\nThe De Lanerolle Brothers are all prepared to make your Christmas a Rockin-Holly-Jolly one. Come and be merry in this festive season when magical Christmas Carols are sung and delicious food served on table.\nDate: December 5\nTime: 7:30 PM - 9:30 PM\nPlace:\n\nPeople's Church presents 'Christmas With The Star' - an elegant evening of Christmas music, directed by Soundarie David Rodrigo, starring Dinushka Jayawickrame, Maxie Rozairo, Noeline Honter, Sunil and Piyal Perera, Rukshan Pereira and Umara, along with the People’s Church Vocal Ensemble, as well as its well known soloists.\nDate: December 12 - 13\nTime: 7 PM - 9 PM\nPlace:\n\nAn afternoon of interactive storytelling that will lead children on an enchanting journey. For children aged 4-8 years.\nDate: December 17\nTime: 3:30 PM - 5 PM\nPlace:\n\nAnnual Christmas Carols, performed by the students of Alliance Francaise de Colombo, will be held on the 16th of December 2017 from 6.00PM onwards at the Alliance Francaise De Colombo Auditorium at 11, Barnes Place, Colombo- 07. Carols will be sung in French, English and Sinhala.\nDate: December 16\nTime: 6 PM\nPlace:\nIt’s time to build your very own Gingerbread House! Put your chef hats on and get ready for a sweet treat! Decorate with marshmallows, Smarties, Colored Royal lcing and more as you take fun pictures with a seasonal selfie board. Enjoy a Christmassy Snack Buffet, and have your picture taken (and framed!) with the jolliest man on earth.\nDate: December 16\nTime: 10 AM - 12:30 PM\nPlace:\n\nSri Lanka Tourism Promotion Bureau (SLTPB) together with other tourism institutions under the Ministry of Tourism Development and Christian Religious Affairs will be organizing the ‘Tourism Fest with the Spirit of Christmas'. This Festival will have a variety of activities to keep the visitors entertained such as a Food Festival, Christmas Choirs, Kids Entertainment, Fireworks, a Bazar and many more.\nDate: December 20 - 23\nTime: 6 PM - 12 PM\nPlace:\n\nSenior and Primary Choirs from the St.Peter's College Gampaha branch present Christmas Carols followed by crib competition, live music and other festive fun.\nDate: December 8\nTime: 3:30 PM - 9:30 PM\nPlace:\n\n\n\n'Tis the season to be jolly!! So kick start this Christmas season with Flamingo House's December installment of DOUBLE TROUBLE! One venue, two levels, four DJs spinning epic tunes all night long!\nDate: December 8\nTime: 8 PM to 4 AM\nPlace:\n\n\n",
  "url": "https://www.yamu.lk/blog/things-to-do-this-christmas-season"
}