{
  "title": "Top 10 Sights & Sites in Colombo",
  "abstract": "The most iconic buildings, religious spots, and views in Colombo.",
  "author": "Kinita",
  "date_published": "10:00am",
  "content": "The best part about a tiny city? How easy it is to be a tourist. Here are some of Colombo's must-see parks, structures, and gathering spots. All historic, all with their own beautiful stories of inception and re-birth, and mostly free!\nFor more details, in-depth history, and photos, click on each title below.\nGangaramaya temple isn't just a temple - it's about 150 years old and most of its space is cluttered with museum artifacts and old and somewhat random donations like wrist watches, currency, and art.\n\nFirst set up by Venerable\n, it's gotten some flack for trying to be both a Buddhist temple and a tourist attraction, but we think that it's got a very quirky charm of its own.\nThis temple raised on platforms on the Beira Lake is probably the most beautiful place in the neighborhood - it's a peaceful and unexpected piece of art that was designed by Geoffrey Bawa and funded by S. H. Moosajee in the 1970s.\nIt's also just next to the Gangaramaya Temple, and you can enter here with the same \"donation\" price and ticket. Walk around it for some serene views and meditative vibes.\nDutch Hospital is literally a hospital from the Dutch colonial era that has been restored by the UDA and is now an upscale shopping and dining precinct. You'll find some of Colombo's best dining (\n), shopping (\n), and spas (Spa Ceylon), and a lively crowd at night.\nAfter over a year of refurbishment, Colombo's only proper museum (the\nand the weird\none barely come on par) is up and running again. This Italianate colonial style building houses statues, artifacts and paintings that go way back in Sri Lanka's history.\nWhile the main museum up front is your typical exhibit space, with good lighting, updated labels and organized sections, the museum premises also includes the Natural History Museum which is pretty old, weird and utterly fascinating (in a decrepit way).\n\nGalle Face Green is the big city's main park. It started out as a place for the British to host games of golf and horseracing, but today it's where everybody rushes to, for some kite-flying, isso vade and ocean watching.\nOn a Sunday at 4PM it feels like literally everybody in Colombo has gathered here on cue, since it has no entrance free, and fringes the sea. Regardless of who you are, the wide view of the ocean, the sky changing colours at sunset and the harbour lit up at night have their undeniable charm.\nIndependence Square remains one of the nicest places to relax in Colombo, especially in the evenings. In addition to the memorial hall itself, there's also the huge sprawling green lawn outside, the\n,\nnext door, and even hoppers at\n. Completed in 1953 to commemorate our independence from British rule, it's a historic monument, but also a great gathering place for dates, joggers, and protestors alike.\nConstructed in 1908 in the Indo-Saracenic style, the Red Mosque is a historical landmark and recognized as one of the oldest mosques in Colombo. It was apparently used as a landmark by sailors who came to Colombo from afar. It's a beautiful building, but they're a bit iffy about allowing women inside\nAn Edwardian monster with sections in the Doric, Ionic and Corinthian classical styles it was built for the British by the prolific Wapchi Marikar baas (the man behind the National Museum, and the New Town Hall). It served not only as a post office but also as the site of the country's fist telegraph and telephone exchanges.\nThis is one of Colombo's grandest public buildings, but it was closed to the public for years as part of a high security zone. After the war the street opened up, and 2016's Colomboscope re-introduced the location by holding art events there. We're not sure what the future holds for this gorgeous structure, but we're hoping it's a gallery!\nViharamahadevi Park, known earlier as Victoria Park, is Colombo's only central park. It's been done-up for quite a while now and it looks great, especially in the evenings. It features a lot of little sights and sounds within itself, like the Buddha Statue, the Victoria Statue, the Rock Aquarium, pony rides, and loads of cheap snacks.\nThe Sri Ponnambalawaneswaram Kovil (or the Sivan Kovil) is situated just a few metres away from the St. Anthony's Church. It's easy to find thanks to its white walls and the occasional sound of the brass bell piercing the air. It's been around since 1905, and it's a go-to place of worship for many practicing Tamils and Hindus alike. You'll see a plethora of different shrines and statues dedicated to different deities each with a different cause. It gets busy from 10AM - 12PM because of the\nceremony and dozens of people milling about.\nIf you want to know how to fit these into a weekend in the city,\n! Happy exploring.\n",
  "url": "https://www.yamu.lk/blog/top-10-sites-in-colombo-srilanka"
}