{
  "title": "Trail 2016 : Daily Blog",
  "abstract": "A daily update of what's happening on the road at Trail 2016!",
  "author": "Staff",
  "date_published": "2:06pm",
  "content": "We are at the halfway point of our Trail with 14 days down and 14 more ahead of us. Today we walked 20km from Daldagama to Padeniya.\nWe've been fortunate to see so many gestures of kindness and compassion along the way, with people from all walks of life eagerly contributing to our cause.\nAlong the route thus far we have managed to collect over Rs. 8 million. Together as one Sri Lanka, we can heal our nation one step at a time.\n\nWe've completed Zone 5 of Trail 2016! Today we walked 27km from Padeniya to Kurunegala.\n\nIt's been an amazing journey so far, and it's humbling to see the commitment of our fellow Sri Lankans as they brave the heat and walk with us to unite and heal our nation.\nAlong the route so far, we have collected over Rs. 8 million in donations thanks to the generosity of Sri Lankans in the North and North Central regions. As we walk towards the South, this generosity remains the same. We are thankful to the communities in and around the greater Kurunegala area who came forward with their donations towards Trail 2016.\nToday we walked 24 km from Kurunegala to Pannala. It was heartwarming to see the support from the communities we passed along the route today. Children were eagerly waiting for our Ambassador Mahela Jayawardena so that they could catch a glimpse of a cricketing legend. As soon as they saw him, they erupted in applause and scrambled to give him their donations.\n\nFamilies lined the roads to give us their savings. Many of them didn't have a lot of money to give, but that didn't stop them from contributing as their generosity knew no bounds. This is what Trail is all about - people from all walks of life uniting under a common cause, our nation's fight against cancer.\n\nToday, we walked 22 km from Dampalassa to Pannala. It was a rainy day which made for a fun walk for everyone as they all got soaked. The rainy weather was a welcome reprieve from the heat of the past 17 days, and everyone had a great time as they raised funds for a good cause.\nThere was a huge crowd today, and amazing support from the surrounding communities. It was quite special to have members of the indigenous community of Sri Lanka walk with us to show their support for Trail 2016's mission to unite and heal our nation.\nOur organizers, sponsors and partners did a stellar job making sure the walk ran smoothly despite the rain and we'd like to say a big thank you to them for always seeing the day's events through.\n\nToday, we walked 21 km from Pannala to Kochichikade. Some of our country's cricket stars, Rangana Herath and Jeevan Mendis, joined us on the Trail today in support of our fight against cancer.\n\nWe met several locals who battled cancer themselves and donated to us as we walked past. Although they had low incomes and couldn't afford to give us a lot of money, their hearts were full and they still managed to contribute whatever they could. It is touching to see the selflessness and generosity of our fellow Sri Lankan's, it motivates us to keep walking. And this is why we Trail.\nIt was a rainy 23 km from Kochchikade to Ja-Ela today.  As we hit the tail end of Trail 2016, the monsoon weather has started to catch up with us, but our energy and enthusiasm for this cause remains high. Our walkers, although soaked to the bone, trooped through and continued straight on till the end point.\nThere were many supporters waiting to encourage us, so despite the gloomy weather we were motivated to keep walking. We continued to see the same generosity as before, with people standing in the rain to donate money to our till collection.\nThis walk has opened our eyes to the beauty of our country and its people, who have full hearts and giving spirits, which makes our 28-day journey easier and more fulfilling.\n\nwe will be walking from Ja-Ela to Galle Face Green.\nNo mandatory registration or fees, the walk is open to all!\n, and we hope to see you all there!\n",
  "url": "https://www.yamu.lk/blog/trail-2016-daily-blog"
}