{
  "title": "Travel Tips For The Season",
  "abstract": "If you're planning on heading out of the island this holiday season, we've got a few tips that might help.",
  "author": "",
  "date_published": "11:51am",
  "content": "Christmas is almost here! It’s also probably the most anticipated time of the year and the time when everyone starts to think about where to travel with all that sweet sweet leave they’ve got saved up. That being said, travelling can be a bit tedious, so we put together a few tips for those looking to travel this season.\nP.S- In case you haven’t decided where to travel yet, here are\n!\nis a travel app that we discovered a few years ago and it’s an absolute godsend. The app functions as a travel planner and aggregator, basically collecting all your itineraries, hotel bookings, booked activities from your email and put in down in an easy to read timeline with all the booking information and relevant maps.\nover doing this manually on something like Excel. One of the most useful features here are the notifications, through which Tripit will remind you a few hours before your next flight, hotel check-in, train, etc. It’s just incredibly convenient, easy to use, and takes away the need to check multiple apps.\nWhen you’re out of the country your passport is the single most valuable item that you’ll carry with you. So if you somehow end up losing it, you’re kinda screwed. Which is why it’s super important to carry multiple copies of your passport and ID with you. Our best advice would be to put a copy in each of your bags, as well as take a photo of the passport bio page and the relevant visa on your smartphone. This way even if you do end up losing your passport, you’ll have some proof to back up an inquiry.\nTravelling almost always means spending, especially when it’s during the season, and it makes sense since you want to make the most of it when you’re in a foreign country. The only issue is that we Sri Lankans tend to prefer cash over card, which is why super important to NOT keep all your cash in one place. You want to split your cash and store it in about three separate places like inside an unassuming sock, a hidden compartment in your backpack and even in a travel partner’s luggage.  This way even if you do find yourself in an unfortunate situation where you lose your wallet or get pick-pocketed, you won’t lose all your money.\nWhile your toothbrush and toothpaste will almost always travel with you, it’s not really the most convenient way of freshening up your breath when you’re on the move. A small bottle of mouthwash on the other hand will fit in just about any backpack or handbag. You’ll usually find yourself doing a lot of walking when exploring new areas and it’s easy to get dehydrated, which inevitably leads to bad breath. So a handy mouthwash is a quick and easy fix in case you need to speak to someone for directions. Bonus points if you can actually get your hands on a small bottle like the one in the pic above (50 ml) so that you can take it in your carry-on luggage.\nIf you’re travelling during the season, you’re either getting cold weather to the West or warm weather to the East. So depending on which way you’re headed, you’re going to want to carry either a small bottle of moisturizer or sunscreen with you. The moisturizer is almost a must since we Lankans do not handle low humidity well at all, while on the other hand it’s easy to be a bit panditha about warmer climates and come back about eight shades darker, since we’re all about that tan.\nA power bank is something everyone thinks of taking with them and then somehow forgets about it at the last minute. Google Maps and GPS are your best friend when you’re travelling. Unfortunately, they also tend to drain a significant amount of battery. Combine that with constant data usage and other frequently used travel apps like tripadvisor and you’re looking at around 40% more battery usage, which in most cases will result in less than a full day of juice. If you’re not a fan of having a cord sticking out of your phone for long, grab a\n. So yeah, do yourself a favour and don’t forget the power bank.\n",
  "url": "https://www.yamu.lk/blog/travel-tips-for-the-season"
}