{
  "title": "Travel Essentials for the Gallivanter in Sri Lanka",
  "abstract": "Things you need to pack if you're exploring Sri Lanka!",
  "author": "Aisha",
  "date_published": "2:48pm",
  "content": "With our gloriously long weekends and multiple random holidays (25 national holidays\n, amirite?), there are plenty of opportunities to get out and explore the country; be it balmy beaches or cooler climes in the mountains.\nThere's also a ton of stuff we ought to carry along, but tend to forget because they're such everyday items that they slip your mind. Keep a little travel-bag aside with these essentials so you're always covered. Shifani made these cool illustrations to help you remember, because everything's more memorable with cartoons.\nThis is what I most commonly forget. I keep thinking that the hostels/ hotels would have it, like those teensy tubes they give in-flight, but nope. Never understood how there's always soap and shampoo, but no toothpaste, but that's how the world is. Always keep a tube of toothpaste ready, unless you're ok with people thinking you've got halitosis.\nBecause you need them in trains. And if you're hiking and need to go feral. Either way, there's nothing to lose with tp, so take it along.\nA lot less trouble than water, and also more efficient. You can get little vials of this from any supermarket, and while you\nsurvive a trip without this, it'll be because you're ready to deal with germs you picked up on the way. Honestly though, this is a necessity if you're making the most of your trip, gallivanting around, and need to quickly wipe your hands clean before (and after) grabbing something to chase the munchies away. At the very least, carry wet wipes.\n(Just read\nfor confirmation). As well as being just a towel, it can also double as a blanket, a shawl, or a carpet in extreme circumstances. Plus, if you irresponsibly forget your toothpaste, you can borrow some off your travelling partner without feeling like too large a doofus by off-handedly pointing out that\nOne word: mosquitoes. It'll also help keep other annoying bugs at bay. The smell is rather strong so you mayn't particularly enjoy it, but it's better than being bitten and stung by a hundred un-swattable little things that clamour for your blood. Slather across skin generously, and chill in peace.\nYou can never, ever, ever go wrong with extra pairs of these. What if you step into a deep puddle of mud, fall into a paddy field, trip into a stream and don't have a change of dry clothes? Ugh. Plus if you're particularly appealing to bad luck, you could break your shoe. Just take one extra pair along, even if it's a regular pair of batas.\nWe're literally surrounded by water. We also have some amazing waterfalls and rivers. It's unlikely that you'd\npass by any of these; and even if you're planning on cocooning yourself up in a hotel, there'd be a pool. Take one along, because as islanders we also ought to be water babies.\nDon't get discouraged when your friend laughs at you for packing band-aid because \"You're more likely to break a leg, and you're bringing along a\n?!\". I've had shoecuts, and they're\n. You'd at least get a lot of care and attention with a broken leg, but that ain't happening when you get a shoecut and you suffer in silent agony. A bandaid can easily fix this, so why not take one along? Plus panadol and immodium for sudden headaches and bad stomachs.\nThese are superbly multi-purpose. Get one that's wide enough to keep you warm when there's a sudden hill-country chill, or more importantly to cover up when you're suddenly in a dubious area, need to take public transport, or need to enter a religious building. If the shawl is wide enough it can serve to cover your shoulders or act as a sarong or beach wrap too.\n",
  "url": "https://www.yamu.lk/blog/travel-essentials-for-the-gallivanter-in-sri-lanka"
}