{
  "title": "Truffle Festival at Casa Colombo",
  "abstract": "Casa Colombo's menu dedicated to truffles deserves props, but the dishes are a mixed bag.",
  "author": "",
  "date_published": "11:44am",
  "content": "Few ingredients are as prized in the food world as truffles—not the\nchocolate kind, although those are prized as well—the odd, pebble-shaped\nthat\nare so rare and expensive that they routinely sell for\n. With most of the high-quality truffles in\nthe world unearthed in France and Italy, it is far from easy to get your hands\non the aromatic 'shroom. So when we heard that Casa Colombo had gone so far as\nto dedicate a whole festival to the fungi, we were intrigued. Although we don't\nroutinely feature promotions, this one was too momentous to miss.\nWe've said it\nof times before, but it's impossible to not be struck by\nthe colourful eccentricity of Casa Colombo when you walk in. A cross between a\nstately colonial mansion and a kitsch-loving designer's wet dream, the hotel's\nsweeping expanse is filled with several water bodies and seating areas, and\nquirky touches like a glittery, gilded ceiling that would put South India's\ngold fixation to shame. The relentless quirkiness can be a tad over-the-top,\nbut on the flip side, it's nice to be able to enjoy fine dining without the\nfussiness.\nTruffles were the sole item on our agenda. With an understandably compact\nmenu of just a couple starters, half a dozen mains and one side of truffle\nfries to choose from, it didn't take us too long to place our order. But the\nrest of the evening didn't proceed as speedily. Although there were only a few\ndiners, the kitchen seemed to falter under the strain of the orders.\nOur appetiser, vol-au-vents made of puff pastry\ntopped with a smidgen of porcini mushrooms and truffle cream, disappeared in\nthree swift bites. Crisp, buttery and soaking in the signature muskiness of the\ntruffles (even though the topping was seriously small), there was little to\nfault about this perfectly executed appetiser.\nOn the flip side, our appetite was now stoked and there was no food in\nsight. After a whole hour had passed, our mains finally began to appear. The\nservice gaffes wouldn't end there, though — instead of the porcini risotto I\noriginally ordered, I was served fettucine. But to their credit, the kitchen\nrapidly rectified the mistake.\nOf the mains, the tagliata-style grilled beef steak (Rs. 3,250) looked like\nit had been plated hastily, with a pile of iceberg lettuce (instead of the\npromised rocket) plonked in the middle of slices of steak.\nAlthough the meat was done to a perfect medium, a little more seasoning\nwould have gone a long way towards adding depth of flavour to this dish.\nDespite the truffle shavings that had been sprinkled on top, it didn't floor us\nin quite the way we had expected both in terms of fragrance and\nflavour.\nThe home-made gnocchi with tiger prawns, clams and black truffles (Rs.\n2,250) came smothered in a rich, cream-based sauce infused with truffle\nflavour. Soft and pillowy, the gnocchi certainly passed the test, and paired\nwell with the sweetness of the prawns and clams. We would have liked more of a\ntruffle punch though – as well-seasoned as it was, the creaminess of the sauce\nseemed to overwhelm everything else.\nAlthough it didn't come in the promised pecorino cheese basket, the porcini\nrisotto with black truffle (Rs. 2,500) was still our unanimous pick of the\nthree mains. A substantial serving of creamy and aromatic rice, cooked just a\ntad over al dente, it came with a small pile of micro-herbs on top. The\nmeatiness of the porcini mushrooms generously distributed throughout the\nrisotto paired perfectly with the earthiness of the truffles. Surprisingly, the\nmicro-herbs weren't simply there for visual effect: the tiny bites of sharpness\nadded an interesting counterpoint to the overall richness of this nuanced\ndish.\nHaving tried a fair share of truffle fries (usually, with just a whiff of\ntruffle oil by way of flavour), I was sceptical about an ambitious menu\ndedicated solely to the funky fungus. Casa Colombo's new menu deserves props\nfor attempting it — and doing justice to the ingredient for the most part. None\nof the dishes we tried skimped on truffles, and a couple of them were pitch\nperfect. However, some others were let down by tardy service and not enough\nattention to detail. Given the beauty of the ingredient and the price you pay\nfor it, that's a bit of a shame.\nThe truffle menu is available till mid-September. It is in addition to the\nregular menu. Call the hotel on 011 4520130 for details.\n",
  "url": "https://www.yamu.lk/blog/truffle-festival-at-casa-colombo"
}