{
  "title": "TV Shows Sri Lankan Kids Grew Up With In The 90s",
  "abstract": "Because the 90s are always relevant.",
  "author": "Aisha",
  "date_published": "12:20pm",
  "content": "When the new millennium is nothing short of simultaneously mind numbing and mindblowing in every possible way (entertainment, politics, world affairs...) there is little we can do other than to reminisce about the good old days. Mainly, the 90s, because let's face it, it was a simpler and awesomer time.\nWith one of the most amazing intros of all time, Knight Rider was a family favourite featuring a smart and sassy car,\nMichael Knight, and classic action packed sequences between the bad guys and the good guys.\nDealing with the everyday drama of a large family (nine altogether!) 7th Heaven follows the story of Reverend Eric Camden's family and neighbourhood. The storyline instils family values, morals, and lessons without being too preachy and is one of those rare shows your parents would encourage you to watch.\nRemember Neri? A mysterious girl who lived alone on an island, with superhuman capabilities to swim for longer than usual and possess an amazing lung capacity. It's an ecological sci-fi series, where conservation and animal communication is touched upon and intertwined with more personal stories of Neri embarking on a quest to find what her father was trying to do before he died.\n\nA classic and much-loved sitcom, the Fresh Prince features Will Smith playing his goofy, comical, and incorrigible self. The theme song is a story in itself as it outlines how the rough and ready Will gets into a fistfight in school and is sent off to live with his very posh aunt, uncle, and cousins in Bel Air. Hilarity and adventures ensue, especially as he joins a new school.\n\n\nImagine suddenly finding out that you and your sisters are actually\nin the modern world! This is like the adult version of Sabrina the Teenage Witch, minus the teen drama, and where their combined powers make them almost invincible. Needless to say, these witches weren't the ones nightmares were made of.\n\n\nThere's no chance that you haven't heard of, read, or watched at least some of Enid Blyton's works — and the Famous Five is one of her most popular series that proved to be a hit here as well! I remember they used to show a dubbed version as well. Not to be confused with the Five Find-Outers and Dog, the FF trailed Julian, Dick, George, Anne and Timmy as they somehow or the other managed to get entangled with smugglers, gipsies, kidnappers and whatnot.\n\n\nThe 90s was a haven for everyone who loved science fiction, fantasy, historical fiction and everything in between, and we're actually really blessed to have experienced the best of TV. Loving dinosaurs was practically a thing, especially with TV shows like this and then the Jurassic Park movies. The Lost World was based on Conan Doyle's book, where a group of intrepid explorers crash into the Amazon and land in 'the lost world' - a part of Earth untouched by time where dinosaurs run free.\n\n\nNickelodeon doesn't make series like this anymore. You need to employ a bit of suspension of disbelief with Skeeter because he's a puppet who's living an ordinary life with an ordinary family, except that there's absolutely no mention made of him being a puppet.\n\n\nBack when Mary-Kate and Ashley Olsen were wee little toddlers, Full House is a coming of age comedy series of a young father who tries to bring his three daughters up after their mother's death. You meet the insanely sassy and wise for her age Michelle (played by the Olsen twins), an adorable set of twin boys, and their older siblings — all being taken care of by their father, his best friend, and his brother in law.\n\n\nA grumpy extraterrestrial's spaceship crashes right into the home of an American family, who doesn't think twice (okay, maybe they did) about adopting the furry fellow and giving him a place to stay as they try fixing his spaceship back. All this is done in secret of course, because you know how freaked out the American government gets whenever an illegal alien lands in the States.\nSome of these are definitely pre-90s, but like Bhagya's\n, this list is based on when it was broadcast on local TV. We had a tough time narrowing it down to 10 shows, given the variety we had back then.\n",
  "url": "https://www.yamu.lk/blog/tv-shows-sri-lankan-kids-grew-up-with-in-the-90s"
}