{
  "title": "Uncaged Bites : Grilled Chicken",
  "abstract": "Sri Lankan bites haven't changed in ages. With Uncaged Bites we're looking at the bars and restaurants looking to change…",
  "author": "Staff",
  "date_published": "3:04pm",
  "content": "Bites have been a staple at Lankan parties, reunions and gatherings for decades. It’s like our signature local take on tapas only with more character and spice! Now the issue about all things Sri Lankan is that we don’t generally like to change things once we’ve found a formula that works. But after like 20+ years, it’s about time we changed up our favourite bites with more of a modern twist, in a way that it complements the new drinks we’ve also got.\nWith Uncaged Bites we’ll be looking at a bars and restaurants around Colombo who are doing just that! Each month we’ll feature a classic Sri Lankan bite as well as the new versions around town by some of our favourite bars and restaurants that aren’t afraid to break the mold and come up with some really ambitious bites.\nIf we’re talking staples, grilled chicken is right up there. Not only is it the most eaten meat on the island, it’s also the perfect base for most preparations. The classic preparation is uncomplicated but still packs flavour. The meat is usually cooked on the bone, seasoned with salt and a good amount of ground pepper and then grilled along with sautéed garlic and ginger. Pair this with a few veggies or capsicums and you’re good to go.\nRnR’s Garlic Grease Yaka is a true homage to spicy Lankan bites with enough kick to test even the most bonafide spice connoisseur. That being said, they manage to bring on the spice without compromising on the flavour, so even if you’re spice tolerance is just average, you’ll find yourself going back for more through the tears welling up in your eyes.\nThey use thigh and breast meat which they marinate and take straight to the hot plate. While the chicken cooks they throw in a good amount of garlic cloves along with it and prep their signature Nai Kochchi Sauce. The Garlic Grease Yaka is then served up on a sizzling plate along with more chopped kocchi miris (‘cause why not?), some onions for crunch, topped off with grilled garlic cloves.\nAt the end what you’re getting is an unapologetically spicy, garlicky grilled chicken which ticks all the boxes you’d want in an uncaged Lankan bite.\nAsylum went with a slightly different approach with their spin on the classic. The Jungle Bite is the classic grilled chicken redefined with a contemporary touch, while still retaining it’s character, flavours and spice. While this isn’t quite as spicy as RnR’s rendition of the classic, it still strikes a great balance of seasoning, textures and heat, which works perfectly with Asylum’s vibe.\nThey start with two whole chicken legs which they marinate in a cocktail of condiments with a few unique flavour enhancers like paprika, mustard cream and fresh thyme. The chicken then goes on a high heat grill to really get that nice sear on outside, before going into the oven for a few minutes to cook through. The chopped chicken is then mixed in with a mix of crunchy veggies like onions, bell peppers, chopped chillies, tomatoes and balanced out with a squeeze of lime juice. All of it is then plated on top of a bed of chopped cabbage and topped with a healthy drizzle of their mint sauce, served along with their signature chilli mayo.\nAsylum actually chose to serve the chicken bone-in, which may sound a bit off-putting to some, but really works since it helps keep the meat moist and tender. It’s a bit of extra work, but it’s well worth the effort.\nAll the different ingredients going into that marinate also really shines through at the end, punctuated by their chill mayo sauce which brings the heat with a welcomed hint of sweetness.\nIn both of these cases the dishes come with two Tiger Beers, and the pairing makes a lot of sense. What most people don’t actually know is that Tiger is actually brewed here in Sri Lanka using a locally inspired recipe to suit the tropical climate. It’s also the go-to beer for street food in countries like Singapore, Thailand and Vietnam so this is no surprise.\nWhen it comes to the Garlic Grease Yaka, you really need something like a refreshing lager to counteract that spice so that you can keep going back for more. Tiger Beer isn’t too heavily carbonated either so you’re not going to find yourself feeling bloated or gassy.\nThe Jungle Bite has a lot of distinct favours going on which you can truly appreciate with the beer acting as a malty, tropically lagered palate cleanser. It let’s you re-experience those flavours with each bite without any real bitter aftertaste.\nWe’ve already tried both of these uncaged bites on more than one occasion and came away really impressed. If you’re a fan of heat and spice, the Garlic Grease Yaka will likely become an instant classic. On the other hand, if you’re looking for something with a lot depth and subtle flavours, the Jungle Bite has a lot to offer. If that isn’t enough reason, both of the dishes come with a Tiger Beer combo deal, which makes it great value for money.\n",
  "url": "https://www.yamu.lk/blog/uncaged-bites-grilled-chicken"
}