{
  "title": "Valentine's Day 2017 : Meals, Deals & More",
  "abstract": "Buffets, discounts, and more that you can get this Valentine's Day.",
  "author": "Staff",
  "date_published": "3:05pm",
  "content": "We've collated a list of places that have discounts, deals, or offers on this Valentine's Day.\nA romantic dinner for you and your significant other.\nPrice:\n\nA Valentine's Day dinner buffet with a glass of rosé.\nPrice:\nSea Spray offers the ultimate seafood lovers sharing experience this Valentine’s day, starting with a chilled 'Fruit de Mer' on ice, followed by a succession of courses crafted around the best Sri Lankan coastal seafood blended with seasonal island produce and flavours.\nPrice:\nThe 1864\nThe 1864 offers an intimate dining experience with a carefully created Valentine's menu featuring modern European cuisine. Only the finest gastronomic produce is used, including Trincomalee Barramundi and locally sourced seafood, French duck and foie-gras, and finest quality New Zealand lamb.\nPrice:\nLove Huts on Paradise Beach\nCelebrate the love in complete privacy in your own hut. It comes complete with an exquisite menu, and a butler who would be on call the whole night.\nPrice:\nSerenade your Valentine amidst the grandeur of the Governor's restaurant.\nPrice:\nEnjoy a romantic dinner under the stars.\nPrice:\nA mix of romance and fresh air, accompanied with two complimentary cocktails and a rose for the lady.\nPrice:\nAn all you can eat seafood buffet accompanies with two glasses of bubbly, and a rose for the lady.\nEnjoy an international dinner buffet from 6.30 pm onwards.\nPrice:\nA special Valentine's \"Real Red High Tea\".\nPrice:\nSpecial dinner buffet for you and your Significant Other.\nPrice:\nEnjoy a six-course gourmet set menu at The London Grill this Valentine's Day.\nPrice:\nTreat yourself and your loved one to a special Valentine's infinity buffet.\nPrice:\n\nIndulge the night in a splash of romance and savour a tailor-made international dinner buffet.\nPrice:\nInternational dinner for two with two glasses of sparkling, a box of chocolates and a rose for the lady.\nPrice: Rs. 4000 per person\nIkoi Tei\nA Japanese twist on love, with two exquisite menus to select from and Japanese steam cakes for the ladies\nPrice:\nIndulge in an intimate dinner spread at OZO Colombo, which comes complete with complimentary Spritzer and chocolate covered strawberries.\nPrice:\nEnjoy an evening with good food and entertainment.\nPrice:\n",
  "url": "https://www.yamu.lk/blog/valentines-day-2017-meals-deals-buffets"
}