{
  "title": "Valentine's Cakes, Cupcakes And Cookies",
  "abstract": "Even anti-romantic curmudgeons can secretly love cupcakes. Here's a list of 9 places that we think are good for…",
  "author": "",
  "date_published": "1:03pm",
  "content": "Mitsi is a sweet Balkan baker who also runs a nice coffee shop. She's know for her cakes and the have a special range for the special day.\n777 163 090\nAmbrosia's got a yummy looking array of goodies for Valentine's Day. Just the things to be giving away to that special someone, or even if you want to lure in someone in.\nThey deliver as well.\n777 772 052\nA&M Cupcakes has a convenient outlet on Galle Road, Colombo 3. For V-Day you can get stuff like a heart cake with bundles of roses, I Love You cakes, and rose cupcakes.\n72 244 2244\nItsy Bitsy cupcake is another home baker whose doing some pretty cupcakes and stuff for Valentine's Day. You can place orders of flavors of your choice or your sweetheart's, that's a great idea now? All you need to know is his or her flavour.\n\n76 838 9898\nCandy Cakes is another home baker has a range of cake in a push up stick. A break from the usual cupcakes and cakes, here's just the unusual gift to be giving your sweetheart.\n\n773 858 550\nThe Brick Lane Cookie Company is offering up DOUBLE Nutella Burst as Valentine's special. Give your sweetheart a gift box of the gooiest goodies. What's available?\nAll  of their gift boxes include of a special Valentine's Day mini card.\n117 252 250\nDark Temptations is baking mini strawberry surprise cupcakes and cakes for Valentine's Day.\n777 880 830\nFor all the vegetarians and vegans who are looking for a piece of the action, namely cupcakes and brownies and other goodies. If you have a vegetarian/vegan sweetheart and wondering where to go to pick up some goodies? Well here is your answer. Silken red velvet cupcakes, Ferrero Rocher Delight - moist chocolate cupcake with a chocolate and nut filling topped up with a swirl of fudgey chocolate frosting and a Ferrero Rocher chocolate on top or how about some red velvet Red Velvet Sweetheart Brownies?\n77 354 4716\nSits is the classic and by many accounts the best home baker. This Valentines, she's offering mini heart shaped shortbread cookies and larger ones plus  mini fondant covered vanilla cake, and strawberry ganache cupcakes.\n77 773 0793\nSugar Rush is a new Colombo home baker whose got some cute heart shaped brownies at Rs. 120 each. An ideal lil treat for Valentine's Day.\n77 340 11 60\n",
  "url": "https://www.yamu.lk/blog/valentines-cakes-stuff"
}