{
  "title": "Valentine's Day Event Roundup (2018)",
  "abstract": "Here are a roundup of Valentine's Day events, to attend with and without a Valentine.\r\n",
  "author": "",
  "date_published": "4:40pm",
  "content": "Valentine's Day, you either love it or hate it. For those of you who are looking for things to do whether you are a couple or a single, here's our round-up of Valentine's Day events. There are even events in here for kids and animals, so spread the love.\nThis Valentine's day drop in with your Valentine to Bakes By Bella for their specially curated Valentine treat.Only happens on the 13th and 14th of February so don't miss it.\n\n\nThere is no better opportunity to spoil your loved one during the year than on Valentines Day. Whisk your partner to Mövenpick Hotel Colombo to take part in a host of exciting events. Book between the 9th – 17th February and enjoy a romantic getaway in the city, yet, away from the hustle and bustle, as Mövenpick Hotel Colombo puts together a truly exceptional package.\n\nSweep your sweetheart off their feet this Valentine’s Day at OZO Colombo with a splash of love. Enjoy an intimate dinner at EAT and dance away while you are serenaded by the captivating voices of Sam Day, Shehara and Mike at ON14 .\n\nChillax Garden Pub is bringing you a special Valentine's Day celebration with fun activities, games and DJ music.\n\n\nTreat your Valentine to a rose, fun games and prizes, special Valentine's menu and live saxophone music\n\nCelebrate Valentine's at a trendy rooftop bar in Colombo. This special package includes a bottle of sparkling wine, choice of 5 tapas dishes and dainty cupcakes.\n\n\n\nA special date for kiddies with Babybear & Jittabugs. They are inviting your little babies (6 months to 2 years) to join on a Valentines play date to celebrate Love!\n\n\nValentine's day at the Palm's, Mount Lavinia. Be there to spend that special evening with the person you love. Lot's of prizes and dinner buffet along with DJ music to set the tone of the evening!\n\n\n\nIt’s the month of love and Embark is playing Cupid by trying to pair cute street dogs and puppies with their forever families and homes. This Valentines give your Valentine a puppy.\n\n\nClassy, elegant and hopelessly romantic, celebrate the month of love with with your partner this Valentine's at Mitsi's high tea. Food, sweets and roses to celebrate a day dedicated to love, romance and the special person in your life.\n\nBook a rendezvous between February 13 and February 20, 2018 and enjoy a romantic getaway from ME Colombo.\n\n\nSetting the ambience for romance with a dinner by the poolside with smooth live entertainment inclusive of complimentary Bubbly, Venezuelan Chocolates and many more surprises for the couple.\n\n\nRomantic view spectacular food and a chance to win some amazing prizes... Why not spend Valentine's Day at the heart of Colombo...\n\nThe Asylum is curating a night for those who are unlucky in love, who choose to be single, for the few who just like their friends more than their significant other and last but not the least....the lucky couples in love who want a fun social night out! FUN TIMES!\n\nJoin Shangri-La Hotel when they celebrate the varied stages of love on Valentines Day.\n\n\n",
  "url": "https://www.yamu.lk/blog/a-valentines-round-up-of-events"
}