{
  "title": "Valentine's Day 2015 (Hot Dates In Colombo)",
  "abstract": "Here's a round up of what's happening for Valentines, places to dine at, events to go to, things to buy for that…",
  "author": "indi",
  "date_published": "12:23pm",
  "content": "Chesa Swiss is a guaranteed fine dining experience. This Valentine's they're offering a five course menu with wines. If you'd prefer a customised menu, you could do that too just by calling them. Rs 8,000 per person including a glass of wine or juice.\nFor reservations and more information call 112 573 433, or check out the menu on\n. Chesa is ultimately about lovely food.\nWe've only covered it as a lounge, but Clique does really excellent fine dining - including sous vide steaks and other fancy delights. Their Valentines menu is above (click to see it bigger). It's Rs. 7,500 per head and includes a glass of Moet (the good stuff) and a jam jar Belvedere cocktail. Call 765 315 042 or 774 620 492 for reservations.\nAnother guaranteed good experience (or as close as you get). Gallery Cafe has perhaps the best dining ambience in the city and the food is quite good. This Valentine's Day they have a special set menu which includes a complimentary glass of Prosecco. The event is priced at Rs. 4,500 per person. Call 112 582 162 for reservations. As another option, their\nproperty is really nice, though you need to bring your own wine.\nORO 1889 is really tasty Italian pizza place with wonderful family service and a beautiful ambience. Despite being in a mall, it's actually one of the most romantic dining experiences you can get. This Valentine's day they have an Italian spread priced at Rs. 2,750 per person. For reservation and inquiries call 112 575 287.\nGerard Mendis on Horton Place is a beautiful location known for it's chocolates (always good for V-Day). This year they're got a five-course chocolate inspired menu. Click on the image to make it bigger, we can't really do it justice. Rs. 9,000 per couple. Call 714 818 170 for rezzies.\nZen is a newish and nice Japanese place (always a good date night). They’ve got a Valentine’s Day special menu for Rs. 3,500 per person. For reservations and more information contact 112 686 883.\nCafe Francais has tasty bistro-style French cuisine, which is probably the most romantic type of food. It's Rs. 15,000 for the seven-course meal or Rs. 20,000 with paired wines. For reservations and more information call 114 502 602.\nThe Park Street Mews Restaurant is romantic and now has excellent food with beautiful plating. Their Valentine's menu features grilled barramundi fish with champagne, slow cooked fresh salmon fillet, prime steak wrapped with smoked black forest ham or herb crusted rack of lamb and desserts of red velvet layer cake with lemon cheese frosting or raspberry meringue tower, to end a romantic meal. It's a la carte (and generally affordable) though you get a glass of sparkling wine for bills over Rs 2,000. For reservations and more information contact 112 300 133.\nStreat360 is having an all-you-can-eat street food bash on the 14th. It's just Rs 2,500 for singles and Rs 4,000 for couples. There'll also be a Piñata fun. For reservations and more information call 117 360 360.\nGo Italian this Valentine's at the Bayleaf with their special menu and special offers on sparkling wine - by the glass or bottle. Their buzzing retro bar downstairs offers a range of cocktails and premium liquor to enjoy with Tapas and Harpo’s Pizzas. For reservations and more information contact Manju or Bernard 112 695 920.\nIf you'd like fancy dining Indian style Agra (near Independence Square) is a good bet. They have a three-course meal (\n) with wine, chocolate and roses.\nMount Lavinia is a classic location, no doubt. The whole place has the history of romance between a British governor and the local Lavinia, and their views and beachside dining options are quite beautiful. This year they're offering a range of reliably tasty favorites (Governor's, Seafood Cove) as well as some more private options, including one available to just one couple.\nThe Kingsbury has promotions at its restaurants, and you can spell out a V-Day message in chocolates (they have them in the shapes of all the letters plus hearts, in various flavors). You can call them to prepare a box or simply choose from the selection available at Thé Cake from the 12th to 14th February.\nThe Kingsbury rooftop bar has a beautiful view above the ocean and it's usually quite happening. This is more of a drinks and dancing scene. Their V-Day evening starts at 6.30 PM and continues way past midnight. Entrance is priced at Rs. 1500 for the guys and free for ladies (their get a rose also). The fee is inclusive of a glass of wine.\nFor a tasty five-course meal plus chocolates, wine (two glasses) and roses, The Ocean is a good spot.\nIf you want to have the most balling Valentine's Day in the city, you can bid on it from Lakeside. Only available for two people though. They have other romantic options as well.\nThe Pavilion Inn is TM Dilshan's new boutique hotel and it's completely new and pretty nice. They're offering a Valentine's Buffet Dinner with limited tables by the poolside for Rs. 3500 per person. If you want to stay over, Lose Your Heart is a special romantic package (Rs. 15000 for BB) that includes wine and chocolate covered strawberries in your luxury hotel room with a 15 percent discounted that can be used at their Cricketers Arms Restaurant. A nice vacation within the city.\nColombo Courtyard is a central and tasteful city hotel. As a bonus, their Italian Valentine's Day menu is available all week, from the 9th to the 15th. What's on offer is a five-course dinner for Rs. 3,500 per person.\nOZO is quite new and has a lovely view. They have two options for the day.\n",
  "url": "https://www.yamu.lk/blog/valentine-plans"
}