{
  "title": "Vesak in Sri Lanka, 2016",
  "abstract": "Vesak is the most important celebration for Theravada Buddhists, commemorating the ‘thrice blessed day’, or the…",
  "author": "janith",
  "date_published": "1:27pm",
  "content": "Vesak is the most important celebration for Theravada Buddhists, commemorating the\n, or the day Prince Siddhartha was born, attained Buddhahood, and attained Parinibbana (passed away). Mahayana Buddhists usually celebrate it as the birth of Prince Siddhartha.\nOut of these three events, the enlightenment is considered the most important one. Prince Siddhartha left the trappings of royalty at age 29, renouncing his claim to the throne and becoming an ascetic. The prince spent 6 years seeking enlightenment, initially with the aid of teachers, then through extreme austerity (at one point refusing to eat anything but fruits and leaves that had fallen from trees into his alms bowl), and finally settling on the middle path between extremes of self-indulgence and self-mortification. At the age of 35, sitting under the sacred fig tree (which became the Jaya Sri Maha Bodhi in Bodh Gaya), he finally attained enlightenment and became known as the Gautama Buddha.\nVesak is traditionally the most observed day of uposatha, the Buddhist day of observance. Devotees flock to the temples to observe\n(the eight precepts), spend the day in meditation and attending sermons, and generally partaking in\n(giving),\n(observing precepts) and\n(meditation). Vesak usually attracts the most number of attendees out of all twelve annual Poya days.\nEven the seemingly ‘secular’ celebrations around Vesak carry deep spiritual meaning. Offering flowers is a way to contemplate the way the flowers wither and die in the sun, just as every being does, and a reminder to be mindful of the fragility and impermanence of life. The eight-sided classic Vesak lantern is meant to represent the\n(the eight vicissitudes of life - gain and loss, good repute and ill repute, praise and censure, and pain and pleasure), and the candle inside is to remember not to get attached or affected by these - lest it be a cause for suffering (as the candle touching the sides of the lantern causes it to burn down).\nObservances in Sri Lanka have, in recent decades, have taken a more commercial aspect as well. The proliferation of Vesak greeting cards, groups singing Vesak hymns, large and extravagant pandals with colourful electrical lighting, stalls selling prefabricated Vesak decorations, blaring out devotional songs on loudspeakers throughout the night, and the excesses of dansal and cruising around to\n(sometimes with alcohol and catcalling being involved) arguably detract from the true value of the observation.\n\n“Avoid all evil,\nCultivate the good and the true,\nPurify your heart,\nThis is the Teaching of the Buddhas”\nMay the thrice blessed Vesak be a contemplative holiday for all.\n",
  "url": "https://www.yamu.lk/blog/vesak-in-sri-lanka-2016"
}