{
  "title": "Vesak In Colombo 2017",
  "abstract": "Vesak is back! Here are some of the best Vesak festivals around Colombo. ",
  "author": "",
  "date_published": "3:56pm",
  "content": "Vesak is back! The celebration of birth, enlightenment and death of Buddha according to the Theravada tradition, Vesak is an exciting time for everyone here in Sri Lanka.\nHere are some of the best Vesak festivals around Colombo.\nVesak comes to Bauddhaloka Mawatha (Colombo 7) with grand lights, pandols and carols. Organized annually by All Ceylon Buddhist Congress, Bauddhaloka Vesak Zone from 10th to 13th of May will also feature a Buddhist archeological exhibition.\nThis year, United Nations celebrates Vesak on a global scale, here in Sri Lanka. With the participation of Indian PM Narendra Modi, an array of events has been planned in both Colombo and Kandy from 12th to 14th of May.\nIn parallel, Kahapola, Piliyandala will host a representation of the ancient Shakya Kingdom built by The Light of Asia Foundation.\nThe beautiful Beira Lake and the whole surrounding area will be glowing for Vesak, as usual, from the 10th to 14th of May. The pandol and lantern competitions, Vesak music and dansals are organized by Gangarama Temple along with the Prime Minister’s office.\nFrom 12th to 14th of May, the Ape Gama premises (bordering the Diyawanna Lake) which will be illuminated with 2500 floating lanterns. Here, you can explore the history and heritage of 10 Buddhist countries. Also, the Indian Cultural Center is hosting a sand statues exhibition as a part of Diyawanna Vesak Zone. As part of the experience, but further away, there will also be a dancing event in Nelum Pokuna portraying the life of Buddha.\nIf you want to see the whole samsaric journey of Buddha in one place, Galle Face Green is the place to go. They have the first ever Laser Vesak Pandol.\nCapital Maharaja along with John Keells has brought many Buddhist relics from Mihinthalaya, Tissamaharamaya and Nelligala to their Braybrook Place Vesak Zone. Here you can also see a lot of exciting things like Buddhists plays, Vesak carols and puppet shows.\nShraddha Television and LakViru Radio are lighting up Kelaniya this Vesak. Apart from carols, puppet shows, pandols and lanterns, Shraddha Vesak Zone is featuring a footprint of Buddha knowns as Siripathula in the middle of Kalani River.\nKites carrying Buddhist teachings and messages will take over the Galle Face sky on 10th May from 5-10 PM. This kite competition is organized by the Ravana Aviation Kite Association.\nApart from those mega vesak zones, Colombo’s legendary pandals are back again this year.\nThotalanga, the longest running Vesak Pandol in the city returns for the 65th year.\nMost of the road in Colombo will be flooded with traffic as usual; so it’s advisable to park your vehicle somewhere nearby and walk to see Vesak in the city. According to AccuWeather, there could be showers here and there, so you better get ready for that too. And, although this is Buddha’s birthday, keep in mind it is more of a religious festival; not a party. So go easy on fancy masks, whistling pipes etc as those could be annoying to other people. And please don’t litter. We just had a huge garbage crisis for this new year; we don’t need another for Vesak!\n\n",
  "url": "https://www.yamu.lk/blog/vesak-in-colombo-2017-2"
}