{
  "title": "Vesak In Colombo (2015) ",
  "abstract": "Here's a guide to preparing for Vesak this year, from where to get decorations to the sight-seeing. ",
  "author": "Shifani",
  "date_published": "1:39pm",
  "content": "Vesak is almost here and it's always an exciting time in Colombo as everyone begins to prepare for it. The day commemorates the birth, enlightenment and parinibbana of the Buddha, and seeing the city light up symbolically is a beautiful sight - it's pretty much the country's most visual, mass festival.\nHere's a guide to the sight-seeing you can do on Vesak (May 3rd), with some amazing photographs of Vesak evenings by\n, and also some tips on where to buy your lanterns and decorations.\nThe best place overall is around the Beira Lake, near\n. Note that you should not get anywhere near here with a car. The streets are mostly shut for vehicle traffic and you can walk around and see lots of pandols and lights in a concentrated space. This is probably the best place overall in Colombo. Thorana Junction at the start of the Negombo Road is also well known, but that's basically just one huge pandol.\nBesides that, however, there are pandols and light displays in almost every neighborhood. Basically, every Buddhist temple will have something going on.\nIf you're looking for dansals (ice cream dansal ftw),\nbased on last years data. We've put the main spots in our map above.\nRoad.lk also recommends donating to help the people in the birthplace of the Buddha - Nepal. You can donate cash thru the\n(or any number of charities) and\nis collecting essential items at TB Jayah Mw.\nThere are plenty of street-side stops that pop up during the last three weeks before Vesak, featuring delicate hexagonal lanterns made out of crepe paper - but one reliable stretch is at the Kirulapone bus station. If you're heading here from Havelock Road, just pass the Kirulapone police station and you'll see a busy line of shops on your right, with stacks and stacks of Vesak decor, some completed and hung up, some just at the bamboo-twigs stage.\nIf you are new to getting decorations for Vesak, just know that everything is crazy cheap, with ordinary average sized lanterns at Rs. 180-200 and fairy lights and light fittings for Rs. 150-500. Most of it is generic, while you might find a few very colourful and interesting ones if you browse through carefully.\nThey'll charge you accordingly depending on if you want them to help you do the light fittings, and if you want completed lanterns or just the bamboo-stick framework.\nAlternatively you can call them up and order your own variation, and come pick them up in 2-3 days.\nKumara made this grandiose, large lantern - the ones in this size are generally pricier at about Rs. 2500 - which he says depicts the Dalada Maligawa or the Temple of the Tooth in Kandy. He said he took just one and a half hours to assemble it. If you want him to work on your decorations this year you can call him on 078 567 66 77.\nI personally liked the lanterns made by Devika, which featured mostly cut-out work, so it looked more delicate and detailed than your average lantern. Plus her stall had little Batman masks for Rs. 100. She does orders too and is available on 0712 650 638.\nWalking down the stretch you'll probably bump into the families of the artists behind the lanterns too, and after talking to them we found out that they begin preparing for the season as far back as five months before Vesak.\nVesak is a time for contemplation for many Buddhists and a very important part of our national expression. Many travel all the way to Colombo from their hometowns just to see the lights. From the free ice cream dansals to the kids running around in masks to just the quiet, spectacular view on the Beira Lake, regardless of if you're Buddhist or not, Vesak is a one of a kind festival you don't want to miss.\n",
  "url": "https://www.yamu.lk/blog/vesak-in-colombo-2015"
}