{
  "title": "Visit The Nallur Temple Festival",
  "abstract": "The longest-running festival in the country is a colourful and chaotic celebration of Jaffna Hindu culture. It is on for another…",
  "author": "Thulasi",
  "date_published": "9:33am",
  "content": "The annual Nallur Kovil festival in Jaffna is currently in full swing. The thoroughfares of Nallur, once the capital of the Jaffna kingdom, are thronging with pilgrims and tourists from all over the country. Originally built by the rulers of this erstwhile kingdom, the temple has a history stretching back over a thousand years. The 25-day festival that started on August 19 and will culminate in a flurry of cultural events and processions on September 13, is said to be the longest-running festival in the country.\nSo what can you expect to see if you visited Jaffna during this colourful period? First, the religious festivities.\nIf you’ve never seen or participated in Hindu temple celebrations before—or even if you have—the Nallur Kovil festival is an opportunity to experience a uniquely devout yet carnival-esque atmosphere. You will see temple chariot processions, with deities in heavily decorated wooden chariots being taken around the temple courtyard to bless the devotees outside. The chariots are pulled by the devout vying for the honour of being the gods’ horsemen, accompanied by musicians playing nadaswarams (a traditional wind instrument), conches, cymbals and drums.\nBut apart from all the religiosity, the festival is also an occasion for families to enjoy a spot of shopping and feasting.\nA mini bazaar of stalls selling food and knick-knacks has been set up along the four main streets leading to the temple. Families come decked out in their best Kanjivaram saris and veshtis to pray, but along the way, also pause to purchase everything from pots and pans to plaster of Paris statues at the wayside stalls.\nThe rules of participating in the festivities are quite clear: there are several sign boards cautioning tourists to dress appropriately, remove their footwear outside the temple precincts, and not engage in public displays of affection. The only couple that is allowed to do that are Krishna and Ratha in plaster relief.\nFood is a big part of the festival experience. There are several stalls selling savouries and sweets, but they are all vegetarian in keeping with cultural norms. From the local halwas and jalebis to lollipops and toffees, there are sweetmeats of several stripes on sale.\nNot being as saccharine-inclined, we tried a savoury snack of steamed kadala mixed with chopped onions, pakoras and cassava chips, drizzled with a spicy sauce. At only Rs. 50, it was a substantial bite that hit the spot. Those who don’t mind a spike in sugar levels must consider a pilgrimage to the iconic Rio ice cream and its main competitor, Lingam’s. Both are situated in close proximity to each other in Nallur, and vie for your eyeballs and tastebuds with their technicolor creations. To know which one wins the closely contested war of ice cream in Jaffna, watch out for our upcoming post.\nThere are few better ways to experience vibrant Jaffna Hindu culture than by visiting the Nallur festival. But here’s a word of warning. If you’re not used to heavy crowds, take care to keep to the outer precincts of the temple where you can easily edge away from the throngs. The maximum numbers are expected to attend the grand finale of the festival that happens between September 11-13. If you don’t mind the crush, however, this carnival-esque festival is a great Jaffna experience.\n",
  "url": "https://www.yamu.lk/blog/visit-the-nallur-temple-festival"
}