{
  "title": "Visit An Elder's Home For Father's Day",
  "abstract": "June 19 is Father's Day in this part of the world. If you are looking to do something out of the ordinary here's just…",
  "author": "Rishani",
  "date_published": "10:19am",
  "content": "June 19 is Father's Day in this part of the world. If you are looking to do something out of the ordinary for your dad / thathi, here's just an idea. There are many elderly uncles who have no family or friends to visit them or show them that extra bit of love and attention on Fathers Day. So we've put up a list of homes, perhaps in your neighbourhood or around the corner from where you live.\nThese folks will absolutely love some attention and care on Fathers Day. So how about you gather your flock, your parents, your friends,  your children just to pop in at elders home to make a bunch of gents (and ladies) feel included in this celebration? If you can afford it, take them out for a meal, or a tour of Colombo, or have a picnic.\nHere's a list of homes where you would find these elderly folks.This is not a comprehensive list, so do go ahead and add the homes you know in the comment section.\nis home to gents only. No 117, Sir James Peiris Mawatha , Colombo 2. 112 434 792\nis home to both uncles and aunties.  No 27, Pamunuwila Road,  Makola. 112 912 836\n, Home for both genders. Sri Saranankara Road, Kreeda Mawatha,, Kalubowila 112 727 580\nThe Brohier Elders Home, home to gents only. Galle Road, (opposite the Bank of Ceylon) Colombo 6, 774 170 029.\n, home to both ladies and gents. 45/3 Uswatte Circular Road, Moratuwa114 877 349\nis home to both males and females. 112 691 695\nis home to both males and females. No 28, D.S.Kahawita Lane,Attidiya, Dehiwala 11 276 1832\n, Home to gents only. 12. Sarvodaya Suwasetha Elders’ Home, Asgiriya Road, Gampaha. 332 236 911\nVisit any one of the elders homes above by either clicking on the link or giving the Homes a call.\n",
  "url": "https://www.yamu.lk/blog/visit-an-elders-home-for-fathers-day"
}