{
  "title": "Ways to Reduce Waste & Garbage in Sri Lanka",
  "abstract": "Ways to reduce garbage & waste in Sri Lanka.",
  "author": "",
  "date_published": "5:17pm",
  "content": "In 2000 typhoons hit parts of the Philippines causing flooding. In Manila, an avalanche of mud and garbage crashed down on more than 100 huts which were homes to 800 families, killing and displacing many. In Ethiopia, last month, a wall of garbage collapsed at a dump, killing more than 100 people. At the dawn of the New Year, tragedy struck the communities living under the rubbish heap at the Meethotamulla. The death toll is at 30 with search still underway.\nGarbage pile ups are our garbage and the tragedy which occurred is a call to action to each one of us. What should our response be as individuals and householders? What are the little things we could do in our own households to avoid another tragedy recurring?\nfor the use of cloth bags. Take your own cloth bag to the supermarket. Both Cargills and Keells Supermarkets provide the option of purchasing eco friendly bags or bringing your own bags from home to reduce usage of polythene pollution.\nInsist on using your cloth bag instead of polythene bags.\n. Yet polythene is still widely in use in supermarkets and grocery stores. You can write to your favourite supermarket and petition for the discontinuation of polythene bags.\n\nIf you must, purchase the larger plastic bottles so that it would last longer until the next purchase, or opt to go without.\n: Donate usable clothing and e-waste than opting to trash it. Consider giving your clothing to\nwho would be glad to take it off you to benefit the needs of others. Donate all your e-waste to\n.\nUse scraps of vegetables and fruit, eggshells, tea leaves and coffee to make your own compost.\n:If you have surplus, non perishable food items, you can donate to a needy neighbour or give it away to\nand the\nwhich takes excess non-perishable food items to redistribute it to those in need.\nTo get rid of paper, and empty glass bottles, the\nwill be happy to take those burdens off your shoulders.\nPurchase products produced from recycled material. Don’t be confused between the “recycled” and “recyclable” symbols. It should say “recyclable.”\nMake a loud hue and cry. Petition for waste management that is effective and safe for all. Talk to the relevant government agents, write to newspapers, or blog online. Petition for zero waste.\nThese are couple of ideas from Sri Lankan enterprises that upcycle waste and make it into profit:\n",
  "url": "https://www.yamu.lk/blog/reduce-waste-garbage-srilanka"
}