{
  "title": "What & Where - Easter Celebrations  2018 ",
  "abstract": "Easter treats for the whole family",
  "author": "",
  "date_published": "3:03pm",
  "content": "With Easter Sunday just around the corner, I hope you have made plans to indulge in chcoclate coated Easter eggs and the feasts this Easter holiday. To make it easier for you, we are including a list of all the places hosting Easter events.\n\nThere will be grand festivities in store at the Cinnamon Grand. Here’s just a small peek into what’s in store for you this Easter at the Cinnamon Grand. Their Coffee Shop, The Taprobane Restaurant as well as the Cheers Pub are hosting a variety of Easter events. For information and reservations please contact 112 497 373.\n\n: Enjoy our exclusive Easter Sunday Brunch for only Rs.4500/- nett per person from 11.30am - 3.00pm and Easter Sunday High Tea Rs.2900/- nett per person from 3.00pm - 6.00pm! For restaurant bookings and information please contact 077 108 7720.\nA time to rejoice and be thankful. Celebrate the joy of Easter with family and friends! An extravagant Sunday brunch, complete with a scrumptious buffet, Chocolate Easter Eggs for the kids and a special appearance by the Easter Bunny awaits you.\nCount your blessings with your family and be a part of a beautiful. Count your blessings with your family and be a part of a beautiful Easter celebration at the Mount Lavinia Hotel. Rs. 3,400/- per person at the Governor’s Restaurant & Terrace. For more information and reservations contact 011 2 711 711 | Ext : 1425.\n\n: This Easter Sunday, head over to the Ports Of Call with your loved ones and enjoy our special Easter menu. It’s a feast you’ll never forget. Bring your kids along as there will be Easter egg hunts and face painting. For reservations call 112 244 6622.\n\nJoin the activity-filled Kids Easter Party at the Shangri-La lawn. With execiting activities including an egg hunt, art and craft corner for decorating eggs and cookies, a bouncy castle, face painters and more. Kids will love the mini-buffet with a tasty spread from hot dogs and popcorn, to a delicious chocolate fountain and candy sugar floss. For more information and reservations contact 117 888 288.\n\nEaster Celebrations has always been one of the most exciting events at Waters Edge. Keeping with the grand style, Peter Rabbit will make a surprise entrance this year. He will then help the children find hundreds of colourful eggs. . Once that is done and dusted, the kids will have a galore of Easter themes games and rides, an Easter piñata full of surprises, arts and crafts corners, bouncers, face-painting and magic balloons to enjoy.\n\n\n\nOf all the occasions shared around one of our tables, those that bring families together across generations are often the most special. That’s why we love to put on our Sunday best for this Easter, and set a tradition we hope you’ll make a part of your own. For reservations and more information call 774 358 160.\n\n\n\nEaster is just around the corner and we have the perfect spot for a delicious and relaxing Lunch! Join us at the Harbour Room Restaurant and enjoy a spectacular view with an even more spectacular Easter Lunch! For reservations and more information contact 773 441 425.\n\nHave yourself a blessed Easter.\n\n\n",
  "url": "https://www.yamu.lk/blog/what-and-where-easter-celebrations-2018"
}