{
  "title": "What Women Want",
  "abstract": "Not an article on the Mel Gibson movie. ",
  "author": "",
  "date_published": "8:05pm",
  "content": "Women's Day in Sri Lanka has about the same impact as Cheesecake Day. Discounts, free shizz, and eventually a bitter taste in your mouth as you're left with disappointment and ideological despair. I'd happily forsake all the pedicure discounts and frying pans for the utopian bliss of boring old equality.\nAs a post-colonial country, we're battling with the corset-like\n, prudeness, and repression. A lot of what the world's loudest feminists are campaigning for - like\nor\n- are very very far removed from the bare minimum that we need like safety, equality, and adequate women's health options (but we'll take that free pizza anyway).\nBut all of us (that's you too, awesome men out there!) can do better, slow and steady - and here's how. We divided this article into two pages. This page is about initiatives that people and companies can work on, and the next one's going to be on government and policy. Since you're sitting there, reading this in English and scrolling through on your phone or laptop, we assume you're privileged enough to be able to push for these changes in establishments around you.\nBalancing budgets, saving money, how to apply for jobs, how to make a mean paripu - these skills are essential to everyone (and a surprising number of well-off women don't possess them either). On the other hand, charity and hand-outs can only take rural or underprivileged women so far. Life skills like basic money management, learning how to open a bank account, and colloquial English are the key to not only entrepreneurship etc but also independence and security. If you can afford safe housing and food on your own dime, you're less likely to have to stick around in an abusive relationship or be forced to get married when you're young or not ready. Plus in South Asia, \"\n\",\n.\nSri Lanka is starting to\nto support women entrepreneurs (from\nto\n). So instead of gifting jewellery, clothes, or products, start gifting adult education or business grants.\nLearning directly from a badass mentor is one of the best ways to get ahead (did you even watch Star Wars? Come on). Every community is bound to have their own grassroots heroine to aspire to, when our usual handful of politically/family-connected elite female superstars' lives seem unrelatable or unattainable. Plus local women share and understand the challenges of the young girls around them that may not affect others. Nurturing our everyday heroes to continue their journey and affect the girls and women around has a beautiful, positive ripple effect.\nSri Lankan women are the powerhouse of the economy, as the\n: tea, garments, factories, and domestic workers. However, almost all of the women employed in these sectors do\n, factory line workers in the initial stages of the supply chain, or household help in other countries. Don't let all the Instagram photos of toothy tea pluckers fool you, almost all of these are labour-intensive, \"precarious jobs\" because work is either temporary or on a contractual basis.\nexplains further that \"such work arrangements are beneficial to the employer; as such workers are easier to terminate during economic downturns and cost less, as they are not eligible to receive some social protection benefits such as gratuity. Work is precarious not only due to the nature of the contractual arrangement between the worker and the employer, but also because of the nature of work as women work overtime and detrimental hours.\"\nBig companies should be establishing programs of upward mobility, and not resting in the safety of the knowledge that they're simply\n. Almost without exception, line managers or overseers in these key industries are men. This\n\n, or contributes to high rates of attrition. Which leads us to...\nAn individual who feels unsafe, harassed, or marginalised at work is more likely to leave that job, or leave employment completely. Sri Lankan working women need proper access to sanitation, safe access, and transport. This is a problem that acutely affects women of every strata (but as usual, it's worse for the low-income bracket because they lack the financial opportunity to pursue litigation or the social power to take abusers to court). This can range from coerced sex on implied threat of firing to \"innocent\" unsolicited massages and the ubiquitous \"jokes\" about women's bodies, abilities, or worse. Despite Sri Lanka's progressive workplace sexual harassment laws (especially in the South Asian context), women often see their job performance or opportunities dry up if they don't take these advances or \"jokes\" with casual unconcern as they're viewed as \"difficult\" or \"bitchy\".\nTo highlight a personal example, I was molested as a 17 year old intern at a prominent ad company in Colombo by the 40+ year old married department head. When I took this to the HR to file a formal complaint, they pointed out to me that he was a prominent international hire and I was a temporary intern and could leave soon. I left.\nClean and safe public toilets in busy areas, offices, commercial complexes, and transport hubs is key. We've been mocked plenty of times for pushing for sanitation as society (on social media) deems it an embarrassing topic or shrugs it off by saying \"but we're better than India\". Comparisons afford no solace for\n, pregnancy, or ill-health due to lack of adequate or safe toilets and access to sanitary equipment, or have to walk hours to obtain clean water for household necessities. I mean, I doubt the 11% of Lankan families who need to take disease-ridden poops in holes dug near their papol trees are thinking \"thank God I'm not off in Trivandrum right now, Jayaweva!\"\nFurthermore, IRIN reports that \"Nearly one million schoolchildren - about a third of the school-age population in Sri Lanka - do not have safe sanitation, despite the island’s overall sanitation coverage reaching near 89 percent of the population.\" Chairman of Netwater and\nKusum Athukorala goes on to elaborate that “Girls are regularly discouraged from using toilets and this increases\n. There are reports of school teachers who after five years of teaching without accessing toilets, end up with renal failure”.\nOn the positive side, after a spate of successful projects in the Polonnaruwa District,\nthat \"water and sanitation initiatives involving women could prove instrumental in the conflict-affected north, where access to piped water after two decades of war remains problematic.\"\n. Just getting to work or higher education facilities can be a daunting challenge when you have an hour or so of potential penile contact or viscous verbal vileness to contend with per day. According to the\n, some 90% of Sri Lankan women deal with sexual harassment on public transport, but only 4% actually approached the police for help. Worse still, some 82% of bystanders have witnessed others being molested or harassed and done nothing about it.\nThe UN agency, along with other movements like Sri Lanka Unites, are working and advocating for safe transport, safe bus halts free of sexual harassment or danger, and safety for women.\nWomen don't just need to be princesses, wives, reality stars and mothers when they grow up (if you're Kim K you can be all 4 though!). The world of Science, Technology, Engineering, and Medicine is open to them, and parents and schools need to be cultivating that in a big way. According to the\n, some 52% of women reported they'd prefer to work for the Government in education because it's seen as safe and acceptable. Even women who pursue science see\n.\nIt's not like squeezing a real live human out your delicate flowery nether regions isn't challenge enough, having to deal with employment discrimination is a thing too. While\n, and labour (this is not a double entendre) laws are in place to ensure paid leave, free and comprehensive public pre-natal and ante-natal care, there are still serious barriers to workers due to childbirth and pregnancy. For example, young women are less likely to be employed amongst men with the same experience and qualifications mostly because employers assume they'd have to grapple with providing maternity leave, the hassle of finding maternity leave replacement workers, and that the women may never return to work at all. However,\n\"many employers state that experience has taught them that women are more likely to return to the workplace if they feel they have been valued and looked after during their working pregnancy and maternity leave and so the benefits can outweigh the costs.\"\nGlobally,\ntend toward providing extended paid paternity leave, providing day cares at work, flexible work plans, and work-from-home options. This not only retains good staff, but also establishes a loyal employee base.\n“Some people ask: “Why the word feminist? Why not just say you are a believer in human rights, or something like that?” Because that would be dishonest. Feminism is, of course, part of human rights in general—but to choose to use the vague expression human rights is to deny the specific and particular problem of gender. It would be a way of pretending that it was not women who have, for centuries, been excluded. It would be a way of denying that the problem of gender targets women.”\n― Chimamanda Ngozi Adichie, We Should All Be Feminists\nThis article is a product of extensive research done by the ADB, UNDP, the UNFPA, and numerous other bodies. We strongly encourage you to follow the links to read and learn more about the topics in detail. Then, aggressively bring them up at dinner parties till your social life is an arid desert of righteousness.\n",
  "url": "https://www.yamu.lk/blog/what-women-want-srilanka"
}