{
  "title": "What Not To Say To An Arts Student",
  "abstract": "Arts students deal with a lot of crap - here's your own personal guide to potentially lessening that load.",
  "author": "Iman",
  "date_published": "11:57am",
  "content": "Studying the arts in Sri Lanka comes with a unique set of difficulties and frustrations. Arts degrees are popularly perceived as inferior to more traditional ones (medicine, law, engineering), and most people have no trouble reminding you of this. Below are some things you should probably not say to an arts student - most of it is common knowledge, but some of y'all tend to need reminding.\nCondescending adjectives include: fun, interesting, unusual. This is usually said by older relatives when you've slipped up and accidentally disclosed that you are not, in fact, doing anything they have deemed useful with your life. Telling signs include a pause between the 'so' and the adjective of choice, an abrupt change of subject after, and a sense of shame that isn't justified but that haunts you nevertheless.\n\"Wow, [arts subject], huh? I know nothing about the arts and I'd rather not verbalise my belief that it isn't as important as any other degree.\"\nLiterally anything I want. The best part about arts degrees is that they're not as restrictive as, for example, medicine. Arts graduates have a wide variety of jobs to choose from, in industries as diverse as media, publishing, communication, marketing and entertainment, to name a few. So yeah, we've got options. NEXT.\n\"You're so lucky you've got such a broad range of areas to go into!\"\nGod forbid parents should trust their children and encourage them to pursue their passions. But listen, sweetie, I'm so sorry that your parents are so narrow-minded that they draw the line at paying for degrees they can't brag to your older relatives about. Tragic.\n\"Your parents trust you and respect your decisions? Huh, can't relate.\"\nThis one actually makes my teeth grind and my nostrils flare. How DARE you patronise the very root of my caffeine dependence? The belief that our workloads can't possibly be that bad because our degrees aren't that important is downright insulting. These aren't bags under my eyes, these are SUITCASES.\n: \"Please educate me on what an arts degree involves because I clearly have no clue.\"\nObviously, your goals have to be practical, and you need to be able to support yourself financially, BUT my bad if my number one priority isn't making lots and lots of money. Way to be a slave to the system, man.\n\"Having different priorities is okay, and I shouldn't try to impose mine on other people.\"\nWhere do I even begin? The misogyny? The total lack of respect for anything you don't consider important? Choosing to be a housewife does not immediately render your education useless, and please refer to numbers 2. and 5. on this list if you're that concerned about my job opportunities and financial situation.\n\"I'm literal trash.\"\nPeople studying and working in the arts have a lot to deal with already - the popular assumption that what we do isn't\nimportant, for example, or being the first to suffer budget cuts or the retraction of financial funding because we're more 'dispensable'. So the next time you feel the need to say anything on this list, do us all a favour and just don't. We've heard it all before.\n",
  "url": "https://www.yamu.lk/blog/what-not-to-say-to-an-arts-student"
}