{
  "title": "What To Expect When You're In Sri Lanka",
  "abstract": "If you've touched down upon our golden sands for the first time ever, you're going to be a little overwhelmed. Here's a guide…",
  "author": "Sarah",
  "date_published": "9:25am",
  "content": "The Island of Taprobane is a stellar blend of colour, culture, peacocks, air hostesses and of course golden sands. The minute you touch down and step off the plane you'll be overwhelmed by the sounds and sights, as well as the occasional spatter of aviary excrement.\nNew to the golden sands of Thambapanni? Here's a guide to help you keep up with the rather intricate decorum of the average local.\nPeople aren't really fazed by the outlandish cuisine we're so proud of thanks to the tourist industry picking us up and placing us dead centre in the middle of the travel map these days. However, as opposed to\n, our authentic dishes don't lie in the cafes of Colombo 07. But if you've heard tell of our spectacular Sri Lankan Rice and Curry, Isso Wade, Wattalapan, Lamprais and want in, head to our\n!\nSo you're done with your lunch and\n. You head to the loo. There's this strange contraption sort of like a gun but not quite a gun. Looks like it's from outer space. What could this be? What do people do with this?\nIt's used to wash your bum and cleanse thyself of all impurities.\n'But why not just use toilet paper?'\nYou wash, and then you wipe. That's how we do it here. Most of us at least.\nTucked artfully beneath the bumpers of many a vehicle you'll see a few dried red chillis tied together with a lime. Or if you walk/drive past a residential area chances are you'll see little amulets nailed above the main doorways. These superstitious practices actually go a long way back. So whether it's a bunch of garlands or a cracked coconut on a\nfloor, you're looking at hundreds of years of cultural belief, so don't disrupt the juju.\nSri Lanka is not for the weak and delicate. Immense concentration and fair amounts of physical strength are required. You might be incredibly overwhelmed by the smells and sights the first time you head to an area like\nbut if you keep your head about you, you'll actually stumble across a few remarkably charming sights, or\n.\nBe ready to rub shoulders and other things with total strangers. Arm yourself with an umbrella or a full water bottle to either shade you from the sun, stay dehydrated and/or use as a weapon when necessary. Theft count is low here but still, make sure you don't carry items of greater value when you venture out into a seedy or touristy location.\nAlso pigeons.\nA lot of tourists make the assumption that locals love to point and stare when they walk past us with harem pants and dreadlocks. While this might be 100% true, it also happens both ways. Our choice of attire is as intriguing as it gets and you'll be taken aback at how many men walk about commando (wink). Sarongs,\n, saris, shalwars, robes; it's an endless wardrobe and although it's a bit uncomfortable, we quite understand the staring.\nSpeaking of dreadlocks and harem pants, you'll meet the hippie crowd by the droves here especially if your destination in mind is\n. They amble about aimlessly, like sheep and are quite friendly if approached. They're also super friendly if you look like you know where to find some good old hallucinogens. Don't tell them where. Actually, don't even\nwhere.\nAside from the monstrous heat, the annoyingly zen surfers and the occasional\n, your stay here shouldn't be too horrible at all. I mean sure we might use a water blaster every time we visit the loo but we also have breathtaking beaches, amazing food and we're friendly to boot. So grab your sunscreen and go forth!\n",
  "url": "https://www.yamu.lk/blog/what-to-expect-when-youre-in-sri-lanka"
}