{
  "title": "What's Up With The Muslim Marriage and Divorce Act?",
  "abstract": "Questions regarding the whys, whats, and hows of the MMDA summarized.",
  "author": "",
  "date_published": "11:51am",
  "content": "The Muslim Marriage and Divorce Act (MMDA) has been making the newsrounds lately both locally and internationally because, frankly, of how some of the clauses literally violates basic human rights. It's an archaic law which lobbyists are attempting to\n, and it currently supercedes the Sri Lankan Constitution.\nJustice Saleem Marsoof outlines how the current MMDA came into existence in his paper\nAfter going through several modifications and reviews from the Muhammedan Code of 1806 to the MMDA of 1951, the code brought in from current-day Indonesia and established during the Dutch rule in 1770 has prevailed since then to now,\nAs the name implies, the Muslim Marriage and Divorce Act deals with personal laws concerning the Muslim community in Sri Lanka. Article 16 (1) of the Sri Lankan Constitution states that\nthereby diluting the supremacy of the Constitution by allowing the Muslim Personal Law to supercede it.\nTo put it simply, the MMDA reigns supreme where Muslims are concerned, despite the Constitution's existence. Muslims simply cannot marry out of the MMDA, as their marriage would be annulled or considered illegal if they did. This is made crystal clear in the\n(GMRO) itself, which explicitly exempts Muslims from registering their marriages under it. To quote,\nYour Fundamental Rights clearly outline that\nHowever, since personal laws supercede general laws the MMDA prevents this from happening. One example is how a woman cannot sign her own marriage contract, or get married without the consent and signature of a male guardian. In the event that a male guardian isn't present, a\nsigns on behalf of her.\nThe reason personal laws supercedes this and the MMDA has this provision is\nof Article 16 (1), which explicitly states that\nErgo, Article 16 (1) directly contradicts your Fundamental Rights.\nIn its current state, the only way to dilute the MMDA's power over Muslim children and women, and grant them their rights is if Article 16 (1) is repealed; and as Actions Groups advocate,\nCalls for action are to reform the MMDA, not abolish it completely. The need to reform has been persistent throughout several decades now (they first began around the 1950s), and\nin an attempt to bring attention to the issue.\n- Women's Action Network, as reported by Adaderana.lk\nThe last attempts at reform was in 2009, when then Justice Minister Milinda Moragoda appointed a committee headed by former Supreme Court Judge Saleem Marsoof. The committee consisted of 16 experts from the Muslim, Sinhala, and Tamil communities and also included women. However, despite the passage of nearly a decade,\nIt condones child marriage. The minimum age of marriage as stipulated by the MMDA is 12 years of age, BUT this can be even younger if the Quazi decrees it permissible.\nThe conditions of divorce for men and women are not equal, with the divorce proceedings made exceedingly easy for the husband but complicated for the wife seeking the annulment. The husband does not need to give reasons for the divorce either, whereas the wife is required to go through lenghty procedures and justify her reasons for divorce, along with witnesses and case hearings.\nThe husband can commit polygamy without consent — or even knowledge — of his first wife. This is possible as long as he just informs the relevant quazis.\nThe bride's signature and thereby consent is\nrequired on the marriage contract as her\nor 'legal guardian' signs on her behalf.\nWomen are completely excluded from being on the Board of Quazis, to becoming a Quazi, a marriage registrar, or a juror. Given that the position of a Quazi is funded by the State and that they are considered to be public servants and are funded indiscriminately by the general public, this is discrimination against women based on gender — ie, a woman is deprived of being a State employee merely because she is female, regardless of her merits for the job.\nThe Sri Lanka Tawheed Jamaath (SLTJ) organized a protest rally earlier in November\n. They claimed that imposing a minimum age on marriage is not practical and that a girl ought to have the right and ability to marry if she so wills, regardless of her age. Ironically, the placard stating that a girl-child should have marriage rights was held upright by a boy who barely looked old enough to understand the intricacies of the protest he was involved in. As photographs of the rally emerged, so did memes.\nTo simplify things, the MMDA is in urgent need of reforms. An outdated law which allows for child marriage and is sexist by discriminating against women should have been amended by now, yet it has not.\nWomen and children under the MMDA are not given equal treatment or protection unlike their fellow citizens in Sri Lanka as certain rights otherwise granted under the Constitution are superceded by Article 16 (1).\n\n",
  "url": "https://www.yamu.lk/blog/whats-up-with-the-muslim-marriage-and-divorce-act"
}