{
  "title": "Where and How to Get Customized Gifts",
  "abstract": "Handmade gifts are good gifts.",
  "author": "Aisha",
  "date_published": "4:00pm",
  "content": "If you put a lot of thought into your gifts and love giving people something that would make them happy (but you don't have the time or skills to craft something yourself), think about getting them customized gifts; we promise that they work just as fine :)\nTry moving away from the generic printed mugs/ Tshirts/ photo-frames and try these cool hand-made gift options instead. We've got personalized jewellry, footwear, batiks, artwork, stationery and more. Take your pick!\nDespite being just over an year old Kraftsy has become immensely popular for custom footwear. They also branch out to making knitted sling bags and funky batik prints, but their crocheted (and sometimes handloomed) slippers and strappy sandals are what keeps them going.\nA photo posted by Kraftsy (@kraftsylk) on\nCustomized, handpainted,\ncutesy mugs and pretty neatly done as well, Inquisitivepanda has nailed down the art of making perfect mugs.\nA photo posted by Inquisitivepanda (@by.inquisitivepanda) on\n\nFrom patchwork stuffed toys to quilts and even basic baby-shirts and kimonos, Connecting Yards is like your one-stop-shop for baby related clotheswear and soft toys. Basically everything fabric.\nThis is literally the only place from where you can get hand-made miniatures that are\nof the real deal. It's as though nothing's impossible for the creative hands behind MM as they craft everything under the sun from plants to food to books and doll houses.\nDefinitely for stationary lovers, ArtyCrafts does exquisite hand-bound journals and books. Their work is incredibly neat, and if you're a bibliophile, you'll treasure the amount of work that's gone into creating these pieces.\n\nFrom beautiful nail-and-thread art to customized wooden lamps and more wall hangings, Shoelace Studios is the place to hit up if you want to give someone some epic home decor. The stuff they've got are great to give as a house-warming gift or to add some jazz to your best friend's room. Or your own, even.\nA photo posted by Shoelace Studio (@shoelace_studio) on\nFinding inspiration from everything from plastic to train tickets — both which are upcycled into funky jewellry — ALKE will design basically anything you require, accessory-wise.\nBasically every new parent's dream (this may be an exaggeration) Tiny Tots makes a cast of your baby's hands and feet and frames it. I know this sounds kind of creepy, but it's also a cute idea. You get to capture that clenched-little-fists baby moment forever.\nPractically the only place you can find quirky dreamcatchers (or any dreamcatcher at all), TFP also makes charm bracelets, necklets, and chokers. You can pick and choose the charms of your choice, so it's pretty neat.\nAgain best suited to gift to people with little kids, Patched makes patchwork quilts, customizes towels, and embroiders baby dresses. Get them to make playmats — a great way to keep little ones engaged in play! (Also great to make giant sets of\nor Snake and Ladders).\nA photo posted by Patched (@patchedsl) on\nThese are our recommendations, but if you've got more that we should check out and keep an eye out for, hit us up in the comments. Meanwhile, we hope you found this helpful!\n",
  "url": "https://www.yamu.lk/blog/where-and-how-to-get-customized-gifts"
}