{
  "title": "Where To Watch The SL vs India ODI Series",
  "abstract": "Here's look at where you can catch the upcoming SL vs India ODI series!",
  "author": "",
  "date_published": "4:03pm",
  "content": "To say that Sri Lanka's recent cricket encounters have resulted in less than stellar performances would be a gross understatement. That being said an ODI series between Sri Lanka and India is always entertaining, and if the Champions Trophy was any indication we do have a shot. So if you're looking to catch the matches here in Colombo, here are some of your options:\nThe Cricket Club Cafe is a tribute to all things cricket, so it's a no-brainer that it'll be a great place to relax, grab a cold one and watch the match. This is also a great choice for the hardcore cricket lovers since you're surrounded by a ton of cool memorabilia along with a fully cricket themed menu to boot. We recommend the nachos to munch on while you watch.\nCheers at Cinnamon Grand has been a go-to for any popular sports encouter for a long time now. It's spacious, comfortable and the food is solid, though a bit on the pricey side. Bonus points for their kids area which will let all those busy parents watch the match in peace while the kids play.\nOver the last two years Playtrix has come into its own as of the most popular Sports bars in Colombo, especially among the younger crowd. They've got a happy hour from 6 pm to 9 pm and some great live music, in case things start looking bad for our boys.\nIf you're maybe planning on catching the match outside of Colombo, the Lion Pub is a solid choice. They've been around for ages, so you'll find a bunch of regulars turning up for a relaxed atmosphere and of course, Lion beer. They've also got Arthur's Pizza right next door in case you want to order Lankan themed pizza to make you feel more patriotic.\nThe coziest of the lot, Manchester is a great for the casual cricket fan to drop in after work and catch up with the match. It's also another popular spot for Open Mic nights and performances so there's plenty for both casual and more serious fans to enjoy.\n",
  "url": "https://www.yamu.lk/blog/where-to-watch-the-sl-vs-india-odi-series"
}