{
  "title": "Why I Stopped Using Facebook",
  "abstract": "I personally don’t use Facebook anymore. Well, that’s not entirely true. Let me explain.",
  "author": "",
  "date_published": "1:38pm",
  "content": "I personally don’t use Facebook anymore. Well, that’s not entirely true. Let me explain.\nI have to use Facebook for work and I’ve forgotten how many sites I use Facebook Connect to login to. I don’t even know my YAMU password, I login with Facebook.\nIn a sense, Facebook is a utility, like a national ID card. It’s a form of Internet ID, as is a working email account, and you just need it to get into stuff. I certainly know people that don’t have FB accounts at all (like my sister), but I’m not there yet.\nAt the same time, I never use Facebook. That is, I rarely open the feed and I almost never consume content there. Why?\nFacebook is designed to keep me scrolling and also to ensure that I never really leave. So there are some interesting things, but always the promise of something more interesting further down, or later on, so you keep going on, and coming back… but why?\nI found that I was thinking about a hundred things a day but not actually thinking very much.\nOn a daily basis, the news is stuff that enrages or bothers people (Sri Lankans seem to have a real thing for car crashes, for example) or gets their attention. There are positive things like kittens or butts, but in general it doesn’t make you happier. Like it or not, Facebook is a major source of news, and thus of negativity.\nThe second thing is that people on Facebook can be awful. Text is not a good method for communicating nuance and a lot of people sound rude or mean, even if they don’t mean to be. Some people actually are mean. There are these endless rabbit holes of comment wars you can observe or get into where nobody learns anything or changes their mind. You just leave feeling angry, and it takes time out of the actual day.\nSo that’s why I don’t open my news feed. Sometimes I check (like in order to write this) and I can literally feel the gravity of the thing, pulling me down, down, down the page. Once I cut that out I have more time to, like, read books, or talk to people, and think. And I feel better.\nWhen I started using Facebook it required a University ID. Now it is open to everyone and connects I think over a billion people, which is a wonderful achievement. And they’re profitable, so truly, I admire them, and Zuck.\nI just don’t like using it anymore. There are more people like me, and Facebook does have a problem with people sharing less personal stuff, but the question is whether that’s a big enough problem to let go of the successful business they have. And whether it’s an opportunity for someone else.\nI think Facebook the company may want to change, but being a business, I don’t think market forces really require it to. People have been complaining about TV being bad for you for like 50 years and people still watch hours of TV every day. Perhaps Facebook is just something like that. Perhaps it's not bad for you at all.\nI don’t know. I’m old. Perhaps I just don’t have that much to share and I’m trying to tack a broader trend on to that. I do know that I haven’t (really) used Facebook for a few months now and I feel much better. I’d say it might work for you, but who knows. Perhaps it’s something you could debate on Facebook.\n",
  "url": "https://www.yamu.lk/blog/is-facebook-good-for-you"
}