{
  "title": "Why Is Rice and Curry the Best Food Ever?",
  "abstract": "Where my papadum at?",
  "author": "",
  "date_published": "2:25am",
  "content": "You shall be exiled from this country if you state your contempt for\n,\nRice and Curry. This country has no space for unpatriotic citizens who cannot savour the 150 rupee (or more) goodness.\nPacked with grains of rice that will make your round belly rounder, Rice and Curry has been listed number 1 on the list the World's Best Meals, an esteemed competition judged by self proclaimed Rice and Curry EEs (Enthusiastic Experts) like me.\nAnd here are the reasons why Rice and Curry tops all meals.\nFilled with all that carby goodness, one packet is enough to send you into hibernation. Why consult a doctor for 3000 rupees when you can get a buth packet for less than 300 rupees?\nYou get the not-so-healthy carbs from the rice, you get the protein from the chicken.\nYou get some diluted vitamins from the veggies, you get some cholesterol from the papadum.\nIt's all about the balance.\nWith a burst of flavors, all that\ngoodness and that\ntang, rice and curry paves its way into being one of the tastiest meals in the Milky Way. It's got so much going on that with every bite you get a slightly different taste. The taste just gets better with every morsel.\nEven that uncle who goes for 7th servings at\nwon't complain after a good buth packet.\nUnless you go to a five star, pish posh hotel and ask for a rice and curry which would come with all the taxes in the world, including a tax for your existence, Rice and Curry is cheap AF. For 150 rupees, you can get yourself rice, beetroot, dhal, chicken and beans. Oh and papadum! If you're lucky, some\ntoo!\nWhat's more aesthetic than a plate with 3 or more colourful curries and papadum fried to a golden hue?\nNothing.\nColourful, amazing, a little unhealthy, with lots going on, it's the most Sri Lankan thing you can get! It has been scientifically proven (not really, but who cares?) that if you're missing home, a steaming rice and curry can ease you of the nostalgia.\nWe can turn anything into a curry for a good old Rice and Curry.\nFrom a\ncurry to this curry to that curry, we can make a curry out of your broken bata slippers.\nCurry level: Sri Lanka\nDying of a cold? Have a spicy Rice and Curry.\nHomesick? Make Rice and Curry.\nLost a leg? Eat Rice and Curry.\n\nFeeling like a good Rice and Curry now?\nfor our top picks!\n",
  "url": "https://www.yamu.lk/blog/why-is-rice-and-curry-the-best-food-ever"
}