{
  "title": "Why You Should Quit Your Job",
  "abstract": "Right now is a good time for you to start something new, if that's what you want to do.",
  "author": "indi",
  "date_published": "7:42pm",
  "content": "Before YAMU, I quit a decent paying job because I wanted to do\n. I wanted to make something cool and I didn't want people telling me to do other stuff.\nSo that's how I started. Why should you start now?\nSimply speaking, there's money in the startup scene again. When we started there was a little bit (though we didn't get any) but after that, there wasn't much at all. Now it's suddenly picking up again. In my experience, when the money is there, you should take it.\nVenture Engine is great and has been here for years, and everyone from Startup X Foundry to Keells to Hemas is interested in funding startups now.\nI'll just talk about Keells here (\n) because we're working closely with them and they put the simplest deal on the table.\nIf you have a good team and idea, you should\nto JKx by June 25th. Why? Because Keells is a great first investor to have, because they train you, and because up to 7 teams will get up to Rs. 2 million each, and a clear track to raise up to Rs. 50 million more.\nThat's more money than YAMU started with, and you'll start with a valuation (Rs. 40 million) that we'd struggle to sell our company for now. Basically, you'll start ahead. So that's why now.\nIf you're selected, you should be ready to work on your startup full-time come November. A lot of people want to hedge their bets and keep their day job, but my advice is, don't.\nIf you're doing a startup you need to focus. Rs. 2 million should cover basic salaries for you and a few founders, so pay yourself, buckle down and work hard on your product and your first customers.\nIt's better to take a full shot at this and fail fast than just do it in a half-assed way for years.\nHaving a job is great - for many people it means security, stability, even survival. So no, not\nshould quit their job.\nHowever, if you have a burning idea, or the idea that you want to have an idea, then you should do it. Just take a shot. Now is a time where people will actually pay you to do it, so why not?\nAnd don't worry about failing. Failing is basically graduate school plus an MBA for startups. It is your greatest education. Trust me, that won't make it any less painful, but it's incredibly valuable. It's that education that enables you to launch another business, or contribute to an existing company.\nOf course, perhaps your job supports you, or your family, and any number of obligations beyond, say, self-actualization. That's why funding matters. If you're doing a startup, you should always pay yourself. So pay yourself. Perhaps not the market rate, but if you get funded, you can pay yourself to survive.\nSo, if you have the desire, if you have the skill, and you're lucky enough to be able to take a risk, now is the time to launch your startup. I encourage you to apply to\nthis week. Hopefully we'll see startups that are much, much more successful than YAMU by this time next year.\n",
  "url": "https://www.yamu.lk/blog/why-you-should-quit-your-job"
}