{
  "title": "Why Avurudu Is Better Than New Year's Eve",
  "abstract": "Here's why Sri Lankan New Year is the best.",
  "author": "indi",
  "date_published": "12:24pm",
  "content": "Sri Lanka has two new years, one in January (the western one) and one in April (ours). Here's why our New Year is better.\nIn western countries, you might get a day off for New Year; just enough time to sleep off a hangover and get back to work.\nIn Sri Lanka, the country is basically useless for an entire month. There are only two official days off, but most people take a week, and some people never come back at all. That's a real holiday.\nFor Western New Year you need to pay like Rs. 10,000 to get into an ordinary hotel bar and eat kiribath standing up in the morning.\nFor Avurudu, you give people betel leaves and they give you money. They just give you money. At some point you need to grow up and start giving younger people money, but if you just avoid children (strategic napping) you can still come out ahead.\nThe main festivity associated with New Year's Eve is getting drunk or otherwise intoxicated and watching a ball drop. For a lot of people that's not their thing and they just end up watching a movie and going to sleep.\nAvurudu is much more family-friendly. Everyone likes to eat kiribath, play games, and wear new clothes. The usual intoxication involved is eating too much and passing out in the afternoon heat. Not that the uncles don't drink in the weeks before and after, but the holiday itself is for families.\nFor western New Year, you get to watch a ball sliding down a sort of greased pole, on TV. That's the main event.\nIn Sri Lanka, you can climb a greased pole yourself, pillow-fight, smash pots with sticks, or even enter the village foot-race if you can brave the heat. Alternately, you can just watch all the games in the shade and drink a Nelli crush, as I prefer to do.\nMany Sri Lankan companies expect staff to come to work\non New Year's Day for some fiendish, bleary-eyed ritual of eating cold kiribath together. It's actually a punishment.\nAfter Avurudu, nobody expects you to be productive. It is perfectly acceptable to not answer the phone properly until May. This may not be a good thing for our national economy, but it is good for general quality of life.\nOn New Year's you don't often share anything, except your personal space on a dancefloor.\nOn Avurudu, Sri Lankans share food with all of their neighbours, regardless of caste or creed. People gift plates of food and sweets to their neighbours, and those neighbours never return the plate empty.\nSome people re-gift what they get to the next neighbour, but the spirit is there. It's all about giving.\nHappy Avurudu everyone. Hope you have a peaceful, chilled and refreshing time in the new year. Even if you haven't harvested anything, you still deserve a break.\n",
  "url": "https://www.yamu.lk/blog/why-avurudu-is-better-than-new-years-eve"
}