{
  "title": "Why You Need To Get Married",
  "abstract": "Wondering whether you should get married? Let us take you on a journey of buffets, tax, and babies.",
  "author": "",
  "date_published": "2:10pm",
  "content": "South Asia's social system is rigged to favour the hitched. It doesn't matter if you're well-qualified, successful, or an all-round sweetie-pie - you're often less valued than your married counterparts. Why?\nMaybe it's because if\nagrees to hang out with you all the time until you die, you can't be so bad. Or in an Asian context it means your family has enough standing, wealth, or religious correctness that people want to marry into it. Or most likely, just because you're now seen as a serious adult capable of being invested with responsibility and trust (doesn't matter if you already had those qualities without a bit of bling on your fing). Getting married is like an Asian lifehack - you're suddenly playing life on easy mode. Here's why:\nthan their unmarried counterparts. Science, bitch.\nThis one's actually a bit gender-divisive. If you're a man,\n, but if you're a recently-married woman, it doesn't. Married men are perceived as being more likely to stay in a job as they have to now provide, they've got responsibilities, they're viewed as a \"family man\", and most of all, they're a lot more motivated to do well monetarily to support their families. Newly-married women are often seen as potential liabilities to a business as they are\n. Add to all of this in Sri Lanka is the fact that an older unmarried man in Sri Lanka is viewed with suspicion as a \"perpetual bachelor\".\nIf you're living together but unmarried, you'll have a tough time in case something happens to one of you. This ranges from a lack of legal rights in terms of health insurance, pension recipients, inheriting property, and more. You'll also not be allowed to visit your spouse in jail, ICU, or abroad. You may also not be allowed to adopt, or you won't be allowed equal rights to your children if you are unmarried. Sure, if you live in the EU or UK you can apply for a civil partnership or domicile partnership, but those don't apply here in sunny old Sri Lanka.\nSpeaking of houses, it's also incredibly difficult to find housing if you're living with your partner. It doesn't matter if you've been with them for a decade as opposed to two people who met and married on the same day, the marriage certificate automatically renders their relationship more valid. Go figure.\nI had an inflamed kidney a couple of years ago. In order to properly diagnose it, my (very nice and competent) doctor sent me off to the hospital's lab to get a sonogram. The (very horrible and brusque) male doctor doing the scan wouldn't speak directly to me, ask me any questions about my own body (he would only address my parents or partner), and once he found out I was unmarried, refused to do a vaginal sonogram. Despite the fact that this was necessary for the diagnosis and I was in severe pain. This is at one of Sri Lanka's glitziest private hospitals, which should scare you a little bit more.\nFurthermore, I've met plenty of people who have had terrible gynaec sessions or incorrect information given to them because the local doctors will either not help you with reproductive health if you are unmarried, or will ask \"are you married?\" rather than \"are you sexually active?\". Keep in mind that\n- it's just ignorant thinking of individual practitioners (there are great ones out there too!).\nOkay, you can have a kid without getting married, but the social repercussions of that in a repressive society are 'uge (not that it should matter to anyone whose genitalia isn't involved). Adoption is almost completely restricted to married couples in South Asia. It doesn't quite matter if you have the compassion and means to adopt a kid, you're still less eligible if unmarried (\n).\nThis is the best and worst reason to get married. The second you finish high school, your first degree, go on your second date with someone, or have a cousin or sibling get married, you'll keep hearing busybodies ask you why you aren't married. Nobody cares about your answer, this is just a way of reminding you that it is your divine duty to\n. Also because everybody knows if you're not married by 30 you're basically a puppy-stabbing sea monster.\nYou don't need to resign yourself to a debt-ridden wedding complete with 1,600 strangers balefully glaring at your makeup-caked face mumbling vows and wondering if it's okay to eat yet. You can either embrace it with someone that you adore and want to build a great loving partnership and family with, or move to another country where the system isn't as concerned about your marital status, or supports marriage equality. Either way, don't forget to send us cake.\nPS: If this article is irrelevant to you because you're a single pringle, please use\nfirst. Or stay single and happy, you do you!\n",
  "url": "https://www.yamu.lk/blog/why-you-need-to-get-married-asap"
}