{
  "title": "Why Don't Foreigners Want to Invest In Sri Lanka?",
  "abstract": "We look at some of the reasons FDI isn't as high as it should be.",
  "author": "Kinita",
  "date_published": "3:56pm",
  "content": "While the Government is hoping and/or forecasting Foreign Direct Investment inflows of\n, it’s still a faltering sum in comparison to the FDI that many other South Asian countries like India,\n,\n,\nand Vietnam see. Why aren’t we catching up?\nMany economists argue that consistency and stability in policies (economic and political), guarantee of property rights, and low corruption are the key. Overall, one of the biggest problems you’ll notice is that it’s simply not that easy to do business (or even live) here unless you’re local or locally connected. In fact, it appears as though Sri Lanka’s getting comparatively worse, as according to the\nthe country has slid down a rank to 110.\nAccording to the Central Bank itself,\nFDI flows occur due to push and pull factors relating to the source country and the recipient country, respectively. In general, pull factors include low cost labour, raw material, access to markets, competitive exchange rates, low tax regimes, availability of land for setting up factories etc. Factors that create a conducive environment for FDI include political stability, consistent support by public institutions, sound macroeconomic and legal frameworks, efficient logistics, minimum trade barriers, agglomeration economies and low-cost and highly efficient human resources. Since global value chain producers need to transport product components from one location to another expeditiously and with low transaction costs, the efficiency of road and sea transport, access to ports, speed of customs clearance, warehousing and the existence of minimum tariff and non-tariff barriers are critical.\nKeep in mind that all investment isn’t good or sustainable investment either (\n). Here are a handful of reasons why foreigners just aren’t investing as much as we’d like.\nYou’d be surprised at the number of people that still don’t know where Sri Lanka is, and some think it's an annex of India. Check out\nfor more.\nSri Lanka’s economic strengths are rarely discussed on global platforms, with emphasis either on post-war reconciliation or tourism. Furthermore, Sri Lanka’s brand as created by GoSL is Sri Lanka is a tourist destination (\n) rather than a place to invest in sectors other than hospitality. As a result, the business communities in the West often see Sri Lanka as a place to go visit for a holiday rather than a place to put money in.\nand\nare direct comparisons to this, aggressively campaigning for both their tourism and potential business opportunities. While Singapore has its attractive status as a financial hub, India has desirable natural resources, and Bangladesh has cheap labour.\nWith so much inconsistency, changes and fluctuations in taxation and land ownership policies, Sri Lanka isn’t a safe investment. In fact, it’s reported that\nat the end of 2016 due to inconsistent policies and backpedalling.\nGoSL prioritises Chinese, South Asian, and European relationships as opposed to North America. For example, when's the last time any minister visited Canada? As a result, the effect is that the Canadian, Australian, and UK governments mostly see Sri Lanka as a place that a\n.\nCanadians/ North Americans often don’t know where the opportunities are outside the BOI-promoted projects which are the product of Government interests. As it stands, the GoSL is promoting projects like a\n, which may not be projects considered feasible by many. In fact, information in general is hard to find. It was difficult to find publicly-available Government information for this piece itself, and most pertinent links came from external bodies.\nUnder the Canadian Corruption of Foreign Public Officials Act and the US Foreign Corrupt Practices Act, it is absolutely illegal for Canadian / American businesses to bribe or attempt to bribe public officials. Where bribes have been asked for, Canadian companies will turn off investing completely. Unfortunately,\n. On the plus side however, the country is ahead of many of its regional peers (and competitors for FDI), like the Philippines, Thailand, Vietnam, Pakistan, Myanmar, and Bangladesh.\nFor example, foreign exchange currency control is not yet completely removed, which is a barrier to investment. In fact, according to\n“Sri Lanka is trying to make Colombo a financial centre, but analysts say without a complete overhaul or abolition of the central bank, the idea will be a pipe dream.” Furthermore,\n“Sri Lanka’s present import regime is one of the most complex and protectionist in the world.”\nConcerns about dispute resolution in Sri Lankan courts, as Lankan courts often do not recognise litigation filed in other countries. This is an issue particularly when it comes to ownership rights and disputes.\nFor many international companies and bodies in Sri Lanka, finding highly qualified staff is difficult. Due to Sri Lanka's brain drain, many highly-skilled workers leave after training or education. Productivity and punctuality concerns are also rampant. There’s also a lack of formalized brokers for FDIs, as opposed to people who \"know somebody\". Foreigners will also realise that unless they pass a certain investment minimum and have BOI approval, getting working visas for their foreign staff is ridiculously hard. According to Economist Deshal de Mel (\nhere), this also makes it difficult to attract foreigners who want to export using Sri Lanka as a base, because our labour is comparatively expensive and unproductive, and they’d much rather invest somewhere like Bangladesh for cheap labour or Thailand/Malaysia for technology and productivity.\nAttracting foreign investment or partnering up with global businesses doesn't need to be so dicey, especially when Sri Lanka's got so much potential. If you're looking to move/expand your business to Canada or North America, or just want to learn more about entering new markets, have a chat with international business consultants like\n.\n",
  "url": "https://www.yamu.lk/blog/why-dont-foreigners-want-to-invest-in-sri-lanka"
}