{
  "title": "YAMU Date Night Index 2018",
  "abstract": "We have made Valentine's Day planning easier for you.",
  "author": "Dinithi",
  "date_published": "11:31am",
  "content": "\"Valentine's Day. It's the one time of the year when the world tries to be as romantic as I am all the time.\"\nThese wise words of Manny Delgado from Modern Family pretty much sum up what Valentine's Day is. No matter, we are here to help you plan your perfect date night with your special someone, including where to go, and what to wear (via\n). Let's get started.\nIf you want to be up close and personal with your partner (like you should be every day) may we suggest;\nLadies, if you're having trouble picking an outfit that's comfortable but at the same time sure to make some heads turn, try something fresh with a cool, new concept on conventional Valentine's dressing. Get this unique designer\nstyled with your own choice of minimal jewelry would make up for a comfortable, yet sophisticated outfit.\nFor those of you who want to enjoy some fine-dining with great booze and mood music we suggest;\nIf you're going for classy, you wanna look it too. The\nis a great choice for a fancy dinner out, just as it is for a private and personal dinner. The designer print is super versatile and flexible enough for you to be able to wear it on more than one occasion.\nIf you and your special someone share a unique love of history and colonial heritage, may we suggest;\nAll you gentlemen, if you want to gift your special lady something special, try out these elegant designer sarees in heritage art form batik with a modern design take. Why not get her the\n, it comes with a Printed Chiffon saree jacket fabric (don't worry, she will know what that means).\nFor those well-established relationships that don't need contrived situations to feel the connection or on the other hand, the ones that are still \"not quite there yet\" we recommend;\nYou can try the\nor the\nfor a casual dinner date. Keeping up to the season's flavour, the lettered embroidery on the neckline is tastefully done, and the stripe embroidery detailing on the sleeves and hem add value to the dress itself. Great attention to design while keeping it casual best! Wear it with a pair of sneakers and you're good to go. These dresses are great holiday looks too, so great if you're looking for double-duty looks.\nThere you have it. We hope you've got some ideas on where to eat or what to wear on this day from our list. Check out the Valentine's collection on\nto find some great looks or gifting options this season.\nIn the end, true love is about keeping the spark alive and to keep this level of romance each and every day, in however way you can. It's not all about gifts and chocolate (maybe a little), it's about establishing something deeper. Love wins. It always does.\nHappy Valentine's Day!\n",
  "url": "https://www.yamu.lk/blog/yamu-datenight-index-2018"
}