{
  "title": "YAMU's Top 10 New Restaurants For 2014",
  "abstract": "Here's a list of our favourite mind blowing restaurants and bakers that came up in 2014. ",
  "author": "",
  "date_published": "1:15pm",
  "content": "A lot of restaurants/bakers/etc opened in Sri Lanka in 2014. These are the places we thought were mind blowing.\nYou can click on the name of each place to read our full review. Note that we aren't saying these are the best places overall, these are just our favorite new entrants of 2014.\nRocket Burger will probably always be one of our favourite burger joints in the country. You'll find it between shops on Pedlar's Street in the Galle Fort, the burgers are tall and oozing, and you get a plate full of potato wedges instead of fries. Their Bulgogi burger is pure magic, stuffed with juicy marinated beef, Bulgogi sauce, mayo and kimchi.\nAchcharu Kade is one of the many start-ups that moved out after gaining popularity at the\n. They have an interesting range of food on their menu that keeps changing daily - the food is super affordable, they've got a delicious rice & curry, and watch out for that awesome bombai muttai ice cream.\nAmbrosia is one of the two bakers on our list - and this year it really impressed us. Since they've got a low minimum order they're more affordable than other bakers, and their sweet concoctions literally made us go 'wow'. Their cupcakes are foodgasmic (go for the ones with warm ganache centers), and their almond-flake roulades are beautifully done.\nGiovanni's was such a pleasant surprise this year. It's one of the city's best pizza places, a one-man-show with Dimuthu at the clay oven,working hard to whip up his own recipes for generous Italian pizzas. Considering the quality of the pizzas and amount of toppings, it's also super affordable.\nThis new Italian restaurant is the result of a Sri Lankan restaurateur making it in Italy and bringing that experience (and a fair amount of investment) back here. This spot is in Bentota, but if you in the area they do a lovely and authentic take on Italian pastas and seafood, all at an international standard.\nBakes By Bella gained popularity for her yummy creations this year mostly through\n. She makes divine mini-cupcakes, biskies, and peanut M&M cookies - but it was really her classic jar of brownies, cream and strawberries that made us fall in love. Now everybody's putting stuff in jars, but for us it started here.\nAnother graduate of the Good Market, this family run spot on Thimbirigasaya does the best hot dog in the city (not much competition, but still) as well as excellent bread, sausages, pickles and more. It's a place you can use for grocery shopping, but they also do a nice range of things you can eat in.\nAnother family run spot, this is basically a Thai wife who cooks really well and they opened up a restaurant. The food is amazing though the portions are small and the service basically couldn't handle all the people after our first review (and word of mouth spread). They since improved their service and the food is still excellent. They go for a Thai street food style and they nail it.\nSo that's our favorites for 2014. Colombo has gone from having the same few restaurants for decades to a new eatery opening almost every week. It's been a pleasure to eat our way through all the creativity. Happy New Year.\n",
  "url": "https://www.yamu.lk/blog/yamu-2014-favourites"
}