{
  "title": "YAMU Loves: Dilmah's Lapsang Souchong Tea",
  "abstract": "It's a black tea that sharply divides opinions - but you already know we love it. Go on, give it a try and let us know…",
  "author": "",
  "date_published": "9:51pm",
  "content": "It’s hardly unusual for coffee to evoke strong reactions, but tea occupies a rather more genteel place in the scheme of things, especially in Sri Lanka. Offering a gentle, well-rounded lift rather than the in-your-face jolt of coffee, it is the likeable poster child of the beverage world.\nThere is one tea, however, that strays so far from the norm that it almost always evokes extreme reactions: the lapsang souchong. A strong, amber-coloured drink, its most striking characteristic is a smoky aroma that some liken to charcoal, while others compare to a peaty whisky. Like a hoppy beer or black coffee, lapsang souchong’s flavour either grows on you or leaves you cold.\nOriginally hailing from the Wuyi mountains in the Fujian province of China, lapsang souchong (zheng shan xiao zhong in Chinese) is considered by some as the first black tea ever produced. There are many legends surrounding its creation, but all of them have one fact in common. Tea farmers in the Fujian province are said to have dried souchong leaves, which are larger and older than orange pekoe (considered the finest leaves), by gently roasting them over pinewood embers. The embers of the burning wood infused the tea with a unique aroma, which has become the signature scent of lapsang souchong.\nAs a big fan of all things smoky (and a longtime fan of lapsang souchong), I was thrilled to find Dilmah’s iteration of the drink at the t-Lounge. When brewed, the leaves lend the tea an almost jewel-like, resin hue, and a complex aroma that brings back memories of barbecues and campfires. Introduced two years ago, Dilmah’s souchong is a single estate tea produced in the Galle district. Unlike traditional souchong, Dilmah’s version is roasted over locally procured cinnamon wood, which adds a slightly bitter intensity.\nVeering far from the norm of sweet, mild, milky teas, Dilmah’s souchong is a bold experiment — and one that’s well worth trying. You may love it or hate it, but what fun is food or drink without a little debate?\nA cup of Dilmah’s lapsang souchong costs Rs 290 while a caddy costs approximately Rs 715. For address details of the t-Lounge, visit the\n.\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-dilmahs-lapsang-souchong"
}