{
  "title": "YAMU Loves: Tom Yum At Tom Yum",
  "abstract": "Scorching yet immensely flavourful, Tom Yum's version of its namesake dish has cemented its place among our firm Thai…",
  "author": "vidya",
  "date_published": "9:50pm",
  "content": "As an introduction to the punchy, no-holds-barred flavours of Thai food, there are few dishes that compare to tom yum. A home-style classic that binds the signature herbs and spices of Thai cuisine together in a fiery broth, it is a vividly sensory experience. Intensely aromatic, deeply spicy and a riot of colours and textures, it is a deceptively simple soup with a surprising depth.\nFrom the Thai words ‘tom’ which means a boiled broth and ‘yum’ or sour and spicy, tom yum is often referred to as the ‘national aroma’ of Thailand. Fresh herbs such as galangal (or Thai ginger), lemongrass and kaffir lime leaves form the foundation, bird’s eye chillies (and chilli paste) bring the heat, and seafood or meat add the heft. Laden with prawns, tom yum goong is the most popular iteration of the dish, while tom yum gai includes chicken.\nFar from a fussy, restaurant-style dish, tom yum is the very definition of Thai home cooking. As Thai food blogger Leela Punyaratabandhu, who writes a popular food blog called\n, says in\npiece on Serious Eats, “In Thailand, while dishes like Pad Thai...are almost always left to the street food cooks, tom yum is rooted firmly in the home kitchen. This is what a mother makes with a plate of Thai omelet for dinner when the fridge is nearly bare. It's what a father who only cooks once a decade, can make blindfolded.”\nOur search for a tom yum that ticks all the boxes led us to an unassuming restaurant by the same name in Bambalapitiya, which has been dishing out street-style Thai food since 2014. On our first visit, a couple months ago, Tom Yum’s rendition of its namesake dish left us breathless. Each mouthful of the soup, dressed with a slick of chilli oil, hid a knockout punch. Scorching the\nwhile also delivering plenty of chew from the generously strewn squid and prawns, it was a sinus-clearing dish that sent our endorphins into a tizzy.\nA family recipe handed down to Rom, who co-owns the restaurant along with her husband Divanka, Tom Yum’s version of the dish derives its gut-punch heat from tiny, local kochchi chillies. A shoo-in for hard-to-source bird’s eye chillies, they perform their role valiantly. Here’s a hat tip: Don’t ask for the spice to be toned down, it defeats the purpose. Instead, order a full-bodied bowlful, which can easily satiate two to three diners, the next time you visit. And when the fire subsides, leave us a comment to tell us what you thought.\nA portion of tom yum goong and tom yum gai at Tom Yum costs Rs. 750. Read our earlier review of the restaurant\n.\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-tom-yum-at-tom-yum"
}