{
  "title": "YAMU Loves: Seeni Sambol And Sprats Ice Cream",
  "abstract": "Onions and dairy would ordinarily not mix, but they co-exist happily in rare's excellent seeni sambol and sprats ice…",
  "author": "vidya",
  "date_published": "9:51pm",
  "content": "We love being surprised by little-known ingredients and unconventional flavour pairings, so\nseeni sambol and sprats ice cream makes the inaugural cut of our YAMU Loves feature.\nNot so long ago, ice cream was little more than the trusty trifecta of milk, cream and sugar, with a little alchemy thrown in. The retro flavours of my childhood—vanilla, strawberry and chocolate—merely served as vehicles to deliver the uncomplicated pleasure of eating ice cream. We didn’t expect ice cream to taste authentic or break fresh ground – all it had to do was to be sweet, creamy and predictable.\nBut things have come a long way since Kwality Wall’s Cornettos were the last word in innovation. Masterchef Australia’s runaway popularity means we’re all familiar with Heston Blumenthal and the mind-boggling flavours he conjures up in the name of ice cream. At his restaurant,\n(in Berkshire, UK and now in Melbourne), one of the most popular desserts is a\n, infused with the flavour of bacon and eggs and injected into empty egg shells, which are ‘scrambled’ live for diners. Elsewhere, chefs like New York’s\nare radically expanding the contours of conventional ice cream with flavours like foie gras, purple rice, and cream cheese and carrot cake.\nAgainst this backdrop of ice cream as culinary canvas, rare’s unconventional range of\ndeserves special mention. The ice creams play true to the restaurant’s overarching philosophy of using local ingredients and translating them into an international context. While we love many of the 12 flavours that marry sweet, savoury and spicy notes—including the black pepper and olives, passion fruit and chilli and salted peanut—there’s one in particular that we will single out for high praise. It’s the seeni sambol and sprats ice cream (Rs. 550).\nOnions and dairy would ordinarily not make for happy bedfellows, but the restaurant’s spin on the timeless combination of onions and sprats hits bull’s eye. The jammy sweetness and mild fragrance of the caramelised onions pair perfectly with the creamy custard, the sprinkling of dried sprat powder on top adds a touch of saltiness, and a smattering of red chilli seeds lends a subtle heat. It sounds odd, but it really isn’t – instead, it is an edgy experiment that has worked.\n“It could have gone either way,” admits Chef Vichalya Fernando, 27, who is the executive chef of the restaurant. “We had to research for several months before we got it right.” To ensure that the seeni sambol meets his exacting standards, Fernando says it is made afresh for every new batch of ice cream. The onions are caramelised for longer than usual to enhance their sweetness, and they are infused into the custard for 24 hours before the ice cream mixture is churned. That accounts for the bold-yet-balanced flavour of the final product, which takes your expectations and flips them on their head in the best way.\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-seeni-sambol-and-sprats-ice-cream"
}