{
  "title": "YAMU's 6 Favourite Dosas",
  "abstract": "Dosa hopping exposed us to a few interesting dosais in which gingelly oil, copious amounts of chilli, and cashew nuts…",
  "author": "Aisha",
  "date_published": "2:29pm",
  "content": "Having originated in India, dosa— those soft (or crispy) fermented pancakes — are now a local favourite, especially amongst those who favour saivar food. Ghee dosais and masala dosais are the most popular and are absolutely amazing when done well, but most places dish out mediocre versions. We've been saivar hopping, trying out a variety of dosais, including the not-too common. While we haven't covered\ndosa places around Colombo, we tried our best to sample a range of options. These are our favourites, in no particular order.\nCrispy and oily, this is one dosai you could binge on without worrying about high blood cholestrol. With a yellow and lightly green tinge to it, the colour adds on to the whole 'this-is-healthy' vibe.\noil is sesame seed oil, and has pretty amazing medicinal qualities. It's particularly good for you if you've got high blood sugar or diabetes. Though honestly, I'm not sure how good it is when it's (lightly) fried. It's as crispy as a good ghee roast, and it gives off a strong but not overpowering gingelly flavour. If you don't like the taste of herbal essences (no pun intended) this probably isn't for you, but we liked it and found it to be pretty amazing.\n\nRs. 270\nA crisp, butterscotch-coloured cone that you can smell even before you have torn off a piece and popped it in your mouth. Suryas' ghee roast throws down the gauntlet to all the other competition. Decadent and fragrant, it renders the accompanying chutneys and\nirrelevant. Be warned that this can disappear within a matter of seconds, and if you're out with friends, ordering a second round is completely natural.\n\nRs. 230\n\nThis ghee masala dosai was one of the best we've had in a while, and had a great balance of flavour, texture and creaminess. What made this that much better was the masala. Unlike most places, it was not too spicy. Bhagya actually prefers it this way, claiming that you can really enjoy the flavour of the potato masala when it's prepared thus. Besides the masala, you also get the sambar and two chutneys. It's pretty epic when all three condiments are combined.\n\nRs. 420\nThis fiery dosai will leave you in tears as you walk out of the restaurant, nursing a tissue to your runny nose — it's\nspicy. Folded into the dosai, the onions were tempered and bathed in generous doses of chilli powder. I thought it lacked salt, but it was still really good. It's basically like\nwithout the\n, and is perfect for anyone who loves the heat of chilli.\n\nRs. 150\nWe know this doesn't look all that great, but looks can be deceiving. The mixture consisted of semolina, onions and cashews. The roasted cashews had a pronounced nutty flavour, and went well with the crunchy, finely chopped onions. This is one of our favourites, and the portion was quite large and filling as well. It's perfect for a meal or for a snack — we basically had it as both.\n\n\nRs. 260\n'Rava' is basically semolina, and a rava roast is, as the name implies, another lightly fried dosai which is slightly fluffier than your average ghee roasts. This was crispy and had\nfinely interspersed with the batter. I'm not a fan of\nHowever, this was chopped and tempered so well that it went completely hand-in-hand with the roast, and I quite liked it.  There was also a slight touch of chili which added a welcome dash of heat to it.\n\nRs. 260\nWe know there's many more varieties to try out, and we'll hopefully get around to covering more of them soon. If there are any of your personal favourites you'd like to recommend, hit us up in the comments. Meanwhile, Malinthe's been working on\nso you can look around for what you'd like, and where you can get them. As a result of that,we now have this\nwhich are available at our favourite dosa joint — Sri Suriyas. You're welcome!\n",
  "url": "https://www.yamu.lk/blog/yamus-favourite-dosas"
}