{
  "title": "YAMU's Top 10 Galle Fort Spots",
  "abstract": "Meet our top 10 Galle Fort spots, from quirky bars to heritage hotels.",
  "author": "Kinita",
  "date_published": "11:42am",
  "content": "Galle Fort is one of our favourite locations on the island. Despite its rampant gentrification over the years, it's maintained that irresistable colonial charm and artsy vibe. With the\nabout to roll around, we've got our top 10 establishments that you might enjoy for some mid-literary libation.\nBuilt in 1684, Amangalla is an absolute bastion of Fort history. Serving as accommodation for colonial Dutch commanders, then as the New Oriental Hotel for about 140 years, it's been taken over by international boutique luxury chain Aman for the past decade. You can expect quiet, old world luxury and impeccable service, with prices to match. If you can't get a booking there, we'd recommend stopping by for a meal.\nThis is a tiny and incredibly quirky little bar near Pedlar's Street which offers an interesting selection of drinks. With fabulous decor set up by the adjoining\ninterior decor store, it's a great spot to wind down with a cocktail.\nOne of our favourite secret spots in Galle, Poonie's Kitchen is a delightful respite from the overpriced and underflavoured touristy restaurants down south. Their ambience is absolutely lovely, and the food is great at relatively reasonable prices (about Rs. 1000 a head). We recommend their prawn noodles.\nFortaleza serves up good continental fare and has a solid selection of wine. We'd suggest you go there in the evening for lovely underlighting, a bottle of wine, and their table top barbeque. They also have 4 rooms in case you're looking for accommodation.\nPedlar's Inn is a Galle Fort staple, the ultimate place for tourists and visitors. It's a little bit expensive, but it's got plenty of seating and a lovely courtyard. We love their understated decor and al fresco dining, although their food can be a bit uninspired sometimes.\nA relatively new addition to the Fort, A Minute By Tuk Tuk is on the upper storey of the Galle Dutch Hospital. It's got a stellar view overlooking the Indian Ocean and a good selection of drinks. Although their cocktails are the usual Rs. 700-900 a pop, their arrack is fairly reasonable.\nMango House is one of our favourite spots to stay in the Fort. Their decor is quirky and charming, and their prices not exorbitant at around Rs. 10,000 for a double room per night with breakfast. They do tend to get booked out fast, so book in advance if you can!\nDespite only having 4 suites, 42 Lighthouse Street is one of the most beautiful places to stay in the Fort. Built in the early 1800s, it's been expertly restored by the Taru Villas team. We'd recommend it if you're looking to spend the long weekend with a special someone.\nThe GFH is right in the heart of the Fort, and comes equipped with all the usual amenities you'd expect from a small luxury hotel. They also really play into that old-school vibe with a vintage car parked outside and their three century old heritage. Again, you'd be wise to book in advance.\nAn interesting portmanteau of Dharshan Munidasa's Colombo establishments (Nihonbashi and Ministry of Crab), Tuna & the Crab may sound like the name of a hipster band but serves up great seafood. It's quite pricey, but if you want good crab or fresh sashimi, this is your best bet in the Fort.\nFor comprehensive directions on how to reach Galle check out\n. You can also have a look at our map here:\n\n",
  "url": "https://www.yamu.lk/blog/yamus-top-10-galle-fort-spots"
}