{
  "title": "YAMU Loves: McDonald's Crispy Chicken",
  "abstract": "Terribly unhealthy but oh-so-good.",
  "author": "",
  "date_published": "10:20am",
  "content": "First of all, we're sorry. We know that McDonald's is a shining beacon of capitalism, where, in Sri Lanka, they make you buy inexplicably expensive burgers and limit your flurry options to Oreos. All said and done, we kind of sort of maybe like their Crispy Chicken.\nOkay, we love it. Hence this YAMU Loves piece. Step aside KFC, the fast food fried chicken force is stronger with this one.\nThere's only so much one can write about fried chicken, especially from a fast-food outlet, so let's get this over with.\nFor \"Only\" Rs. 480, they make it sound like you're getting a great deal. They also trick you into thinking that what you're spending is closer to Rs. 400 than Rs. 500. That may just have been our hunger-riddled stomachs tricking us instead. Also, it\na pretty good deal, compared to its competitors. We're just slightly horrified at actually loving incredibly unhealthy fast food this much.\nSo, back to the chicken:\nIt's as good a deal as you'll get for spicy, piping hot, batter-fried chicken. You only get two pieces, but it's surprisingly filling. I love how the meat itself has flavour and a good seasoning game going on — it's basically a larger piece of chicken than what you get sandwiched between your McSpicy. Plus points are that you don't have to deal with bread and mayo and that sad bit of lettuce that's stuffed into their burgers. They're also good at draining the oil, so you're not left with an oily mess like their competitors.\nIf you want something fried, unhealthy, fast, AND filling, your best bet is is this (unless you stock up on street samosas, which are even better). These are available through their delivery app, which we've been using at work quite a bit. I mean, even Imaad likes them, and he doesn't like anything.\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-mc-donalds-crispy-chicken"
}