{
  "title": "YAMU TV's Press Release",
  "abstract": "We recently ran our first press release. It ran in a few newspapers and on LBO. ",
  "author": "indi",
  "date_published": "11:10am",
  "content": "We recently ran our first press release. It ran in a few newspapers and\n.\nAlso, we reproduce the press release here, for your reads.\nFrom chocolate biscuit pudding to a light-hearted analysis on the power cut crisis and almost everything in between, tens of thousands of content-hungry Sri Lankans have found a new online resource that has gained exponential viewership in just five months from its launch.\nYAMU TV was launched in November 2015 by YAMU (www.yamu.lk ), the three-and-a-half year old start-up best-known for its online dining and city guide. The company reports that viewership on its Facebook page has more than doubled every month, from 44,000 views in its first month to 720,000 in February 2016.\nThe site contains a mix of original video content produced by YAMU TV, including recipes, a weekly commentary on topical issues by co-founder Indi Samarajiva, pets and more.\n“The rapid growth in viewership has been very exciting,” said Indi Samarajiva, Director of YAMU. “We publish around 20 new original videos each month, which can be viewed for free by visiting the YAMU TV website or the YAMU TV Facebook Page. The majority of viewers access our videos through Facebook.”\nThe most viewed video on YAMU TV to date has been a one-minute demonstration of how to make chocolate biscuit pudding, with 685,000 views at 24th March.\nThe original content on YAMU TV is presented under different segments such as ‘UYAMU’ - short video recipes featuring popular dishes like kottu, hoppers, crème caramel and Peking duck; ‘How It’s Made’ – peeks into how Colombo restaurants make signature dishes; 'The Weekly Show with Indi' – a humorous look at controversial and topical issues; 'Risky Business' – light-hearted interviews with interesting and informed local professionals on quirky, topical subjects and 'Word on the Street' – interviews with people around Colombo on issues in the news.\nThe YAMU start-up launched as a content company with restaurant reviews as its core activity. Its initial success resulted in a diversification of content, leading to the YAMU team growing from four people at commencement to 18 today. Currently, four members of the team work on video: Shifani Reffai, Dylan Nanayakarra, Imaad Majeed and Malinthe Samarakoon.\nThe YAMU website, which averages 120,000 users per month, has independently reviewed more than 800 local restaurants. It is supported by an app for iOS and Android powered smartphones and tabs and a monthly magazine of the same name, which is available free at restaurants, coffee-shops, hostels and stores around Colombo, or on subscription for home delivery. Visitors to the site can also sign up for email delivery via a subscribe link.\n",
  "url": "https://www.yamu.lk/blog/yamu-tvs-press-release"
}