{
  "title": "YAMU's Most Frequented (Where We Actually Eat)",
  "abstract": "Some places the YAMU crew runs back to even after the review is published, for second and third noms. Here are a few…",
  "author": "Shifani",
  "date_published": "1:10pm",
  "content": "These are the places the YAMU staff actually eats (on their own dime). We're not saying these are the best, these are just the places we end up going back to again and again.\nTasty is my (Shifani's) go-to guy. They do a tasty rice and curry, a delicious, generous buttery range of short-eats and pastries, and hello, the best eclairs in town IMHO. As far as quick affordable bites and reliable lunch goes, they're at the top of the list. Located in the very happening neighborhood that is Thimbirigasyaya, it's easily accessible and just a skip away from Hansa (good chocolate coffee). If you frequent Tasty yourself there's a chance you'll spot me walking out with a dozen eclairs for the team at office. [\n].\nAshik is not too far from our office and a lot of us head down there for a good mid-day rice and curry. The yellow keeri samba rice is especially good, and it comes with thick creamy parippu, papadam, gotukola mallung, a very well seasoned piece of chicken, and sometimes a bit of jack fruit. For Rs. 150, this is a wonderful packet of value for money. For about 100 bucks more you can get a nice, flavoursome, peppery batter-fried chicken with your rice, a good alternative to the KFC drumlets. Our alternative for a quick R & C is\n.\nMin Han is Indi's favourite and he's probably been there like ten times already. The Chinese food is always delicious, comes in big portions and is very cheap. It's a bit on the dingy end of the restaurant spectrum, but we love the fare. Everything on the menu is priced at a max of Rs. 680 for a small, which is enough for four people - the juicy sweet Japanese style prawns, cuttlefish, pork dishes and sweet potato leaves are all pretty satisfactory dishes to go for. Watch out for Wijayapala, the main waiter, he's quite the character.\nSkrumptious is our lord and saviour, from the kingdom of over-the-counter gooey, chocolate-dripping brownies. This is high quality stuff, and they know me quite well now because I keep calling and demanding they deliver me their bowls of chocolate biscuit pudding. They've got a well known restaurant now\noff Jawatte Road, and a convenient\n, but the good thing is you can just get them to deliver it to you. Go for the peanut butter brownies and the CBP. Delivery efficiency can vary though, depending on your location and time of phone-call, so best to call the day before.\nNaniyori is another favourite delivery option on our list. It often arrives on Bhagya's table, only to be guarded ferociously by him, though we usually end up swindling a slice of sashimi off the box when he's not looking. Naniyori is the only decent Japanese delivery service in Colombo as far as we know. It's certainly not the best Japanese in town but their bento boxes are a win. For about Rs. 920, you get a fresh and filling assortment of sushi, sashimi, rolls and veg sides. The soy sauce and wasabi coupled with the sushi are a special delight, and this may not be world-class sushi, but it's quite good and for the price it can't be beat.\nTatlers Tea is no big deal on Colombo's restaurant scene, but it's a nearby option for us when we're craving a good cuppa tea. The place is a cross between a cafe and a kade, a very small space that mostly just does decent tea. Dinesh and Sandesh often stop by there for an afternoon chill sesh, while they also shake up some very thick fruit juices and a few shape-eke shorteats.\nMythi's is one of Bhagya's prime haunts, because he loves ze pork. Besides their killer rice and curry, they make one of the best black pork curries in the city. The pork rice and curry comes heavily laden, and only in the Rs. 200ish price range, with a great flavourful balance of spices and pepper in the curry, and a bucketload of tasty rice and parippu and fresh gotukola mallung.\nBombay Sweet Park is frequented by us for one reason only: samosas. It's a very small kade on the Galle Road side of Visakha Road, and they usually do rice and curry, shorteats, Faluda, the usual. The shorteats are good and the juices come in nice tall, thick glasses, but their samosas are just perfect - crispy neat corners, and plenty of spicy, flavoursome meaty filling. We usually get a dozen of these on Mondays to help us reluctantly wake up and start off the week.\nThe Cakery is our reliable source of birthday cakes for everyone in office. The place, under the flag of the English Cake Company, has long been known for their desserts made from high quality ingredients - and they were recently lauded for\n. Anyways, the rich cheesecake and the creamy chocolate fudge stuff here is da bomb. While a slice can cost about Rs. 200, a cake costs close to Rs. 2000. It's pricier than your average bakery cake, but then again this isn't your average bakery cake.\nGiovanni's is our go-to pizza place. They don't do very wide delivery, but they cover Colombo 5 pretty much and their pizzas are amazing. Really generous amount of toppings (sometimes you can't even pick them up) and quite affordably priced (usually around Rs. 850 to 1300). Dimuthi is a pizza journeyman of sorts who has worked at a few places before opening up shop here. He's got mad skills and we recommend, especially the bacon and cheese pizza, or whatever he's got as a special.\nCharcoal is a wonderful little find down Hotel Road in Mount, with charming ambience and quality, not-too-pricey bites. Three of us are from the Lavinia end of town, so it's one of the options we consider when looking for a place to chill, be it for a tasty meal, a meetup or a quiet read with a cup of mocha. With your orders coming in at about Rs. 300-500, the burgers and the cheesecake are worth nomming on, they use Hansa coffee in their beverages which hit the spot, and on some evenings there are jam sessions on the terrace upstairs. The only sad thing is they close their doors at 8PM, so make sure you get there early.\nSo, those are some of the places the YAMU staff often visits. Again, we're not saying these are our top recommendations or anything, this is just where we find ourselves time after time. What are your regular hangs? If you've got suggestions, list them in the comments below.\n",
  "url": "https://www.yamu.lk/blog/yamus-most-frequented"
}