{
  "title": "YAMU Loves: Tres Leches at Butter Boutique ",
  "abstract": "The milk-soaked, cream coated tres leches cake is the latest craze among Butter Boutique frequenters, and the YAMU crew is…",
  "author": "",
  "date_published": "11:12am",
  "content": "In the world of cake, especially if you're like me and are on some secret quest to eat all the cake in the world, it's easy for one spongey creamy concoction to get confused with another. But our recent visits to Butter Boutique introduced us to a very fresh, new infatuation, and after many a clandestine meeting, I found myself thinking, hey... this one is not like all the other cakes. It's special. Maybe... it's the one. (Right now in my head I'm standing in the rain with tres leches à la The Notebook scene.)\nThe tres leches is as magical as it sounds. (Sounds like tray-la-shay, I think. Though I could be\nwrong.) The phrase means \"three milks\" in Spanish. It is cake soaked in three kinds of milk - condensed milk (aka Milkmaid), evaporated milk (what remains when 60% of the water is removed from fresh milk), and cream. The milk-soakage makes the cake incredibly soft and moist, without being soggy, and gives it a really wholesome, distinct flavour. A layer of only-slightly-sweet whipped cream is slathered thickly over the top of the cake. Between the milky, light base below and the generous cream above, there's very little to keep me from reacting in the following manner when someone tries to casually sneak a bite of my tres leches:\nButter Boutique is one of Colombo's finest when it comes to over-the-counter desserts, contending alongside high-quality ingredients and recipes from places like\n,\nand lately\nThe tres leches however, currently, blows all competition out of the park. Especially if you're the type who enjoys your cake, but at the same time, you don't want to pass out belly-up with a bad sugar-hangover (yes that's a thing), this one is relatively easy on your sugar levels. It's sweet, but it doesn't give you that OK-I-ate-too-much sensation you get after having a big slice of typical cake favourites (chocolate, buttercream, peanut butter).\nApparently tres leches is a big deal in the Caribbean. Also the practice of soaking cake in a liquid is pretty old, goes all the way back to medieval times. It comes in different variations today - one popular one being that in Turkey, where they sometimes literally make it using three milks: cow's, goat's and water buffalo's.\nThe reason I'm giving you useless tres leches trivia now is because, quite frankly I've run out of things to say about it.\nMuch like its recipe, it's a straightforward, no-nonsense, simple, happy dessert. The cake is light and soft, a bite feels wholesome for its milkyness and its restraint on sugar, and though technically it's probably as bad as other cakes for your weight, you don't feel so guilty afterwards. Try it yourself, it's one of those instant fixer-uppers on a bad day. A slice costs Rs. 400 at\n- you can read more about them\n\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-tres-leche-cake-at-butter-boutique"
}