{
  "title": "YAMU's Favorite Bubble Teas ",
  "abstract": "Here's a list of our favorite bubble teas. ",
  "author": "ShaliniIR",
  "date_published": "1:58pm",
  "content": "It would be an understatement to say that \"YAMU loves bubble tea\" because we don't love it, we're obsessed. The only thing that's asked more than \"can we go get bubble tea,\" is \"what are we having for lunch?\".\nFortunately for us, we have three bubble tea outlets within our vicinity:\nThimbirigasyaya (which is sadly closed for renovations),\n(Natalia and Ushan have loyalty cards because they practically live there), and\nat Liberty (one time, we walked out with 13 bubble teas). So in no particular order, here are our favourite flavours of bubble tea and where you can find them.\nBubblelement crawled their way to our hearts with their chocolate bubble drinks. Office favourites include Kit Kat, After Eight, and obviously Bobatella. These are absolutely delicious but it will send you on a week-long guilt trip. What we love is that they don't use a particular syrup for these flavors, instead blend actual chocolates, which makes the drinks more brilliant. We prefer to take these drinks to go because if you have it in-house, their servings are just too small and not worth the price.\nHonorary mentions to Bubbelement's Taro and Classic Milk Tea. Taro is generally a hard flavour to get on point (we know from our terrible experience at Bubble Me) but they do a pretty good job. Milk tea is just milk tea, it's not hard to mess up but it's one of the most frequently ordered drinks at the office. It's milky, with the right amount of tea a good layer of chewy bubble.\nBubble Me has a lot of drinks to choose from: milk based, tea based, yoghurt based, and slushies. We love the new Caramel Mocha slushie, it's sweet with a subtle hint of coffee. Don't get any of their slushies with black pearls though because when the drinks are too cold the chewy pearls become hard and it's just sadness from there. We also love Bubble Me's Caramel Milk Tea (0% sugar with black pearls), its sweet, it's simple and delicious.\nTheir Lychee Tea with Strawberry Popping Boba is also one to look out for. It has a fruit-tea base, which is sort of bitter but the sweetness from the popping boba balances it out.\nMabroc is the cheapest bubble tea vendor around. Their prices go from  Rs. 250 for a small and Rs. 280 for a large. They also offer hot and cold bubble teas, which is great. Our favourite from Mabroc's milk based teas is the Classic Milk Tea and Tiramisu. Both of them taste better whether it is hot or cold. The milk tea is very creamy, with super soft black pearls. The tiramisu is not as creamy, but it has strong flavours and we love it.\nThe Passion Fruit Milkshake is also amazing. It's very summery, and light and perfect for a hot day (which is every day).\nThere you have it. Here are our top bubble teas. If we haven't included your favorite, let us know in the comments!\n",
  "url": "https://www.yamu.lk/blog/yamus-favorite-bubble-teas"
}