{
  "title": "YAMU Loves: Special Bento at Naniyori",
  "abstract": "We take a deeper look at one of our favourite Japanese dishes around Colombo: the special bento at Naniyori.",
  "author": "",
  "date_published": "9:52pm",
  "content": "For an island with an abundance of fresh fish, we have surprisingly few\n(less than 15). With most of them coming to around Rs. 2000 per head, it's just not affordable or viable to have regularly. There are a few exceptions though, and the Special Bento by\nat Rs. 920 has been one of our long time favourites.\nSo what sets the Special Bento apart from the other bentos around town? A great balance of quality and quantity. This bad boy comes with twelve maki sushi (kappa maki and tekka maki), five nigiri (salmon and tuna), kaisen don (sashimi rice) and pickled veges along with a few add-ons like a small sago pudding and green tea. Seventeen sushi for Rs. 920 in itself would be a great deal, but with everything else that they give, this is the most affordable way to get your Japanese fix.\nWe like to start with the maki to sort of get the taste buds going. Kappa actually refers to a\nHowever, the highlight of the bento is the nigiri. Just to compare, a single salmon or tuna nigiri usually sells for around Rs. 200, and the special bento comes with five! We almost always get this delivered, yet the seafood has mostly been fresh. They use slightly fatty cuts of tuna, which adds just a bit of richness, further complementing the flavour of the sushi rice. These nigiri are usually milder in terms of wasabi, which is fine since the bento comes with extra wasabi if you prefer to amp it up. The construction, while not perfect, is also much better than you'd expect considering the price of the sushi.\nWe've had this many times, and the consistency does tend to vary a bit at times, but we've always been happy with what we've gotten. It's not the most refined sushi you'll find in Colombo, but they've shown good technique and attention to detail that would usually cost a lot more. The best part is that this is also available for delivery, so they've basically got all the bases covered. You should definitely order in advance though, because it takes about an hour to an hour and a half to reach.\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-5"
}