{
  "title": "YAMU Called To The Cops Over Review",
  "abstract": "Ankara is a Turkish restaurant that doesn't like their review. So they called the cops.",
  "author": "",
  "date_published": "8:59pm",
  "content": "is a Turkish restaurant that doesn't like their review. So they called the cops.\nThis isn't the first time this has happened. These owners have called the cops before. Writing a review wasn't a crime then, and it isn't a crime now. This is a waste of everyone's time, but it's also a story.\nThe last time I was called to the Police Station was over a review of Eden Cafe. This was a different restaurant in the same location. I assume it's the same people, because literally no other restaurant calls the cops when they read a review they don't like.\nLast time I gave a statement, the police agreed that it wasn't a criminal matter and the case ended there.\nUnder Article 14 of the Sri Lankan Constitution, everyone has the right to free speech, including publication. This right isn't abridged for speech critical of the government, or the powerful, and certainly not for random restaurants.\nUnless your speech is a threat, or hate speech or inciting violence, the cops don't need to get involved. And a restaurant review is hardly any of those things.\nYou can file a\ncase for libel, slander, or defamation, but that doesn't involve the cops. Our reviews are also none of those things. They're just restaurant reviews.\nCommon sense also tells you that it's OK to write an opinion. Can you imagine the chaos and boredom that would ensue if you couldn't say you didn't like some food, or someone's wallpaper?\nFrom TripAdvisor to Amazon to even Facebook and Google Maps - everyone writes reviews. People have opinions and publish them. It's OK.\nWe seem to have built a significant part of the digital world on the premise that people can write what they think, good or bad, and the world hasn't collapsed. Indeed, it's gotten better.\nWe've had incidents like this in the past but haven't publicized them, out of respect for the restaurant. Wherever possible we try to talk directly and try and reach some understanding.\nIn this case, however, I got a call from the Daily Mirror which said Ankara had spoken to them and that they were running the story. Why they'd want to publicize their bad review is beyond me, but I have no idea what the papers would publish. I thought we'd tell you guys first. [Update: the\n].\nThe sensational aspect of the story seems to be that I'll be arrested soon. Which I don't think is true. I told the Police I'd like to talk to my lawyer and we're going in to make a statement tomorrow (the 7th). There is no crime to charge me with so I'd be curious to know what I'd be arrested for. As mentioned, writing a review isn't a crime.\nYAMU is proud to write unbiased reviews, especially in a media scene where most reviews are fawning and basically paid for. Unbiased doesn't mean the truth, it just means our opinion. We have a lot of experience, we try to hire smart people and we have an editorial process, but at the end of the day any review is an opinion. Our readers are intelligent and they can decide for themselves. They can write their own reviews as well. Or review us if they want.\nMost restaurants are mature enough to take a bad review and either learn from it or ignore it. A few, however, call the cops. Well, actually only one calls the cops.\n. At least they didn't threaten to kill us. But that's another story.\n",
  "url": "https://www.yamu.lk/blog/writing-reviews-isnt-a-crime"
}