{
  "title": "YAMU Loves : Hot Butter Cuttlefish at Randoli",
  "abstract": "We think we may have found one of our favourite hot butter cuttlefishes in the city.",
  "author": "",
  "date_published": "12:06pm",
  "content": "Who, nay, WHAT would we be without Hot Butter Cuttlefish? Hear our paean.\nThis uniquely Sri Lankan dish is more indicative of the island's true culture than the theology of your average bigot. A microcosm within a bite, each chunk of HBC represents an amalgamation of everything beautiful the resplendent isle has to offer - bountiful seasides, cultural mélanges, delicious cuisine, and a sharp whack of heat when you least expect it.\n,\n,\n, and dangerous dalliances with obesity (you're welcome, gentle reader), we thought we all had our favourites confirmed here at YAMU.\nWe popped into\n, (which we choose for proximity, not for the sommelier's selection), and started easing away the workday with some beautiful sunshine-kissed amber Old Reserve. As all our old reservations ebbed away, we thought a wee snack would hit the spot, and what else could we opt for but HBC, veritable institution of the bold and tipsy?\n10 minutes later, a middling sized dish of golden-fried cuttlefish steamed gently in front of us. 1.5 minutes later, an empty bowl of capsicum and assorted abandoned vegetables lay there, violated, desecrated, by our probing silverware that we wielded like sabres in an Inigo Montoya sort of fashion.\nThe flavour, the execution, the spice, everything! We've now tried Randoli's HBC 4 times and had a consistently good snick-snack served up each time. It's not cheap at Rs. 830, but the cheapness of the drinks (some Rs. 180 odd for a 50 ML of arrack) should offset the price of the dish somewhat. In our experience, they generally never re-fry, so you get fresh, piping hot fresh fare, with the right juxtaposition of chilli paste and sweetness.\nWhat happy creatures were we. Keep in mind that this dish is an indulgence, so don't let any part of this review fool you into thinking HBC is either gourmet fare or good for you. Trust this giant calamari admiral when he says:\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-hot-butter-cuttlefish-at-randoli"
}