{
  "title": "YAMU Loves: Beef in Chilli Oil at Min Han",
  "abstract": "Here's a closer look at one of our favourite dishes from one of our favourite restaurants in Colombo.",
  "author": "Aisha",
  "date_published": "9:50pm",
  "content": "Beef in Chilli Oil is pretty self explanatory and doesn't need to leave much to the imagination: it practically\nbeef in chilli oil, plus with a few other things like greens and vermicelli thrown in. You'd think the Chilli Oil is, well, chilli oil and therefore non-drinkable as a soup (as I first did on my first visit and used it as a gravy instead), but happily discovered that it doubles as both, soup and gravy without burning a hole in your stomach.\nWe've (meaning I've) been to Min Han's specifically for this at least thrice, and can vouch for satisfaction each time. Their erratic (and only) Sri Lankan waiter Wijayapala will however shake his head in disdain and and opine about how it's just\n, but don't be put off. If you love beef, and love spice, and love chilli,\nThe meat is surprisingly soft and succulent for beef, and is chopped into super bite-sized pieces. Also, it feels as if everything's been marinaded in the chilli oil mixture for so long that the flavour's permeated every cell of the beef, and even the vermicelli; so though the noodles are basically noodles, it's intensely flavoursome noodles. More importantly, even the bits of cabbage thrown in has incredible flavour and this surprises me as (in my book, at least) cabbage is the blandest thing I can think of and quite possibly one of my least favourite things to eat.\nWe can vouch for this in terms of consistency, with the only inconsistent thing being the amount of vermicelli involved — there's usually enough to eat for a couple of people, but one of the last times we went, we had to fish around the bowl to get a bit more than a couple of decent mouthfuls.\nCouple this beauty with some steamed rice and you're good to go.\n",
  "url": "https://www.yamu.lk/blog/yamu-loves-6"
}