{
  "title": "Yoga & More with Jessyca Canizales",
  "abstract": "Yoga, wellness, reiki & more with consultant Jessyca.",
  "author": "Kinita",
  "date_published": "1:37pm",
  "content": "Sri Lanka's starting to become a\n. We're loving the vast array of options both within and outside of Colombo, so were pretty excited to hear from Jessyca recently and check out a class of hers at the Prana Lounge.\nJessyca conducts everything from yoga to reiki sessions, and is currently focussing on pranayama and meditation whilst living in Sri Lanka.\nexplains that she works as a yoga instructor (eRYT), light worker, and wellness consultant.\nI popped in for a 90 minute Sunday morning class at the\n(which I've actually never visited before despite it being the host of the pretty\n). It was full when I snuck in, full of super yogic-looking expats and natural light primed for the \"Flow & Glow Vinyasa\" session.\nWe went through some fairly easy (even for beginners) sequences, most of which had varying options of difficulty depending on your fitness and flexibility (which you'll appreciate if your downward dog is as wobbly as mine). Jessyca was an encouraging and experienced teacher and took us through the class with mindfulness and positivity.\nEvery so often, she'd go around the class and help correct positions or go deeper into stretches.  She seemed passionate about building strong foundational postures, like the chaturanga (pictured below). Eventually, we wound down with a savasana and guided meditation. I noticed that Jessyca took the time to individually speak to class-goers after the session, giving personalized tips or advice. The Sunday class was a perfect way to wrap up the weekend, and I left feeling refreshed yet energized (and sweaty).\nIf you'd like to test out a class, Jessyca has a few at the\nin Colombo 07 and the\n. Just call up each in advance or check their pages for updated information, timings, and prices. As a general rule you can expect to pay about Rs. 1000-Rs. 2000 for a 60-90 minute class at the Prana Lounge or Rs. 1900+ for classes and workshops at the Sri Yoga Shala. They usually have mats and bolster cushions and more accessories in case you need them, but you can bring your own too.\nIf you're already familiar with her work or are looking for something bigger, you can\nfor her private instructions, monthly workshops and retreats around Sri Lanka (some in exciting spots like Yala!), or even corporate packages like yoga and meditation workshops for offices. Jessyca has a stock of yoga mats etc so she will come prepared with everything you need.\nIf you're looking to become a teacher yourself, Jessyca is endorsed to offer Yoga teacher training on the island, and will be offering an all-inclusive yoga teacher training at Camp Poe in Ahangama this October!\n",
  "url": "https://www.yamu.lk/blog/yoga-with-jessyca-canizales"
}