{
  "title": "Yoga Spots in Colombo",
  "abstract": "Popular yoga spots in Colombo.",
  "author": "Kinita",
  "date_published": "10:16am",
  "content": "We've had a bunch of questions asking us which places in Colombo offer yoga sessions or classes. We're not big yoga gurus ourselves but here are a few studios that have been recommended to us by friends and colleagues. All this food reviewing takes its toll on our waistlines, so let us know which ones you recommend, and we'll check them out in the future!\nLocated in the heart of Cinnamon Gardens, Prana Lounge is an inventive studio with engaging teachers and an active social media account. They have a few events and a variety of classes. We know quite a few people who are fans!\nWith three centres across Colombo and a bunch of teachers, this appears to be one of the most widespread options in the city. Check out their site for more details about their locations, timings, and options.\nTouted as Colombo's first dedicated yoga studio, the Om Space is very popular. They have fun, dedicated teachers and a host of events. Check them out on Havelock Road.\nThis centre on Ridgeway Place offers a bunch of services. We got a call from them to confirm that they are in fact up and running. The centre is also in affiliation with the Indian Cultural Centre, and you can contact either on 0777274859.\nA World Yoga Council approved teacher, Aanantharavi teaches classes in Welawatte, in both German and English.\nA charitable international trust, Babaji's Kriya Yoga is offered by Babaji's Kriya Yoga Order of Acharyas Trust. Classes are conducted at their premises in Dehiwala. They have weekly Hatha Yoga classes, a meditation room, and a bookstore.\nThe ICC on Gregory's Road also offers weekly yoga lessons for very cheap. Also it's as authentic as it gets, we'd assume.\nBody Bar is a full gym down Jawatta Road that attracts loads of people because they host dance classes, yoga, zumba and martial arts lessons. They've got clean showers and a pretty diverse crowd (different ages etc). You can pay for yoga lessons on a per-class basis, check their\nfor timings.\nHappy Stretching!\n",
  "url": "https://www.yamu.lk/blog/yoga-spots-in-colombo"
}