{
  "title": "Yumi Grills BBQ",
  "abstract": "Yumi Cake doesn't do just delicious cakes anymore - they now host a great chicken barbecue every evening. ",
  "author": "Shifani",
  "date_published": "11:52am",
  "content": "- the gourmet cake shop in Bamba that grew out of the Good Market - has lately been branching out into more than just gooey cakes. Besides being an easy source for gluten-free goodies, they also make good salads, some killer\n, Jaffna crab curry, and now - they host a sizzling barbecue every evening.\nThe\ncafe is a charming little bistro of sorts, with white window panels and a white picket fence around it. It is a small space though, with enough seating for about eight. I'd recommend sitting outside next to the BBQ grill, pretty nice and breezy in the evenings. I wouldn't suggest bringing a big crowd though, it's good for a meal with one or two friends - or else you could always do takeaway and have your meal on the Marine Drive rocks on the opposite side.\nIt's on Marine Drive so if you're outside you'll see a lot of 6PM traffic passing by, but on the up side you get a great view of the sun going down.\nThis is a chicken barbecue, and at around 6PM they begin with two hefty chicken thighs. We were told that the meat is marinated before this for 24 hours so it really soaks in all the spices. The chicken was grilled at about 6.15 and we were served about 20 minutes later.\nThe guy takes the barbecued chicken indoors to present it well and brings it out with a fresh bowl of salad, two buns of kurakkan bread, hummus, spicy tomato sauce, and home-made mayo. This costs Rs. 800, which admittedly is not a cheap meal, but it's becoming fairly average pricing for Colombo. Also once you're done with the chicken, the salad and the bread, you're extremely full.\nAnd this is no ordinary meat and salad, there's been a lot of work put into method by the chef and owner of Yumi. The chicken thigh is delicious and not greasy as at typical BBQs (no oil is poured onto the chicken). It was tender on the inside, and the best part was the grilled outer layer, which was crisp with a distinct and flavoursome spicy hit, a result of the chef's special recipe. Unexpectedly, the kurakkan bread makes a great combo with the chicken.\nThe salad is a tasty toss of lettuce, sweet corn, onions, tomatoes and a bit of olive oil - and with the home-made mayo, which is eggless and much lighter than ordinary mayo, it's a good one. We were told that the hummus and chicken has a touch of Middle Eastern in the recipes, with ingredients brought down from that part of the world. It's a lovely meal with its different parts very thoughtfully put together in terms of flavour.\nIt isn't often you get to sample hot-hot BBQed meat in Colombo unless you're at a hotel buffet, so the Yumi Grills are warmly welcome. If you're out at night and looking for a tasty meaty meal, which is relatively healthy if the lack of grease and the generous salad is anything to go by, this one is worth considering.\n",
  "url": "https://www.yamu.lk/blog/yumi-grills"
}